
Процедура ХМ_НеТиповыеИзменения()
	
	// ХМНПФ 18.12.2015 ШадринАВ // Выведен новый реквизит ХМ_НомерКаспер // №109
	
КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ХМДополнитьФорму(); 

КонецПроцедуры 


Процедура ХМДополнитьФорму() 
	
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("ВставитьПередЭлементом", Элементы.СВИФТБИК);  
	СвойстваПоля.Вставить("Заголовок", "Каспер");  
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_НомерКаспер",Элементы.Список,"Список.ХМ_НомерКаспер",СвойстваПоля);		
		
КонецПроцедуры 