
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 26.02.2019 ГригорьевМА // ПолучитьСписокВидимыхКолонов_ДоговорыОПС() // №2067
	// ХМНПФ 26.02.2019 ГригорьевМА // ПолучитьСписокВидимыхКолонов_РасшифровкаСумм() // №2067
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРеквизитОтбораРасшифровки()
	Если Объект.ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма20")
		ИЛИ Объект.ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма24")
	Тогда
		Возврат "Решение";
	Иначе	
		Возврат "ДоговорОПС";
	КонецЕсли;
КонецФункции

&НаСервере
&ИзменениеИКонтроль("ПолучитьСписокВидимыхКолонов_ДоговорыОПС")
Функция ХМПолучитьСписокВидимыхКолонов_ДоговорыОПС()
	ПутьКДаннымТаблицы = Элементы.ДоговорыОПС.ПутьКДанным + ".";

	Массив = Новый Массив;
	#Удаление 
	Массив.Добавить("НомерСтроки");	
	#КонецУдаления
	#Вставка		
	// +ХМНПФ 26.02.2019 ГригорьевМА // ПолучитьСписокВидимыхКолонов_ДоговорыОПС() // №2067
	Массив.Добавить(ПутьКДаннымТаблицы + "НомерСтроки");
	// -ХМНПФ 26.02.2019 ГригорьевМА // ПолучитьСписокВидимыхКолонов_ДоговорыОПС() // №2067
	#КонецВставки	
	Если Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма20 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ВариантРешения");
		Массив.Добавить(ПутьКДаннымТаблицы + "Решение");
		Массив.Добавить(ПутьКДаннымТаблицы + "Заявление");
		Массив.Добавить(ПутьКДаннымТаблицы + "Уведомление");
		Массив.Добавить(ПутьКДаннымТаблицы + "КодВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "ПериодВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "НомерППВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "ДатаНачалаЕВ");
		Массив.Добавить(ПутьКДаннымТаблицы + "ДатаОкончания");
		Массив.Добавить(ПутьКДаннымТаблицы + "ДатаРасчетаСуммы");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаПервойВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаЕжемесВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаФактВыплаты");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма21 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");		
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма22 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "Получатель");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма24 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "Решение");
		Массив.Добавить(ПутьКДаннымТаблицы + "КодВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "ДатаВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "НомерППВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "ПерваяВыплата");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");		
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма25 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма27 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ОбязательстваПоНЧТП");
		Массив.Добавить(ПутьКДаннымТаблицы + "МесВыплатаНЧТП");
		Массив.Добавить(ПутьКДаннымТаблицы + "МесВыплатаКоррНЧТП");
		Массив.Добавить(ПутьКДаннымТаблицы + "КоррКоэффНЧТП");
		Массив.Добавить(ПутьКДаннымТаблицы + "ОбязательстваПоСПВ");
		Массив.Добавить(ПутьКДаннымТаблицы + "МесВыплатаСПВ");
		Массив.Добавить(ПутьКДаннымТаблицы + "МесВыплатаКоррСПВ");
		Массив.Добавить(ПутьКДаннымТаблицы + "КоррКоэффСВ");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма28 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаНаНачало");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаНаКонец");
		Массив.Добавить(ПутьКДаннымТаблицы + "ИДПредшПериод");		
		Массив.Добавить(ПутьКДаннымТаблицы + "ИДТекущий");	
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма42 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "Заявление");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма43 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "Решение");
		Массив.Добавить(ПутьКДаннымТаблицы + "Заявление");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма44 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма46 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ВариантРешения");
		Массив.Добавить(ПутьКДаннымТаблицы + "Решение");
		Массив.Добавить(ПутьКДаннымТаблицы + "Заявление");
		Массив.Добавить(ПутьКДаннымТаблицы + "Уведомление");
		Массив.Добавить(ПутьКДаннымТаблицы + "КодВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "НомерППВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "ДатаОкончания");
		Массив.Добавить(ПутьКДаннымТаблицы + "ПериодВыплаты");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма47 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "Решение");
		Массив.Добавить(ПутьКДаннымТаблицы + "КодВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "НомерППВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "ДатаВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "ПерваяВыплата");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма48 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма49 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ОбязательстваПоНЧТП");
		Массив.Добавить(ПутьКДаннымТаблицы + "МесВыплатаНЧТП");
		Массив.Добавить(ПутьКДаннымТаблицы + "МесВыплатаКоррНЧТП");
		Массив.Добавить(ПутьКДаннымТаблицы + "КоррКоэффНЧТП");
		Массив.Добавить(ПутьКДаннымТаблицы + "ОбязательстваПоСПВ");
		Массив.Добавить(ПутьКДаннымТаблицы + "МесВыплатаСПВ");
		Массив.Добавить(ПутьКДаннымТаблицы + "МесВыплатаКоррСПВ");
		Массив.Добавить(ПутьКДаннымТаблицы + "КоррКоэффСВ");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма50 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаНаНачало");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаНаКонец");
		Массив.Добавить(ПутьКДаннымТаблицы + "ИДПредшПериод");		
		Массив.Добавить(ПутьКДаннымТаблицы + "ИДТекущий");	
	КонецЕсли;

	Возврат Массив;
КонецФункции

&НаСервере
&ИзменениеИКонтроль("ПолучитьСписокВидимыхКолонов_РасшифровкаСумм")
Функция ХМПолучитьСписокВидимыхКолонов_РасшифровкаСумм()
	ПутьКДаннымТаблицы = Элементы.РасшифровкаСумм.ПутьКДанным + ".";

	Массив = Новый Массив;
	#Удаление 
	Массив.Добавить("НомерСтроки"); 
	#КонецУдаления
	#Вставка		
	// +ХМНПФ 26.02.2019 ГригорьевМА // ПолучитьСписокВидимыхКолонов_РасшифровкаСумм() // №2067
	Массив.Добавить(ПутьКДаннымТаблицы + "НомерСтроки");
	// -ХМНПФ 26.02.2019 ГригорьевМА // ПолучитьСписокВидимыхКолонов_РасшифровкаСумм() // №2067
	#КонецВставки
	Если Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма20 И НЕ ?(Объект.ДоговорыОПС.Количество() > 0, Объект.ДоговорыОПС[0].ВариантРешения = "ОТКЗ", Ложь) Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "Решение");
		Массив.Добавить(ПутьКДаннымТаблицы + "ТипСуммы");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаПервойВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаЕжемесВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаФактВыплаты");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма21 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ТипРезерва");
		Массив.Добавить(ПутьКДаннымТаблицы + "ТипСуммы");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");		
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма22 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ТипСуммы");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма24 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ТипСуммы");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма25 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ТипСуммы");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "Правопреемник");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗаявлениеПравопреемника");
		Массив.Добавить(ПутьКДаннымТаблицы + "Решение");
		Массив.Добавить(ПутьКДаннымТаблицы + "Источник");
		Массив.Добавить(ПутьКДаннымТаблицы + "ТипРешения");		
		Массив.Добавить(ПутьКДаннымТаблицы + "ПлатежныйДокумент");
		Массив.Добавить(ПутьКДаннымТаблицы + "Источник");
		Массив.Добавить(ПутьКДаннымТаблицы + "ТипРешения");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма28 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ТипСуммы");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "ИДПредшПериод");
		Массив.Добавить(ПутьКДаннымТаблицы + "ИДТекущий");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма42 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ТипСуммы");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВосполнения");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВозмещения");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма44 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ТипСуммы");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма48 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		//Массив.Добавить(ПутьКДаннымТаблицы + "ТипСуммы");
		//Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "Правопреемник");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗаявлениеПравопреемника");
		Массив.Добавить(ПутьКДаннымТаблицы + "Решение");
		Массив.Добавить(ПутьКДаннымТаблицы + "Источник");
		Массив.Добавить(ПутьКДаннымТаблицы + "ТипРешения");		
		Массив.Добавить(ПутьКДаннымТаблицы + "ПлатежныйДокумент");
		Массив.Добавить(ПутьКДаннымТаблицы + "Источник");
		Массив.Добавить(ПутьКДаннымТаблицы + "ТипРешения");
	КонецЕсли;

	Возврат Массив;
КонецФункции
