
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 22.04.2016 ШадринАВ // СохранитьПакетНаДиск() // №316
	// ХМНПФ 02.08.2016 ШадринАВ // СформироватьПачкуСведения28XLS() // №461
	// ХМНПФ 02.08.2016 ШадринАВ // СформироватьПачкуСведения26XLS() // №461
	// ХМНПФ 02.08.2016 ШадринАВ // Новая ХМ_ВывестиПодписьОтвественногоИИсполнителя() // №461
	// ХМНПФ 19.10.2016 ШадринАВ // изменен макет Реестр  // №586
	//		в область Извещение28 добавлен текст "в соответствии с абзацем 5 пункта 2 статьи 36.5 Федерального закона от 07.05.1998 № 75-ФЗ "О негосударственных пенсионных фондах" направляет информацию о суммах средств пенсионных накоплений которые переданы негосударственным пенсионным фондом в Пенсионный фонд Российской Федерации."
	// ХМНПФ 28.10.2016 ШадринАВ // изменен макет Реестр  // №618
	//		в область СведенияОПереданныхСуммахВДругойНПФ26 добавлен текст "в соответствии с п. 3 ст. 36.4 Федерального закона от 07.05.1998 № 75-ФЗ "О негосударственных пенсионных фондах", в соответствии с положениями Федерального закона от 30.04.2008 № 56-ФЗ "О дополнительных страховых взносах на накопительную часть трудовой пенсии и государственной поддержке формирования пенсионных накоплений", Федерального закона от 29.12.2006 № 256-ФЗ "О дополнительных мерах государственной поддержки семей, имеющих детей" направляет информацию о суммах средств пенсионных накоплений которые переданы негосударственным пенсионным фондом"
	// ХМНПФ 12.01.2017 ШадринАВ // СформироватьРеестрСведений27НаВыплатыXDTO() // №702
	// ХМНПФ 30.10.2017 ШадринАВ // ФормированиеПачекДляРеестров() // №1216
	// ХМНПФ 26.02.2018 ШадринАВ // СформироватьРеестрСведений27НаВыплатыXDTO() // №1383
	// ХМНПФ 02.03.2018 КлименкоМИ // СформироватьСведения31XDTO() // №1414
	// ХМНПФ 29.03.2018 КлименкоМИ // СформироватьРеестрСведений27НаВыплатыXDTO() // №1466
	// ХМНПФ 29.08.2018 КлименкоМИ // СобратьСведенияОПП() // №1795
	// ХМНПФ 13.09.2018 ШадринАВ // СформироватьСведения31XDTO() // №1819
	// ХМНПФ 23.01.2019 ШадринАВ // ПриЗаписи() // №2006
	// ХМНПФ 23.01.2019 ШадринАВ // ФормированиеПачекЗаявленийВыплат() // №2006
	
	// ХМНПФ 30.01.2018 КлименкоМИ // СформироватьРеестр5XDTO() // №1297  // не актуально с релиза 4.0.36.1
КонецПроцедуры

&ИзменениеИКонтроль("ПриЗаписи")
Процедура РасшОбщ_ПриЗаписи(Отказ)
	Если ВидЭД = Перечисления.уп_ВидыЭД.Уведомление8 Тогда
		//пишем движения в регистр сведений "Уведомления"
		Движения.уп_УведомленияПФР.Очистить();
		//Движения.уп_УведомленияПФР.Записывать;
		Для Каждого стр из ДокументыКВыгрузке Цикл
			Для Каждого СтрПачки из  стр.ОбъектВладелец.СоставПачки Цикл
				Движение = Движения.уп_УведомленияПФР.Добавить();
				Движение.Активность = Истина;
				Движение.ДатаУведомления = Дата;
				Если ТипЗнч(СтрПачки.ДокументПачки) = Тип("ДокументСсылка.уп_РешениеОЕдиновременнойВыплате") 
					или ТипЗнч(СтрПачки.ДокументПачки) = Тип("ДокументСсылка.уп_РешениеОЕдиновременнойВыплате")
					или ТипЗнч(СтрПачки.ДокументПачки) = Тип("ДокументСсылка.уп_РешениеОНазначенииНЧТП") Тогда
					Движение.Заявление = СтрПачки.ДокументПачки.ДокументОснование;
				Иначе
					Движение.Заявление = СтрПачки.ДокументПачки;
				КонецЕсли;
				#Удаление
				Движение.НомерУведомления = Номер;
				#КонецУдаления
				#Вставка
				// +ХМНПФ 23.01.2019 ШадринАВ // ПриЗаписи() // №2006
				Движение.НомерУведомления = Прав(СокрЛП(Номер),15);
				// -ХМНПФ 23.01.2019 ШадринАВ // ПриЗаписи() // №2006
				#КонецВставки
				Движение.Период = Дата;
				Движение.Регистратор = Ссылка;
			КонецЦикла;	
		КонецЦикла;
		Движения.уп_УведомленияПФР.Записать();
	КонецЕсли;	
КонецПроцедуры

&ИзменениеИКонтроль("СохранитьПакетНаДиск")
Процедура РасшОбщ_СохранитьПакетНаДиск(ПутьВыгрузки) Экспорт
	
		СтруктураНастроек = уп_ЭДО.ПолучитьНастройкиМодуляЭДО(Организация, Дата);		
		#Вставка
		// +ХМНПФ 22.04.2016 ШадринАВ // СохранитьПакетНаДиск() // №316
		СтруктураНастроек.ТипФайлов = ХМ_ТипФайлов;
		// -ХМНПФ 22.04.2016 ШадринАВ // СохранитьПакетНаДиск() // №316
		#КонецВставки
		
		//определим, надо ли выгружать имеющиеся или формировать заново
		ФайлыЕсть = ложь;
		Если СтруктураНастроек.СохранятьФайлыВБД Тогда
			//файлы могут быть в базе, проверяем по строкам и описи
			Если ЗначениеЗаполнено(Опись) Тогда
				ФайлыЕсть = Истина;
			КонецЕсли;
			Для Каждого стр из ДокументыКВыгрузке Цикл
				Если ЗначениеЗаполнено(стр.ЭлектронныйДокумент) Тогда
					ФайлыЕсть = Истина;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
		
		//Если ФайлыЕсть Тогда
		//	//спросим надо ли переформировывать
		//	ТекстВопроса = "Файлы сформированы и сохранены в БД. Переформировать?";
		//	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		//	Если Ответ = КодВозвратаДиалога.Да Тогда
				ФайлыЕсть = Ложь;
		//	КонецЕсли;
		//КонецЕсли;
		
		ИмяФайлаАрхива = ПутьВыгрузки +"\"+ ИмяФайлаАрхива();
		ИмяФайлаАрхива = Новый Файл(ИмяФайлаАрхива);
		ФайлАрхива = Новый ЗаписьZipФайла(ИмяФайлаАрхива.ПолноеИмя, , , МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный); 

		Если ФайлыЕсть И ЗначениеЗаполнено(Опись) Тогда
			ИмяФайлаОписи = ПутьВыгрузки +"\"+ Опись.ИмяФайла;
			Если ТипЗнч(Опись.ТекстХранилище) <> Тип("ДвоичныеДанные") Тогда
				ТекстОписи = Опись.ТекстХранилище.Получить();
				ТекстОписи.Записать(ПутьВыгрузки +"\"+ Опись.ИмяФайла, КодировкаТекста.ANSI);
			Иначе //двоичные данные - это эксель
				//надо посмотреть как эксель извлекать из двоичных данных
				ДвоичныеДанные = Опись.ТекстХранилище;
				ДвоичныеДанные.Записать(ПутьВыгрузки +"\"+ Опись.ИмяФайла);
			КонецЕсли;
			Сообщить("Записан файл "+ПутьВыгрузки +"\"+ Опись.ИмяФайла);
			Если  СтруктураНастроек.ТипФайлов = 1 Тогда //формируем файл архива
				ФайлАрхива.Добавить(ИмяФайлаОписи, РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
			КонецЕсли;
		КонецЕсли;
		
		Если ФайлыЕсть Тогда
			Для Каждого стр из ДокументыКВыгрузке Цикл
				ИмяФайла = ПутьВыгрузки +"\"+ стр.ЭлектронныйДокумент.ИмяФайла;
				Если ТипЗнч( стр.ЭлектронныйДокумент.ТекстХранилище) <> Тип("ДвоичныеДанные") Тогда
					ТекстРеестра = стр.ЭлектронныйДокумент.ТекстХранилище.Получить();
					//ТекстРеестра.Записать(ПутьВыгрузки +"\"+ стр.ЭлектронныйДокумент.ИмяФайла, КодировкаТекста.ANSI);
					ТекстРеестра.Записать(ПутьВыгрузки +"\"+ стр.ЭлектронныйДокумент.ИмяФайла);
				Иначе
					ДвоичныеДанные = стр.ЭлектронныйДокумент.ТекстХранилище;
					ДвоичныеДанные.Записать(ПутьВыгрузки +"\"+ стр.ЭлектронныйДокумент.ИмяФайла);
				КонецЕсли;	
				Сообщить("Записан файл "+ПутьВыгрузки +"\"+ стр.ЭлектронныйДокумент.ИмяФайла);
				
				ФайлАрхива.Добавить(ИмяФайла, РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно); 
			КонецЦикла;
			ЕстьОшибки = Ложь;
		Иначе
			//формируем файлы
			Если СтруктураНастроек.ТипФайлов = 0 Тогда
				ЕстьОшибки = СформироватьВыгрузкиXLS(СтруктураНастроек,ПутьВыгрузки);
			Иначе
				ЕстьОшибки = СформироватьВыгрузки(СтруктураНастроек,ПутьВыгрузки,"СохранитьПакетНаДиск");
			КонецЕсли;	
			//записываем документ
			Записать();
			//формируем архив
			Если СтруктураНастроек.ТипФайлов = 1 Тогда
				Если ЗначениеЗаполнено(Опись) Тогда
					ИмяФайлаОписи = ПутьВыгрузки +"\"+ ЭтотОбъект.Опись.ИмяФайла;
					ФайлАрхива.Добавить(ИмяФайлаОписи, РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно); 
				ИначеЕсли ЗначениеЗаполнено(ИмяОписи) Тогда
					ИмяФайлаОписи = ПутьВыгрузки +"\"+ ЭтотОбъект.ИмяОписи;
					ФайлАрхива.Добавить(ИмяФайлаОписи, РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно); 
				КонецЕсли;
				Для Каждого стр из ДокументыКВыгрузке Цикл
					ИмяФайла = "";
					Если ЗначениеЗаполнено(стр.ЭлектронныйДокумент) Тогда
						ИмяФайла = ПутьВыгрузки +"\"+ стр.ЭлектронныйДокумент.ИмяФайла;
					ИначеЕсли ЗначениеЗаполнено(стр.ИмяДокумента) Тогда 
						ИмяФайла = ПутьВыгрузки +"\"+ стр.ИмяДокумента;
					КонецЕсли;
					Если ЗначениеЗаполнено(ИмяФайла) Тогда
						ФайлАрхива.Добавить(ИмяФайла, РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЕстьОшибки Тогда
			Если СтруктураНастроек.ТипФайлов = 1 Тогда
				ФайлАрхива.Записать(); 
				Сообщить("Файл: "+ИмяФайлаАрхива.ПолноеИмя+" записан");
			КонецЕсли;
		КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("СформироватьПачкуСведения26XLS")
Процедура РасшОбщ_СформироватьПачкуСведения26XLS(стр,СохранятьФайлыВБД, МассивФайлы, ПорядокВыгрузкиКомпенсаций, ПроставлятьМестоРожденияРФ)
	
	ВременныйФайлШапки = ПолучитьИмяВременногоФайла("xls");
	ФайлШапка = Новый Файл(ВременныйФайлШапки);
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет       = ПолучитьМакет("Реестр");
	
	
	ИндексЗначенияПеречисления = Перечисления["уп_ВидыЭД"].Индекс(ВидЭД);
	ИмяЗначенияПеречисления = Метаданные.Перечисления["уп_ВидыЭД"].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
	ОбластьМакета = Макет.ПолучитьОбласть(ИмяЗначенияПеречисления);
	ОбластьМакета.Параметры.ФорНаименованиеНПФ = ВРЕГ(Организация.уп_НаименованиеДляПФР);
	ОбластьМакета.Параметры.ИНН = Организация.ИНН;
	ОбластьМакета.Параметры.ПолноеНаименованиеНПФ = ВРЕГ(Организация.НаименованиеПолное);
	
	//еще номер реестра, дата реестра, том
	ОбластьМакета.Параметры.ДатаРеестра = Дата;
	ОбластьМакета.Параметры.НомерРеестра = Номер;
	ОбластьМакета.Параметры.НомерТома = стр.НомерСтроки;
	
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.Записать(ФайлШапка.ПолноеИмя, ТипФайлаТабличногоДокумента.XLS);
	
	ПутьКФайлуШаблона = ВременныйФайлШапки;
	
	Файл = Новый Файл(ПутьКФайлуШаблона);
	
	Если не Файл.Существует() Тогда
		#Если Клиент Тогда
			Предупреждение("Не найден файл шаблона " + Файл.Имя + "!", 15);
		#Иначе
			Сообщить("Не найден файл шаблона " + Файл.Имя + "!");
		#КонецЕсли
		Возврат;                      
	КонецЕсли;
	
	#Если Клиент Тогда
		Состояние("Запись в файл...");
	#КонецЕсли
	
	Попытка             
		Эксель = Новый COMОбъект("Excel.Application");    
		Эксель.DisplayAlerts = Ложь;
	Исключение             
		Сообщить(ОписаниеОшибки());     
	КонецПопытки; 
	
	Книга = Эксель.Workbooks().Open(Файл.ПолноеИмя,, истина);
	
	//заполняем шапку
	Лист = Книга.Sheets(1);                                                                 
	Лист.Activate();
	
	СписокДокументов = Новый СписокЗначений;
	СписокДокументов.Добавить(стр.ОбъектВладелец);
	ВыборкаИтогов = СуммыДляОписиРеестра(СписокДокументов);
	Если ВыборкаИтогов.Следующий() Тогда
		Выборка = ВыборкаИтогов.Выбрать();
		
		//установим формат ИНН
		Лист.Cells(9,4).NumberFormat = "@";
		//возможно надо повторно записать ИНН
		Лист.Cells(9,4).Value = Организация.ИНН;
		
		ст = 16;
		НомСт = 0;
		Пока Выборка.Следующий() Цикл
			ст = ст+1;
			НомСт = НомСт+1;
			
			Если ПорядокВыгрузкиКомпенсаций = 0 Тогда  //компенсацию не выгружаем
				
				ВзносыОПС = Выборка.СуммаСВ;
				ИДОПС     = Выборка.СуммаСВ_ИД;
				ВзносыДСВ = Выборка.СуммаДСВ;
				ИДДСВ     = Выборка.СуммаДСВ_ИД;
				ВзносыСФ  = Выборка.СуммаСФ;
				ИДСФ      = Выборка.СуммаСФ_ИД;
				МК        = Выборка.СуммаМК;
				ИДМК      = Выборка.СуммаМК_ИД;
				КолЗЛ    = Выборка.ДоговорОПС;
				СуммаВыплатнойРезерв = Выборка.СуммаВыплатнойРезерв;
				СуммаРезервПодСрочныеВыплаты = Выборка.СуммаРезервПодСрочныеВыплаты;
				СуммаНаЕВ = Выборка.СуммаНаЕВ;
				ИтоговаяСуммаСПН = Выборка.СуммаОстаток-СуммаВыплатнойРезерв-СуммаРезервПодСрочныеВыплаты-СуммаНаЕВ;
				ОбщаяСумма= Выборка.СуммаОстаток-СуммаВыплатнойРезерв-СуммаРезервПодСрочныеВыплаты-СуммаНаЕВ;
				СуммаКомпенсации = 0;
				СуммаВосполнения = 0;
			ИначеЕсли ПорядокВыгрузкиКомпенсаций = 1 Тогда  //компенсация сверху
				
				ВзносыОПС = Выборка.СуммаСВ-Выборка.СуммаСВ_К-Выборка.СуммаСВ_В;
				ИДОПС     = Выборка.СуммаСВ_ИД-Выборка.СуммаСВ_ИД_К-Выборка.СуммаСВ_ИД_В;
				ВзносыДСВ = Выборка.СуммаДСВ-Выборка.СуммаДСВ_К-Выборка.СуммаДСВ_В;
				ИДДСВ     = Выборка.СуммаДСВ_ИД-Выборка.СуммаДСВ_ИД_К-Выборка.СуммаДСВ_ИД_В;
				ВзносыСФ  = Выборка.СуммаСФ-Выборка.СуммаСФ_К-Выборка.СуммаСФ_В;
				ИДСФ      = Выборка.СуммаСФ_ИД-Выборка.СуммаСФ_ИД_К-Выборка.СуммаСФ_ИД_В;
				МК        = Выборка.СуммаМК-Выборка.СуммаМК_К-Выборка.СуммаМК_В;
				ИДМК      = Выборка.СуммаМК_ИД-Выборка.СуммаМК_ИД_К-Выборка.СуммаМК_ИД_В;
				КолЗЛ    = Выборка.ДоговорОПС;
				СуммаВыплатнойРезерв = Выборка.СуммаВыплатнойРезерв;
				СуммаРезервПодСрочныеВыплаты = Выборка.СуммаРезервПодСрочныеВыплаты;
				СуммаНаЕВ = Выборка.СуммаНаЕВ;
				ИтоговаяСуммаСПН = Выборка.СуммаОстаток-СуммаВыплатнойРезерв-СуммаРезервПодСрочныеВыплаты-СуммаНаЕВ-Выборка.СуммаКомпенсации-Выборка.СуммаВосполнения;
				ОбщаяСумма= Выборка.СуммаОстаток-СуммаВыплатнойРезерв-СуммаРезервПодСрочныеВыплаты-СуммаНаЕВ;;
				СуммаКомпенсации = Выборка.СуммаКомпенсации;
				СуммаВосполнения = Выборка.СуммаВосполнения;
			ИначеЕсли ПорядокВыгрузкиКомпенсаций = 2 Тогда  //компенсация в сумме
				
				ВзносыОПС = Выборка.СуммаСВ;
				ИДОПС     = Выборка.СуммаСВ_ИД;
				ВзносыДСВ = Выборка.СуммаДСВ;
				ИДДСВ     = Выборка.СуммаДСВ_ИД;
				ВзносыСФ  = Выборка.СуммаСФ;
				ИДСФ      = Выборка.СуммаСФ_ИД;
				МК        = Выборка.СуммаМК;
				ИДМК      = Выборка.СуммаМК_ИД;
				КолЗЛ    = Выборка.ДоговорОПС;
				СуммаВыплатнойРезерв = Выборка.СуммаВыплатнойРезерв;
				СуммаРезервПодСрочныеВыплаты = Выборка.СуммаРезервПодСрочныеВыплаты;
				СуммаНаЕВ = Выборка.СуммаНаЕВ;
				ИтоговаяСуммаСПН = Выборка.СуммаОстаток-СуммаВыплатнойРезерв-СуммаРезервПодСрочныеВыплаты-СуммаНаЕВ;
				ОбщаяСумма= Выборка.СуммаОстаток-СуммаВыплатнойРезерв-СуммаРезервПодСрочныеВыплаты-СуммаНаЕВ;
				СуммаКомпенсации = Выборка.СуммаКомпенсации;
				СуммаВосполнения = Выборка.СуммаВосполнения;
			КонецЕсли;
			
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,1), "", 1, 1, 3, Ложь, Строка(НомСт));  //по центру
		//+ АДаниленко 51013                                                    
			Фам 	 = Выборка.Фамилия;
			Имя 	 = Выборка.Имя;
			Отчество = Выборка.Отчество;
		//- АДаниленко 51013
			
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,2), "", 1, 1, 2, Ложь, ВРЕГ(Фам));  //по левому краю
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,3), "", 1, 1, 2, Ложь, ВРЕГ(Имя));
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,4), "", 1, 1, 2, Ложь, ВРЕГ(Отчество));
			
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,5), "@", 1, 1, 3, Ложь, Формат(Выборка.ДатаРождения,"ДФ=dd.MM.yyyy"));   //по центру
			Если ПроставлятьМестоРожденияРФ Тогда
				МестоРожденияСтр = "РФ";
			Иначе
				МестоРожденияСтр = ВРЕГ(Сред(Выборка.МестоРождения,3));
			КонецЕсли;
			
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,6), "", 1, 1, 2, Истина, МестоРожденияСтр);  //по левому краю
			
			СНИЛС = уп_ОПС.ПреобразоватьНомерПФРДляРеестра(Выборка.НомерПФР); 
			ПерваяЧастьСтраховогоНомера = Лев(СНИЛС,9);
			ВтораяЧастьСтраховогоНомера = Прав(СНИЛС,2);
			
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,7), "", 1, 1, 3, Ложь, ВРЕГ(Лев(Строка(Выборка.Пол),1)));   //по центру
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,8), "", 1, 1, 4, Ложь, Число(ПерваяЧастьСтраховогоНомера));   //по правому краю
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,9), "", 1, 1, 4, Ложь, Число(ВтораяЧастьСтраховогоНомера));   //по правому краю
			
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,10), "0,00", 1, 1, 1, Ложь, ВзносыОПС);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,11), "0,00", 1, 1, 1, Ложь, ИДОПС);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,12), "0,00", 1, 1, 1, Ложь, ВзносыДСВ);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,13), "0,00", 1, 1, 1, Ложь, ИДДСВ);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,14), "0,00", 1, 1, 1, Ложь, ВзносыСФ);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,15), "0,00", 1, 1, 1, Ложь, ИДСФ);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,16), "0,00", 1, 1, 1, Ложь, МК);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,17), "0,00", 1, 1, 1, Ложь, ИДМК);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,18), "0,00", 1, 1, 1, Ложь, ИтоговаяСуммаСПН);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,19), "0,00", 1, 1, 1, Ложь, СуммаВосполнения);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,20), "0,00", 1, 1, 1, Ложь, СуммаКомпенсации);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,21), "0,00", 1, 1, 1, Ложь, ОбщаяСумма);   //по значению
			//еще инн и наименование фонда
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,22), "", 1, 1, 2, Истина, Формат(Число(СокрЛП(ПенсионныйФонд.ИНН)),"ЧГ=0"));  //по левому краю
			НаименованиеНПФ = СокрЛП(ВРЕГ(СтрЗаменить(?(ЗначениеЗаполнено(ПенсионныйФонд.уп_НаименованиеДляПФР), ПенсионныйФонд.уп_НаименованиеДляПФР, ПенсионныйФонд.Наименование),""""," ")));
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,23), "", 1, 1, 2, Истина, НаименованиеНПФ);  //по левому краю
		КонецЦикла;
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,8), "", 0, 1, 4, Ложь, "ИТОГО");   //по значению	
		//Лист.Cells(17+НомСт,8).Value = "ИТОГО";  "=sum(J17:A3)"
		СтрокаФормулы = "=sum(J17:J"+Строка(Формат(ст,"ЧРГ=' '; ЧГ=0"))+")";
		Лист.Cells(17+НомСт,10).Formula = СтрокаФормулы;
		Лист.Cells(17+НомСт,11).Formula = СтрЗаменить(СтрокаФормулы,"J","K");
		Лист.Cells(17+НомСт,12).Formula = СтрЗаменить(СтрокаФормулы,"J","L");
		Лист.Cells(17+НомСт,13).Formula = СтрЗаменить(СтрокаФормулы,"J","M");
		Лист.Cells(17+НомСт,14).Formula = СтрЗаменить(СтрокаФормулы,"J","N");
		Лист.Cells(17+НомСт,15).Formula = СтрЗаменить(СтрокаФормулы,"J","O");
		Лист.Cells(17+НомСт,16).Formula = СтрЗаменить(СтрокаФормулы,"J","P");
		Лист.Cells(17+НомСт,17).Formula = СтрЗаменить(СтрокаФормулы,"J","Q");
		Лист.Cells(17+НомСт,18).Formula = СтрЗаменить(СтрокаФормулы,"J","R");
		Лист.Cells(17+НомСт,19).Formula = СтрЗаменить(СтрокаФормулы,"J","S");
		Лист.Cells(17+НомСт,20).Formula = СтрЗаменить(СтрокаФормулы,"J","T");
		Лист.Cells(17+НомСт,21).Formula = СтрЗаменить(СтрокаФормулы,"J","U");
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,10), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,11), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,12), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,13), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,14), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,15), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,16), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,17), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,18), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,19), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,20), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,21), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		
		ИмяФайлаСтроки = ИмяФайла(стр.НомерСтроки,"xls");		
		#Вставка
		// ХМНПФ 02.08.2016 ШадринАВ // СформироватьПачкуСведения26XLS() // №461
		ХМ_ВывестиПодписьОтвественногоИИсполнителя(Лист,НомСт);
		// ХМНПФ 02.08.2016 ШадринАВ // СформироватьПачкуСведения26XLS() // №461
		#КонецВставки
		
		ВременныйФайл = ПолучитьИмяВременногоФайла("xls");
		Книга.SaveAs(ВременныйФайл);
		
		Если СохранятьФайлыВБД Тогда
			//сохраним файл в справочник, запишем ссылку на него в таб.часть
			Книга.Close();
			Если НЕ ЗначениеЗаполнено(стр.ЭлектронныйДокумент) Тогда
				ФайлЭДО = Справочники.уп_ЭДПрисоединенныеФайлы.СоздатьЭлемент();
			Иначе
				ФайлЭДО = стр.ЭлектронныйДокумент.ПолучитьОбъект();
			КонецЕсли;
			ФайлЭДО.ВладелецФайла = ЭтотОбъект.Ссылка;
			ФайлЭДО.ВерсияФормата = Перечисления.уп_ВерсииФорматаОбменаПФР.Формат_xls_2014;
			ФайлЭДО.ВидЭД = ВидЭД;
			файлЭДО.ДатаСоздания = Дата;
			ФайлЭДО.ИмяФайла = ИмяФайлаСтроки;
			ФайлЭДО.Наименование = ИмяФайлаСтроки;
			ФайлЭДО.Организация = Организация;
			ФайлЭДО.Получатель = Получатель;
			ТекстВХранилище = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ВременныйФайл), Новый СжатиеДанных);
			ФайлЭДО.ТекстХранилище = ТекстВХранилище;
			ФайлЭДО.Записать();
			
			//записываем его в реквизит
			Стр.ЭлектронныйДокумент = ФайлЭДО.Ссылка;
		Иначе
			//сохраним файл по пути выгрузки, запишем его имя в таб часть (без пути)
			стр.ИмяДокумента = ИмяФайлаСтроки;
			Книга.Close();
		КонецЕсли;
		
		МассивФайлы.Добавить(Новый Структура("Имя, Адрес", ИмяФайлаСтроки, ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВременныйФайл), Новый УникальныйИдентификатор)));
		
		Эксель.Application.Quit();
		УдалитьФайлы(ВременныйФайлШапки);
		
	КонецЕсли;

КонецПроцедуры	

&ИзменениеИКонтроль("СформироватьПачкуСведения28XLS")
Процедура РасшОбщ_СформироватьПачкуСведения28XLS(стр,СохранятьФайлыВБД, МассивФайлы, ПорядокВыгрузкиКомпенсаций, ПроставлятьМестоРожденияРФ)
	ВременныйФайлШапки = ПолучитьИмяВременногоФайла("xls");
	ФайлШапка = Новый Файл(ВременныйФайлШапки);
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет       = ПолучитьМакет("Реестр");
	
	
	ИндексЗначенияПеречисления = Перечисления["уп_ВидыЭД"].Индекс(ВидЭД);
	ИмяЗначенияПеречисления = Метаданные.Перечисления["уп_ВидыЭД"].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
	ОбластьМакета = Макет.ПолучитьОбласть(ИмяЗначенияПеречисления);
	ОбластьМакета.Параметры.ФорНаименованиеНПФ = ВРЕГ(Организация.уп_НаименованиеДляПФР);
	ОбластьМакета.Параметры.ИНН = Организация.ИНН;
	ОбластьМакета.Параметры.ПолноеНаименованиеНПФ = ВРЕГ(Организация.НаименованиеПолное);
	
	//еще номер реестра, дата реестра, том
	ОбластьМакета.Параметры.ДатаРеестра = Дата;
	ОбластьМакета.Параметры.НомерРеестра = Номер;
	ОбластьМакета.Параметры.НомерТома = стр.НомерСтроки;
	
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.Записать(ФайлШапка.ПолноеИмя, ТипФайлаТабличногоДокумента.XLS);
	
	ПутьКФайлуШаблона = ВременныйФайлШапки;
	
	Файл = Новый Файл(ПутьКФайлуШаблона);
	
	Если не Файл.Существует() Тогда
		#Если Клиент Тогда
			Предупреждение("Не найден файл шаблона " + Файл.Имя + "!", 15);
		#Иначе
			Сообщить("Не найден файл шаблона " + Файл.Имя + "!");
		#КонецЕсли
		Возврат;                      
	КонецЕсли;
	
	#Если Клиент Тогда
		Состояние("Запись в файл...");
	#КонецЕсли
	
	Попытка             
		Эксель = Новый COMОбъект("Excel.Application");    
		Эксель.DisplayAlerts = Ложь;
	Исключение             
		Сообщить(ОписаниеОшибки());     
	КонецПопытки; 
	
	Книга = Эксель.Workbooks().Open(Файл.ПолноеИмя,, истина);
	
	//заполняем шапку
	Лист = Книга.Sheets(1);                                                                 
	Лист.Activate();
	
	СписокДокументов = Новый СписокЗначений;
	СписокДокументов.Добавить(стр.ОбъектВладелец);
	ВыборкаИтогов = СуммыДляОписиРеестра(СписокДокументов);
	Если ВыборкаИтогов.Следующий() Тогда
		Выборка = ВыборкаИтогов.Выбрать();
		
		//установим формат ИНН
		Лист.Cells(9,4).NumberFormat = "@";
		//возможно надо повторно записать ИНН
		Лист.Cells(9,4).Value = Организация.ИНН;
		
		ст = 16;
		НомСт = 0;
		Пока Выборка.Следующий() Цикл
			ст = ст+1;
			НомСт = НомСт+1;
			
			Если ПорядокВыгрузкиКомпенсаций = 0 Тогда  //компенсацию не выгружаем
				
				ВзносыОПС = Выборка.СуммаСВ;
				ИДОПС     = Выборка.СуммаСВ_ИД;
				ВзносыДСВ = Выборка.СуммаДСВ;
				ИДДСВ     = Выборка.СуммаДСВ_ИД;
				ВзносыСФ  = Выборка.СуммаСФ;
				ИДСФ      = Выборка.СуммаСФ_ИД;
				МК        = Выборка.СуммаМК;
				ИДМК      = Выборка.СуммаМК_ИД;
				КолЗЛ    = Выборка.ДоговорОПС;
				СуммаВыплатнойРезерв = Выборка.СуммаВыплатнойРезерв;
				СуммаРезервПодСрочныеВыплаты = Выборка.СуммаРезервПодСрочныеВыплаты;
				СуммаНаЕВ = Выборка.СуммаНаЕВ;
				ИтоговаяСуммаСПН = Выборка.СуммаОстаток-СуммаВыплатнойРезерв-СуммаРезервПодСрочныеВыплаты-СуммаНаЕВ;
				ОбщаяСумма= Выборка.СуммаОстаток-СуммаВыплатнойРезерв-СуммаРезервПодСрочныеВыплаты-СуммаНаЕВ;
				СуммаКомпенсации = 0;
				СуммаВосполнения = 0;
			ИначеЕсли ПорядокВыгрузкиКомпенсаций = 1 Тогда  //компенсация сверху
				
				ВзносыОПС = Выборка.СуммаСВ-Выборка.СуммаСВ_К-Выборка.СуммаСВ_В;
				ИДОПС     = Выборка.СуммаСВ_ИД-Выборка.СуммаСВ_ИД_К-Выборка.СуммаСВ_ИД_В;
				ВзносыДСВ = Выборка.СуммаДСВ-Выборка.СуммаДСВ_К-Выборка.СуммаДСВ_В;
				ИДДСВ     = Выборка.СуммаДСВ_ИД-Выборка.СуммаДСВ_ИД_К-Выборка.СуммаДСВ_ИД_В;
				ВзносыСФ  = Выборка.СуммаСФ-Выборка.СуммаСФ_К-Выборка.СуммаСФ_В;
				ИДСФ      = Выборка.СуммаСФ_ИД-Выборка.СуммаСФ_ИД_К-Выборка.СуммаСФ_ИД_В;
				МК        = Выборка.СуммаМК-Выборка.СуммаМК_К-Выборка.СуммаМК_В;
				ИДМК      = Выборка.СуммаМК_ИД-Выборка.СуммаМК_ИД_К-Выборка.СуммаМК_ИД_В;
				КолЗЛ    = Выборка.ДоговорОПС;
				СуммаВыплатнойРезерв = Выборка.СуммаВыплатнойРезерв;
				СуммаРезервПодСрочныеВыплаты = Выборка.СуммаРезервПодСрочныеВыплаты;
				СуммаНаЕВ = Выборка.СуммаНаЕВ;
				ИтоговаяСуммаСПН = Выборка.СуммаОстаток-СуммаВыплатнойРезерв-СуммаРезервПодСрочныеВыплаты-СуммаНаЕВ-Выборка.СуммаКомпенсации-Выборка.СуммаВосполнения;
				ОбщаяСумма= Выборка.СуммаОстаток-СуммаВыплатнойРезерв-СуммаРезервПодСрочныеВыплаты-СуммаНаЕВ;;
				СуммаКомпенсации = Выборка.СуммаКомпенсации;
				СуммаВосполнения = Выборка.СуммаВосполнения;
			ИначеЕсли ПорядокВыгрузкиКомпенсаций = 2 Тогда  //компенсация в сумме
				
				ВзносыОПС = Выборка.СуммаСВ;
				ИДОПС     = Выборка.СуммаСВ_ИД;
				ВзносыДСВ = Выборка.СуммаДСВ;
				ИДДСВ     = Выборка.СуммаДСВ_ИД;
				ВзносыСФ  = Выборка.СуммаСФ;
				ИДСФ      = Выборка.СуммаСФ_ИД;
				МК        = Выборка.СуммаМК;
				ИДМК      = Выборка.СуммаМК_ИД;
				КолЗЛ    = Выборка.ДоговорОПС;
				СуммаВыплатнойРезерв = Выборка.СуммаВыплатнойРезерв;
				СуммаРезервПодСрочныеВыплаты = Выборка.СуммаРезервПодСрочныеВыплаты;
				СуммаНаЕВ = Выборка.СуммаНаЕВ;
				ИтоговаяСуммаСПН = Выборка.СуммаОстаток-СуммаВыплатнойРезерв-СуммаРезервПодСрочныеВыплаты-СуммаНаЕВ;
				ОбщаяСумма= Выборка.СуммаОстаток-СуммаВыплатнойРезерв-СуммаРезервПодСрочныеВыплаты-СуммаНаЕВ;
				СуммаКомпенсации = Выборка.СуммаКомпенсации;
				СуммаВосполнения = Выборка.СуммаВосполнения;
			КонецЕсли;
			
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,1), "", 1, 1, 3, Ложь, Строка(НомСт));  //по центру
		//+ АДаниленко 51013                                                    
			Фам 	 = Выборка.Фамилия;
			Имя 	 = Выборка.Имя;
			Отчество = Выборка.Отчество;
		//- АДаниленко 51013
			
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,2), "", 1, 1, 2, Ложь, ВРЕГ(Фам));  //по левому краю
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,3), "", 1, 1, 2, Ложь, ВРЕГ(Имя));
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,4), "", 1, 1, 2, Ложь, ВРЕГ(Отчество));
			
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,5), "@", 1, 1, 3, Ложь, Формат(Выборка.ДатаРождения,"ДФ=dd.MM.yyyy"));   //по центру
			Если ПроставлятьМестоРожденияРФ Тогда
				МестоРожденияСтр = "РФ";
			Иначе
				МестоРожденияСтр = ВРЕГ(Сред(Выборка.МестоРождения,3));
			КонецЕсли;
			
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,6), "", 1, 1, 2, Истина, МестоРожденияСтр);  //по левому краю
			
			СНИЛС = уп_ОПС.ПреобразоватьНомерПФРДляРеестра(Выборка.НомерПФР); 
			ПерваяЧастьСтраховогоНомера = Лев(СНИЛС,9);
			ВтораяЧастьСтраховогоНомера = Прав(СНИЛС,2);
			
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,7), "", 1, 1, 3, Ложь, ВРЕГ(Лев(Строка(Выборка.Пол),1)));   //по центру
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,8), "", 1, 1, 4, Ложь, Число(ПерваяЧастьСтраховогоНомера));   //по правому краю
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,9), "", 1, 1, 4, Ложь, Число(ВтораяЧастьСтраховогоНомера));   //по правому краю
			
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,10), "0,00", 1, 1, 1, Ложь, ВзносыОПС);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,11), "0,00", 1, 1, 1, Ложь, ИДОПС);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,12), "0,00", 1, 1, 1, Ложь, ВзносыДСВ);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,13), "0,00", 1, 1, 1, Ложь, ИДДСВ);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,14), "0,00", 1, 1, 1, Ложь, ВзносыСФ);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,15), "0,00", 1, 1, 1, Ложь, ИДСФ);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,16), "0,00", 1, 1, 1, Ложь, МК);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,17), "0,00", 1, 1, 1, Ложь, ИДМК);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,18), "0,00", 1, 1, 1, Ложь, ИтоговаяСуммаСПН);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,19), "0,00", 1, 1, 1, Ложь, СуммаВосполнения);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,20), "0,00", 1, 1, 1, Ложь, СуммаКомпенсации);   //по значению	
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,21), "0,00", 1, 1, 1, Ложь, ОбщаяСумма);   //по значению
			//еще инн и наименование фонда
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,22), "", 1, 1, 2, Истина, Формат(Число(СокрЛП(ПенсионныйФонд.ИНН)),"ЧГ=0"));  //по левому краю
			НаименованиеНПФ = СокрЛП(ВРЕГ(СтрЗаменить(?(ЗначениеЗаполнено(ПенсионныйФонд.уп_НаименованиеДляПФР), ПенсионныйФонд.уп_НаименованиеДляПФР, ПенсионныйФонд.Наименование),""""," ")));
			УстановитьФорматЗначениеЯчейки(Лист.Cells(ст,23), "", 1, 1, 2, Истина, НаименованиеНПФ);  //по левому краю
		КонецЦикла;
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,8), "", 0, 1, 4, Ложь, "ИТОГО");   //по значению	
		//Лист.Cells(17+НомСт,8).Value = "ИТОГО";  "=sum(J17:A3)"
		СтрокаФормулы = "=sum(J17:J"+Строка(Формат(ст,"ЧРГ=' '; ЧГ=0"))+")";
		Лист.Cells(17+НомСт,10).Formula = СтрокаФормулы;
		Лист.Cells(17+НомСт,11).Formula = СтрЗаменить(СтрокаФормулы,"J","K");
		Лист.Cells(17+НомСт,12).Formula = СтрЗаменить(СтрокаФормулы,"J","L");
		Лист.Cells(17+НомСт,13).Formula = СтрЗаменить(СтрокаФормулы,"J","M");
		Лист.Cells(17+НомСт,14).Formula = СтрЗаменить(СтрокаФормулы,"J","N");
		Лист.Cells(17+НомСт,15).Formula = СтрЗаменить(СтрокаФормулы,"J","O");
		Лист.Cells(17+НомСт,16).Formula = СтрЗаменить(СтрокаФормулы,"J","P");
		Лист.Cells(17+НомСт,17).Formula = СтрЗаменить(СтрокаФормулы,"J","Q");
		Лист.Cells(17+НомСт,18).Formula = СтрЗаменить(СтрокаФормулы,"J","R");
		Лист.Cells(17+НомСт,19).Formula = СтрЗаменить(СтрокаФормулы,"J","S");
		Лист.Cells(17+НомСт,20).Formula = СтрЗаменить(СтрокаФормулы,"J","T");
		Лист.Cells(17+НомСт,21).Formula = СтрЗаменить(СтрокаФормулы,"J","U");
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,10), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,11), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,12), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,13), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,14), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,15), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,16), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,17), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,18), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,19), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,20), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		УстановитьФорматЗначениеЯчейки(Лист.Cells(17+НомСт,21), "0,00", 1, 1, 1, Ложь, "");   //по значению	
		
		ИмяФайлаСтроки = ИмяФайла(стр.НомерСтроки,"xls");		
		#Вставка
		// +ХМНПФ 02.08.2016 ШадринАВ // СформироватьПачкуСведения28XLS() // №461
		ХМ_ВывестиПодписьОтвественногоИИсполнителя(Лист,НомСт);
		// -ХМНПФ 02.08.2016 ШадринАВ // СформироватьПачкуСведения28XLS() // №461
		#КонецВставки
		
		ВременныйФайл = ПолучитьИмяВременногоФайла("xls");
		Книга.SaveAs(ВременныйФайл);
		
		Если СохранятьФайлыВБД Тогда
			
			//сохраним файл в справочник, запишем ссылку на него в таб.часть
			Книга.Close();
			Если НЕ ЗначениеЗаполнено(стр.ЭлектронныйДокумент) Тогда
				ФайлЭДО = Справочники.уп_ЭДПрисоединенныеФайлы.СоздатьЭлемент();
			Иначе
				ФайлЭДО = стр.ЭлектронныйДокумент.ПолучитьОбъект();
			КонецЕсли;
			ФайлЭДО.ВладелецФайла = ЭтотОбъект.Ссылка;
			ФайлЭДО.ВерсияФормата = Перечисления.уп_ВерсииФорматаОбменаПФР.Формат_xls_2014;
			ФайлЭДО.ВидЭД = ВидЭД;
			файлЭДО.ДатаСоздания = Дата;
			ФайлЭДО.ИмяФайла = ИмяФайлаСтроки;
			ФайлЭДО.Наименование = ИмяФайлаСтроки;
			ФайлЭДО.Организация = Организация;
			ФайлЭДО.Получатель = Получатель;
			ТекстВХранилище = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ВременныйФайл), Новый СжатиеДанных);
			ФайлЭДО.ТекстХранилище = ТекстВХранилище;
			ФайлЭДО.Записать();
			
			//записываем его в реквизит
			Стр.ЭлектронныйДокумент = ФайлЭДО.Ссылка;
		Иначе
			//сохраним файл по пути выгрузки, запишем его имя в таб часть (без пути)
			стр.ИмяДокумента = ИмяФайлаСтроки;
			Книга.Close();
		КонецЕсли;
		
		МассивФайлы.Добавить(Новый Структура("Имя, Адрес", ИмяФайлаСтроки, ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВременныйФайл), Новый УникальныйИдентификатор)));
		
		Эксель.Application.Quit();
		УдалитьФайлы(ВременныйФайлШапки);
		
	КонецЕсли;

КонецПроцедуры	

&ИзменениеИКонтроль("СформироватьРеестрСведений27НаВыплатыXDTO")
Процедура РасшОбщ_СформироватьРеестрСведений27НаВыплатыXDTO(СтрокаТЧ, СохранятьФайлыВБД, МассивФайлы) Экспорт
	
	// формируем реестр
	ИмяФайла = ИмяФайла(СтрокаТЧ.НомерСтроки);
	
	Запись = Новый ЗаписьXML;
	
	КолЗЛ = СтрокаТЧ.ОбъектВладелец.СоставПачки.Количество();
	
	ФайлПФР = Неопределено;
	Пакет = ФабрикаXDTO.Пакеты.Получить("Сведения_27_Для_ПФР");
	
	СвойствоXDTO_ФайлПФР = Пакет.КорневыеСвойства.Получить("ФайлПФР");
	Если СвойствоXDTO_ФайлПФР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФайлПФР = ФабрикаXDTO.Создать(СвойствоXDTO_ФайлПФР.Тип);
	
	СвойствоИмяФайла = ФайлПФР.Свойства().Получить("ИмяФайла"); // к свойствам можно обращаться через ОбъектXDTO по имени
	Если СвойствоИмяФайла <> Неопределено Тогда
		ФайлПФР.ИмяФайла = ИмяФайла;
	КонецЕсли;
	СвойствоЗаголовок = ФайлПФР.Свойства().Получить("ЗаголовокФайла"); // к свойствам можно обращаться через ОбъектXDTO по имени
	Если СвойствоЗаголовок <> Неопределено Тогда
		ФабрикаЗаголовок = ФабрикаXDTO.Создать(СвойствоЗаголовок.Тип);
		ФабрикаЗаголовок.ВерсияФормата="07.00";
		ФабрикаЗаголовок.ТипФайла="ВНЕШНИЙ";
		СвойствоПрограмма = ФабрикаЗаголовок.Свойства().Получить("ПрограммаПодготовкиДанных");
		Если СвойствоПрограмма <> Неопределено Тогда
			ФабрикаПрограмма = ФабрикаXDTO.Создать(СвойствоПрограмма.Тип);
			ФабрикаПрограмма.НазваниеПрограммы = "УНПФ";
			ВерсияПрограммы = Метаданные.Версия;
			ФабрикаПрограмма.Версия = ВерсияПрограммы;
			ФабрикаЗаголовок.ПрограммаПодготовкиДанных=ФабрикаПрограмма;
		КонецЕсли;	
		ФабрикаЗаголовок.ИсточникДанных="НПФ";
		ФайлПФР.ЗаголовокФайла = ФабрикаЗаголовок;
	КонецЕсли;	
	СвойствоПачкаВхДок = ФайлПФР.Свойства().Получить("ПачкаВходящихДокументов"); // к свойствам можно обращаться через ОбъектXDTO по имени
	Если СвойствоПачкаВхДок <> Неопределено Тогда
		ФабрикаПачкаВхДок = ФабрикаXDTO.Создать(СвойствоПачкаВхДок.Тип);
		ФабрикаПачкаВхДок.Окружение = "В составе файла";
		ФабрикаПачкаВхДок.Стадия = "До обработки";
		ФабрикаПачкаВхДок.СпособИнвестирования = "НПФ";
		//вложенная фабрика
		СвойствоОпись = ФабрикаПачкаВхДок.Свойства().Получить("ОПИСЬ_ПЕРЕДАЧИ_ДОКУМЕНТОВ_ИЗ_НПФ");
		Если СвойствоОпись<>Неопределено Тогда
			ФабрикаОпись = ФабрикаXDTO.Создать(СвойствоОпись.Тип);
			ФабрикаОпись.НомерВпачке = 1;
			ФабрикаОпись.ТипВходящейОписи = "ОПИСЬ НПФ";
			
			СвойствоСоставитель = ФабрикаОпись.Свойства().Получить("СоставительПачки");
			Если СвойствоСоставитель<>Неопределено Тогда
				ФабрикаСоставитель = ФабрикаXDTO.Создать(СвойствоСоставитель.Тип);
				ФабрикаСоставитель.ИНН = Формат(Число(СокрЛП(Организация.ИНН)),"ЧГ=0");
				ФабрикаСоставитель.НаименованиеОрганизации = СокрЛП(ВРЕГ(Организация.уп_НаименованиеДляПФР));
				ФабрикаОпись.СоставительПачки = ФабрикаСоставитель;
			КонецЕсли;	
			ТекНомерПачки = ДобавитьДоФормата(Строка(СтрокаТЧ.НомерСтроки),5,"0","Лево");
			ФабрикаОпись.НомерПачки = ТекНомерПачки;
			СвойствоНаличиеДокументов = ФабрикаОпись.Свойства().Получить("НаличиеДокументов");
			Если СвойствоНаличиеДокументов<>Неопределено Тогда
				ФабрикаНаличиеДокументов = ФабрикаXDTO.Создать(СвойствоНаличиеДокументов.Тип);
				ФабрикаНаличиеДокументов.ТипДокумента = ТипДокумента();
				ФабрикаНаличиеДокументов.Количество = Формат(КолЗЛ,"ЧГ=");
				ФабрикаОпись.НаличиеДокументов = ФабрикаНаличиеДокументов;
			КонецЕсли;	
			
			ФабрикаОпись.ДатаСоставления = Формат(Дата,"ДФ=dd.MM.yyyy");
			ТекНомерДокументаОрганизации = ДобавитьДоФормата(ПолучитьНомерНаПечать(Ссылка),5,"0","Лево");
			ФабрикаОпись.НомерДокументаОрганизации = Формат(ТекНомерДокументаОрганизации,"ЧВН=");
			ФабрикаОпись.ДатаДокумента = Формат(Дата,"ДФ=dd.MM.yyyy");
			ФабрикаОпись.НомерДокумента = ПолучитьНомерНаПечать(Ссылка);
			ГодСтрокой = Лев(Формат(Дата2,"ДФ=yyyy-MM-dd"),4);
			ФабрикаОпись.ЗаГод = ГодСтрокой;
			
			ФабрикаОпись.ЧислоПачек = ДокументыКВыгрузке.Количество();
			
			СвойствоИтогоПоДокументу = ФабрикаОпись.Свойства().Получить("ИтогоПоДокументу");
			Если СвойствоИтогоПоДокументу<>Неопределено Тогда
				ФабрикаИтогопоДокументу = ФабрикаXDTO.Создать(СвойствоИтогоПоДокументу.Тип);
				ФабрикаИтогопоДокументу.КоличествоЗЛпоДокументу = Формат(КолЗЛ_Итог,"ЧГ=");
				ФабрикаОпись.ИтогоПоДокументу = ФабрикаИтогопоДокументу;
			КонецЕсли;
			
			СвойствоИтогоПоПачке = ФабрикаОпись.Свойства().Получить("ИтогоПоПачке");
			Если СвойствоИтогоПоПачке<>Неопределено Тогда
				ФабрикаИтогопоПачке = ФабрикаXDTO.Создать(СвойствоИтогоПоПачке.Тип);
				ФабрикаИтогопоПачке.КоличествоЗЛпоПачке = Формат(КолЗЛ,"ЧГ=");
				ФабрикаОпись.ИтогоПоПачке = ФабрикаИтогопоПачке;
			КонецЕсли;
		КонецЕсли;
		ФабрикаПачкаВхДок.ОПИСЬ_ПЕРЕДАЧИ_ДОКУМЕНТОВ_ИЗ_НПФ = ФабрикаОпись;
	//+ АДаниленко 51005 Для вывода ошибок XDTO при выгрузке в XML
		ТекстовыйПротокол = Новый ТекстовыйДокумент;
		ЕстьОшибкиXDTO    = Ложь;
	//- АДаниленко 51005
		ВыборкаЗЛ = СуммыДляОписиРеестраСведенийНаВыплаты(СтрокаТЧ.ОбъектВладелец);
		НомерПоПачке = 0;
		Пока ВыборкаЗЛ.Следующий() Цикл
			НомерПоПачке = НомерПоПачке+1;
			НомерПП = НомерПП+1;
			
			СвойствоРеестр =  ФабрикаПачкаВхДок.Свойства().Получить(ТипДокумента());
			Если СвойствоРеестр<>Неопределено Тогда
				ФабрикаРеестр = ФабрикаXDTO.Создать(СвойствоРеестр.Тип);
				ФабрикаРеестр.НомервПачке = Формат(НомерПоПачке,"ЧГ=");
				ФабрикаРеестр.НомерПП = Формат(НомерПП,"ЧГ=");
				
				СвойствоФИО = ФабрикаРеестр.Свойства().Получить("ФИО");
				Если СвойствоФИО<>Неопределено Тогда
					ФабрикаФИО = ФабрикаXDTO.Создать(СвойствоФИО.Тип);
				//+ АДаниленко 51013						
					Фам 	 = ВыборкаЗЛ.ФамилияВРеестреПФР;
					Имя 	 = ВыборкаЗЛ.ИмяВРеестреПФР;
					Отчество = ВыборкаЗЛ.ОтчествоВРеестреПФР;											
					
					Попытка	
						ФабрикаФИО.Фамилия = ВРЕГ(Фам);
					Исключение
						Если НЕ ЕстьОшибкиXDTO Тогда
							ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
						КонецЕсли;	
						ЕстьОшибкиXDTO = Истина;
						ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
					КонецПопытки;
					
					Попытка

						ФабрикаФИО.Имя = ВРЕГ(Имя);
					Исключение
						Если НЕ ЕстьОшибкиXDTO Тогда
							ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
						КонецЕсли;	
						ЕстьОшибкиXDTO = Истина;
						ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
					КонецПопытки;
					
					Попытка
						ФабрикаФИО.Отчество = ВРЕГ(Отчество);						
					Исключение
						Если НЕ ЕстьОшибкиXDTO Тогда
							ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
						КонецЕсли;	
						ЕстьОшибкиXDTO = Истина;
						ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
					КонецПопытки;
				//- АДаниленко 51013
					ФабрикаРеестр.ФИО = ФабрикаФИО;
				КонецЕсли;
				
				СНИЛС = уп_ОПС.ПреобразоватьНомерПФРДляРеестра(ВыборкаЗЛ.НомерПФР); 
				ПерваяЧастьСтраховогоНомера = Лев(СНИЛС,9);
				ВтораяЧастьСтраховогоНомера = Прав(СНИЛС,2);
			//+ АДаниленко 51005 - Добавлены попытки
				Попытка
					ФабрикаРеестр.СтраховойНомер = Формат(Число(ПерваяЧастьСтраховогоНомера),"ЧГ=0");
				Исключение
					Если НЕ ЕстьОшибкиXDTO Тогда
						ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
					КонецЕсли;	
					ЕстьОшибкиXDTO = Истина;
					ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
				КонецПопытки;
				
				Попытка
					ФабрикаРеестр.КонтрольноеЧисло = Формат(Число(ВтораяЧастьСтраховогоНомера),"ЧН=0; ЧГ=0");
				Исключение
					Если НЕ ЕстьОшибкиXDTO Тогда
						ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
					КонецЕсли;	
					ЕстьОшибкиXDTO = Истина;
					ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
				КонецПопытки;
			//- АДаниленко 51005
				Если НЕ ЗначениеЗаполнено(СНИЛС) Тогда
					Сообщить("У ЗЛ "+ВыборкаЗЛ.ФИОЗастрахованногоЛица+", с кодом "+ВыборкаЗЛ.ДоговорОПС.Участник.Код+" отсутствует страховой номер.",СтатусСообщения.ОченьВажное);
					ЕстьОшибки = ИСТИНА;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(ВтораяЧастьСтраховогоНомера) Тогда
					Сообщить("У ЗЛ "+ВыборкаЗЛ.ФИОЗастрахованногоЛица+", с кодом "+ВыборкаЗЛ.ДоговорОПС.Участник.Код+" некорректный страховой номер.",СтатусСообщения.ОченьВажное);
					ЕстьОшибки = Истина;
				КонецЕсли;
				
				СвойствоЗаявление = ФабрикаРеестр.Свойства().Получить("ЗаявлениеЗЛоНазначенииВыплаты");
				Если СвойствоЗаявление<>Неопределено Тогда
					ФабрикаЗаявление = ФабрикаXDTO.Создать(СвойствоЗаявление.Тип);
				//+ АДаниленко 51005 - Добавлена попытка
					Попытка
						ФабрикаЗаявление.ДатаЗаявления = Формат(ВыборкаЗЛ.Заявление.Дата,"ДФ=dd.MM.yyyy");																	
						ФабрикаЗаявление.НомерЗаявления = ПолучитьНомерНаПечать(СокрЛП(ВыборкаЗЛ.Заявление.Номер));
					Исключение
						Если НЕ ЕстьОшибкиXDTO Тогда
							ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
						КонецЕсли;	
						ЕстьОшибкиXDTO = Истина;
						ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
					КонецПопытки;
				//- АДаниленко 51005
					ФабрикаРеестр.ЗаявлениеЗЛоНазначенииВыплаты = ФабрикаЗаявление;
				КонецЕсли;
				
				СвойствоРешение = ФабрикаРеестр.Свойства().Получить("РешениеОВыплате");
				Если СвойствоРешение<>Неопределено Тогда
					ФабрикаРешение = ФабрикаXDTO.Создать(СвойствоРешение.Тип);
				//+ АДаниленко 51005 - Добавлена попытка	
					Попытка
						Если ТипЗнч(ВыборкаЗЛ.ДокументПачки) = Тип("ДокументСсылка.уп_РешениеОЕдиновременнойВыплате") И ВыборкаЗЛ.ДокументПачки.ДоначислениеПоПереданномуВзносуИзПФР Тогда
							ФабрикаРешение.ВариантРешения = "КОРР";
						ИначеЕсли ТипЗнч(ВыборкаЗЛ.ДокументПачки) = Тип("ДокументСсылка.уп_ИндексацияНЧТП") 
							ИЛИ ТипЗнч(ВыборкаЗЛ.ДокументПачки) = Тип("ДокументСсылка.уп_ИндексацияСрочнойВыплаты") Тогда
							ФабрикаРешение.ВариантРешения = "КОРР";
						ИначеЕсли ВыборкаЗЛ.ТипВыплаты = "ОТКЗ" Тогда
							ФабрикаРешение.ВариантРешения = "ОТКЗ";
						Иначе
							ФабрикаРешение.ВариантРешения = "УСТН";
						КонецЕсли;
						ФабрикаРешение.ДатаРешения = Формат(ВыборкаЗЛ.ДатаРешения,"ДФ=dd.MM.yyyy");
						ФабрикаРешение.НомерРешения = ПолучитьНомерНаПечать(СокрЛП(ВыборкаЗЛ.НомерРешения));
					Исключение
						Если НЕ ЕстьОшибкиXDTO Тогда
							ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
						КонецЕсли;	
						ЕстьОшибкиXDTO = Истина;
						ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
					КонецПопытки;
				//- АДаниленко 51005
					ФабрикаРеестр.РешениеОВыплате = ФабрикаРешение;
				КонецЕсли;
				
				СвойствоУведомление = ФабрикаРеестр.Свойства().Получить("УведомлениеОбращенииЗЛ");
				Если СвойствоУведомление<>Неопределено Тогда
					ФабрикаУведомление = ФабрикаXDTO.Создать(СвойствоУведомление.Тип);
				//+ АДаниленко 51005 - Добавлена попытка	
					Попытка
						ФабрикаУведомление.ДатаОбращения = Формат(ВыборкаЗЛ.ДатаУведомления,"ДФ=dd.MM.yyyy");
						ФабрикаУведомление.НомерОбращения = ПолучитьНомерНаПечать(СокрЛП(ВыборкаЗЛ.НомерУведомления));
						ФабрикаРеестр.УведомлениеОбращенииЗЛ = ФабрикаУведомление;
					Исключение
						Если НЕ ЕстьОшибкиXDTO Тогда
							ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
						КонецЕсли;	
						ЕстьОшибкиXDTO = Истина;
						ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
					КонецПопытки;
				//- АДаниленко 51005	
				КонецЕсли;
			
				Если ВыборкаЗЛ.ТипВыплаты <> "ОТКЗ" Тогда
					СвойствоВыплатыЗЛ1 = ФабрикаРеестр.Свойства().Получить("ВыплатыЗЛ1");
					Если СвойствоВыплатыЗЛ1<>Неопределено Тогда
						ФабрикаВыплатыЗЛ1 = ФабрикаXDTO.Создать(СвойствоВыплатыЗЛ1.Тип);
						//+ АДаниленко 51005 - Добавлена попытка	
						Попытка
							ФабрикаВыплатыЗЛ1.ВидВыплаты = ВыборкаЗЛ.ТипВыплаты;
							ФабрикаВыплатыЗЛ1.ДатаРасчетаСуммы = Формат(ВыборкаЗЛ.ДатаРешения,"ДФ=dd.MM.yyyy");
							//ФабрикаВыплатыЗЛ1.ПричинаПрекПриост = "";
							ФабрикаВыплатыЗЛ1.ПричинаПрекПриост = "ПРОЧ";  //зачем то поле стало обязательным
						Исключение
							Если НЕ ЕстьОшибкиXDTO Тогда
								ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
							КонецЕсли;	
							ЕстьОшибкиXDTO = Истина;
							ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
						КонецПопытки;
						//- АДаниленко 51005	
						//дату окончания надо считать
						Если ВыборкаЗЛ.ТипВыплаты = "ЕВ" Тогда
							#Удаление
							ДатаОкончанияВыплаты = ВыборкаЗЛ.ДатаНачалаВыплат;
							#КонецУдаления
							#Вставка
							// +ХМНПФ 12.01.2017 ШадринАВ // СформироватьРеестрСведений27НаВыплатыXDTO() // №702
							ДатаОкончанияВыплаты = ?(ЗначениеЗаполнено(ВыборкаЗЛ.ДатаНачалаВыплат),ВыборкаЗЛ.ДатаНачалаВыплат,ВыборкаЗЛ.ДатаРешения);
							// -ХМНПФ 12.01.2017 ШадринАВ // СформироватьРеестрСведений27НаВыплатыXDTO() // №702
							#КонецВставки
						Иначе
							//считаем
							ДатаОкончанияВыплаты = НачалоМесяца(ДобавитьМесяц(ВыборкаЗЛ.ДатаНачалаВыплат,ВыборкаЗЛ.Срок-1));
						КонецЕсли;
						СуммаСПН = ВыборкаЗЛ.СуммаДляВыплатыОПС+ВыборкаЗЛ.СуммаДляВыплатыДСВ+ВыборкаЗЛ.СуммаДляВыплатыСОФН+ВыборкаЗЛ.СуммаДляВыплатыМСК;
						//+ АДаниленко 51005 Добавлена попытка	
						Попытка
						//+ АДаниленко 22.01.2018 - Необходимо оставить только для СВ
							#Удаление
							Если уп_ДатаОкончанияСВ Тогда
								Если ВыборкаЗЛ.ТипВыплаты = "СПВ" Тогда 
									ФабрикаВыплатыЗЛ1.ДатаОкончанияВыплаты = Формат(ДатаОкончанияВыплаты,"ДФ=dd.MM.yyyy");
								Иначе
									ФабрикаВыплатыЗЛ1.ДатаОкончанияВыплаты = "";
								КонецЕсли;
							Иначе 
								ФабрикаВыплатыЗЛ1.ДатаОкончанияВыплаты = Формат(ДатаОкончанияВыплаты,"ДФ=dd.MM.yyyy");
							КонецЕсли;
							#КонецУдаления
							#Вставка
							// +ХМНПФ 26.02.2018 ШадринАВ // СформироватьРеестрСведений27НаВыплатыXDTO() // №1383
							ФабрикаВыплатыЗЛ1.ДатаОкончанияВыплаты = Формат(ДатаОкончанияВыплаты,"ДФ=dd.MM.yyyy");
							// -ХМНПФ 26.02.2018 ШадринАВ // СформироватьРеестрСведений27НаВыплатыXDTO() // №1383
							#КонецВставки
						//- АДаниленко 22.01.2018
							ФабрикаВыплатыЗЛ1.СуммаСПНдляВыплаты = ОбработатьЧислоДляФайла(СуммаСПН);
							
							ФабрикаВыплатыЗЛ1.СуммаДляВыплатыОПС = ОбработатьЧислоДляФайла(ВыборкаЗЛ.СуммаДляВыплатыОПС);
							ФабрикаВыплатыЗЛ1.ВзносыОПСВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.ВзносыОПСВыплата);
							ФабрикаВыплатыЗЛ1.ИДпоОПСВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.ИДпоОПСВыплата);
							ФабрикаВыплатыЗЛ1.КомпОПСВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.КомпОПСВыплата);
							ФабрикаВыплатыЗЛ1.ВосплОПСВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.ВосплОПСВыплата);
							ФабрикаВыплатыЗЛ1.ВозмОПСВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.ВозмОПСВыплата);
							
							ФабрикаВыплатыЗЛ1.СуммаДляВыплатыДСВ = ОбработатьЧислоДляФайла(ВыборкаЗЛ.СуммаДляВыплатыДСВ);
							ФабрикаВыплатыЗЛ1.ВзносыДСВВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.ВзносыДСВВыплата);
							ФабрикаВыплатыЗЛ1.ИДпоДСВВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.ИДпоДСВВыплата);
							ФабрикаВыплатыЗЛ1.КомпДСВВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.КомпДСВВыплата);
							ФабрикаВыплатыЗЛ1.ВосплДСВВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.ВосплДСВВыплата);
							ФабрикаВыплатыЗЛ1.ВозмДСВВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.ВозмДСВВыплата);
							
							ФабрикаВыплатыЗЛ1.СуммаДляВыплатыСОФН = ОбработатьЧислоДляФайла(ВыборкаЗЛ.СуммаДляВыплатыСОФН);
							ФабрикаВыплатыЗЛ1.ВзносыСОФНВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.ВзносыСОФНВыплата);
							ФабрикаВыплатыЗЛ1.ИДпоСОФНВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.ИДпоСОФНВыплата);
							ФабрикаВыплатыЗЛ1.КомпСОФНВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.КомпСОФНВыплата);
							ФабрикаВыплатыЗЛ1.ВосплСОФНВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.ВосплСОФНВыплата);
							ФабрикаВыплатыЗЛ1.ВозмСОФНВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.ВозмСОФНВыплата);
							
							ФабрикаВыплатыЗЛ1.СуммаДляВыплатыМСК = ОбработатьЧислоДляФайла(ВыборкаЗЛ.СуммаДляВыплатыМСК);
							ФабрикаВыплатыЗЛ1.СредстваМСКВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.СредстваМСКВыплата);
							ФабрикаВыплатыЗЛ1.ИДпоМСКВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.ИДпоМСКВыплата);
							ФабрикаВыплатыЗЛ1.КомпМСКВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.КомпМСКВыплата);
							ФабрикаВыплатыЗЛ1.ВосплМСКВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.ВосплМСКВыплата);
							ФабрикаВыплатыЗЛ1.ВозмМСКВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.ВозмМСКВыплата);
							
							ФабрикаВыплатыЗЛ1.ДатаСобытия = Формат(ВыборкаЗЛ.ДатаРешения,"ДФ=dd.MM.yyyy");
							ФабрикаВыплатыЗЛ1.СуммаПервойВыплаты = ОбработатьЧислоДляФайла(ВыборкаЗЛ.СуммаПервойВыплаты);
						Исключение
							Если НЕ ЕстьОшибкиXDTO Тогда
								ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
							КонецЕсли;	
							ЕстьОшибкиXDTO = Истина;
							ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
						КонецПопытки;
						//- АДаниленко 51005	
						//распределим первую выплату по типам сумм
						СуммаПролистали = 0;
						Если ВыборкаЗЛ.СуммаДляВыплатыОПС<СуммаСПН Тогда
							//еще есть источники
							СуммаОПС = Окр(ВыборкаЗЛ.СуммаПервойВыплаты*ВыборкаЗЛ.СуммаДляВыплатыОПС/СуммаСПН,2);
						Иначе
							СуммаОПС = ВыборкаЗЛ.СуммаПервойВыплаты;
						КонецЕсли;
						СуммаПролистали = ВыборкаЗЛ.СуммаДляВыплатыОПС;
						
						Если СуммаПролистали+ВыборкаЗЛ.СуммаДляВыплатыДСВ<СуммаСПН Тогда
							//еще есть источники
							СуммаДСВ = Окр(ВыборкаЗЛ.СуммаПервойВыплаты*ВыборкаЗЛ.СуммаДляВыплатыДСВ/СуммаСПН,2);
						Иначе
							СуммаДСВ = ВыборкаЗЛ.СуммаПервойВыплаты-СуммаОПС;
						КонецЕсли;
						СуммаПролистали = СуммаПролистали+ВыборкаЗЛ.СуммаДляВыплатыДСВ;
						
						Если СуммаПролистали+ВыборкаЗЛ.СуммаДляВыплатыСОФН<СуммаСПН Тогда
							//еще есть источники
							СуммаСОФН = Окр(ВыборкаЗЛ.СуммаПервойВыплаты*ВыборкаЗЛ.СуммаДляВыплатыСОФН/СуммаСПН,2);
						Иначе
							СуммаСОФН = ВыборкаЗЛ.СуммаПервойВыплаты-СуммаОПС-СуммаДСВ;
						КонецЕсли;
						
						СуммаМК = ВыборкаЗЛ.СуммаПервойВыплаты-СуммаОПС-СуммаДСВ-СуммаСОФН;
						//+ АДаниленко 51005 - Добавлена попытка	
						Попытка
							ФабрикаВыплатыЗЛ1.ПерваяВыплатаОПС = ОбработатьЧислоДляФайла(СуммаОПС); 
							ФабрикаВыплатыЗЛ1.ПерваяВыплатаДСВ = ОбработатьЧислоДляФайла(СуммаДСВ);
							ФабрикаВыплатыЗЛ1.ПерваяВыплатаСОФН = ОбработатьЧислоДляФайла(СуммаСОФН);
							ФабрикаВыплатыЗЛ1.ПерваяВыплатаМСК = ОбработатьЧислоДляФайла(СуммаМК);
							ФабрикаВыплатыЗЛ1.НомерПервойВыплаты = ВыборкаЗЛ.НомерПервойВыплаты;
							
							Если ВыборкаЗЛ.ТипВыплаты = "ЕВ" Тогда
								ФабрикаВыплатыЗЛ1.ДатаНачалаЕжемесячнойВыплаты = "";
								ФабрикаВыплатыЗЛ1.ЕжемесячнаяВыплата = ОбработатьЧислоДляФайла(0);
								ФабрикаВыплатыЗЛ1.ЕжемесячнаяВыплатаОСП = ОбработатьЧислоДляФайла(0);
								ФабрикаВыплатыЗЛ1.ЕжемесячнаяВыплатаДСВ = ОбработатьЧислоДляФайла(0);
								ФабрикаВыплатыЗЛ1.ЕжемесячнаяВыплатаСОФН = ОбработатьЧислоДляФайла(0);
								ФабрикаВыплатыЗЛ1.ЕжемесячнаяВыплатаМСК = ОбработатьЧислоДляФайла(0);
							Иначе
								ФабрикаВыплатыЗЛ1.ДатаНачалаЕжемесячнойВыплаты = Формат(КонецМесяца(ВыборкаЗЛ.ДатаРешения)+1,"ДФ=dd.MM.yyyy");
								ФабрикаВыплатыЗЛ1.ЕжемесячнаяВыплата = ОбработатьЧислоДляФайла(ВыборкаЗЛ.СуммаЕжемесячнойВыплаты);
								//распределим ежемесячную выплату по типам сумм
								СуммаПролистали = 0;
								Если ВыборкаЗЛ.СуммаДляВыплатыОПС<СуммаСПН Тогда
									//еще есть источники
									СуммаОПС = Окр(ВыборкаЗЛ.СуммаЕжемесячнойВыплаты*ВыборкаЗЛ.СуммаДляВыплатыОПС/СуммаСПН,2);
								Иначе
									СуммаОПС = ВыборкаЗЛ.СуммаЕжемесячнойВыплаты;
								КонецЕсли;
								СуммаПролистали = ВыборкаЗЛ.СуммаДляВыплатыОПС;
								
								Если СуммаПролистали+ВыборкаЗЛ.СуммаДляВыплатыДСВ<СуммаСПН Тогда
									//еще есть источники
									СуммаДСВ = Окр(ВыборкаЗЛ.СуммаЕжемесячнойВыплаты*ВыборкаЗЛ.СуммаДляВыплатыДСВ/СуммаСПН,2);
								Иначе
									СуммаДСВ = ВыборкаЗЛ.СуммаЕжемесячнойВыплаты-СуммаОПС;
								КонецЕсли;
								СуммаПролистали = СуммаПролистали+ВыборкаЗЛ.СуммаДляВыплатыДСВ;
								
								Если СуммаПролистали+ВыборкаЗЛ.СуммаДляВыплатыСОФН<СуммаСПН Тогда
									//еще есть источники
									СуммаСОФН = Окр(ВыборкаЗЛ.СуммаЕжемесячнойВыплаты*ВыборкаЗЛ.СуммаДляВыплатыСОФН/СуммаСПН,2);
								Иначе
									СуммаСОФН = ВыборкаЗЛ.СуммаЕжемесячнойВыплаты-СуммаОПС-СуммаДСВ;
								КонецЕсли;
								
								СуммаМК = ВыборкаЗЛ.СуммаЕжемесячнойВыплаты-СуммаОПС-СуммаДСВ-СуммаСОФН;
								
								ФабрикаВыплатыЗЛ1.ЕжемесячнаяВыплатаОСП = ОбработатьЧислоДляФайла(СуммаОПС);
								ФабрикаВыплатыЗЛ1.ЕжемесячнаяВыплатаДСВ = ОбработатьЧислоДляФайла(СуммаДСВ);
								ФабрикаВыплатыЗЛ1.ЕжемесячнаяВыплатаСОФН = ОбработатьЧислоДляФайла(СуммаСОФН);
								ФабрикаВыплатыЗЛ1.ЕжемесячнаяВыплатаМСК = ОбработатьЧислоДляФайла(СуммаМК);
							КонецЕсли;	
							ФабрикаВыплатыЗЛ1.СуммаФактВыплаты = ОбработатьЧислоДляФайла(0);
							ФабрикаВыплатыЗЛ1.ФактВыплатаОПС = ОбработатьЧислоДляФайла(0);
							ФабрикаВыплатыЗЛ1.ФактВыплатаДСВ = ОбработатьЧислоДляФайла(0);
							ФабрикаВыплатыЗЛ1.ФактВыплатаСОФН = ОбработатьЧислоДляФайла(0);
							ФабрикаВыплатыЗЛ1.ФактВыплатаМСК = ОбработатьЧислоДляФайла(0);
							
						//+ АДаниленко 22.01.2018	
							Если уп_ДатаОкончанияСВ Тогда							
								#Удаление
								Если ВыборкаЗЛ.ТипВыплаты = "СПВ" Тогда
								#КонецУдаления
								#Вставка
								//+ХМНПФ 29.03.2018 КлименкоМИ // СформироватьРеестрСведений27НаВыплатыXDTO() // №1466
								Если  ВыборкаЗЛ.ТипВыплаты <> "ЕВ" Тогда	
								//-ХМНПФ 29.03.2018 КлименкоМИ // СформироватьРеестрСведений27НаВыплатыXDTO() // №1466
								#КонецВставки
									ФабрикаВыплатыЗЛ1.ПериодВыплатыМесяцев = ВыборкаЗЛ.Срок;
								Иначе
									ФабрикаВыплатыЗЛ1.ПериодВыплатыМесяцев = "";
								КонецЕсли;
							Иначе
								ФабрикаВыплатыЗЛ1.ПериодВыплатыМесяцев = ВыборкаЗЛ.Срок;
								Если ВыборкаЗЛ.Срок = 1 Тогда
									ФабрикаВыплатыЗЛ1.ПериодВыплатыМесяцев = "";
								КонецЕсли;
							КонецЕсли;
						//- АДаниленко 22.01.2018	
							
							//ФабрикаВыплатыЗЛ1.СуммаФактВыплаты = "";
							//ФабрикаВыплатыЗЛ1.ФактВыплатаОПС = "";
							//ФабрикаВыплатыЗЛ1.ФактВыплатаДСВ = "";
							//ФабрикаВыплатыЗЛ1.ФактВыплатаСОФН = "";
							//ФабрикаВыплатыЗЛ1.ФактВыплатаМСК = "";
							
							ФабрикаРеестр.ВыплатыЗЛ1 = ФабрикаВыплатыЗЛ1;
						Исключение
							Если НЕ ЕстьОшибкиXDTO Тогда
								ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
							КонецЕсли;	
							ЕстьОшибкиXDTO = Истина;
							ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
						КонецПопытки;
						//- АДаниленко 51005	
					КонецЕсли;
				КонецЕсли;
				ФабрикаПачкаВхДок[ТипДокумента()].Добавить(ФабрикаРеестр);
			КонецЕсли;
		КонецЦикла;
		ФайлПФР.ПачкаВходящихДокументов = ФабрикаПачкаВхДок;
	КонецЕсли;	
//+ АДаниленко 51005
	Если ЕстьОшибкиXDTO Тогда
		МассивФайлы.Добавить(Новый Структура("Протокол, Текст", "Ошибки XDTO", ТекстовыйПротокол.ПолучитьТекст()));
		ЕстьОшибки = Истина;
	КонецЕсли;	
//- АДаниленко 51005
	Запись.УстановитьСтроку("windows-1251");
	ФабрикаXDTO.ЗаписатьXML(Запись, ФайлПФР, "ФайлПФР");
	
	//записываем объявление
	ЗаголовокФайла = "<?xml version=""1.0"" encoding=""windows-1251"" standalone=""no""?>";	
	XMLВСтроку = Запись.Закрыть();
	//удаляем из первого тега лишнее
	XMLВСтрокуРедакция = СтрЗаменить(XMLВСтроку,
	" xmlns=""Сведения_27_Для_ПФР"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""",
	"");
		
	МассивФайлы.Добавить(Новый Структура("Имя, Заголовок, Текст", ИмяФайла, ЗаголовокФайла, XMLВСтрокуРедакция));
	
	Если НЕ ЕстьОшибки Тогда
		// записываем ее в элемент справочника
		Если СохранятьФайлыВБД Тогда
			Если НЕ ЗначениеЗаполнено(Опись) Тогда
				ФайлЭДО = Справочники.уп_ЭДПрисоединенныеФайлы.СоздатьЭлемент();
			Иначе
				ФайлЭДО = Опись.ПолучитьОбъект();
			КонецЕсли;
			ФайлЭДО.ВладелецФайла = ЭтотОбъект.Ссылка;
			ФайлЭДО.ВерсияФормата = Перечисления.уп_ВерсииФорматаОбменаПФР.Формат_0700;
			ФайлЭДО.ВидЭД = ВидЭД;
			файлЭДО.ДатаСоздания = Дата;
			ФайлЭДО.ИмяФайла = ИмяФайла;
			ФайлЭДО.Наименование = ИмяФайла;
			ФайлЭДО.Организация = Организация;
			ФайлЭДО.Получатель = Получатель;
			Текст = ЗаголовокФайла+XMLВСтрокуРедакция;
			ТекстВХранилище = Новый ХранилищеЗначения(Текст);
			ФайлЭДО.ТекстХранилище = ТекстВХранилище;
			ФайлЭДО.Записать();
			
			//записываем элемент справочника в реквизит
			СтрокаТЧ.ЭлектронныйДокумент = ФайлЭДО.Ссылка;
		Иначе
			СтрокаТЧ.ИмяДокумента = ИмяФайла;
		КонецЕсли;
	Иначе
		//Сообщить("Файл "+ИмяФайла+" сформирован не корректно.",СтатусСообщения.ОченьВажное);
		МассивФайлы.Добавить(Новый Структура("ТекстОшибки", "Файл "+ИмяФайла+" сформирован не корректно."));
	КонецЕсли;
	
КонецПроцедуры

&ИзменениеИКонтроль("СформироватьСведения31XDTO")
Процедура РасшОбщ_СформироватьСведения31XDTO(СтрокаТЧ, СохранятьФайлыВБД, МассивФайлы, ПроставлятьМестоРожденияРФ)
	
	// формируем реестр
	ИмяФайла = ИмяФайла(СтрокаТЧ.НомерСтроки);
	
	ВыборкаЗЛ = СобратьСведенияОПП(СтрокаТЧ.ОбъектВладелец);
	
	Запись = Новый ЗаписьXML;
	
	ФайлПФР = Неопределено;
	Пакет = ФабрикаXDTO.Пакеты.Получить("Сведения_31_Для_ПФР");
	
	СвойствоXDTO_ФайлПФР = Пакет.КорневыеСвойства.Получить("ФайлПФР");
	Если СвойствоXDTO_ФайлПФР = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФайлПФР = ФабрикаXDTO.Создать(СвойствоXDTO_ФайлПФР.Тип);
	
	СвойствоИмяФайла = ФайлПФР.Свойства().Получить("ИмяФайла"); // к свойствам можно обращаться через ОбъектXDTO по имени
	Если СвойствоИмяФайла <> Неопределено Тогда
		ФайлПФР.ИмяФайла = ИмяФайла;
	КонецЕсли;
	
	//КолЗЛ = СтрокаТЧ.ОбъектВладелец.ДоговорыОПС.Количество();
	КолЗЛ = ОпределитьКолЗЛПоПачкеПП(СтрокаТЧ.ОбъектВладелец);
	
	СвойствоЗаголовок = ФайлПФР.Свойства().Получить("ЗаголовокФайла"); // к свойствам можно обращаться через ОбъектXDTO по имени
	Если СвойствоЗаголовок <> Неопределено Тогда
		ФабрикаЗаголовок = ФабрикаXDTO.Создать(СвойствоЗаголовок.Тип);
		ФабрикаЗаголовок.ВерсияФормата="07.00";
		ФабрикаЗаголовок.ТипФайла="ВНЕШНИЙ";
		СвойствоПрограмма = ФабрикаЗаголовок.Свойства().Получить("ПрограммаПодготовкиДанных");
		Если СвойствоПрограмма <> Неопределено Тогда
			ФабрикаПрограмма = ФабрикаXDTO.Создать(СвойствоПрограмма.Тип);
			ФабрикаПрограмма.НазваниеПрограммы = "УНПФ";
			//ВерсияПрограммы = Константы.НомерВерсииКонфигурации.Получить();
			ВерсияПрограммы = Метаданные.Версия;
			ФабрикаПрограмма.Версия = ВерсияПрограммы;
			ФабрикаЗаголовок.ПрограммаПодготовкиДанных=ФабрикаПрограмма;
		КонецЕсли;	
		ФабрикаЗаголовок.ИсточникДанных="НПФ";
		ФайлПФР.ЗаголовокФайла = ФабрикаЗаголовок;
	КонецЕсли;	
	СвойствоПачкаВхДок = ФайлПФР.Свойства().Получить("ПачкаВходящихДокументов"); // к свойствам можно обращаться через ОбъектXDTO по имени
	Если СвойствоПачкаВхДок <> Неопределено Тогда
		ФабрикаПачкаВхДок = ФабрикаXDTO.Создать(СвойствоПачкаВхДок.Тип);
		ФабрикаПачкаВхДок.Окружение = "В составе файла";
		ФабрикаПачкаВхДок.Стадия = "До обработки";
		ФабрикаПачкаВхДок.СпособИнвестирования = "НПФ";
		//вложенная фабрика
		СвойствоОпись = ФабрикаПачкаВхДок.Свойства().Получить("ОПИСЬ_ПЕРЕДАЧИ_ДОКУМЕНТОВ_ИЗ_НПФ");
		Если СвойствоОпись<>Неопределено Тогда
			ФабрикаОпись = ФабрикаXDTO.Создать(СвойствоОпись.Тип);
			ФабрикаОпись.НомерВпачке = 1;
			ФабрикаОпись.ТипВходящейОписи = "ОПИСЬ НПФ";
			
			СвойствоСоставитель = ФабрикаОпись.Свойства().Получить("СоставительПачки");
			Если СвойствоСоставитель<>Неопределено Тогда
				ФабрикаСоставитель = ФабрикаXDTO.Создать(СвойствоСоставитель.Тип);
				ФабрикаСоставитель.ИНН = Формат(Число(СокрЛП(Организация.ИНН)),"ЧГ=0");
				ФабрикаСоставитель.НаименованиеОрганизации = СокрЛП(ВРЕГ(Организация.уп_НаименованиеДляПФР));
				ФабрикаОпись.СоставительПачки = ФабрикаСоставитель;
			КонецЕсли;	
			ТекНомерПачки = ДобавитьДоФормата(Строка(СтрокаТЧ.НомерСтроки),5,"0","Лево");
			ФабрикаОпись.НомерПачки = ТекНомерПачки;
			СвойствоНаличиеДокументов = ФабрикаОпись.Свойства().Получить("НаличиеДокументов");
			Если СвойствоНаличиеДокументов<>Неопределено Тогда
				ФабрикаНаличиеДокументов = ФабрикаXDTO.Создать(СвойствоНаличиеДокументов.Тип);
				ФабрикаНаличиеДокументов.ТипДокумента = ТипДокумента();
				ФабрикаНаличиеДокументов.Количество = Формат(КолЗЛ,"ЧГ=");
				ФабрикаОпись.НаличиеДокументов = ФабрикаНаличиеДокументов;
			КонецЕсли;	
			
			ФабрикаОпись.ДатаСоставления = Формат(Дата,"ДФ=dd.MM.yyyy");
			ТекНомерДокументаОрганизации = ДобавитьДоФормата(ПолучитьНомерНаПечать(Ссылка),5,"0","Лево");
			ФабрикаОпись.НомерДокументаОрганизации = Формат(ТекНомерДокументаОрганизации,"ЧВН=");
			ФабрикаОпись.ДатаДокумента = Формат(Дата,"ДФ=dd.MM.yyyy");
			ФабрикаОпись.НомерДокумента = ПолучитьНомерНаПечать(Ссылка);
			ГодСтрокой = Лев(Формат(Дата2,"ДФ=yyyy-MM-dd"),4);
			ФабрикаОпись.ЗаГод = ГодСтрокой;
			
			ФабрикаОпись.ЧислоПачек = ДокументыКВыгрузке.Количество();
			
			СвойствоИтогоПоДокументу = ФабрикаОпись.Свойства().Получить("ИтогоПоДокументу");
			Если СвойствоИтогоПоДокументу<>Неопределено Тогда
				ФабрикаИтогопоДокументу = ФабрикаXDTO.Создать(СвойствоИтогоПоДокументу.Тип);
				ФабрикаИтогопоДокументу.КоличествоЗЛпоДокументу = Формат(КолЗЛ_Итог,"ЧГ=");
				ФабрикаОпись.ИтогоПоДокументу = ФабрикаИтогопоДокументу;
			КонецЕсли;
			
			СвойствоИтогоПоПачке = ФабрикаОпись.Свойства().Получить("ИтогоПоПачке");
			Если СвойствоИтогоПоПачке<>Неопределено Тогда
				ФабрикаИтогопоПачке = ФабрикаXDTO.Создать(СвойствоИтогоПоПачке.Тип);
				ФабрикаИтогопоПачке.КоличествоЗЛпоПачке = Формат(КолЗЛ,"ЧГ=");
				ФабрикаОпись.ИтогоПоПачке = ФабрикаИтогопоПачке;
			КонецЕсли;
			
		КонецЕсли;
		ФабрикаПачкаВхДок.ОПИСЬ_ПЕРЕДАЧИ_ДОКУМЕНТОВ_ИЗ_НПФ = ФабрикаОпись;
	//+ АДаниленко 51005 Для вывода ошибок XDTO при выгрузке в XML
		ТекстовыйПротокол = Новый ТекстовыйДокумент;
		ЕстьОшибкиXDTO	  = Ложь;
	//- АДаниленко 51005	
		НомерПоПачке = 0;
		Пока ВыборкаЗЛ.Следующий() Цикл
			ВыборкаРешений = ВыборкаЗЛ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ТекЗЛ = ВыборкаЗЛ.ЗастрахованноеЛицо;
			Пока ВыборкаРешений.Следующий() Цикл
				ОсталосьСВ = ВыборкаРешений.СуммаСписаноСВ;
				ОсталосьДСВ = ВыборкаРешений.СуммаСписаноДСВ;
				ОсталосьСФ = ВыборкаРешений.СуммаСписаноСФ;
				ОсталосьВсего = ОсталосьСВ+ОсталосьДСВ+ОсталосьСФ;
				
				НомерПоПачке = НомерПоПачке+1;
				НомерПП = НомерПП+1;
				
				СвойствоРеестр =  ФабрикаПачкаВхДок.Свойства().Получить(ТипДокумента());
				Если СвойствоРеестр<>Неопределено Тогда
					ФабрикаРеестр = ФабрикаXDTO.Создать(СвойствоРеестр.Тип);
					ФабрикаРеестр.НомервПачке = Формат(НомерПоПачке,"ЧГ=");
					ФабрикаРеестр.НомерПП = Формат(НомерПП,"ЧГ=");
					
					ТекЗЛ = ВыборкаЗЛ.ЗастрахованноеЛицо;
					
					СвойствоФИО = ФабрикаРеестр.Свойства().Получить("ФИО");
					Если СвойствоФИО<>Неопределено Тогда
						ФабрикаФИО = ФабрикаXDTO.Создать(СвойствоФИО.Тип);
					//+ АДаниленко 51005
						ФизЛицо = ТекЗЛ.уп_ФизЛицо;
						Если ЗначениеЗаполнено(ФизЛицо.уп_ФамилияВРеестреПФР) 
						И ЗначениеЗаполнено(ФизЛицо.уп_ИмяВРеестреПФР) Тогда
							Фам 	 = ФизЛицо.уп_ФамилияВРеестреПФР;
							Имя 	 = ФизЛицо.уп_ИмяВРеестреПФР;
							Отчество = ФизЛицо.уп_ОтчествоВРеестреПФР;						
						Иначе
							ФИО = ТекЗЛ.уп_ФизЛицо.Наименование;
							ФИОСтруктура = РазобратьФИО(СокрЛП(ФИО), ФизЛицо);
							Фам 	 = ФИОСтруктура.Фамилия;
							Имя		 = ФИОСтруктура.Имя;
							Отчество = ФИОСтруктура.Отчество;
						КонецЕсли;
					
						Попытка	
							ФабрикаФИО.Фамилия = ВРЕГ(Фам);
						Исключение
							Если НЕ ЕстьОшибкиXDTO Тогда
								ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
							КонецЕсли;	
							ЕстьОшибкиXDTO = Истина;
							ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
						КонецПопытки;
						
						Попытка

							ФабрикаФИО.Имя = ВРЕГ(Имя);
						Исключение
							Если НЕ ЕстьОшибкиXDTO Тогда
								ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
							КонецЕсли;	
							ЕстьОшибкиXDTO = Истина;
							ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
						КонецПопытки;
						
						Попытка
							ФабрикаФИО.Отчество = ВРЕГ(Отчество);						
						Исключение
							Если НЕ ЕстьОшибкиXDTO Тогда
								ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
							КонецЕсли;	
							ЕстьОшибкиXDTO = Истина;
							ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
						КонецПопытки;
					//- АДаниленко 51005
					ФабрикаРеестр.ФИО = ФабрикаФИО;
					КонецЕсли;
					
					Попытка
						ФабрикаРеестр.ДатаРождения = Формат(ТекЗЛ.уп_ФизЛицо.ДатаРождения,"ДФ=dd.MM.yyyy");
					Исключение
						Если НЕ ЕстьОшибкиXDTO Тогда
							ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
						КонецЕсли;	
						ЕстьОшибкиXDTO = Истина;
						ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
					КонецПопытки;
					
					СвойствоМестоРождения = ФабрикаРеестр.Свойства().Получить("МестоРождения");
					Если СвойствоМестоРождения<>Неопределено Тогда
						ФабрикаМестоРождения = ФабрикаXDTO.Создать(СвойствоМестоРождения.Тип);
						МестоРождения = ПерсонифицированныйУчетКлиентСервер.РазложитьМестоРождения(ТекЗЛ.уп_ФизЛицо.МестоРождения, Истина, ПроставлятьМестоРожденияРФ);
						
						Если МестоРождения.Особое = 1 Тогда
							ТипМестаРождения = "ОСОБОЕ";
						ИначеЕсли МестоРождения.Особое = 0 Тогда
							ТипМестаРождения = "СТАНДАРТ";
						КонецЕсли;	
						МестоРожденияНаселенныйПункт = ВРЕГ(МестоРождения.НаселенныйПункт);
						МестоРожденияРайон = ВРЕГ(МестоРождения.Район);
						МестоРожденияОбласть = ВРЕГ(МестоРождения.Область);
						МестоРожденияСтрана = ВРЕГ(МестоРождения.Страна);
						
						Попытка
							ФабрикаМестоРождения.ТипМестаРождения = ТипМестаРождения;
							ФабрикаМестоРождения.ГородРождения = МестоРожденияНаселенныйПункт;
							ФабрикаМестоРождения.РайонРождения = МестоРожденияРайон;
							ФабрикаМестоРождения.РегионРождения = МестоРожденияОбласть;
							ФабрикаМестоРождения.СтранаРождения = МестоРожденияСтрана;
							ФабрикаРеестр.МестоРождения = ФабрикаМестоРождения;
						Исключение
							Если НЕ ЕстьОшибкиXDTO Тогда
								ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
							КонецЕсли;	
							ЕстьОшибкиXDTO = Истина;
							ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
						КонецПопытки;
					КонецЕсли;
				//+ АДаниленко 51005 - Добавлена попытка
					Попытка
						ФабрикаРеестр.Пол = ВРЕГ(Лев(Строка(ТекЗЛ.уп_ФизЛицо.Пол),1));
					Исключение
						Если НЕ ЕстьОшибкиXDTO Тогда
							ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
						КонецЕсли;	
						ЕстьОшибкиXDTO = Истина;
						ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
					КонецПопытки;
				//- АДаниленко 51005
					
					СНИЛС = уп_ОПС.ПреобразоватьНомерПФРДляРеестра(ТекЗЛ.уп_ФизЛицо.СтраховойНомерПФР); 
					ПерваяЧастьСтраховогоНомера = Лев(СНИЛС,9);
					ВтораяЧастьСтраховогоНомера = Прав(СНИЛС,2);
				//+ АДаниленко 51005 - Добавлена попытка
					Попытка
						ФабрикаРеестр.СтраховойНомер = Формат(Число(ПерваяЧастьСтраховогоНомера),"ЧГ=0");
						ФабрикаРеестр.КонтрольноеЧисло = Формат(Число(ВтораяЧастьСтраховогоНомера),"ЧН=0; ЧГ=0");
					Исключение
						Если НЕ ЕстьОшибкиXDTO Тогда
							ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
						КонецЕсли;	
						ЕстьОшибкиXDTO = Истина;
						ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
					КонецПопытки;
				//- АДаниленко 51005
					Если НЕ ЗначениеЗаполнено(СНИЛС) Тогда
						Сообщить("У ЗЛ "+ТекЗЛ.уп_ФизЛицо.Наименование+", с кодом "+ТекЗЛ.Код+" отсутствует страховой номер.",СтатусСообщения.ОченьВажное);
						ЕстьОшибки = ИСТИНА;
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(ВтораяЧастьСтраховогоНомера) Тогда
						Сообщить("У ЗЛ "+ТекЗЛ.уп_ФизЛицо.Наименование+", с кодом "+ТекЗЛ.Код+" некорректный страховой номер.",СтатусСообщения.ОченьВажное);
						ЕстьОшибки = Истина;
					КонецЕсли;
					
					Попытка
						ФабрикаРеестр.ВзносыОПС = ОбработатьЧислоДляФайла(ВыборкаРешений.ВзносыОПС);
						ФабрикаРеестр.ИДпоОПС = ОбработатьЧислоДляФайла(ВыборкаРешений.ИДпоОПС);
						ФабрикаРеестр.КомпОПС = ОбработатьЧислоДляФайла(ВыборкаРешений.КомпОПС);
						ФабрикаРеестр.ГВоспОПС = ОбработатьЧислоДляФайла(ВыборкаРешений.ГВоспОПС);
						ФабрикаРеестр.ГВозмОПС = ОбработатьЧислоДляФайла(ВыборкаРешений.ГВозОПС);
						ФабрикаРеестр.СуммаОПС = ОбработатьЧислоДляФайла(ВыборкаРешений.СуммаОПС);
						ФабрикаРеестр.ВзносыДСВ = ОбработатьЧислоДляФайла(ВыборкаРешений.ВзносыДСВ);
						ФабрикаРеестр.ИДпоДСВ = ОбработатьЧислоДляФайла(ВыборкаРешений.ИДпоДСВ);
						ФабрикаРеестр.КомпДСВ = ОбработатьЧислоДляФайла(ВыборкаРешений.КомпДСВ);
						ФабрикаРеестр.ГВоспДСВ = ОбработатьЧислоДляФайла(ВыборкаРешений.ГВоспДСВ);
						ФабрикаРеестр.ГВозмДСВ = ОбработатьЧислоДляФайла(ВыборкаРешений.ГВозДСВ);
						ФабрикаРеестр.СуммаДСВ = ОбработатьЧислоДляФайла(ВыборкаРешений.СуммаДСВ);
						ФабрикаРеестр.ВзносыСОФН = ОбработатьЧислоДляФайла(ВыборкаРешений.ВзносыСОФН);
						ФабрикаРеестр.ИДпоСОФН = ОбработатьЧислоДляФайла(ВыборкаРешений.ИДпоСОФН);
						ФабрикаРеестр.КомпСОФН = ОбработатьЧислоДляФайла(ВыборкаРешений.КомпСОФН);
						ФабрикаРеестр.ГВоспСОФН = ОбработатьЧислоДляФайла(ВыборкаРешений.ГВоспСОФН);
						ФабрикаРеестр.ГВозмСОФН = ОбработатьЧислоДляФайла(ВыборкаРешений.ГВозСОФН);
						ФабрикаРеестр.СуммаСОФН = ОбработатьЧислоДляФайла(ВыборкаРешений.СуммаСОФН);
						ФабрикаРеестр.ВзносыМСК = ОбработатьЧислоДляФайла(ВыборкаРешений.ВзносыМСК);
						ФабрикаРеестр.ИДпоМСК = ОбработатьЧислоДляФайла(ВыборкаРешений.ИДпоМСК);
						ФабрикаРеестр.КомпМСК = ОбработатьЧислоДляФайла(ВыборкаРешений.КомпМСК);
						ФабрикаРеестр.ГВоспМСК = ОбработатьЧислоДляФайла(ВыборкаРешений.ГВоспМСК);
						ФабрикаРеестр.ГВозмМСК = ОбработатьЧислоДляФайла(ВыборкаРешений.ГВозМСК);
						ФабрикаРеестр.СуммаМСК = ОбработатьЧислоДляФайла(ВыборкаРешений.СуммаМСК);
						ФабрикаРеестр.ВсегоСПН = ОбработатьЧислоДляФайла(ВыборкаРешений.ВсегоСПН);
						
						ФабрикаРеестр.ДатаСмерти = Формат(ТекЗЛ.уп_ФизЛицо.уп_ДатаСмерти,"ДФ=dd.MM.yyyy");					
						ТипРешения = "ОВ";
						Источник = "РЕЗЕРВ";
						Если ТипЗнч(ВыборкаРешений.Решение) = Тип("ДокументСсылка.уп_РешениеОВыплатеСредствПенсионныхНакоплений") Тогда
							Источник = "СПН";
							Если ВыборкаРешений.Решение.ДополнительнаяВыплата  Тогда
								ТипРешения = "ДВ";
							КонецЕсли;	
						КонецЕсли;
						ФабрикаРеестр.ТипРешения = ТипРешения;
					Исключение
						Если НЕ ЕстьОшибкиXDTO Тогда
							ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
						КонецЕсли;	
						ЕстьОшибкиXDTO = Истина;
						ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
					КонецПопытки;
				//- АДаниленко 51005	
						
					СвойствоРеквизитыРешения = ФабрикаРеестр.Свойства().Получить("РеквизитыРешения");
					Если СвойствоРеквизитыРешения<>Неопределено Тогда
						ФабрикаРеквизитыРешения = ФабрикаXDTO.Создать(СвойствоРеквизитыРешения.Тип);
						Попытка
							#Удаление
							ФабрикаРеквизитыРешения.НомерРешения = ВыборкаРешений.Решение.Номер;
							#КонецУдаления
							#Вставка
							// +ХМНПФ 02.03.2018 КлименкоМИ // СформироватьСведения31XDTO() // №1414
							ФабрикаРеквизитыРешения.НомерРешения = СокрЛП(ВыборкаРешений.Решение.Номер);
							// -ХМНПФ 02.03.2018 КлименкоМИ // СформироватьСведения31XDTO() // №1414
							#КонецВставки
							ФабрикаРеквизитыРешения.ДатаРешения = Формат(ВыборкаРешений.Решение.Дата,"ДФ=dd.MM.yyyy");
							ФабрикаРеестр.РеквизитыРешения = ФабрикаРеквизитыРешения;
						Исключение
							Если НЕ ЕстьОшибкиXDTO Тогда
								ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
							КонецЕсли;	
							ЕстьОшибкиXDTO = Истина;
							ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
						КонецПопытки;
					КонецЕсли;
					ФабрикаРеестр.Источник = Источник;
					
					
					ВыборкаПП = ВыборкаРешений.Выбрать();
					Пока ВыборкаПП.Следующий() Цикл
						СвойствоПравопреемник = ФабрикаРеестр.Свойства().Получить("Правопреемник");
						Если СвойствоПравопреемник<>Неопределено Тогда
							ФабрикаПравопреемник = ФабрикаXDTO.Создать(СвойствоПравопреемник.Тип);
							
							СвойствоФИОПравопреемника = ФабрикаПравопреемник.Свойства().Получить("ФИОПравопреемника");
							Если СвойствоФИОПравопреемника<>Неопределено Тогда
								ФабрикаФИОПравопреемника = ФабрикаXDTO.Создать(СвойствоФИОПравопреемника.Тип);
							//+ АДаниленко 51005
								ФизЛицо = ВыборкаПП.Правопреемник.уп_ФизЛицо;
								Если ЗначениеЗаполнено(ФизЛицо.уп_ФамилияВРеестреПФР) 
								И ЗначениеЗаполнено(ФизЛицо.уп_ИмяВРеестреПФР) Тогда
									ФамПП 	   = ФизЛицо.уп_ФамилияВРеестреПФР;
									ИмяПП 	   = ФизЛицо.уп_ИмяВРеестреПФР;
									ОтчествоПП = ФизЛицо.уп_ОтчествоВРеестреПФР;						
								Иначе
									ФИОПП = ФизЛицо.Наименование;
									ФИОСтруктура = РазобратьФИО(СокрЛП(ФИОПП), ФизЛицо);
									ФамПП 	   = ФИОСтруктура.Фамилия;
									ИмяПП	   = ФИОСтруктура.Имя;
									ОтчествоПП = ФИОСтруктура.Отчество;
								КонецЕсли;
							
								Попытка	
									ФабрикаФИОПравопреемника.ФамилияПравопреемника = ВРЕГ(ФамПП);
								Исключение
									Если НЕ ЕстьОшибкиXDTO Тогда
										ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
									КонецЕсли;	
									ЕстьОшибкиXDTO = Истина;
									ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
								КонецПопытки;
								
								Попытка

									ФабрикаФИОПравопреемника.ИмяПравопреемника = ВРЕГ(ИмяПП);
								Исключение
									Если НЕ ЕстьОшибкиXDTO Тогда
										ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
									КонецЕсли;	
									ЕстьОшибкиXDTO = Истина;
									ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
								КонецПопытки;
								
								Попытка
									ФабрикаФИОПравопреемника.ОтчествоПравопреемника = ВРЕГ(ОтчествоПП);
								Исключение
									Если НЕ ЕстьОшибкиXDTO Тогда
										ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
									КонецЕсли;	
									ЕстьОшибкиXDTO = Истина;
									ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
								КонецПопытки;
							//- АДаниленко 51005
								ФабрикаПравопреемник.ФИОПравопреемника = ФабрикаФИОПравопреемника;
							КонецЕсли;
							СНИЛС_ПП = уп_ОПС.ПреобразоватьНомерПФРДляРеестра(ВыборкаПП.СНИЛС_ПП); 
							ПерваяЧастьСтраховогоНомера_ПП = Лев(СНИЛС,9);
						//+ АДаниленко 51005 - Добавлена попытка
							Попытка
								ФабрикаПравопреемник.СтраховойНомерПравопреемника = ПерваяЧастьСтраховогоНомера_ПП;
							Исключение
								Если НЕ ЕстьОшибкиXDTO Тогда
									ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
								КонецЕсли;	
								ЕстьОшибкиXDTO = Истина;
								ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
							КонецПопытки;
						//- АДаниленко 51005
							СвойствоРеквизитыПлП = ФабрикаПравопреемник.Свойства().Получить("ПлатежныйДокумент");
							Если СвойствоРеквизитыРешения<>Неопределено Тогда
								ФабрикаРеквизитыПлП = ФабрикаXDTO.Создать(СвойствоРеквизитыПлП.Тип);
								Если ТипЗНЧ(ВыборкаПП.ПлатежныйДокумент) = Тип("ДокументСсылка.ПлатежноеПоручение") 
									ИЛИ ТипЗНЧ(ВыборкаПП.ПлатежныйДокумент) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
									#Удаление
									НомерПл = ПолучитьНомерНаПечать(ВыборкаПП.ПлатежныйДокумент);
									#КонецУдаления
									#Вставка
									// +ХМНПФ 02.03.2018 КлименкоМИ // СформироватьСведения31XDTO() // №1414
									НомерПл = СокрЛП(ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаПП.НомерПл, Истина, Истина));
									// -ХМНПФ 02.03.2018 КлименкоМИ // СформироватьСведения31XDTO() // №1414
									#КонецВставки
									//+ АДаниленко 51005 - Добавлена попытка
									Попытка
										ФабрикаРеквизитыПлП.НомерПлатежногоДокумента = НомерПл;
									Исключение
										Если НЕ ЕстьОшибкиXDTO Тогда
											ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
										КонецЕсли;	
										ЕстьОшибкиXDTO = Истина;
										ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
									КонецПопытки;
								//- АДаниленко 51005
								Иначе
									//+ АДаниленко 51005 - Добавлена попытка	
									Попытка
										ФабрикаРеквизитыПлП.НомерПлатежногоДокумента = ВыборкаПП.НомерПл;
									Исключение
										Если НЕ ЕстьОшибкиXDTO Тогда
											ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
										КонецЕсли;	
										ЕстьОшибкиXDTO = Истина;
										ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
									КонецПопытки;
									//- АДаниленко 51005
								КонецЕсли;
								//+ АДаниленко 51005 - Добавлена попытка
								Попытка
									ФабрикаРеквизитыПлП.ДатаПлатежногоДокумента = Формат(ВыборкаПП.ДатаПл,"ДФ=dd.MM.yyyy");								
									ФабрикаПравопреемник.ПлатежныйДокумент = ФабрикаРеквизитыПлП;
								Исключение
									Если НЕ ЕстьОшибкиXDTO Тогда
										ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
									КонецЕсли;	
									ЕстьОшибкиXDTO = Истина;
									ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
								КонецПопытки;
								//- АДаниленко 51005	
							КонецЕсли;
							
							СвойствоЗаявлениеПП = ФабрикаПравопреемник.Свойства().Получить("ЗаявлениеПравопреемника");
							Если СвойствоЗаявлениеПП<>Неопределено Тогда
								ФабрикаЗаявлениеПП = ФабрикаXDTO.Создать(СвойствоЗаявлениеПП.Тип);
								Попытка
									#Удаление
									ФабрикаЗаявлениеПП.НомерЗаявленияПравопреемника = ВыборкаПП.ЗаявлениеНомер;
									#КонецУдаления
									#Вставка
									// +ХМНПФ 13.09.2018 ШадринАВ // СформироватьСведения31XDTO() // №1819
									ФабрикаЗаявлениеПП.НомерЗаявленияПравопреемника = ВРег(СокрЛП(ВыборкаПП.ЗаявлениеНомер));
									// +ХМНПФ 13.09.2018 ШадринАВ // СформироватьСведения31XDTO() // №1819
									#КонецВставки
									ФабрикаЗаявлениеПП.ДатаЗаявленияПравопреемника = Формат(ВыборкаПП.ЗаявлениеДата,"ДФ=dd.MM.yyyy");
								Исключение
									Если НЕ ЕстьОшибкиXDTO Тогда
										ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
									КонецЕсли;	
									ЕстьОшибкиXDTO = Истина;
									ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
								КонецПопытки;
								ФабрикаПравопреемник.ЗаявлениеПравопреемника = ФабрикаЗаявлениеПП;
							КонецЕсли;
							
							
							Если ВыборкаПП.СуммаППОПС+ВыборкаПП.СуммаППДСВ+ВыборкаПП.СуммаППСОФН+ВыборкаПП.СуммаППМСК <> 0 Тогда
								//этот документ уже с типами сумм, можно не распределять
								СуммаСВ_ПП = ВыборкаПП.СуммаППОПС;
								СуммаДСВ_ПП = ВыборкаПП.СуммаППДСВ;
								СуммаСФ_ПП = ВыборкаПП.СуммаППСОФН;
							Иначе
								Если ВыборкаПП.Сумма<>ОсталосьВсего И ОсталосьВсего<>0 Тогда
									//пропорционально распределеяем
									ОсталосьСписать = ВыборкаПП.Сумма-ВыборкаПП.СуммаМК;
									СуммаСВ_ПП = 0;
									СуммаДСВ_ПП = 0;
									СуммаСФ_ПП = 0;
									Если ОсталосьСВ<ОсталосьВсего Тогда
										//еще есть источники
										СуммаСВ_ПП = Окр(ВыборкаПП.Сумма*ОсталосьСВ/ОсталосьВсего,2);
									Иначе
										СуммаСВ_ПП = Мин(ОсталосьСписать,ОсталосьСВ);
									КонецЕсли;
									ОсталосьСписать = ОсталосьСписать-СуммаСВ_ПП;
									ОсталосьСВ = ОсталосьСВ-СуммаСВ_ПП;
									
									Если ОсталосьСписать<>0 Тогда
										Если ОсталосьСВ+ОсталосьДСВ<ОсталосьВсего Тогда
											//еще есть источники
											СуммаДСВ_ПП = Окр(ВыборкаПП.Сумма*ОсталосьДСВ/ОсталосьВсего,2);
										Иначе
											СуммаДСВ_ПП = Мин(ОсталосьСписать,ОсталосьДСВ);
										КонецЕсли;
										ОсталосьСписать = ОсталосьСписать-СуммаДСВ_ПП;
										ОсталосьДСВ = ОсталосьДСВ-СуммаДСВ_ПП;
									КонецЕсли;
									
									Если ОсталосьСписать<>0 Тогда
										СуммаСФ_ПП = Мин(ОсталосьСписать,ОсталосьСФ);
										ОсталосьСписать = ОсталосьСписать-СуммаСФ_ПП;
										ОсталосьСФ = ОсталосьСФ-СуммаСФ_ПП;
									КонецЕсли;
									
								Иначе
									СуммаСВ_ПП = ОсталосьСВ;
									СуммаДСВ_ПП = ОсталосьДСВ;
									СуммаСФ_ПП = ОсталосьСФ;
									ОсталосьСВ = 0;
									ОсталосьДСВ = 0;
									ОсталосьСФ = 0;
								КонецЕсли;
								ОсталосьВсего = ОсталосьСВ+ОсталосьДСВ+ОсталосьСФ;
							КонецЕсли;
						//+ АДаниленко 51005 - Добавлена попытка
							Попытка
								ФабрикаПравопреемник.СуммаОПС_Правопреемника = ОбработатьЧислоДляФайла(СуммаСВ_ПП);
								ФабрикаПравопреемник.СуммаДСВ_Правопреемника = ОбработатьЧислоДляФайла(СуммаДСВ_ПП);
								ФабрикаПравопреемник.СуммаСОФН_Правопреемника = ОбработатьЧислоДляФайла(СуммаСФ_ПП);
								ФабрикаПравопреемник.СуммаМСК_Правопреемника = ОбработатьЧислоДляФайла(ВыборкаПП.СуммаМК);
								ФабрикаПравопреемник.СуммаВсего_Правопреемника = ОбработатьЧислоДляФайла(ВыборкаПП.Сумма);
							Исключение
								Если НЕ ЕстьОшибкиXDTO Тогда
									ТекстовыйПротокол.ДобавитьСтроку("Произошли ошибки в пачке: " + СтрокаТЧ.ОбъектВладелец + Символы.ПС);
								КонецЕсли;	
								ЕстьОшибкиXDTO = Истина;
								ТекстовыйПротокол.ДобавитьСтроку("Строка № " + НомерПоПачке + ": " + ОписаниеОшибки());
							КонецПопытки;
						//- АДаниленко 51005
							//ФабрикаРеестр.Правопреемник = ФабрикаПравопреемник;
							ФабрикаРеестр.Правопреемник.Добавить(ФабрикаПравопреемник);
						КонецЕсли;
					//+ АДаниленко 51105 - Если несколько правоприемников то дублирует блок xml
						//ФабрикаПачкаВхДок[ТипДокумента()].Добавить(ФабрикаРеестр);
					//- АДаниленко 51105	
					КонецЦикла;
				//+ АДаниленко 51105
					ФабрикаПачкаВхДок[ТипДокумента()].Добавить(ФабрикаРеестр);
				//- АДаниленко 51105	
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		ФайлПФР.ПачкаВходящихДокументов = ФабрикаПачкаВхДок;
	КонецЕсли;	
//+ АДаниленко 51005
	Если ЕстьОшибкиXDTO Тогда
		МассивФайлы.Добавить(Новый Структура("Протокол, Текст", "Ошибки XDTO", ТекстовыйПротокол.ПолучитьТекст()));
		ЕстьОшибки = Истина;
	КонецЕсли;	
//- АДаниленко 51005	
	Запись.УстановитьСтроку("windows-1251");
	ФабрикаXDTO.ЗаписатьXML(Запись, ФайлПФР, "ФайлПФР");
	
	//записываем объявление
	ЗаголовокФайла = "<?xml version=""1.0"" encoding=""windows-1251"" standalone=""no""?>";	
	XMLВСтроку = Запись.Закрыть();
	//удаляем из первого тега лишнее
	XMLВСтрокуРедакция = СтрЗаменить(XMLВСтроку,
	" xmlns=""Сведения_31_Для_ПФР"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance""",
	"");
		
	МассивФайлы.Добавить(Новый Структура("Имя, Заголовок, Текст", ИмяФайла, ЗаголовокФайла, XMLВСтрокуРедакция));
	
	Если НЕ ЕстьОшибки Тогда
		// записываем ее в элемент справочника
		Если СохранятьФайлыВБД Тогда
			Если НЕ ЗначениеЗаполнено(Опись) Тогда
				ФайлЭДО = Справочники.уп_ЭДПрисоединенныеФайлы.СоздатьЭлемент();
			Иначе
				ФайлЭДО = Опись.ПолучитьОбъект();
			КонецЕсли;
			ФайлЭДО.ВладелецФайла = ЭтотОбъект.Ссылка;
			ФайлЭДО.ВерсияФормата = Перечисления.уп_ВерсииФорматаОбменаПФР.Формат_0700;
			ФайлЭДО.ВидЭД = ВидЭД;
			файлЭДО.ДатаСоздания = Дата;
			ФайлЭДО.ИмяФайла = ИмяФайла;
			ФайлЭДО.Наименование = ИмяФайла;
			ФайлЭДО.Организация = Организация;
			ФайлЭДО.Получатель = Получатель;
			Текст = ЗаголовокФайла+XMLВСтрокуРедакция;
			ТекстВХранилище = Новый ХранилищеЗначения(Текст);
			ФайлЭДО.ТекстХранилище = ТекстВХранилище;
			ФайлЭДО.Записать();
			
			//записываем элемент справочника в реквизит
			СтрокаТЧ.ЭлектронныйДокумент = ФайлЭДО.Ссылка;
		Иначе
			СтрокаТЧ.ИмяДокумента = ИмяФайла;
		КонецЕсли;
	Иначе
		//Сообщить("Файл "+ИмяФайла+" сформирован не корректно.",СтатусСообщения.ОченьВажное);
		МассивФайлы.Добавить(Новый Структура("ТекстОшибки", "Файл "+ИмяФайла+" сформирован не корректно."));
	КонецЕсли;
	
КонецПроцедуры

&ИзменениеИКонтроль("ФормированиеПачекДляРеестров")
Процедура РасшОбщ_ФормированиеПачекДляРеестров(ВидРеестра, ДатаНач, ДатаКон, Организация, Получатель) Экспорт
	Если ВидРеестра = Перечисления.уп_ВидыЭД.Реестр1 Тогда  //здесь предыдущий страховщик должен быть ПФР
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	уп_ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС,
		               |	уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка
		               |ПОМЕСТИТЬ ДокументыЗакрытия
		               |ИЗ
		               |	Документ.уп_ЗакрытиеДоговораОПС.ДоговорыОПС КАК уп_ЗакрытиеДоговораОПСДоговорыОПС
		               |ГДЕ
		               |	уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка.Проведен = ИСТИНА
		               |	И уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка.ПричинаЗакрытия = &ПричинаЗакрытияДокумента
		               |	И уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
				#Вставка
				// ХМНПФ 30.10.2017 ШадринАВ // ФормированиеПачекДляРеестров() // №1216
		               |	И НЕ уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка.РучнаяКорректировка
				// ХМНПФ 30.10.2017 ШадринАВ // ФормированиеПачекДляРеестров() // №1216
				#КонецВставки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ДокументыЗакрытия.Ссылка,
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия,
		               |	уп_ПредыдущиеСтраховщикиПоДоговорамОПССрезПоследних.ПредыдущийСтраховщик,
		               |	ДокументыЗакрытия.ДоговорОПС
		               |ПОМЕСТИТЬ ДокументыСПричиной
		               |ИЗ
		               |	ДокументыЗакрытия КАК ДокументыЗакрытия
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(&ДатаДок, ) КАК уп_ПричиныЗакрытияДоговоровОПССрезПоследних
		               |		ПО ДокументыЗакрытия.ДоговорОПС = уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ДоговорОПС
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПредыдущиеСтраховщикиПоДоговорамОПС.СрезПоследних(&ДатаДок, ) КАК уп_ПредыдущиеСтраховщикиПоДоговорамОПССрезПоследних
		               |		ПО ДокументыЗакрытия.ДоговорОПС = уп_ПредыдущиеСтраховщикиПоДоговорамОПССрезПоследних.ДоговорОПС
		               |ГДЕ
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия = &ПричинаЗакрытия
		               |	И уп_ПредыдущиеСтраховщикиПоДоговорамОПССрезПоследних.ПредыдущийСтраховщик = &ПФР
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия,
		               |	уп_ПредыдущиеСтраховщикиПоДоговорамОПССрезПоследних.ПредыдущийСтраховщик,
		               |	ДокументыЗакрытия.ДоговорОПС,
		               |	ДокументыЗакрытия.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаПриход, 0)) КАК СуммаОстаток,
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия КАК ПричинаЗакрытия,
		               |	уп_ПрочиеНачисленияОПСОбороты.Регистратор КАК Ссылка,
		               |	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС,
		               |	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаКомпенсацииПриход, 0)) КАК СуммаКомпенсации,
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаВосполненияПриход, 0)) КАК СуммаВосполнения,
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаВозмещенияПриход, 0)) КАК СуммаВозмещения
		               |ПОМЕСТИТЬ ПереведенныеСредства
		               |ИЗ
		               |	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
		               |			&ДатаНач,
		               |			&ДатаКон,
		               |			Регистратор,
		               |			Организация = &Организация
		               |				И ТипВыплаты = &ТипВыплаты
		               |				И Участник = &ПФР) КАК уп_ПрочиеНачисленияОПСОбороты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(&ДатаДок, ) КАК уп_ПричиныЗакрытияДоговоровОПССрезПоследних
		               |		ПО уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС = уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ДоговорОПС
		               |ГДЕ
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия = &ПричинаЗакрытия
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия,
		               |	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС,
		               |	уп_ПрочиеНачисленияОПСОбороты.Регистратор,
		               |	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(ПереведенныеСредства.ДоговорОПС, ДокументыСПричиной.ДоговорОПС) КАК ДоговорОПС,
		               |	ЕСТЬNULL(ПереведенныеСредства.ПричинаЗакрытия, ДокументыСПричиной.ПричинаЗакрытия) КАК ПричинаЗакрытия,
		               |	ЕСТЬNULL(ПереведенныеСредства.СуммаОстаток, 0) КАК СуммаОстаток,
		               |	ВЫБОР
		               |		КОГДА ПереведенныеСредства.ДоговорОПС ЕСТЬ NULL 
		               |			ТОГДА ДокументыСПричиной.ДоговорОПС.Участник.Наименование
		               |		ИНАЧЕ ПереведенныеСредства.ДоговорОПС.Участник.Наименование
		               |	КОНЕЦ КАК ФИО,
		               |	ЕСТЬNULL(ПереведенныеСредства.ТипСуммы, &ПустойТипСуммы) КАК ТипСуммы,
		               |	ЕСТЬNULL(ПереведенныеСредства.СуммаКомпенсации, 0) КАК СуммаКомпенсации,
		               |	ЕСТЬNULL(ПереведенныеСредства.СуммаВосполнения, 0) КАК СуммаВосполнения,
		               |	ЕСТЬNULL(ПереведенныеСредства.СуммаВозмещения, 0) КАК СуммаВозмещения
		               |ИЗ
		               |	ПереведенныеСредства КАК ПереведенныеСредства
		               |		ПОЛНОЕ СОЕДИНЕНИЕ ДокументыСПричиной КАК ДокументыСПричиной
		               |		ПО ПереведенныеСредства.ДоговорОПС = ДокументыСПричиной.ДоговорОПС
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ФИО
		               |ИТОГИ
		               |	СУММА(СуммаОстаток)
		               |ПО
		               |	ДоговорОПС";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ПФР", Получатель);
		Запрос.УстановитьПараметр("ДатаДок", КонецДня(ДатаКон));
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
		Запрос.УстановитьПараметр("ПустойТипСуммы", Справочники.уп_ТипыСуммОПС.ПустаяСсылка());
		
		Запрос.УстановитьПараметр("ТипВыплаты", Перечисления.уп_ТипыВыплат.ПереводВДругойПФ);
		Запрос.УстановитьПараметр("ПричинаЗакрытия", Перечисления.уп_ПричиныЗакрытияДоговораОПС.НеВступилВСилу); 
		Запрос.УстановитьПараметр("ПричинаЗакрытияДокумента", Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти); 
	ИначеЕсли ВидРеестра = Перечисления.уп_ВидыЭД.Реестр4 Тогда    //здесь предыдущий страховщик должен быть ПФР
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	уп_ПакетЭДДокументыКВыгрузке.ОбъектВладелец КАК Ссылка
		               |ПОМЕСТИТЬ ТабДокументовЗакрытия
		               |ИЗ
		               |	Документ.уп_ПакетЭД.ДокументыКВыгрузке КАК уп_ПакетЭДДокументыКВыгрузке
		               |ГДЕ
		               |	уп_ПакетЭДДокументыКВыгрузке.Ссылка = &Уведомление
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	уп_ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС,
		               |	уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка,
		               |	уп_ЗакрытиеДоговораОПСДоговорыОПС.НадлежащийСтраховщик,
		               |	уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка.ПричинаЗакрытия
		               |ПОМЕСТИТЬ ДокументыЗакрытия
		               |ИЗ
		               |	Документ.уп_ЗакрытиеДоговораОПС.ДоговорыОПС КАК уп_ЗакрытиеДоговораОПСДоговорыОПС
		               |ГДЕ
		               |	уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка.Проведен = ИСТИНА
		               |	И уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка.ПричинаЗакрытия = &ПричинаЗакрытияДокумента
		               |	И уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка В
		               |			(ВЫБРАТЬ
		               |				ТабДокументовЗакрытия.Ссылка
		               |			ИЗ
		               |				ТабДокументовЗакрытия)
		               |	И уп_ЗакрытиеДоговораОПСДоговорыОПС.НадлежащийСтраховщик = &ПФР
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ДокументыЗакрытия.ДоговорОПС
		               |ПОМЕСТИТЬ ДоговорыОПС
		               |ИЗ
		               |	ДокументыЗакрытия КАК ДокументыЗакрытия
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаПриход, 0)) КАК СуммаОстаток,
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия КАК ПричинаЗакрытия,
		               |	уп_ПрочиеНачисленияОПСОбороты.Регистратор КАК Ссылка,
		               |	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС,
		               |	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаКомпенсацииПриход, 0)) КАК СуммаКомпенсации,
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаВосполненияПриход, 0)) КАК СуммаВосполнения,
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаВозмещенияПриход, 0)) КАК СуммаВозмещения
		               |ПОМЕСТИТЬ ПереведенныеСредства
		               |ИЗ
		               |	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
		               |			&ДатаНач,
		               |			&ДатаКон,
		               |			Регистратор,
		               |			Организация = &Организация
		               |				И ТипВыплаты = &ТипВыплаты
		               |				И Участник = &ПФР
		               |				И ДоговорОПС В
		               |					(ВЫБРАТЬ
		               |						ДоговорыОПС.ДоговорОПС
		               |					ИЗ
		               |						ДоговорыОПС)) КАК уп_ПрочиеНачисленияОПСОбороты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(&ДатаДок, ) КАК уп_ПричиныЗакрытияДоговоровОПССрезПоследних
		               |		ПО уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС = уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ДоговорОПС
		               |ГДЕ
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия = &ПричинаЗакрытия
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия,
		               |	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС,
		               |	уп_ПрочиеНачисленияОПСОбороты.Регистратор,
		               |	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(ПереведенныеСредства.ДоговорОПС, ДокументыЗакрытия.ДоговорОПС) КАК ДоговорОПС,
		               |	ЕСТЬNULL(ПереведенныеСредства.ПричинаЗакрытия, ДокументыЗакрытия.ПричинаЗакрытия) КАК ПричинаЗакрытия,
		               |	ЕСТЬNULL(ПереведенныеСредства.СуммаОстаток, 0) КАК СуммаОстаток,
		               |	ВЫБОР
		               |		КОГДА ПереведенныеСредства.ДоговорОПС ЕСТЬ NULL 
		               |			ТОГДА ДокументыЗакрытия.ДоговорОПС.Участник.Наименование
		               |		ИНАЧЕ ПереведенныеСредства.ДоговорОПС.Участник.Наименование
		               |	КОНЕЦ КАК ФИО,
		               |	ЕСТЬNULL(ПереведенныеСредства.ТипСуммы, &ПустойТипСуммы) КАК ТипСуммы,
		               |	ЕСТЬNULL(ПереведенныеСредства.СуммаКомпенсации, 0) КАК СуммаКомпенсации,
		               |	ЕСТЬNULL(ПереведенныеСредства.СуммаВосполнения, 0) КАК СуммаВосполнения,
		               |	ЕСТЬNULL(ПереведенныеСредства.СуммаВозмещения, 0) КАК СуммаВозмещения
		               |ИЗ
		               |	ПереведенныеСредства КАК ПереведенныеСредства
		               |		ПОЛНОЕ СОЕДИНЕНИЕ ДокументыЗакрытия КАК ДокументыЗакрытия
		               |		ПО ПереведенныеСредства.ДоговорОПС = ДокументыЗакрытия.ДоговорОПС
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ФИО
		               |ИТОГИ
		               |	СУММА(СуммаОстаток)
		               |ПО
		               |	ДоговорОПС";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ПФР", Получатель);
		Запрос.УстановитьПараметр("ДатаДок", КонецДня(ДатаКон));
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
		Запрос.УстановитьПараметр("ПустойТипСуммы", Справочники.уп_ТипыСуммОПС.ПустаяСсылка());
		Запрос.УстановитьПараметр("Уведомление", Уведомление);
		
		Запрос.УстановитьПараметр("ТипВыплаты", Перечисления.уп_ТипыВыплат.ПереводВДругойПФ);
		Запрос.УстановитьПараметр("ПричинаЗакрытия", Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоРешениюСуда); 
		Запрос.УстановитьПараметр("ПричинаЗакрытияДокумента", Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоРешениюСуда); 
	ИначеЕсли ВидРеестра = Перечисления.уп_ВидыЭД.Реестр2 
		или ВидРеестра = Перечисления.уп_ВидыЭД.Реестр3 Тогда    //здесь следующий страховщик должен быть ПФР
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	уп_ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС,
		               |	уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка
		               |ПОМЕСТИТЬ ДокументыЗакрытия
		               |ИЗ
		               |	Документ.уп_ЗакрытиеДоговораОПС.ДоговорыОПС КАК уп_ЗакрытиеДоговораОПСДоговорыОПС
		               |ГДЕ
		               |	уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка.Проведен = ИСТИНА
		               |	И уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка.ПричинаЗакрытия В (&ПричинаЗакрытияДокумента)
		               |	И уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		               |	И уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка.ПенсионныйФонд = &ПФР
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ДокументыЗакрытия.Ссылка,
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия,
		               |	ДокументыЗакрытия.ДоговорОПС
		               |ПОМЕСТИТЬ ДокументыСПричиной
		               |ИЗ
		               |	ДокументыЗакрытия КАК ДокументыЗакрытия
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(&ДатаДок, ) КАК уп_ПричиныЗакрытияДоговоровОПССрезПоследних
		               |		ПО ДокументыЗакрытия.ДоговорОПС = уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ДоговорОПС
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДокументыЗакрытия.ДоговорОПС,
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия,
		               |	ДокументыЗакрытия.Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаПриход, 0)) КАК СуммаОстаток,
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия КАК ПричинаЗакрытия,
		               |	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС,
		               |	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаКомпенсацииПриход, 0)) КАК СуммаКомпенсации,
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаВосполненияПриход, 0)) КАК СуммаВосполнения,
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаВозмещенияПриход, 0)) КАК СуммаВозмещения
		               |ПОМЕСТИТЬ ПереведенныеСредства
		               |ИЗ
		               |	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
		               |			&ДатаНач,
		               |			&ДатаКон,
		               |			Регистратор,
		               |			Организация = &Организация
		               |				И ТипВыплаты = &ТипВыплаты
		               |				И Участник = &ПФР) КАК уп_ПрочиеНачисленияОПСОбороты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(&ДатаДок, ) КАК уп_ПричиныЗакрытияДоговоровОПССрезПоследних
		               |		ПО уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС = уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ДоговорОПС
		               |ГДЕ
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия В (&ПричинаЗакрытия)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия,
		               |	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС,
		               |	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЕСТЬNULL(ПереведенныеСредства.ПричинаЗакрытия, ДокументыСПричиной.ПричинаЗакрытия) КАК ПричинаЗакрытия,
		               |	ЕСТЬNULL(ПереведенныеСредства.СуммаОстаток, 0) КАК СуммаОстаток,
		               |	ЕСТЬNULL(ПереведенныеСредства.ДоговорОПС, ДокументыСПричиной.ДоговорОПС) КАК ДоговорОПС,
		               |	ВЫБОР
		               |		КОГДА ПереведенныеСредства.ДоговорОПС ЕСТЬ NULL 
		               |			ТОГДА ДокументыСПричиной.ДоговорОПС.Участник.Наименование
		               |		ИНАЧЕ ПереведенныеСредства.ДоговорОПС.Участник.Наименование
		               |	КОНЕЦ КАК ФИО,
		               |	ЕСТЬNULL(ПереведенныеСредства.ТипСуммы, &ПустойТипСуммы) КАК ТипСуммы,
		               |	ЕСТЬNULL(ПереведенныеСредства.СуммаКомпенсации, 0) КАК СуммаКомпенсации,
		               |	ЕСТЬNULL(ПереведенныеСредства.СуммаВосполнения, 0) КАК СуммаВосполнения,
		               |	ЕСТЬNULL(ПереведенныеСредства.СуммаВозмещения, 0) КАК СуммаВозмещения
		               |ИЗ
		               |	ПереведенныеСредства КАК ПереведенныеСредства
		               |		ПОЛНОЕ СОЕДИНЕНИЕ ДокументыСПричиной КАК ДокументыСПричиной
		               |		ПО ПереведенныеСредства.ДоговорОПС = ДокументыСПричиной.ДоговорОПС
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ФИО
		               |ИТОГИ
		               |	СУММА(СуммаОстаток)
		               |ПО
		               |	ДоговорОПС";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ПФР", Получатель);
		Запрос.УстановитьПараметр("ДатаДок", КонецДня(ДатаКон));
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
		Запрос.УстановитьПараметр("ПустойТипСуммы", Справочники.уп_ТипыСуммОПС.ПустаяСсылка());
		
		СписокПричинЗакрытия = Новый СписокЗначений;
		Если ВидЭД = Перечисления.уп_ВидыЭД.Реестр2 Тогда   //здесь могут быть нули
			Запрос.УстановитьПараметр("ТипВыплаты", Перечисления.уп_ТипыВыплат.ПереводВДругойПФ);
			СписокПричинЗакрытия.Добавить(Перечисления.уп_ПричиныЗакрытияДоговораОПС.Досрочное);
			СписокПричинЗакрытия.Добавить(Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПереходДосрочный);
			Запрос.УстановитьПараметр("ПричинаЗакрытия", СписокПричинЗакрытия);
			Запрос.УстановитьПараметр("ПричинаЗакрытияДокумента", СписокПричинЗакрытия); 
		ИначеЕсли ВидЭД = Перечисления.уп_ВидыЭД.Реестр3 Тогда   //здесь могут быть нули
			Запрос.УстановитьПараметр("ТипВыплаты", Перечисления.уп_ТипыВыплат.ПереводВДругойПФ);
			СписокПричинЗакрытия.Добавить(Перечисления.уп_ПричиныЗакрытияДоговораОПС.АннулированиеЛицензии);
			Запрос.УстановитьПараметр("ПричинаЗакрытия", СписокПричинЗакрытия);
			Запрос.УстановитьПараметр("ПричинаЗакрытияДокумента", СписокПричинЗакрытия); 
		КонецЕсли;
	ИначеЕсли ВидРеестра = Перечисления.уп_ВидыЭД.Реестр5 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаПриход, 0)) КАК СуммаОстаток,
		               |	уп_СостоянияДоговораОПССрезПоследних.Состояние,
		               |	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС КАК ДоговорОПС,
		               |	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
		               |	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС.Участник.Наименование КАК ФИО,
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаКомпенсацииПриход, 0)) КАК СуммаКомпенсации,
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаВосполненияПриход, 0)) КАК СуммаВосполнения,
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаВозмещенияПриход, 0)) КАК СуммаВозмещения
		               |ИЗ
		               |	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
		               |			&ДатаНач,
		               |			&ДатаКон,
		               |			Регистратор,
		               |			Организация = &Организация
		               |				И ТипВыплаты = &ТипВыплаты
		               |				И Участник = &ПФР) КАК уп_ПрочиеНачисленияОПСОбороты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(&ДатаДок, ) КАК уп_СостоянияДоговораОПССрезПоследних
		               |		ПО уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС = уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС
		               |ГДЕ
		               |	уп_СостоянияДоговораОПССрезПоследних.Состояние В(&СписокДействующих)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	уп_СостоянияДоговораОПССрезПоследних.Состояние,
		               |	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС,
		               |	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
		               |	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС.Участник.Наименование
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ФИО
		               |ИТОГИ
		               |	СУММА(СуммаОстаток)
		               |ПО
		               |	ДоговорОПС";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ПФР", Получатель);
		Запрос.УстановитьПараметр("ДатаДок", КонецДня(ДатаКон));
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
		СписокДействующих = Новый СписокЗначений;
		СписокДействующих.Добавить(Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод);
		Запрос.УстановитьПараметр("ТипВыплаты", Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапитала);
		Запрос.УстановитьПараметр("СписокДействующих", СписокДействующих);
		
	ИначеЕсли ВидРеестра = Перечисления.уп_ВидыЭД.Реестр6 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаПриход, 0)) КАК СуммаОстаток,
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия КАК ПричинаЗакрытия,
		               |	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС КАК ДоговорОПС,
		               |	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
		               |	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС.Участник.Наименование КАК ФИО,
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаКомпенсацииПриход, 0)) КАК СуммаКомпенсации,
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаВосполненияПриход, 0)) КАК СуммаВосполнения,
		               |	СУММА(ЕСТЬNULL(уп_ПрочиеНачисленияОПСОбороты.СуммаВозмещенияПриход, 0)) КАК СуммаВозмещения
		               |ИЗ
		               |	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
		               |			&ДатаНач,
		               |			&ДатаКон,
		               |			Регистратор,
		               |			Организация = &Организация
		               |				И ТипВыплаты = &ТипВыплаты
		               |				И Участник = &ПФР) КАК уп_ПрочиеНачисленияОПСОбороты
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(&ДатаДок, ) КАК уп_ПричиныЗакрытияДоговоровОПССрезПоследних
		               |		ПО уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС = уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ДоговорОПС
		               |ГДЕ
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия = &ПричинаЗакрытия
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС,
		               |	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия,
		               |	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
		               |	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС.Участник.Наименование
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ФИО
		               |ИТОГИ
		               |	СУММА(СуммаОстаток)
		               |ПО
		               |	ДоговорОПС";
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ПФР", Получатель);
		Запрос.УстановитьПараметр("ДатаДок", КонецДня(ДатаКон));
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
		
		Запрос.УстановитьПараметр("ТипВыплаты", Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапитала);
		Запрос.УстановитьПараметр("ПричинаЗакрытия", Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти);
		Запрос.УстановитьПараметр("ПричинаЗакрытияДокумента", Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти); 
		
	КонецЕсли;	
		
	Результат = Запрос.Выполнить();
	ВыборкаДоговоров = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаДоговоров.Количество()>0 Тогда
		НомПП = 0;
		НовДок = "";
		
		Пока ВыборкаДоговоров.Следующий() Цикл
			Если НомПП = 0 или НомПП = 10000 Тогда
				Если НомПП<>0 Тогда
					//записываем предыдущий документ
					НовДок.Записать();
					НовСтр = ДокументыКВыгрузке.Добавить();
					НовСтр.ОбъектВладелец = НовДок.Ссылка;
					НовСтр.Сумма = НовДок.РасшифровкаСуммы.Итог("Сумма");
				КонецЕсли;
				//создаем новый документ
				НовДок = Документы.уп_ПачкаЗЛДляЭДОПФР.СоздатьДокумент();
				НовДок.ВидЭД = ВидЭД;
				НовДок.Организация = Организация;
				НовДок.Дата = Дата;
				НовДок.ПенсионныйФонд = Получатель;
				НомПП = 0;
			КонецЕсли;
			НомПП = НомПП+1;
			НовСтрПачки = НовДок.ДоговорыОПС.Добавить();
			НовСтрПачки.ДоговорОПС = ВыборкаДоговоров.ДоговорОПС;
			НовСтрПачки.ЗастрахованноеЛицо = ВыборкаДоговоров.ДоговорОПС.Участник;
			НовСтрПачки.Сумма = ВыборкаДоговоров.СуммаОстаток;
			
			Выборка = ВыборкаДоговоров.Выбрать();
			Пока Выборка.Следующий() Цикл
				НовСтрРасшифровки = НовДок.РасшифровкаСуммы.Добавить();
				НовСтрРасшифровки.ДоговорОПС = ВыборкаДоговоров.ДоговорОПС;
				НовСтрРасшифровки.ТипСуммы = Выборка.ТипСуммы;
				НовСтрРасшифровки.Сумма = Выборка.СуммаОстаток;
				НовСтрРасшифровки.СуммаВозмещения = Выборка.СуммаВозмещения;
				НовСтрРасшифровки.СуммаВосполнения = Выборка.СуммаВосполнения;
				НовСтрРасшифровки.СуммаКомпенсации = Выборка.СуммаКомпенсации;
			КонецЦикла;	
		КонецЦикла;	
		НовДок.Записать();
		НовСтр = ДокументыКВыгрузке.Добавить();
		НовСтр.ОбъектВладелец = НовДок.Ссылка;
		НовСтр.Сумма = НовДок.РасшифровкаСуммы.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ФормированиеПачекЗаявленийВыплат")
Процедура РасшОбщ_ФормированиеПачекЗаявленийВыплат(ВидРеестра, ДатаНач, ДатаКон, Организация, Получатель) Экспорт
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	уп_РешениеОНазначенииНЧТП.Ссылка КАК Решение,
	//|	уп_ПачкаДокументовДляЭДОПФРСоставПачки.Ссылка КАК Пачка,
	//|	уп_РешениеОНазначенииНЧТП.РазмерВыплаты КАК РазмерВыплаты,
	//|	уп_РешениеОНазначенииНЧТП.ДокументОснование.Ссылка КАК Заявление,
	//|	уп_РешениеОНазначенииНЧТП.ДокументОснование.Дата КАК ДатаЗаявления
	//|ПОМЕСТИТЬ Заявления_Пачки
	//|ИЗ
	//|	Документ.уп_РешениеОНазначенииНЧТП КАК уп_РешениеОНазначенииНЧТП
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ПачкаДокументовДляЭДОПФР.СоставПачки КАК уп_ПачкаДокументовДляЭДОПФРСоставПачки
	//|		ПО уп_РешениеОНазначенииНЧТП.Ссылка = уп_ПачкаДокументовДляЭДОПФРСоставПачки.ДокументПачки
	//|ГДЕ
	//|	уп_РешениеОНазначенииНЧТП.Организация = &Организация
	//|	И уп_РешениеОНазначенииНЧТП.Дата МЕЖДУ &ДатаНач И &ДатаКон
	//|	И уп_РешениеОНазначенииНЧТП.Проведен = ИСТИНА
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	уп_РешениеОНазначенииСрочнойВыплаты.Ссылка,
	//|	уп_ПачкаДокументовДляЭДОПФРСоставПачки.Ссылка,
	//|	уп_РешениеОНазначенииСрочнойВыплаты.РазмерСрочнойВыплаты,
	//|	уп_РешениеОНазначенииСрочнойВыплаты.ДокументОснование.Ссылка,
	//|	уп_РешениеОНазначенииСрочнойВыплаты.ДокументОснование.Дата
	//|ИЗ
	//|	Документ.уп_РешениеОНазначенииСрочнойВыплаты КАК уп_РешениеОНазначенииСрочнойВыплаты
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ПачкаДокументовДляЭДОПФР.СоставПачки КАК уп_ПачкаДокументовДляЭДОПФРСоставПачки
	//|		ПО уп_РешениеОНазначенииСрочнойВыплаты.Ссылка = уп_ПачкаДокументовДляЭДОПФРСоставПачки.ДокументПачки
	//|ГДЕ
	//|	уп_РешениеОНазначенииСрочнойВыплаты.Организация = &Организация
	//|	И уп_РешениеОНазначенииСрочнойВыплаты.Дата МЕЖДУ &ДатаНач И &ДатаКон
	//|	И уп_РешениеОНазначенииСрочнойВыплаты.Проведен = ИСТИНА
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	уп_РешениеОЕдиновременнойВыплате.Ссылка,
	//|	уп_ПачкаДокументовДляЭДОПФРСоставПачки.Ссылка,
	//|	уп_РешениеОЕдиновременнойВыплате.СуммаНаСчете,
	//|	уп_РешениеОЕдиновременнойВыплате.ДокументОснование.Ссылка,
	//|	уп_РешениеОЕдиновременнойВыплате.ДокументОснование.Дата
	//|ИЗ
	//|	Документ.уп_РешениеОЕдиновременнойВыплате КАК уп_РешениеОЕдиновременнойВыплате
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ПачкаДокументовДляЭДОПФР.СоставПачки КАК уп_ПачкаДокументовДляЭДОПФРСоставПачки
	//|		ПО уп_РешениеОЕдиновременнойВыплате.Ссылка = уп_ПачкаДокументовДляЭДОПФРСоставПачки.ДокументПачки
	//|ГДЕ
	//|	уп_РешениеОЕдиновременнойВыплате.Организация = &Организация
	//|	И уп_РешениеОЕдиновременнойВыплате.Дата МЕЖДУ &ДатаНач И &ДатаКон
	//|	И уп_РешениеОЕдиновременнойВыплате.Проведен = ИСТИНА
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Заявления_Пачки.Решение КАК ПринятоеРешение,
	//|	Заявления_Пачки.РазмерВыплаты,
	//|	Заявления_Пачки.Заявление,
	//|	НАЧАЛОПЕРИОДА(Заявления_Пачки.ДатаЗаявления, ДЕНЬ) КАК ДатаДень,
	//|	НАЧАЛОПЕРИОДА(Заявления_Пачки.Решение.Дата, ДЕНЬ) КАК ДатаРешения,
	//|	Заявления_Пачки.Решение.ДоговорОПС.Участник.Наименование КАК ФИО,
	//|	Заявления_Пачки.Решение.ДоговорОПС КАК ДоговорОПС
	//|ИЗ
	//|	Заявления_Пачки КАК Заявления_Пачки
	//|ГДЕ
	//|	Заявления_Пачки.Пачка ЕСТЬ NULL 
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ДатаРешения,
	//|	ФИО,
	//|	ДоговорОПС";
	//
	//Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	//Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
	//Запрос.УстановитьПараметр("Организация", Организация);
	ФормироватьПоДатеРегистрации = РегистрыСведений.уп_НастройкиЭДОПФР.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация)).Формировать8ПоДатеРегистрации;
	
	Если ФормироватьПоДатеРегистрации Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Ссылка КАК ДокументПачки,
		|	уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ДоговорОПС,
		|	ВЫБОР
		|		КОГДА уп_ЗаявлениеЗЛОЕдиновременнойВыплате.НеУчитыватьДопВзносы
		|			ТОГДА уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ОстатокНаСчете - уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ОстатокДопФинансирование
		|		ИНАЧЕ уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ОстатокНаСчете
		|	КОНЕЦ КАК СуммаВыплаты
		|ПОМЕСТИТЬ ЕВ
		|ИЗ
		|	Документ.уп_ЗаявлениеЗЛОЕдиновременнойВыплате КАК уп_ЗаявлениеЗЛОЕдиновременнойВыплате
		|ГДЕ
		|	уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Проведен = ИСТИНА
		|	И уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Организация = &Организация
	//+ АДаниленко 04.04.2017 Исключенные заявления, это заявления, которым был установлен статус "Исключить" в протоколе ошибок.	
		|	И уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ДатаРегистрации МЕЖДУ &Дата1 И &Дата2
		|	И НЕ уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Ссылка В
		|				(ВЫБРАТЬ
		|					уп_ИсключенныеОшибкиЭД.Документ КАК Ссылка
		|				ИЗ
		|					РегистрСведений.уп_ИсключенныеОшибкиЭД.СрезПоследних() КАК уп_ИсключенныеОшибкиЭД
		|				ГДЕ
		|					НЕ уп_ИсключенныеОшибкиЭД.Обработано)
	//- АДаниленко 04.04.2017
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ЗаявлениеЗЛОНазначенииНЧТП.Ссылка КАК ДокументПачки,
		|	уп_ЗаявлениеЗЛОНазначенииНЧТП.ДоговорОПС,
		|	ВЫБОР
		|		КОГДА уп_ЗаявлениеЗЛОНазначенииНЧТП.УчитыватьДопВзносы
		|			ТОГДА уп_ЗаявлениеЗЛОНазначенииНЧТП.ОстатокНаСчете
		|		ИНАЧЕ уп_ЗаявлениеЗЛОНазначенииНЧТП.ОстатокНаСчете - уп_ЗаявлениеЗЛОНазначенииНЧТП.ОстатокДопФинансирование
		|	КОНЕЦ КАК СуммаВыплаты
		|ПОМЕСТИТЬ НП
		|ИЗ
		|	Документ.уп_ЗаявлениеЗЛОНазначенииНЧТП КАК уп_ЗаявлениеЗЛОНазначенииНЧТП
		|ГДЕ
		|	уп_ЗаявлениеЗЛОНазначенииНЧТП.Проведен = ИСТИНА
		|	И уп_ЗаявлениеЗЛОНазначенииНЧТП.Организация = &Организация
	//+ АДаниленко 04.04.2017 Исключенные заявления, это заявления, которым был установлен статус "Исключить" в протоколе ошибок.	
		|	И уп_ЗаявлениеЗЛОНазначенииНЧТП.ДатаРегистрации МЕЖДУ &Дата1 И &Дата2
		|	И НЕ уп_ЗаявлениеЗЛОНазначенииНЧТП.Ссылка В
		|				(ВЫБРАТЬ
		|					уп_ИсключенныеОшибкиЭД.Документ КАК Ссылка
		|				ИЗ
		|					РегистрСведений.уп_ИсключенныеОшибкиЭД.СрезПоследних() КАК уп_ИсключенныеОшибкиЭД
		|				ГДЕ
		|					НЕ уп_ИсключенныеОшибкиЭД.Обработано)
	//- АДаниленко 04.04.2017	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.Ссылка КАК ДокументПачки,
		|	уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.ДоговорОПС,
		|	уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.ОстатокДопФинансирование КАК СуммаВыплаты
		|ПОМЕСТИТЬ СВ
		|ИЗ
		|	Документ.уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты КАК уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты
		|ГДЕ
		|	уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.Проведен = ИСТИНА
		|	И уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.Организация = &Организация
	//+ АДаниленко 04.04.2017 Исключенные заявления, это заявления, которым был установлен статус "Исключить" в протоколе ошибок.	
		|	И уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.ДатаРегистрации МЕЖДУ &Дата1 И &Дата2
		|	И НЕ уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.Ссылка В
		|				(ВЫБРАТЬ
		|					уп_ИсключенныеОшибкиЭД.Документ КАК Ссылка
		|				ИЗ
		|					РегистрСведений.уп_ИсключенныеОшибкиЭД.СрезПоследних() КАК уп_ИсключенныеОшибкиЭД
		|				ГДЕ
		|					НЕ уп_ИсключенныеОшибкиЭД.Обработано)
	//- АДаниленко 04.04.2017
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ЗаявлениеПравопреемникаОВыплатеОПС.Ссылка,
		|	уп_ЗаявлениеПравопреемникаОВыплатеОПС.ДоговорОПС,
		|	уп_ЗаявлениеПравопреемникаОВыплатеОПС.Правопреемник
		|ПОМЕСТИТЬ ПП
		|ИЗ
		|	Документ.уп_ЗаявлениеПравопреемникаОВыплатеОПС КАК уп_ЗаявлениеПравопреемникаОВыплатеОПС
		|ГДЕ
		|	уп_ЗаявлениеПравопреемникаОВыплатеОПС.Проведен = ИСТИНА
		#Вставка
		// +ХМНПФ 23.01.2019 ШадринАВ // ФормированиеПачекЗаявленийВыплат() // №2006
		|	И Ложь
		// -ХМНПФ 23.01.2019 ШадринАВ // ФормированиеПачекЗаявленийВыплат() // №2006
		#КонецВставки
		|	И уп_ЗаявлениеПравопреемникаОВыплатеОПС.Организация = &Организация
	//+ АДаниленко 04.04.2017 2Исключенные заявления, это заявления, которым был установлен статус "Исключить" в протоколе ошибок. 	
		|	И уп_ЗаявлениеПравопреемникаОВыплатеОПС.ДатаРегистрации МЕЖДУ &Дата1 И &Дата2
		|	И НЕ уп_ЗаявлениеПравопреемникаОВыплатеОПС.Ссылка В
		|				(ВЫБРАТЬ
		|					уп_ИсключенныеОшибкиЭД.Документ КАК Ссылка
		|				ИЗ
		|					РегистрСведений.уп_ИсключенныеОшибкиЭД.СрезПоследних() КАК уп_ИсключенныеОшибкиЭД
		|				ГДЕ
		|					НЕ уп_ИсключенныеОшибкиЭД.Обработано)
	//- АДаниленко 04.04.2017	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС,
		|	уп_ПрочиеНачисленияОПСОбороты.Участник,
		|	уп_ПрочиеНачисленияОПСОбороты.СуммаРасход
		|ПОМЕСТИТЬ ВыплатыПП
		|ИЗ
		|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Период,
		|			ДоговорОПС В
		|					(ВЫБРАТЬ
		|						ПП.ДоговорОПС
		|					ИЗ
		|						ПП)
		|				И ТипВыплаты = &ВыплатаПП
		|				И Участник В
		|					(ВЫБРАТЬ
		|						ПП.Правопреемник
		|					ИЗ
		|						ПП)) КАК уп_ПрочиеНачисленияОПСОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПП.Ссылка КАК ДокументПачки,
		|	ПП.ДоговорОПС,
		|	ЕСТЬNULL(ВыплатыПП.СуммаРасход, 0) КАК СуммаВыплаты
		|ПОМЕСТИТЬ ППсВыплатой
		|ИЗ
		|	ПП КАК ПП
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВыплатыПП КАК ВыплатыПП
		|		ПО ПП.ДоговорОПС = ВыплатыПП.ДоговорОПС
		|			И ПП.Правопреемник = ВыплатыПП.Участник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕВ.ДокументПачки,
		|	ЕВ.ДоговорОПС,
		|	ЕСТЬNULL(ЕВ.СуммаВыплаты, 0) КАК Сумма
		|ПОМЕСТИТЬ ДанныеЗаПериод
		|ИЗ
		|	ЕВ КАК ЕВ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НП.ДокументПачки,
		|	НП.ДоговорОПС,
		|	ЕСТЬNULL(НП.СуммаВыплаты, 0)
		|ИЗ
		|	НП КАК НП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СВ.ДокументПачки,
		|	СВ.ДоговорОПС,
		|	ЕСТЬNULL(СВ.СуммаВыплаты, 0)
		|ИЗ
		|	СВ КАК СВ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ППсВыплатой.ДокументПачки,
		|	ППсВыплатой.ДоговорОПС,
		|	ЕСТЬNULL(ППсВыплатой.СуммаВыплаты, 0)
		|ИЗ
		|	ППсВыплатой КАК ППсВыплатой
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_УведомленияПФРСрезПоследних.Заявление
		|ПОМЕСТИТЬ ПереданныеЗаявления
		|ИЗ
		|	РегистрСведений.уп_УведомленияПФР.СрезПоследних(
		|			&Дата,
		|			Заявление В
		|				(ВЫБРАТЬ
		|					ДанныеЗаПериод.ДокументПачки
		|				ИЗ
		|					ДанныеЗаПериод)) КАК уп_УведомленияПФРСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеЗаПериод.ДокументПачки,
		|	ДанныеЗаПериод.ДоговорОПС,
		|	ДанныеЗаПериод.Сумма,
		|	ВЫБОР
		|		КОГДА ПереданныеЗаявления.Заявление ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ЗаявлениеПередано
		|ПОМЕСТИТЬ Заявления
		|ИЗ
		|	ДанныеЗаПериод КАК ДанныеЗаПериод
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереданныеЗаявления КАК ПереданныеЗаявления
		|		ПО ДанныеЗаПериод.ДокументПачки = ПереданныеЗаявления.Заявление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заявления.ДокументПачки,
		|	Заявления.ДоговорОПС,
		|	Заявления.Сумма
		|ИЗ
		|	Заявления КАК Заявления "+?(ИсключитьПереданные,"
		|ГДЕ
		|	Заявления.ЗаявлениеПередано = 0","")+"
		|";
	Иначе
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Ссылка КАК ДокументПачки,
		|	уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ДоговорОПС,
		|	ВЫБОР
		|		КОГДА уп_ЗаявлениеЗЛОЕдиновременнойВыплате.НеУчитыватьДопВзносы
		|			ТОГДА уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ОстатокНаСчете - уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ОстатокДопФинансирование
		|		ИНАЧЕ уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ОстатокНаСчете
		|	КОНЕЦ КАК СуммаВыплаты
		|ПОМЕСТИТЬ ЕВ
		|ИЗ
		|	Документ.уп_ЗаявлениеЗЛОЕдиновременнойВыплате КАК уп_ЗаявлениеЗЛОЕдиновременнойВыплате
		|ГДЕ
		|	уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Проведен = ИСТИНА
		|	И уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Организация = &Организация
	//+ АДаниленко 04.04.2017 Исключенные заявления, это заявления, которым был установлен статус "Исключить" в протоколе ошибок.	
		|	И уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Дата МЕЖДУ &Дата1 И &Дата2
		|	И НЕ уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Ссылка В
		|				(ВЫБРАТЬ
		|					уп_ИсключенныеОшибкиЭД.Документ КАК Ссылка
		|				ИЗ
		|					РегистрСведений.уп_ИсключенныеОшибкиЭД.СрезПоследних() КАК уп_ИсключенныеОшибкиЭД
		|				ГДЕ
		|					НЕ уп_ИсключенныеОшибкиЭД.Обработано)
	//- АДаниленко 04.04.2017
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ЗаявлениеЗЛОНазначенииНЧТП.Ссылка КАК ДокументПачки,
		|	уп_ЗаявлениеЗЛОНазначенииНЧТП.ДоговорОПС,
		|	ВЫБОР
		|		КОГДА уп_ЗаявлениеЗЛОНазначенииНЧТП.УчитыватьДопВзносы
		|			ТОГДА уп_ЗаявлениеЗЛОНазначенииНЧТП.ОстатокНаСчете
		|		ИНАЧЕ уп_ЗаявлениеЗЛОНазначенииНЧТП.ОстатокНаСчете - уп_ЗаявлениеЗЛОНазначенииНЧТП.ОстатокДопФинансирование
		|	КОНЕЦ КАК СуммаВыплаты
		|ПОМЕСТИТЬ НП
		|ИЗ
		|	Документ.уп_ЗаявлениеЗЛОНазначенииНЧТП КАК уп_ЗаявлениеЗЛОНазначенииНЧТП
		|ГДЕ
		|	уп_ЗаявлениеЗЛОНазначенииНЧТП.Проведен = ИСТИНА
		|	И уп_ЗаявлениеЗЛОНазначенииНЧТП.Организация = &Организация
	//+ АДаниленко 04.04.2017 Исключенные заявления, это заявления, которым был установлен статус "Исключить" в протоколе ошибок.	
		|	И уп_ЗаявлениеЗЛОНазначенииНЧТП.Дата МЕЖДУ &Дата1 И &Дата2
		|	И НЕ уп_ЗаявлениеЗЛОНазначенииНЧТП.Ссылка В
		|				(ВЫБРАТЬ
		|					уп_ИсключенныеОшибкиЭД.Документ КАК Ссылка
		|				ИЗ
		|					РегистрСведений.уп_ИсключенныеОшибкиЭД.СрезПоследних() КАК уп_ИсключенныеОшибкиЭД
		|				ГДЕ
		|					НЕ уп_ИсключенныеОшибкиЭД.Обработано)
	//- АДаниленко 04.04.2017	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.Ссылка КАК ДокументПачки,
		|	уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.ДоговорОПС,
		|	уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.ОстатокДопФинансирование КАК СуммаВыплаты
		|ПОМЕСТИТЬ СВ
		|ИЗ
		|	Документ.уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты КАК уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты
		|ГДЕ
		|	уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.Проведен = ИСТИНА
		|	И уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.Организация = &Организация
	//+ АДаниленко 04.04.2017 Исключенные заявления, это заявления, которым был установлен статус "Исключить" в протоколе ошибок.	
		|	И уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.Дата МЕЖДУ &Дата1 И &Дата2
		|	И НЕ уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.Ссылка В
		|				(ВЫБРАТЬ
		|					уп_ИсключенныеОшибкиЭД.Документ КАК Ссылка
		|				ИЗ
		|					РегистрСведений.уп_ИсключенныеОшибкиЭД.СрезПоследних() КАК уп_ИсключенныеОшибкиЭД
		|				ГДЕ
		|					НЕ уп_ИсключенныеОшибкиЭД.Обработано)
	//- АДаниленко 04.04.2017
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ЗаявлениеПравопреемникаОВыплатеОПС.Ссылка,
		|	уп_ЗаявлениеПравопреемникаОВыплатеОПС.ДоговорОПС,
		|	уп_ЗаявлениеПравопреемникаОВыплатеОПС.Правопреемник
		|ПОМЕСТИТЬ ПП
		|ИЗ
		|	Документ.уп_ЗаявлениеПравопреемникаОВыплатеОПС КАК уп_ЗаявлениеПравопреемникаОВыплатеОПС
		|ГДЕ
		|	уп_ЗаявлениеПравопреемникаОВыплатеОПС.Проведен = ИСТИНА
		#Вставка
		// +ХМНПФ 23.01.2019 ШадринАВ // ФормированиеПачекЗаявленийВыплат() // №2006
		|	И Ложь
		// -ХМНПФ 23.01.2019 ШадринАВ // ФормированиеПачекЗаявленийВыплат() // №2006
		#КонецВставки
		|	И уп_ЗаявлениеПравопреемникаОВыплатеОПС.Организация = &Организация
	//+ АДаниленко 04.04.2017 Исключенные заявления, это заявления, которым был установлен статус "Исключить" в протоколе ошибок. 	
		|	И уп_ЗаявлениеПравопреемникаОВыплатеОПС.Дата МЕЖДУ &Дата1 И &Дата2
		|	И НЕ уп_ЗаявлениеПравопреемникаОВыплатеОПС.Ссылка В
		|				(ВЫБРАТЬ
		|					уп_ИсключенныеОшибкиЭД.Документ КАК Ссылка
		|				ИЗ
		|					РегистрСведений.уп_ИсключенныеОшибкиЭД.СрезПоследних() КАК уп_ИсключенныеОшибкиЭД
		|				ГДЕ
		|					НЕ уп_ИсключенныеОшибкиЭД.Обработано)
	//- АДаниленко 04.04.2017	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ПрочиеНачисленияОПСОбороты.ДоговорОПС,
		|	уп_ПрочиеНачисленияОПСОбороты.Участник,
		|	уп_ПрочиеНачисленияОПСОбороты.СуммаРасход
		|ПОМЕСТИТЬ ВыплатыПП
		|ИЗ
		|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
		|			&Дата1,
		|			&Дата2,
		|			Период,
		|			(ДоговорОПС, Участник) В
		|					(ВЫБРАТЬ
		|						ПП.ДоговорОПС,
		|						ПП.Правопреемник КАК Участник
		|					ИЗ
		|						ПП)
		|				И ТипВыплаты = &ВыплатаПП) КАК уп_ПрочиеНачисленияОПСОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПП.Ссылка КАК ДокументПачки,
		|	ПП.ДоговорОПС,
		|	ЕСТЬNULL(ВыплатыПП.СуммаРасход, 0) КАК СуммаВыплаты
		|ПОМЕСТИТЬ ППсВыплатой
		|ИЗ
		|	ПП КАК ПП
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВыплатыПП КАК ВыплатыПП
		|		ПО ПП.ДоговорОПС = ВыплатыПП.ДоговорОПС
		|			И ПП.Правопреемник = ВыплатыПП.Участник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕВ.ДокументПачки,
		|	ЕВ.ДоговорОПС,
		|	ЕСТЬNULL(ЕВ.СуммаВыплаты, 0) КАК Сумма
		|ПОМЕСТИТЬ ДанныеЗаПериод
		|ИЗ
		|	ЕВ КАК ЕВ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НП.ДокументПачки,
		|	НП.ДоговорОПС,
		|	ЕСТЬNULL(НП.СуммаВыплаты, 0)
		|ИЗ
		|	НП КАК НП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СВ.ДокументПачки,
		|	СВ.ДоговорОПС,
		|	ЕСТЬNULL(СВ.СуммаВыплаты, 0)
		|ИЗ
		|	СВ КАК СВ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ППсВыплатой.ДокументПачки,
		|	ППсВыплатой.ДоговорОПС,
		|	ЕСТЬNULL(ППсВыплатой.СуммаВыплаты, 0)
		|ИЗ
		|	ППсВыплатой КАК ППсВыплатой
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_УведомленияПФРСрезПоследних.Заявление
		|ПОМЕСТИТЬ ПереданныеЗаявления
		|ИЗ
		|	РегистрСведений.уп_УведомленияПФР.СрезПоследних(
		|			&Дата,
		|			Заявление В
		|				(ВЫБРАТЬ
		|					ДанныеЗаПериод.ДокументПачки
		|				ИЗ
		|					ДанныеЗаПериод)) КАК уп_УведомленияПФРСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеЗаПериод.ДокументПачки,
		|	ДанныеЗаПериод.ДоговорОПС,
		|	ДанныеЗаПериод.Сумма,
		|	ВЫБОР
		|		КОГДА ПереданныеЗаявления.Заявление ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ЗаявлениеПередано
		|ПОМЕСТИТЬ Заявления
		|ИЗ
		|	ДанныеЗаПериод КАК ДанныеЗаПериод
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПереданныеЗаявления КАК ПереданныеЗаявления
		|		ПО ДанныеЗаПериод.ДокументПачки = ПереданныеЗаявления.Заявление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заявления.ДокументПачки,
		|	Заявления.ДоговорОПС,
		|	Заявления.Сумма
		|ИЗ
		|	Заявления КАК Заявления "+?(ИсключитьПереданные,"
		|ГДЕ
		|	Заявления.ЗаявлениеПередано = 0","")+"
		|";
	КонецЕсли;	
	Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВыплатаПП", Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	КолЗ = 0;
	НомерЗаписи = 0;
	Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
		НовПачка = Документы.уп_ПачкаДокументовДляЭДОПФР.СоздатьДокумент();
		НовПачка.Организация = Организация;
		НовПачка.Ответственный = Ответственный;
		НовПачка.Дата = Дата;
		СуммаПоПачке = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если КолЗ = 10000 Тогда
				НовПачка.Записать();
				НовСтрДокКВыгрузке = ДокументыКВыгрузке.Добавить();
				НовСтрДокКВыгрузке.ОбъектВладелец = НовПачка.Ссылка;
				НовСтрДокКВыгрузке.Сумма = СуммаПоПачке;
				
				КолЗ = 0;
				Если НомерЗаписи<ВыборкаДетальныеЗаписи.Количество() Тогда
					НовПачка = Документы.уп_ПачкаДокументовДляЭДОПФР.СоздатьДокумент();
					НовПачка.Организация = Организация;
					НовПачка.Ответственный = Ответственный;
					НовПачка.Дата = Дата;
					СуммаПоПачке = 0;
				КонецЕсли;	
			КонецЕсли;
			КолЗ = КолЗ+1;
			НомерЗаписи = НомерЗаписи+1;
			НовСтр = НовПачка.СоставПачки.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,ВыборкаДетальныеЗаписи);
			СуммаПоПачке = СуммаПоПачке+ВыборкаДетальныеЗаписи.Сумма;
		КонецЦикла;
		НовПачка.Записать();
		НовСтрДокКВыгрузке = ДокументыКВыгрузке.Добавить();
		НовСтрДокКВыгрузке.ОбъектВладелец = НовПачка.Ссылка;
		НовСтрДокКВыгрузке.Сумма = СуммаПоПачке;
	КонецЕсли;
	
КонецПроцедуры	

// ХМНПФ 02.08.2016 ШадринАВ // Новая ХМ_ВывестиПодписьОтвественногоИИсполнителя() // №461
Процедура ХМ_ВывестиПодписьОтвественногоИИсполнителя(Лист,НомСт)
	ХМ_Исполнитель = ПараметрыСеанса.ТекущийПользователь.Наименование;
	ХМ_ТелефонИсполнителя = ХМ_ФункцииОтчетов.ПолучитьТелефонПользователя();
	ХМ_ДолжФИО = ХМ_ФункцииОтчетов.ДолжностьИФИОРуководителя(Дата,Организация);
	// должность
	ХМ_Ранж = Лист.Range("B"+Строка(17+НомСт+2)+":C"+Строка(17+НомСт+2));
	ХМ_Ранж.MergeCells = Истина;
	ХМ_Ранж.Borders(9).LineStyle = 1;
	ХМ_Ранж.Value = ХМ_ДолжФИО.Должность;
	ХМ_Ранж.HorizontalAlignment = -4108;
	ХМ_Ранж.Font.Name = "Times New Roman";
	ХМ_Ранж.Font.Size = 10;
	ХМ_Ранж = Лист.Range("b"+Строка(17+НомСт+3)+":c"+Строка(17+НомСт+3));
	ХМ_Ранж.MergeCells = Истина;
	ХМ_Ранж.Value = "(наименование должности ответственного)";
	ХМ_Ранж.HorizontalAlignment = -4108;
	ХМ_Ранж.Font.Name = "Times New Roman";
	ХМ_Ранж.Font.Size = 7;
	// подпись
	ХМ_Ранж = Лист.Range("E"+Строка(17+НомСт+2));
	ХМ_Ранж.Borders(9).LineStyle = 1;
	ХМ_Ранж = Лист.Range("E"+Строка(17+НомСт+3));
	ХМ_Ранж.Value = "(подпись)";
	ХМ_Ранж.HorizontalAlignment = -4108;
	ХМ_Ранж.Font.Name = "Times New Roman";
	ХМ_Ранж.Font.Size = 7;
	// ФИО
	ХМ_Ранж = Лист.Range("G"+Строка(17+НомСт+2)+":J"+Строка(17+НомСт+2));
	ХМ_Ранж.MergeCells = Истина;
	ХМ_Ранж.Borders(9).LineStyle = 1;
	ХМ_Ранж.Value = ХМ_ДолжФИО.ФИО;
	ХМ_Ранж.HorizontalAlignment = -4108;
	ХМ_Ранж.Font.Name = "Times New Roman";
	ХМ_Ранж.Font.Size = 10;
	ХМ_Ранж = Лист.Range("G"+Строка(17+НомСт+3)+":J"+Строка(17+НомСт+3));
	ХМ_Ранж.MergeCells = Истина;
	ХМ_Ранж.Value = "(фамилия, имя, отчество)";
	ХМ_Ранж.HorizontalAlignment = -4108;
	ХМ_Ранж.Font.Name = "Times New Roman";
	ХМ_Ранж.Font.Size = 7;
	// исполнитель
	ХМ_Ранж = Лист.Range("A"+Строка(17+НомСт+7));
	ХМ_Ранж.Value = "Исполнитель: "+ХМ_Исполнитель;
	ХМ_Ранж.Font.Name = "Times New Roman";
	ХМ_Ранж.Font.Size = 8;
	ХМ_Ранж = Лист.Range("A"+Строка(17+НомСт+8));
	ХМ_Ранж.Value = "Контактный телефон: "+ХМ_ТелефонИсполнителя.Представление;
	ХМ_Ранж.Font.Name = "Times New Roman";
	ХМ_Ранж.Font.Size = 8;
КонецПроцедуры // ХМ_ВывестиПодписьОтвественногоИИсполнителя()

// +ХМНПФ Копытко А.А. 23.09.2025 кандидат на удаление (скорее всего упразднили эту функцию)
Функция ПолучитьЗаявления()
//+ АДаниленко 51012
	ТЗЗаявлений = Новый ТаблицаЗначений;
	ТЗЗаявлений.Колонки.Добавить("ЗаявлениеЕВ",   Новый ОписаниеТипов("ДокументСсылка.уп_ЗаявлениеЗЛОЕдиновременнойВыплате"));
	ТЗЗаявлений.Колонки.Добавить("ЗаявлениеНЧТП", Новый ОписаниеТипов("ДокументСсылка.уп_ЗаявлениеЗЛОНазначенииНЧТП"));
	ТЗЗаявлений.Колонки.Добавить("ЗаявлениеСВ",   Новый ОписаниеТипов("ДокументСсылка.уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты"));
	ТЗЗаявлений.Колонки.Добавить("ЗаявлениеОПС",  Новый ОписаниеТипов("ДокументСсылка.уп_ЗаявлениеПравопреемникаОВыплатеОПС"));
	Для Каждого ДокументКВыгрузке Из ЭтотОбъект.ДокументыКВыгрузке Цикл
		Для Каждого СоставПачки Из ДокументКВыгрузке.ОбъектВладелец.СоставПачки Цикл
			Если ТипЗнч(СоставПачки.ДокументПачки) = Тип("ДокументСсылка.уп_ЗаявлениеЗЛОЕдиновременнойВыплате") Тогда
				НоваяСтрока = ТЗЗаявлений.Добавить();				
				НоваяСтрока.ЗаявлениеЕВ = СоставПачки.ДокументПачки;				
			ИначеЕсли ТипЗнч(СоставПачки.ДокументПачки) = Тип("ДокументСсылка.уп_ЗаявлениеЗЛОНазначенииНЧТП") Тогда
				НоваяСтрока = ТЗЗаявлений.Добавить();
				НоваяСтрока.ЗаявлениеНЧТП = СоставПачки.ДокументПачки;				
			ИначеЕсли ТипЗнч(СоставПачки.ДокументПачки) = Тип("ДокументСсылка.уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты") Тогда
				НоваяСтрока = ТЗЗаявлений.Добавить();
				НоваяСтрока.ЗаявлениеСВ = СоставПачки.ДокументПачки;
			ИначеЕсли ТипЗнч(СоставПачки.ДокументПачки) = Тип("ДокументСсылка.уп_ЗаявлениеПравопреемникаОВыплатеОПС") Тогда
				НоваяСтрока = ТЗЗаявлений.Добавить();
				НоваяСтрока.ЗаявлениеОПС = СоставПачки.ДокументПачки;
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;	
	//ЭтотОбъект.ДокументыКВыгрузке[0].ОбъектВладелец.СоставПачки[0].ДокументПачки
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗЗаявления",     ТЗЗаявлений);
	Запрос.УстановитьПараметр("ПометкаУдаления", ЭтотОбъект.ПометкаУдаления);
	Запрос.Текст = "ВЫБРАТЬ
		|	ТЗЗаявления.ЗаявлениеЕВ   КАК ЗаявлениеЕВ,
		|	ТЗЗаявления.ЗаявлениеНЧТП КАК ЗаявлениеНЧТП,
		|	ТЗЗаявления.ЗаявлениеСВ   КАК ЗаявлениеСВ,
		|	ТЗЗаявления.ЗаявлениеОПС  КАК ЗаявлениеОПС
		|ПОМЕСТИТЬ ВТ_ЗаявленияТЗ
		|ИЗ
		|  	&ТЗЗаявления КАК ТЗЗаявления
		|;
		|///////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаявленияТЗ.ЗаявлениеЕВ КАК Заявление
		|ПОМЕСТИТЬ ВТ_Заявления
		|ИЗ
		|  	ВТ_ЗаявленияТЗ КАК ВТ_ЗаявленияТЗ
		|ГДЕ 
		|	НЕ ВТ_ЗаявленияТЗ.ЗаявлениеЕВ = ЗНАЧЕНИЕ(Документ.уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗаявленияТЗ.ЗаявлениеНЧТП
		|ИЗ
		|  	ВТ_ЗаявленияТЗ КАК ВТ_ЗаявленияТЗ
		|
		|ГДЕ 
		|	НЕ ВТ_ЗаявленияТЗ.ЗаявлениеНЧТП = ЗНАЧЕНИЕ(Документ.уп_ЗаявлениеЗЛОНазначенииНЧТП.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗаявленияТЗ.ЗаявлениеСВ
		|ИЗ
		|  	ВТ_ЗаявленияТЗ КАК ВТ_ЗаявленияТЗ
		|
		|ГДЕ 
		|	НЕ ВТ_ЗаявленияТЗ.ЗаявлениеСВ = ЗНАЧЕНИЕ(Документ.уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ЗаявленияТЗ.ЗаявлениеОПС
		|ИЗ
		|  	ВТ_ЗаявленияТЗ КАК ВТ_ЗаявленияТЗ
		|
		|ГДЕ 
		|	НЕ ВТ_ЗаявленияТЗ.ЗаявлениеОПС = ЗНАЧЕНИЕ(Документ.уп_ЗаявлениеПравопреемникаОВыплатеОПС.ПустаяСсылка)
		|;
		|/////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заявления.Заявление,
		|	СостояниеЗаявлений.Регистратор
		|ИЗ
		|  	ВТ_Заявления КАК ВТ_Заявления
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостояниеЗаявлений.СрезПоследних() КАК СостояниеЗаявлений
		|		ПО ВТ_Заявления.Заявление = СостояниеЗаявлений.Заявление
		|ГДЕ
		|	ВЫБОР КОГДА &ПометкаУдаления 
		|		ТОГДА СостояниеЗаявлений.Обработано
		|   	ИНАЧЕ НЕ СостояниеЗаявлений.Обработано
		|	КОНЕЦ
		|ИТОГИ ПО
		|	СостояниеЗаявлений.Регистратор ИЕРАРХИЯ
		|";
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//- АДаниленко 51012
КонецФункции	

