
// ХМНПФ+ 26.02.2024 ЛыткинАМ // НПО Доработка возвратов // №3797
// абонд, поиск документа "Возврат пенсий"
Функция НайтиДокументВозвратПенсий(ДокументСсылка, ДокументОснование, НаименованиеДокумента = "") Экспорт
	
	Запрос = Новый Запрос;
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДокПП.Ссылка
	|ИЗ
	|	Документ.уп_ВозвратПенсий КАК ДокПП
	|ГДЕ
	|	ДокПП.хм_ВозвратСПлатежногоПоручения = &ДокументСсылка";
	
	ВыборкаИзЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаИзЗапроса.Следующий() Тогда
		НайденныйДокумент = ВыборкаИзЗапроса.Ссылка;
	Иначе
		НайденныйДокумент = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденныйДокумент) Тогда
		ПараметрыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НайденныйДокумент, "Номер, Дата, Проведен");
		СтрокаДокумент = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ПараметрыДокумента.Номер);
		НаименованиеДокумента = "Возврат пенсий  № "+ СтрокаДокумент + " от " + Формат(ПараметрыДокумента.Дата, "ДФ=dd.MM.yyyy") + " г.";
	Иначе
		НаименованиеДокумента = "Ввести возврат пенсий";
	КонецЕсли;
	
	Возврат НайденныйДокумент;
	
КонецФункции

///ПлыгунЮВ 20.03.2024
Функция НайтиДокументРегистрацияИзлишнихВыплат(ДокументСсылка, ДокументОснование, НаименованиеДокумента = "") Экспорт
	
	Запрос = Новый Запрос;
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДокПП.Ссылка
	|ИЗ
	|	Документ.хм_РегистрацияОплатыИзлишнеВыплаченныхСуммНПО КАК ДокПП
	|ГДЕ
	|	ДокПП.ПоступлениеВозврата = &ДокументСсылка";
	
	ВыборкаИзЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаИзЗапроса.Следующий() Тогда
		НайденныйДокумент = ВыборкаИзЗапроса.Ссылка;
	Иначе
		НайденныйДокумент = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НайденныйДокумент) Тогда
		ПараметрыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НайденныйДокумент, "Номер, Дата, Проведен");
		СтрокаДокумент = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ПараметрыДокумента.Номер);
		НаименованиеДокумента = "Регистрация оплаты излишне выплаченных сумм  № "+ СтрокаДокумент + " от " + Формат(ПараметрыДокумента.Дата, "ДФ=dd.MM.yyyy") + " г.";
	Иначе
		НаименованиеДокумента = "Ввести Регистрация оплаты излишне выплаченных сумм";
	КонецЕсли;
	
	Возврат НайденныйДокумент;
	
КонецФункции