
#Область ХМНПФ

// ХМНПФ 23.03.2016 ШадринАВ // Новая ХМ_ДоговорыОПСДоговорОПСОбработкаВыбора() // №292
&НаКлиенте
Процедура ХМ_ДоговорыОПСДоговорОПСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ДоговорОПС <> ВыбранноеЗначение Тогда
		СписокКУдалению = Новый СписокЗначений;
		Для Каждого Строка Из Объект.РасшифровкаСуммы Цикл
			Если Строка.ДоговорОПС = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ДоговорОПС И Строка.ДатаПериода = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ДатаПериода Тогда
				СписокКУдалению.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;
		Для а = 0 по СписокКУдалению.Количество()-1 Цикл
			СтрокаКУдалению = СписокКУдалению.Получить(а).Значение;
			Объект.РасшифровкаСуммы.Удалить(СтрокаКУдалению);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


Процедура ХМ_НеТиповыеИзменения()

	// ХМНПФ 20.02.2016 ШадринАВ // Новое поле на форме ХМ_ВозвратСПлатежногоПоручения // №279
	// ХМНПФ 23.02.2016 ШадринАВ // Новая ХМ_ДоговорыОПСДоговорОПСОбработкаВыбора() // №292
	// ХМНПФ 23.03.2016 ШадринАВ // Новая ХМ_ОпределитьДокументВыплаты() // №279
	// ХМНПФ+ 25.04.2016 ШадринАВ // на форму добавлен флаг "Возврат в резерв" // №326

КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// +ХМНПФ 18.12.2018 ГригорьевМА  // Модуль // №1963
	ХМ_РаботаСФормами.уп_ВозвратПенсийОПСПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка); 	
	// -ХМНПФ 18.12.2018 ГригорьевМА  // Модуль // №1963
КонецПроцедуры

#КонецОбласти
