#Если Клиент Тогда
&ИзменениеИКонтроль("Печать")
Процедура ХМ2_Печать(ИмяМакета, КоличествоЭкземпляров, НаПринтер)

	// Получить экземпляр документа на печать
	Если ИмяМакета = "Извещение" Тогда
		//Отчет = Отчеты.уп_СостояниеСчета.Создать();
		//Отчет.Организация = Ссылка.Владелец.Организация;
		//Отчет.НомерСчета = Ссылка;
		//Отчет.ОтборАгент = Ложь;
		//Отчет.ОтборМестоРаботы = Ложь;
		//Отчет.ОтборРегион = Ложь;
		//Отчет.ПоСпискуДоговоров = Ложь;
		//Отчет.ПоСпискуСчетов = Ложь;
		//Отчет.ФормироватьФайлыДляПечати = Ложь;
		//Отчет.ПолучитьФорму().Открыть();
		//Форма = Отчет.ПолучитьФорму();
		//Форма.Открыть();
		ПараметрыОткрытия = Новый Структура();
		ПараметрыОткрытия.Вставить("Организация", Ссылка.Владелец.Организация);
		ПараметрыОткрытия.Вставить("НомерСчета", Ссылка);
		ПараметрыОткрытия.Вставить("ОтборАгент", Ложь);
		ПараметрыОткрытия.Вставить("ОтборМестоРаботы", Ложь);
		ПараметрыОткрытия.Вставить("ОтборРегион", Ложь);
		ПараметрыОткрытия.Вставить("ПоСпискуДоговоров", Ложь);
		ПараметрыОткрытия.Вставить("ПоСпискуСчетов", Ложь);
		ПараметрыОткрытия.Вставить("ФормироватьФайлыДляПечати", Ложь);
		#Удаление 
		ОткрытьФорму("Отчет.уп_СостояниеСчета.Форма.ФормаОтчета",ПараметрыОткрытия);
 		#КонецУдаления
		#Вставка 
		//+ХМНПФ 20.04.2018 ХлопцевБА //1409
		ОткрытьФорму("Отчет.хм_уп_СостояниеСчета.Форма.ФормаОтчета",ПараметрыОткрытия);
		//+ХМНПФ 20.04.2018 ХлопцевБА //1409	
		#КонецВставки
		
	ИначеЕсли ИмяМакета = "Карточка" Тогда

		//ТабДокумент = ПечатьДокумента();
		//УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер);
		ПараметрыОткрытия = Новый Структура();
		ПараметрыОткрытия.Вставить("Организация", Ссылка.Владелец.Организация);
		ПараметрыОткрытия.Вставить("НомерСчета", Ссылка);
		ПараметрыОткрытия.Вставить("ПенсионныйДоговор", Ссылка.Владелец);
		ОткрытьФорму("Отчет.уп_УчетнаяКарточкаУчастника.Форма.ФормаОтчета",ПараметрыОткрытия);
	КонецЕсли;



КонецПроцедуры
#КонецЕсли