
Процедура ХМ_НеТиповыеИзменения()
	// +ХМНПФ 28.0217 Кучеров// Новая Функция ХМ_ПечатьWeb()
	//-ХМНПФ 28.0217 Кучеров//убрал директиву на клиенте
КонецПроцедуры

// +ХМНПФ 28.0217 Кучеров// Новая Функция ХМ_ПечатьWeb()
// для получения печатных форм со стороны Web сервисов
// аналог процедуры печать типового варианта пользовательского интерфейса
Функция ХМ_ПечатьWeb(ИмяМакета) Экспорт
	ТабДокумент = Новый ТабличныйДокумент; // заглушка на случай если не сформируется ни чего 
	Если      ИмяМакета = "Заявление" Тогда
		Если Дата < Дата("20150101") Тогда
			ТабДокумент = ПечатьДокументаСервер(ТабДокумент, "Заявление");
		Иначе
			ТабДокумент = ПечатьДокументаСервер(ТабДокумент, "Заявление2015");
		КонецЕсли;
	КонецЕсли;
	Возврат ТабДокумент;
КонецФункции 

// +ХМНПФ Копытка А.А. 23.09.2025 функции нет в типовой конфигурации кандидат на удаление (Возможно ее заменили на ПечатьДокументаСервер)
Функция ПечатьДокумента(ИмяМакета)
	  
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет(ИмяМакета);
  	ОбластьМакета = Макет.ПолучитьОбласть("Титул");
	ОбластьМакета.Параметры.НаименованиеНПФ = Организация.НаименованиеПолное;
	ОбластьМакета.Параметры.ДатаЗаявления = Дата;
	ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ДоговорОПС.Участник.уп_ФизЛицо));
	Фамилия = ФИОФизЛица.Фамилия;
	Имя = ФИОФизЛица.Имя;                
	Отчество = ФИОФизЛица.Отчество;
	ОбластьМакета.Параметры.ФИОЗастрахованного = Фамилия+" "+Имя+" "+Отчество;
	Если НЕ ЗначениеЗаполнено(ДоговорОПС) Тогда
		ОбластьМакета.Параметры.НомерСчета = "";
	Иначе
		ОбластьМакета.Параметры.НомерСчета = СокрЛП(ДоговорОПС.Код)+"/"+уп_ОПС.ПреобразоватьНомерПФР(ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
	КонецЕсли;
	//-
	//Если Основание = 1 Тогда
	//	ОбластьМакета.Параметры.Основание = "по договору (заявлению)";
	//ИначеЕсли Основание = 2 Тогда
	//	ОбластьМакета.Параметры.Основание = "по закону";
	//Иначе
	//	ОбластьМакета.Параметры.Основание = "";
	//КонецЕсли;
	Если Основание = 1 Тогда
		ОбластьМакета.Параметры.Картинка7 = "V";
	ИначеЕсли Основание = 2 Тогда
		Если СтепеньРодства = 1 или СтепеньРодства = 2 или СтепеньРодства = 3 Тогда
			ОбластьМакета.Параметры.Картинка8 = "V";
		ИначеЕсли СтепеньРодства = 4 или СтепеньРодства = 5 или СтепеньРодства = 6 Тогда
			ОбластьМакета.Параметры.Картинка9 = "V";
		КонецЕсли;	
	КонецЕсли;
	Если Правопреемник31 Тогда
		ОбластьМакета.Параметры.Картинка10 = "V";
	КонецЕсли;	
	//-
	Если СтепеньРодства = 1 Тогда
		ОбластьМакета.Параметры.Картинка1 = "V";
	ИначеЕсли СтепеньРодства = 2 Тогда
		ОбластьМакета.Параметры.Картинка2 = "V";
	ИначеЕсли СтепеньРодства = 3 Тогда
		ОбластьМакета.Параметры.Картинка3 = "V";
	ИначеЕсли СтепеньРодства = 4 Тогда
		ОбластьМакета.Параметры.Картинка4 = "V";
	ИначеЕсли СтепеньРодства = 5 Тогда
		ОбластьМакета.Параметры.Картинка5 = "V";
	ИначеЕсли СтепеньРодства = 6 Тогда
		ОбластьМакета.Параметры.Картинка6 = "V";
	Иначе
		ОбластьМакета.Параметры.Картинка1 = "";
		ОбластьМакета.Параметры.Картинка2 = "";
		ОбластьМакета.Параметры.Картинка3 = "";
		ОбластьМакета.Параметры.Картинка4 = "";
		ОбластьМакета.Параметры.Картинка5 = "";
		ОбластьМакета.Параметры.Картинка6 = "";
	КонецЕсли;
	
    ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
  	ОбластьМакета = Макет.ПолучитьОбласть("Документы");
	ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", Правопреемник.уп_ФизЛицо));                       
	ФамилияП = ФИОФизЛица.Фамилия;
	ИмяП = ФИОФизЛица.Имя;                
	ОтчествоП = ФИОФизЛица.Отчество;
	ОбластьМакета.Параметры.Фамилия = ФамилияП;          
	ОбластьМакета.Параметры.Имя = ИмяП;
	ОбластьМакета.Параметры.Отчество = ОтчествоП;
	Если НЕ ЗначениеЗаполнено(Правопреемник) Тогда
		ОбластьМакета.Параметры.ДатаМестоРождения = "";
	Иначе
		ОбластьМакета.Параметры.ДатаМестоРождения = Формат(Правопреемник.уп_ФизЛицо.ДатаРождения, "ДЛФ=DD")+" "+ПерсонифицированныйУчетКлиентСервер.ПредставлениеМестаРождения(Правопреемник.уп_ФизЛицо.МестоРождения);
	КонецЕсли;
	// создаем запрос для поиска в регистре сведений контактная информация
    // с параметрами юридический адрес контрагента, самого контрагента и отображаем в поле макета
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	ФизическиеЛицаКонтактнаяИнформация.Вид КАК Вид,
                   |	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Представление,
                   |	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка
                   |ИЗ
                   |	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
                   |ГДЕ
                   |	ФизическиеЛицаКонтактнаяИнформация.Вид.Ссылка В(&ВидАдреса)
                   |	И ФизическиеЛицаКонтактнаяИнформация.Ссылка = &ФИОЗастрахованногоЛица";
    			   
    Запрос.УстановитьПараметр("ФИОЗастрахованногоЛица", Правопреемник.уп_ФизЛицо);
	ВидАдреса = Новый СписокЗначений;
	ВидАдреса.Добавить(Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизическиеЛица);
	ВидАдреса.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица);
    Запрос.УстановитьПараметр("ВидАдреса",ВидАдреса);
    Результат = Запрос.Выполнить();
    ВыборкаАдресЮрЗастрахованногоЛица = Результат.Выбрать();
	Адрес = 0;
	Пока ВыборкаАдресЮрЗастрахованногоЛица.Следующий() Цикл
		Если ВыборкаАдресЮрЗастрахованногоЛица.Вид = Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизическиеЛица Тогда
    		ОбластьМакета.Параметры.Адрес = ВыборкаАдресЮрЗастрахованногоЛица.Представление;
			Адрес = 1;
		Иначе
    		ОбластьМакета.Параметры.Телефон = ВыборкаАдресЮрЗастрахованногоЛица.Представление;
		КонецЕсли;	
	КонецЦикла;
	
	Если Адрес = 0 Тогда
		//#Удаление
		////Адр = РегистрыСведений.КонтактнаяИнформация.Получить(Новый Структура("Объект, Тип, Вид", Правопреемник.уп_ФизЛицо, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.УдалитьВидыКонтактнойИнформации.ФактАдресФизЛица));
		//#КонецУдаления
		//#Вставка
		//Адр = РегистрыСведений.УдалитьКонтактнаяИнформация.Получить(Новый Структура("Объект, Тип, Вид", Правопреемник.уп_ФизЛицо, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.УдалитьВидыКонтактнойИнформации.ФактАдресФизЛица));
		//#КонецВставки
		Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
		Адр = Правопреемник.уп_ФизЛицо.КонтактнаяИнформация.НайтиСтроки(Данные);
		Если Адр.Количество()>0 Тогда 
			ОбластьМакета.Параметры.Адрес = Адр[0].Представление;
		Иначе
			//#Удаление
			////Адр = РегистрыСведений.КонтактнаяИнформация.Получить(Новый Структура("Объект, Тип, Вид", Правопреемник.уп_ФизЛицо, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.УдалитьВидыКонтактнойИнформации.ЮрАдресФизЛица));
			//#КонецУдаления
			//#Вставка
			//Адр = РегистрыСведений.УдалитьКонтактнаяИнформация.Получить(Новый Структура("Объект, Тип, Вид", Правопреемник.уп_ФизЛицо, Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.УдалитьВидыКонтактнойИнформации.ЮрАдресФизЛица));
			//#КонецВставки
			Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица);
			Адр = Правопреемник.уп_ФизЛицо.КонтактнаяИнформация.НайтиСтроки(Данные);
			Если Адр.Количество()>0 Тогда 
				ОбластьМакета.Параметры.Адрес = Адр[0].Представление;
			Иначе
				Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.АдресЗаПределамиРФФизическиеЛица);
				Адр = Правопреемник.уп_ФизЛицо.КонтактнаяИнформация.НайтиСтроки(Данные);
				Если Адр.Количество()>0 Тогда 
					ОбластьМакета.Параметры.Адрес = Адр[0].Представление;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	
	//находим паспортные данные застрахованного лица
	//ПаспортныеДанные = РегистрыСведений.ПаспортныеДанныеФизЛиц.ПолучитьПоследнее(Дата,Новый Структура("ФизЛицо", Правопреемник.уп_ФизЛицо));
	ПаспортныеДанные = уп_ОсновнаяПоставкаСервер.ПолучитьДанныеДокументаУдостоверяющегоЛичность(Правопреемник.уп_ФизЛицо, Дата);
	СерияПаспорта = ПаспортныеДанные.Серия;
    НомерПаспорта = ПаспортныеДанные.Номер;
    ДатаВыдачиПаспорта = ПаспортныеДанные.ДатаВыдачи;
    КемВыданПаспорт = ПаспортныеДанные.КемВыдан;
	Если НЕ ЗначениеЗаполнено(Правопреемник) Тогда
		ОбластьМакета.Параметры.СерияНомерПаспорта =  "";
		ОбластьМакета.Параметры.ДатаВыдачи = "";
		ОбластьМакета.Параметры.ПаспортКемВыдан = "";
	Иначе
		ОбластьМакета.Параметры.СерияНомерПаспорта =  СерияПаспорта+" №"+НомерПаспорта;
		ОбластьМакета.Параметры.ДатаВыдачи = формат(ДатаВыдачиПаспорта,"ДЛФ=DD");
		ОбластьМакета.Параметры.ПаспортКемВыдан = КемВыданПаспорт;
	КонецЕсли;
	
	ОбластьМакета.Параметры.НомерПФР = уп_ОПС.ПреобразоватьНомерПФР(Правопреемник.уп_ФизЛицо.СтраховойНомерПФР);

	
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Оборот");
	ОбластьМакета.Параметры.ЧислоРегистрации = Формат(ДатаРегистрации, "ДФ=дд");
	ОбластьМакета.Параметры.МесяцРегистрации = Сред(Формат(ДатаРегистрации, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(ДатаРегистрации, "ДЛФ=дд")))-10);
	ОбластьМакета.Параметры.ГодРегистрации = Формат(ДатаРегистрации, "ДФ=гггг");
	ОбластьМакета.Параметры.НомерЗаявления = Номер;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РаботникиОрганизацийСрезПоследних.Должность
	               |ИЗ
	               |	РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(
	               |			&Период,
	               |			Сотрудник.Физическоелицо = &ОтветственныйФизЛицо
	               |				И Организация = &Организация) КАК РаботникиОрганизацийСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РаботникиОрганизацийСрезПоследних.Период УБЫВ";		
	Запрос.УстановитьПараметр("Период", ДатаРегистрации);
	Запрос.УстановитьПараметр("ОтветственныйФизЛицо", Ответственный.ФизЛицо);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ТЗДолжностьОтветственного = Запрос.Выполнить().Выгрузить();
	
	//ТЗДолжностьОтветственного = РегистрыСведений.РаботникиОрганизаций.СрезПоследних(ДатаРегистрации, Новый Структура("ФизЛицо, Организация",Ответственный.ФизЛицо,Организация));
	Если ТЗДолжностьОтветственного.Количество()>0 Тогда
		ОбластьМакета.Параметры.ДолжностьОтветственного = ТЗДолжностьОтветственного.Получить(0).Должность;
	Иначе
		ОбластьМакета.Параметры.ДолжностьОтветственного = "";
	КонецЕсли;
	
	//ОбластьМакета.Параметры.ДатаЗаявления = Дата;
	ОбластьМакета.Параметры.ДатаРегистрации = ДатаРегистрации; 
	ОбластьМакета.Параметры.НомерРасписки = Номер;
	ОбластьМакета.Параметры.НаименованиеНПФ = Организация.НаименованиеПолное;
	Если НЕ ЗначениеЗаполнено(ДоговорОПС) Тогда
		ОбластьМакета.Параметры.ФИОЗастрахованного = "";
	Иначе
		ОбластьМакета.Параметры.ФИОЗастрахованного = Фамилия+" "+Лев(Имя,1)+"."+Лев(Отчество,1)+".";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Правопреемник) Тогда
		ОбластьМакета.Параметры.ФИОПравопреемника = "";
	Иначе
		ОбластьМакета.Параметры.ФИОПравопреемника =ФамилияП+" "+ Лев(ИмяП,1)+"."+Лев(ОтчествоП,1)+"."+", "+Формат(Правопреемник.уп_ФизЛицо.ДатаРождения, "ДЛФ=DD")+" "+ПерсонифицированныйУчетКлиентСервер.ПредставлениеМестаРождения(Правопреемник.уп_ФизЛицо.МестоРождения);
	КонецЕсли;
	//ОбластьМакета.Параметры.НомерПФР = уп_ОПС.ПреобразоватьНомерПФР(Правопреемник.уп_ФизЛицо.СтраховойНомерПФР);
	Если НЕ ЗначениеЗаполнено(ДоговорОПС) Тогда
		ОбластьМакета.Параметры.НомерПФР = "";
	Иначе
		ОбластьМакета.Параметры.НомерПФР =уп_ОПС.ПреобразоватьНомерПФР(ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		ФИООтветственного = "";
	Иначе
		ФИООтветственного = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", Ответственный.ФизЛицо));
	КонецЕсли;
	ОбластьМакета.Параметры.ФИООтветственного = ФИООтветственного.Фамилия+" "+Лев(ФИООтветственного.Имя,1)+"."+Лев(ФИООтветственного.Отчество,1)+".";
	ТабДокумент.Вывести(ОбластьМакета);
	Возврат ТабДокумент;
КонецФункции

&После("ПриУстановкеНовогоНомера")
Процедура ХМ_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	ХМ_ПодпискиНаСобытия.ХМ_НомераРешенийПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);	
КонецПроцедуры
