
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 22.03.2018 ШадринАВ // ПроверитьЗакрытые() // №1432
КонецПроцедуры

&ИзменениеИКонтроль("ПроверитьЗакрытые")
Функция РасшОбщ_ПроверитьЗакрытые(Заголовок = "")
	 Отказ = Ложь;
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	СостоянияДоговораОПССрезПоследних.ДоговорОПС,
	 #Вставка
	 // +ХМНПФ 22.03.2018 ШадринАВ // ПроверитьЗакрытые() // №1432
	 |	ХМ_ПричиныЗакрытияДоговоровОПС.ПричинаЗакрытия КАК ХМ_ПричинаЗакрытия,
	 // -ХМНПФ 22.03.2018 ШадринАВ // ПроверитьЗакрытые() // №1432
	 #КонецВставки
	 |	СостоянияДоговораОПССрезПоследних.Состояние
	 |ИЗ
	 |	РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(&ДатаДок, ДоговорОПС В (&СписокДоговоров)) КАК СостоянияДоговораОПССрезПоследних
 	 #Вставка
	 // +ХМНПФ 22.03.2018 ШадринАВ // ПроверитьЗакрытые() // №1432
	 |	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(&ДатаДок, ) КАК ХМ_ПричиныЗакрытияДоговоровОПС
	 |		ПО ХМ_ПричиныЗакрытияДоговоровОПС.ДоговорОПС = СостоянияДоговораОПССрезПоследних.ДоговорОПС
	 // -ХМНПФ 22.03.2018 ШадринАВ // ПроверитьЗакрытые() // №1432
	 #КонецВставки
	 |ГДЕ
	 |	СостоянияДоговораОПССрезПоследних.Состояние НЕ В(&СписокСостояний)";
	 
	 Запрос.УстановитьПараметр("ДатаДок", КонецДня(Дата));
	 Запрос.УстановитьПараметр("СписокДоговоров", ДоговорыОПС.ВыгрузитьКолонку("ДоговорОПС"));
	 СписокСостояний = Новый СписокЗначений;
	 СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.Заключен);
	 СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПодтвержденияПФР);
	 СписокСостояний.Добавить(Перечисления.уп_СостоянияДоговоровОПС.ПриостановленПоОтказуИзПФР);
	 Запрос.УстановитьПараметр("СписокСостояний", СписокСостояний);
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		#Вставка
	 	// +ХМНПФ 22.03.2018 ШадринАВ // ПроверитьЗакрытые() // №1432
		 Если Выборка.ХМ_ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ЗакрытПоОтказуИзПФР Тогда Продолжить КонецЕсли;
	 	// -ХМНПФ 22.03.2018 ШадринАВ // ПроверитьЗакрытые() // №1432
		#КонецВставки
	     уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Состояние договора №"+Выборка.ДоговорОПС+" = "+Выборка.Состояние, Отказ, Заголовок);
	 	 Отказ = Истина;
	 КонецЦикла;
	 Возврат Отказ;
 КонецФункции

