// +ХМНПФ 11.01.2018 КлименкоМИ // уп_ВозвратПрочихНачисленийОПС() // №1278
Процедура уп_ВозвратПрочихНачисленийОПС(Источник, Отказ, РежимПроведения) Экспорт
	Если ЗначениеЗаполнено(Источник.ДокументОснование) Тогда	
		Если  Источник.Дата <=  Источник.ДокументОснование.Дата Тогда
			Сообщить("Дата документа возврата меньше даты документа выплаты. Неправильная последовательность документов!"  + Символы.ПС
			+ "Документ возврата: " + Источник.Ссылка + Символы.ПС
			+ "Документ выплаты: " + Источник.ДокументОснование.Ссылка + Символы.ПС
			+ "Проведение невозможно!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // уп_ВозвратПрочихНачисленийОПС(Источник, Отказ, РежимПроведения)

