
&ИзменениеИКонтроль("ОпределитьДокументВыплаты")
Процедура РасшОбщ_ОпределитьДокументВыплаты() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уп_ВыплатныеРеестры.Ссылка
	               |ИЗ
	               |	Документ.уп_ВыплатныеРеестры КАК уп_ВыплатныеРеестры
	               |ГДЕ
	               |	уп_ВыплатныеРеестры.Организация = &Организация
	               |	И уп_ВыплатныеРеестры.ДоговорыОПС.ДоговорОПС = &ДоговорОПС
	               |	И уп_ВыплатныеРеестры.ДоговорыОПС.Участник = &Участник
	               |	И уп_ВыплатныеРеестры.ТипВыплаты В (&ТипВыплаты)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	уп_ВыплатныеРеестры.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	Запрос.УстановитьПараметр("ТипВыплаты", ТипВыплаты);
	Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС Тогда
		Запрос.УстановитьПараметр("Участник", Участник);
		СписокТипВыплат = Новый СписокЗначений;
		СписокТипВыплат.Добавить(ТипВыплаты);
		СписокТипВыплат.Добавить(Перечисления.уп_ТипыВыплат.ВозвратЕдиновременнойВыплатыОПС);
	Иначе
		Запрос.УстановитьПараметр("Участник", Правопреемник);
		СписокТипВыплат = Новый СписокЗначений;
		СписокТипВыплат.Добавить(ТипВыплаты);
		СписокТипВыплат.Добавить(Перечисления.уп_ТипыВыплат.ВозвратВыплатПравопреемникамОПС);
	КонецЕсли;	
	Запрос.УстановитьПараметр("ТипВыплаты", СписокТипВыплат);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
	    ДокументОснование = Выборка.Ссылка;
		#Вставка
		// +ХМНПФ 23.03.2016 ШадринАВ // ОпределитьДокументВыплаты() // №278
		ХМ_ОпределитьПлатежноеПоручение();
		// -ХМНПФ 23.03.2016 ШадринАВ // ОпределитьДокументВыплаты() // №278
		#КонецВставки
	КонецЕсли;
	
КонецПроцедуры

&ИзменениеИКонтроль("СформироватьДвиженияВозвратВНачисленные")
Процедура РасшОбщ_СформироватьДвиженияВозвратВНачисленные(Отказ)
	//сторно выплаты
	//сторно расхода начисления (если нет отдельного учета возвратов)
	
	//надо бы еще контроль остатков сделать и учет сумм компенсации при возврате отвергнутого платежа
	
	//проверяем, есть ли аналитика по решению в начислениях
	СписываемПоРешению = ПроверитьАналитикуРешениеВНачислениях();
	ТекСтрокаРасшифровкаСуммы = ОсновнойЗапросПоТЧДокумента();
	
	Пока ТекСтрокаРасшифровкаСуммы.Следующий() Цикл
		Движение = Движения.уп_ВыплатыОПС.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение.Участник = Правопреемник;
		Иначе
			Движение.Участник = Участник;
		КонецЕсли;
		Движение.ДоговорОПС = ДоговорОПС;
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			Движение.ТипВыплаты = ДокументОснование.ТипВыплаты;
		Иначе
			Движение.ТипВыплаты = ТипВыплаты;
		КонецЕсли;
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС Тогда
			Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
		КонецЕсли;	
		Если СписываемПоРешению Тогда
			Движение.Решение = Решение;
		КонецЕсли;	
		Движение.Сумма = -ТекСтрокаРасшифровкаСуммы.Сумма;
		Движение.Выплата = -ТекСтрокаРасшифровкаСуммы.Сумма;
		
		Если ИспользоватьРегистрВозвратов Тогда
			Движение = Движения.уп_ВозвратыПрочихНачисленийОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.Участник = Правопреемник;
			Иначе
				Движение.Участник = Участник;
			КонецЕсли;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипВыплаты = ТипВыплаты;
			Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
			КонецЕсли;
			Если СписываемПоРешению Тогда
				Движение.Решение = Решение;
			КонецЕсли;	
			Движение.Сумма = ТекСтрокаРасшифровкаСуммы.Сумма;
			Движение.ДокументВыплаты = ДокументОснование;
			Движение.ДокументНачисления = Решение;
			Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.Возврат;
		КонецЕсли;
		
		Если (ДокументОснование.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС
			или ДокументОснование.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС)
			и  НЕ ИспользоватьРегистрВозвратов Тогда   //сторно расхода по начислению
			Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			#Вставка
			// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияВозвратВНачисленные() // №277
			Движение.ХМ_Возврат = Истина;
			// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияВозвратВНачисленные() // №277
			#КонецВставки
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.Участник = Правопреемник;
			Иначе
				Движение.Участник = Участник;
			КонецЕсли;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипВыплаты = ТипВыплаты;
			Если ВедетсяУчетПоТипамСумм Тогда
				Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
			КонецЕсли;	
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
			КонецЕсли;
			Если СписываемПоРешению Тогда
				Движение.Решение = Решение;
			КонецЕсли;	
			Движение.Сумма = - ТекСтрокаРасшифровкаСуммы.Сумма;
		КонецЕсли;
		
		//здесь должна быть проводка Д74 - К76 на сумму (-стр.Сумма)
		Если ЗначениеЗаполнено(ТекСтрокаРасшифровкаСуммы.ПолучательВПлатежномПоручении) Тогда
			Получатель = ТекСтрокаРасшифровкаСуммы.ПолучательВПлатежномПоручении;
		ИначеЕсли ЗначениеЗаполнено(ТекСтрокаРасшифровкаСуммы.Получатель) Тогда
			Получатель = ТекСтрокаРасшифровкаСуммы.Получатель;
		Иначе
			Получатель = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда 
			ВидДвижения = Перечисления.уп_ВидыДвижений.ВозвратВыплатыПравопреемникуОПС;
		Иначе
			ВидДвижения = Перечисления.уп_ВидыДвижений.ВозвратЕдиновременнойВыплаты;
		КонецЕсли;	
		//здесь еще надо определить какой получатель, если через кассу - по ним надо аналитику загнать
		Если НЕ ЗначениеЗаполнено(Получатель) Тогда //через кассу
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Получатель = Правопреемник;
			Иначе
				Получатель = Участник;
			КонецЕсли;
			ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка(); 
		Иначе
			ДоговорКонтрагента = Получатель.ОсновнойДоговорКонтрагента;
		КонецЕсли; 	
		
		уп_ОбщегоНазначенияУчетРезервов.ДобавитьСтрокуВТабБухУчет(ТабБухУчет, Дата, Организация, ВидДвижения, Получатель, ДоговорКонтрагента,
		Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получатель, ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь,  -ТекСтрокаРасшифровкаСуммы.Сумма);
	КонецЦикла;
КонецПроцедуры

&ИзменениеИКонтроль("СформироватьДвиженияВозвратВРезерв")
Процедура РасшОбщ_СформироватьДвиженияВозвратВРезерв(Отказ, ЗачислятьВРезервУмерших)
	//сторно выплаты
	//сторно расходы и прихода начислений
	//возврат в резерв
	ТекСтрокаРасшифровкаСуммы = ОсновнойЗапросПоТЧДокумента();
	
	//проверяем, есть ли аналитика по решению в начислениях
	СписываемПоРешению = ПроверитьАналитикуРешениеВНачислениях();
	
	Пока ТекСтрокаРасшифровкаСуммы.Следующий() Цикл
		//сторно выплаты
		Движение = Движения.уп_ВыплатыОПС.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение.Участник = Правопреемник;
		Иначе
			Движение.Участник = Участник;
		КонецЕсли;
		Движение.ДоговорОПС = ДоговорОПС;
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			Движение.ТипВыплаты = ДокументОснование.ТипВыплаты;
		Иначе
			Движение.ТипВыплаты = ТипВыплаты;
		КонецЕсли;
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС Тогда
			Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
		КонецЕсли;
		Если СписываемПоРешению Тогда
			Движение.Решение = Решение;
		КонецЕсли;	
		Движение.Сумма = -ТекСтрокаРасшифровкаСуммы.Сумма;
		Движение.Выплата = -ТекСтрокаРасшифровкаСуммы.Сумма;
		
		Если ЗначениеЗаполнено(ТекСтрокаРасшифровкаСуммы.ПолучательВПлатежномПоручении) Тогда
			Получатель = ТекСтрокаРасшифровкаСуммы.ПолучательВПлатежномПоручении;
		ИначеЕсли ЗначениеЗаполнено(ТекСтрокаРасшифровкаСуммы.Получатель) Тогда
			Получатель = ТекСтрокаРасшифровкаСуммы.Получатель;
		Иначе
			Получатель = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда 
			ВидДвижения = Перечисления.уп_ВидыДвижений.ВозвратВыплатыПравопреемникуОПС;
		Иначе
			ВидДвижения = Перечисления.уп_ВидыДвижений.ВозвратЕдиновременнойВыплаты;
		КонецЕсли;	
		//здесь еще надо определить какой получатель, если через кассу - по ним надо аналитику загнать
		Если НЕ ЗначениеЗаполнено(Получатель) Тогда //через кассу
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Получатель = Правопреемник;
			Иначе
				Получатель = Участник;
			КонецЕсли;
			ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		Иначе
			ДоговорКонтрагента = Получатель.ОсновнойДоговорКонтрагента;
		КонецЕсли;
		
		уп_ОбщегоНазначенияУчетРезервов.ДобавитьСтрокуВТабБухУчет(ТабБухУчет, Дата, Организация, ВидДвижения, Получатель, ДоговорКонтрагента,
		Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получатель, ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, -ТекСтрокаРасшифровкаСуммы.Сумма);
		
		//сторно расхода начислений
		Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		#Вставка
		// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияВозвратВРезерв() // №277
		Движение.ХМ_Возврат = Истина;
		// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияВозвратВРезерв() // №277
		#КонецВставки
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение.Участник = Правопреемник;
		Иначе
			Движение.Участник = Участник;
		КонецЕсли;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.ТипВыплаты = ТипВыплаты;
		Если ВедетсяУчетПоТипамСумм Тогда
			Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
		КонецЕсли;	
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
		КонецЕсли;
		Если СписываемПоРешению Тогда
			Движение.Решение = Решение;
		КонецЕсли;	
		Движение.Сумма = - ТекСтрокаРасшифровкаСуммы.Сумма;
		
		//сторно прихода начислений
		Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		#Вставка
		// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияВозвратВРезерв() // №277
		Движение.ХМ_Возврат = Истина;
		// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияВозвратВРезерв() // №277
		#КонецВставки
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение.Участник = Правопреемник;
		Иначе
			Движение.Участник = Участник;
		КонецЕсли;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.ТипВыплаты = ТипВыплаты;
		Если ВедетсяУчетПоТипамСумм Тогда
			Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
		КонецЕсли;	
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
		КонецЕсли;
		Если СписываемПоРешению Тогда
			Движение.Решение = Решение;
		КонецЕсли;	
		Движение.Сумма = - ТекСтрокаРасшифровкаСуммы.Сумма;
		
		Если ИспользоватьРегистрВозвратов Тогда
			Движение = Движения.уп_ВозвратыПрочихНачисленийОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.Участник = Правопреемник;
			Иначе
				Движение.Участник = Участник;
			КонецЕсли;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипВыплаты = ТипВыплаты;
			Если ВедетсяУчетПоТипамСумм Тогда
				Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
			КонецЕсли;	
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
			КонецЕсли;
			Если СписываемПоРешению Тогда
				Движение.Решение = Решение;
			КонецЕсли;	
			Движение.Сумма = ТекСтрокаРасшифровкаСуммы.Сумма;
			Движение.ДокументВыплаты = ДокументОснование;
			Движение.ДокументНачисления = Решение;
			Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.Возврат;
			
			Движение = Движения.уп_ВозвратыПрочихНачисленийОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.Участник = Правопреемник;
			Иначе
				Движение.Участник = Участник;
			КонецЕсли;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипВыплаты = ТипВыплаты;
			Если ВедетсяУчетПоТипамСумм Тогда
				Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
			КонецЕсли;	
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
			КонецЕсли;
			Если СписываемПоРешению Тогда
				Движение.Решение = Решение;
			КонецЕсли;	
			Движение.Сумма = ТекСтрокаРасшифровкаСуммы.Сумма;
			Движение.ДокументВыплаты = ДокументОснование;
			Движение.ДокументНачисления = Решение;
			Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.ВозвратВРезерв;
		КонецЕсли;	
		
		//зачисление в резерв
		Движение = Движения.уп_РезервыОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		//если возврат средств правопреемников, то во страховой резерв
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС;
		Иначе
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
			Если ЗачислятьВРезервУмерших Тогда
				Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН;
			Иначе
				Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
			Конецесли;
		КонецЕсли;
		Движение.Сумма = ТекСтрокаРасшифровкаСуммы.Сумма;
		
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение = Движения.уп_АналитикаРезерваОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
			Движение.ТипСуммы   = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
			//Если ТекСтрокаРасшифровкаСуммы.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
			//	Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.РезервОПС_НЧТП;
			//ИначеЕсли ТекСтрокаРасшифровкаСуммы.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты Тогда
			//	Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.РезервОПС_СрочныхВыплат;
			//КонецЕсли;
			Движение.Сумма = ТекСтрокаРасшифровкаСуммы.Сумма;
		КонецЕсли;	
		
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда 
			ВидДвижения = Перечисления.уп_ВидыДвижений.ВозвратВыплатыПравопреемникуОПСВРезерв;
		Иначе
			ВидДвижения = Перечисления.уп_ВидыДвижений.ВозвратЕВВРезерв;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ТекСтрокаРасшифровкаСуммы.ПолучательВПлатежномПоручении) Тогда
			Получатель = ТекСтрокаРасшифровкаСуммы.ПолучательВПлатежномПоручении;
		ИначеЕсли ЗначениеЗаполнено(ТекСтрокаРасшифровкаСуммы.Получатель) Тогда
			Получатель = ТекСтрокаРасшифровкаСуммы.Получатель;
		Иначе
			Получатель = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		//здесь еще надо определить какой получатель, если через кассу - по ним надо аналитику загнать
		Если НЕ ЗначениеЗаполнено(Получатель) Тогда //через кассу
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Получатель = Правопреемник;
			Иначе
				Получатель = Участник;
			КонецЕсли;
			ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		Иначе
			ДоговорКонтрагента = Получатель.ОсновнойДоговорКонтрагента;
		КонецЕсли;
		
		
		уп_ОбщегоНазначенияУчетРезервов.ДобавитьСтрокуВТабБухУчет(ТабБухУчет, Дата, Организация, ВидДвижения, ТекСтрокаРасшифровкаСуммы.ДоговорОПС.Участник, ТекСтрокаРасшифровкаСуммы.ДоговорОПС.ДоговорКонтрагента,
		Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получатель, ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, -ТекСтрокаРасшифровкаСуммы.Сумма);
		
	КонецЦикла;	
КонецПроцедуры

&ИзменениеИКонтроль("СформироватьДвиженияВозвратНачисленийВРезерв")
Процедура РасшОбщ_СформироватьДвиженияВозвратНачисленийВРезерв(Отказ, ЗачислятьВРезервУмерших)
	//сторно прихода начислений
	//возврат в резерв
	//списание резервов начислений, если есть
	ТекСтрокаРасшифровкаСуммы = ОсновнойЗапросПоТЧДокумента();
	
	//проверяем, есть ли аналитика по решению в начислениях
	СписываемПоРешению = ПроверитьАналитикуРешениеВНачислениях();
	
	Пока ТекСтрокаРасшифровкаСуммы.Следующий() Цикл
		//сторно прихода начислений
		Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		#Вставка
		// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияВозвратНачисленийВРезерв() // №277
		Движение.ХМ_Возврат = Истина;
		// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияВозвратНачисленийВРезерв() // №277
		#КонецВставки
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение.Участник = Правопреемник;
		Иначе
			Движение.Участник = Участник;
		КонецЕсли;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.ТипВыплаты = ТипВыплаты;
		Если ВедетсяУчетПоТипамСумм Тогда
			Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
		КонецЕсли;
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
		КонецЕсли;
		Если СписываемПоРешению Тогда
			Движение.Решение = Решение;
		КонецЕсли;	
		Движение.Сумма = - ТекСтрокаРасшифровкаСуммы.Сумма;
		
		//запись в резерв
		Движение = Движения.уп_РезервыОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		//если возврат средств правопреемников, то во страховой резерв
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС;
		Иначе
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
			Если ЗачислятьВРезервУмерших Тогда
				Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН;
			Иначе
				Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
			Конецесли;
		КонецЕсли;
		Движение.Сумма = ТекСтрокаРасшифровкаСуммы.Сумма;
		
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение = Движения.уп_АналитикаРезерваОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
			Движение.ТипСуммы   = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
			//Если ТекСтрокаРасшифровкаСуммы.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
			//	Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.РезервОПС_НЧТП;
			//ИначеЕсли ТекСтрокаРасшифровкаСуммы.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты Тогда
			//	Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.РезервОПС_СрочныхВыплат;
			//КонецЕсли;
			Движение.Сумма = ТекСтрокаРасшифровкаСуммы.Сумма;
		КонецЕсли;	
		
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда 
			ВидДвижения = Перечисления.уп_ВидыДвижений.ВозвратВыплатыПравопреемникуОПСВРезерв;
		Иначе
			ВидДвижения = Перечисления.уп_ВидыДвижений.ВозвратЕВВРезерв;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ТекСтрокаРасшифровкаСуммы.ПолучательВПлатежномПоручении) Тогда
			Получатель = ТекСтрокаРасшифровкаСуммы.ПолучательВПлатежномПоручении;
		ИначеЕсли ЗначениеЗаполнено(ТекСтрокаРасшифровкаСуммы.Получатель) Тогда
			Получатель = ТекСтрокаРасшифровкаСуммы.Получатель;
		Иначе
			Получатель = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		//здесь еще надо определить какой получатель, если через кассу - по ним надо аналитику загнать
		Если НЕ ЗначениеЗаполнено(Получатель) Тогда //через кассу
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Получатель = Правопреемник;
			Иначе
				Получатель = Участник;
			КонецЕсли;
			ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		Иначе
			ДоговорКонтрагента = Получатель.ОсновнойДоговорКонтрагента;
		КонецЕсли;
		
		уп_ОбщегоНазначенияУчетРезервов.ДобавитьСтрокуВТабБухУчет(ТабБухУчет, Дата, Организация, ВидДвижения, ТекСтрокаРасшифровкаСуммы.ДоговорОПС.Участник, ТекСтрокаРасшифровкаСуммы.ДоговорОПС.ДоговорКонтрагента,
		Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получатель, ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, -ТекСтрокаРасшифровкаСуммы.Сумма);
		
	КонецЦикла;	
	
	ПроверитьСписатьРезервыНачислений();
КонецПроцедуры

&ИзменениеИКонтроль("СформироватьДвиженияПоВозвращеннымПлатежамВРезерв")
Процедура РасшОбщ_СформироватьДвиженияПоВозвращеннымПлатежамВРезерв(Отказ, ЗачислятьВРезервУмерших)
	//проверим остатки по регистру возвратов
	//сторнируем обороты по начислениям
	//оформим возврат в резерв
	
	//списание отвергнутых платежей
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_ВозвратПрочихНачисленийОПСРасшифровкаСуммы.ТипРезерва КАК ТипРезерва,
	|	уп_ВозвратПрочихНачисленийОПСРасшифровкаСуммы.ТипСуммы КАК ТипСуммы,
	|	уп_ВозвратПрочихНачисленийОПСРасшифровкаСуммы.Сумма КАК Сумма
	|ПОМЕСТИТЬ ТабПоДокументу
	|ИЗ
	|	Документ.уп_ВозвратПрочихНачисленийОПС.РасшифровкаСуммы КАК уп_ВозвратПрочихНачисленийОПСРасшифровкаСуммы
	|ГДЕ
	|	уп_ВозвратПрочихНачисленийОПСРасшифровкаСуммы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ВозвратыПрочихНачисленийОПСОстатки.ТипСуммы КАК ТипСуммы,
	|	уп_ВозвратыПрочихНачисленийОПСОстатки.ТипРезерва КАК ТипРезерва,
	|	уп_ВозвратыПрочихНачисленийОПСОстатки.СуммаОстаток КАК СуммаОстаток,
	|	уп_ВозвратыПрочихНачисленийОПСОстатки.ТипВыплаты КАК ТипВыплаты
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.уп_ВозвратыПрочихНачисленийОПС.Остатки(
	|			&ДатаДок,
	|			ДоговорОПС = &ДоговорОПС
	|				И ТипВыплаты В (&СписокТиповВыплат)
	|				И Участник = &Участник) КАК уп_ВозвратыПрочихНачисленийОПСОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабПоДокументу.ТипРезерва КАК ТипРезерва,
	|	ТабПоДокументу.ТипСуммы КАК ТипСуммы,
	|	ТабПоДокументу.Сумма КАК Сумма,
	|	ЕстьNULL(Остатки.СуммаОстаток,0) КАК СуммаОстаток,
	|	Остатки.ТипВыплаты КАК ТипВыплаты
	|ИЗ
	|	ТабПоДокументу КАК ТабПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ТабПоДокументу.ТипСуммы = Остатки.ТипСуммы" +?(ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС,"
	|			И ТабПоДокументу.ТипРезерва = Остатки.ТипРезерва","");
	
	Запрос.УстановитьПараметр("ДатаДок", Новый Граница(МоментВремени(),ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	СписокТиповВыплат = Новый СписокЗначений;
	СписокТиповВыплат.Добавить(ТипВыплаты);
	Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
		Запрос.УстановитьПараметр("Участник", Правопреемник);
	Иначе
		Запрос.УстановитьПараметр("Участник", Участник);
	КонецЕсли;
	Запрос.УстановитьПараметр("СписокТиповВыплат", СписокТиповВыплат);
	
	//проверяем, есть ли аналитика по решению в начислениях
	СписываемПоРешению = ПроверитьАналитикуРешениеВНачислениях();
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.СуммаОстаток>=Выборка.Сумма Тогда
			Движение = Движения.уп_ВозвратыПрочихНачисленийОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.Участник = Правопреемник;
			Иначе
				Движение.Участник = Участник;
			КонецЕсли;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипВыплаты = ТипВыплаты;
			Движение.ТипСуммы = Выборка.ТипСуммы;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.ТипРезерва = Выборка.ТипРезерва;
			КонецЕсли;
			Если СписываемПоРешению Тогда
				Движение.Решение = Решение;
			КонецЕсли;
			Движение.Сумма = Выборка.Сумма;
			Движение.ДокументВыплаты = ДокументОснование;
			Движение.ДокументНачисления = Решение;
			Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.ВозвратВРезерв;
			
			//сторно начисления
			Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			#Вставка
			// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияПоВозвращеннымПлатежамВРезерв() // №277
			Движение.ХМ_Возврат = Истина;
			// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияПоВозвращеннымПлатежамВРезерв() // №277
			#КонецВставки
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.Участник = Правопреемник;
			Иначе
				Движение.Участник = Участник;
			КонецЕсли;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипВыплаты = ТипВыплаты;
			Движение.ТипСуммы = Выборка.ТипСуммы;
			Если СписываемПоРешению Тогда
				Движение.Решение = Решение;
			КонецЕсли;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.ТипРезерва = Выборка.ТипРезерва;
			КонецЕсли;
			Движение.Сумма = -Выборка.Сумма;
			
			Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход; 
			#Вставка
			// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияПоВозвращеннымПлатежамВРезерв() // №277
			Движение.ХМ_Возврат = Истина;
			// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияПоВозвращеннымПлатежамВРезерв() // №277
			#КонецВставки
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.Участник = Правопреемник;
			Иначе
				Движение.Участник = Участник;
			КонецЕсли;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипВыплаты = ТипВыплаты;
			Движение.ТипСуммы = Выборка.ТипСуммы;
			Если СписываемПоРешению Тогда
				Движение.Решение = Решение;
			КонецЕсли;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.ТипРезерва = Выборка.ТипРезерва;
			КонецЕсли;
			Движение.Сумма = -Выборка.Сумма;
			
		Иначе
			Отказ = Истина;
			Сообщить("По типу суммы "+Выборка.ТипСуммы+" остаток возвращенных платежей меньше оформляемой суммы возврата в резерв.");
		КонецЕсли;	
	КонецЦикла;	
	
	ТекСтрокаРасшифровкаСуммы = ОсновнойЗапросПоТЧДокумента();
	
	Пока ТекСтрокаРасшифровкаСуммы.Следующий() Цикл
		
		//зачисление в резерв
		Движение = Движения.уп_РезервыОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		//если возврат средств правопреемников, то во страховой резерв
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС;
		Иначе
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
			Если ЗачислятьВРезервУмерших Тогда
				Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН;
			Иначе
				Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
			Конецесли;
		КонецЕсли;
		Движение.Сумма = ТекСтрокаРасшифровкаСуммы.Сумма;
		
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение = Движения.уп_АналитикаРезерваОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
			Движение.ТипСуммы   = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
			//Если ТекСтрокаРасшифровкаСуммы.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
			//	Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.РезервОПС_НЧТП;
			//ИначеЕсли ТекСтрокаРасшифровкаСуммы.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты Тогда
			//	Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.РезервОПС_СрочныхВыплат;
			//КонецЕсли;
			Движение.Сумма = ТекСтрокаРасшифровкаСуммы.Сумма;
		КонецЕсли;	
		
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда 
			ВидДвижения = Перечисления.уп_ВидыДвижений.ВозвратВыплатыПравопреемникуОПСВРезерв;
		Иначе
			ВидДвижения = Перечисления.уп_ВидыДвижений.ВозвратЕВВРезерв;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ТекСтрокаРасшифровкаСуммы.ПолучательВПлатежномПоручении) Тогда
			Получатель = ТекСтрокаРасшифровкаСуммы.ПолучательВПлатежномПоручении;
		ИначеЕсли ЗначениеЗаполнено(ТекСтрокаРасшифровкаСуммы.Получатель) Тогда
			Получатель = ТекСтрокаРасшифровкаСуммы.Получатель;
		Иначе
			Получатель = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		//здесь еще надо определить какой получатель, если через кассу - по ним надо аналитику загнать
		Если НЕ ЗначениеЗаполнено(Получатель) Тогда //через кассу
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Получатель = Правопреемник;
			Иначе
				Получатель = Участник;
			КонецЕсли;
			ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		Иначе
			ДоговорКонтрагента = Получатель.ОсновнойДоговорКонтрагента;
		КонецЕсли; 	
		
		уп_ОбщегоНазначенияУчетРезервов.ДобавитьСтрокуВТабБухУчет(ТабБухУчет, Дата, Организация, ВидДвижения, ТекСтрокаРасшифровкаСуммы.ДоговорОПС.Участник, ТекСтрокаРасшифровкаСуммы.ДоговорОПС.ДоговорКонтрагента,
		Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получатель, ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, -ТекСтрокаРасшифровкаСуммы.Сумма);
	КонецЦикла;
КонецПроцедуры	

&ИзменениеИКонтроль("СформироватьДвиженияПоОтвергнутымПлатежамВРезерв")
Процедура РасшОбщ_СформироватьДвиженияПоОтвергнутымПлатежамВРезерв(Отказ, ЗачислятьВРезервУмерших)
	//проверим остатки по отвергнутым платежам
	//сторнируем обороты по начислениям
	//оформим возврат в резерв
	//списшем резервы начислений, если есть
	
	//списание отвергнутых платежей
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_ВозвратПрочихНачисленийОПСРасшифровкаСуммы.ТипРезерва КАК ТипРезерва,
	|	уп_ВозвратПрочихНачисленийОПСРасшифровкаСуммы.ТипСуммы КАК ТипСуммы,
	|	уп_ВозвратПрочихНачисленийОПСРасшифровкаСуммы.Сумма КАК Сумма
	|ПОМЕСТИТЬ ТабПоДокументу
	|ИЗ
	|	Документ.уп_ВозвратПрочихНачисленийОПС.РасшифровкаСуммы КАК уп_ВозвратПрочихНачисленийОПСРасшифровкаСуммы
	|ГДЕ
	|	уп_ВозвратПрочихНачисленийОПСРасшифровкаСуммы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки.ТипСуммы КАК ТипСуммы,
	|	уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки.ТипРезерва КАК ТипРезерва,
	|	уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки.СуммаОстаток КАК СуммаОстаток,
	|	уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки.ТипВыплаты КАК ТипВыплаты,
	|	уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки.СуммаКомпенсацииОстаток КАК СуммаКомпенсацииОстаток,
	|	уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки.СуммаВосполненияОстаток КАК СуммаВосполненияОстаток,
	|	уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки.СуммаВозмещенияОстаток КАК СуммаВозмещенияОстаток,
	|	уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки.НалоговаяБазаПоНДФЛОстаток КАК НалоговаяБазаПоНДФЛОстаток
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.уп_ОтвергнутыеПлатежиПрочиеНачисленияОПС.Остатки(
	|			&ДатаДок,
	|			ДоговорОПС = &ДоговорОПС
	|				И ТипВыплаты В (&СписокТиповВыплат)
	|				И Участник = &Участник) КАК уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки.ТипСуммы КАК ТипСуммы,
	|	уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки.ТипРезерва КАК ТипРезерва,
	|	уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки.СуммаОстаток КАК СуммаОстаток,
	|	уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки.ТипВыплаты КАК ТипВыплаты,
	|	уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки.СуммаКомпенсацииОстаток КАК СуммаКомпенсацииОстаток,
	|	уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки.СуммаВосполненияОстаток КАК СуммаВосполненияОстаток,
	|	уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки.СуммаВозмещенияОстаток КАК СуммаВозмещенияОстаток,
	|	уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки.НалоговаяБазаПоНДФЛОстаток КАК НалоговаяБазаПоНДФЛОстаток
	|ПОМЕСТИТЬ ОстаткиПоРешению
	|ИЗ
	|	РегистрНакопления.уп_ОтвергнутыеПлатежиПрочиеНачисленияОПС.Остатки(
	|			&ДатаДок,
	|			ДоговорОПС = &ДоговорОПС
	|				И ТипВыплаты В (&СписокТиповВыплат)
	|				И Участник = &Участник
	|				И Решение = &Решение) КАК уп_ОтвергнутыеПлатежиПрочиеНачисленияОПСОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабПоДокументу.ТипРезерва КАК ТипРезерва,
	|	ТабПоДокументу.ТипСуммы КАК ТипСуммы,
	|	ТабПоДокументу.Сумма КАК Сумма,
	|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	Остатки.ТипВыплаты КАК ТипВыплаты,
	|	ЕСТЬNULL(Остатки.СуммаКомпенсацииОстаток, 0) КАК СуммаКомпенсацииОстаток,
	|	ЕСТЬNULL(Остатки.СуммаВосполненияОстаток, 0) КАК СуммаВосполненияОстаток,
	|	ЕСТЬNULL(Остатки.СуммаВозмещенияОстаток, 0) КАК СуммаВозмещенияОстаток,
	|	ЕСТЬNULL(Остатки.НалоговаяБазаПоНДФЛОстаток, 0) КАК НалоговаяБазаПоНДФЛОстаток,
	|	ЕСТЬNULL(ОстаткиПоРешению.СуммаОстаток, 0) КАК СуммаОстатокР,
	|	ЕСТЬNULL(ОстаткиПоРешению.СуммаКомпенсацииОстаток, 0) КАК СуммаКомпенсацииОстатокР,
	|	ЕСТЬNULL(ОстаткиПоРешению.СуммаВосполненияОстаток, 0) КАК СуммаВосполненияОстатокР,
	|	ЕСТЬNULL(ОстаткиПоРешению.СуммаВозмещенияОстаток, 0) КАК СуммаВозмещенияОстатокР,
	|	ЕСТЬNULL(ОстаткиПоРешению.НалоговаяБазаПоНДФЛОстаток, 0) КАК НалоговаяБазаПоНДФЛОстатокР
	|ИЗ
	|	ТабПоДокументу КАК ТабПоДокументу
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ТабПоДокументу.ТипСуммы = Остатки.ТипСуммы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоРешению КАК ОстаткиПоРешению
	|		ПО ТабПоДокументу.ТипСуммы = ОстаткиПоРешению.ТипСуммы" +?(ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС,"
	|			И ТабПоДокументу.ТипРезерва = Остатки.ТипРезерва","");
	
	Запрос.УстановитьПараметр("ДатаДок", Новый Граница(МоментВремени(),ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Решение", Решение);
	СписокТиповВыплат = Новый СписокЗначений;
	СписокТиповВыплат.Добавить(ТипВыплаты);
	Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
		Запрос.УстановитьПараметр("Участник", Правопреемник);
	Иначе
		Запрос.УстановитьПараметр("Участник", Участник);
	КонецЕсли;
	Запрос.УстановитьПараметр("СписокТиповВыплат", СписокТиповВыплат);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.СуммаОстатокР<>0 Тогда
			СписываемПоРешению = Истина;
		Иначе
			СписываемПоРешению = Ложь;
		КонецЕсли;	
		Если (НЕ СписываемПоРешению И Выборка.СуммаОстаток>=Выборка.Сумма)
			ИЛИ (СписываемПоРешению И Выборка.СуммаОстатокР>=Выборка.Сумма) Тогда
			//здесь еще суммы компенсации надо бы дорисовать
			Движение = Движения.уп_ОтвергнутыеПлатежиПрочиеНачисленияОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.Участник = Правопреемник;
			Иначе
				Движение.Участник = Участник;
			КонецЕсли;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипВыплаты = ТипВыплаты;
			Движение.ТипСуммы = Выборка.ТипСуммы;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.ТипРезерва = Выборка.ТипРезерва;
			КонецЕсли;
			Если СписываемПоРешению Тогда
				Движение.Решение = Решение;
			КонецЕсли;	
			Движение.Сумма = Выборка.Сумма;
			Движение.ДокументВыплаты = ДокументОснование;
			Движение.ДокументНачисления = Решение;
			Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.ВозвратВРезерв;
		Иначе
			Отказ = Истина;
			Сообщить("По типу суммы "+Выборка.ТипСуммы+" остаток отвергнутых платежей меньше оформляемой суммы возврата в резерв.");
		КонецЕсли;	
	КонецЦикла;	
	
	ТекСтрокаРасшифровкаСуммы = ОсновнойЗапросПоТЧДокумента();
	
	СписываемПоРешению = ПроверитьАналитикуРешениеВНачислениях();
	
	Пока ТекСтрокаРасшифровкаСуммы.Следующий() Цикл
		//сторно расхода начислений
		Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		#Вставка
		// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияПоОтвергнутымПлатежамВРезерв() // №277
		Движение.ХМ_Возврат = Истина;
		// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияПоОтвергнутымПлатежамВРезерв() // №277
		#КонецВставки
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение.Участник = Правопреемник;
		Иначе
			Движение.Участник = Участник;
		КонецЕсли;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.ТипВыплаты = ТипВыплаты;
		Если ВедетсяУчетПоТипамСумм Тогда
			Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
		КонецЕсли;	
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
		КонецЕсли;
		Если СписываемПоРешению Тогда
			Движение.Решение = Решение;
		КонецЕсли;	
		Движение.Сумма = - ТекСтрокаРасшифровкаСуммы.Сумма;
		
		//сторно прихода начислений
		Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		#Вставка
		// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияПоОтвергнутымПлатежамВРезерв() // №277
		Движение.ХМ_Возврат = Истина;
		// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияПоОтвергнутымПлатежамВРезерв() // №277
		#КонецВставки
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение.Участник = Правопреемник;
		Иначе
			Движение.Участник = Участник;
		КонецЕсли;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.ТипВыплаты = ТипВыплаты;
		Если ВедетсяУчетПоТипамСумм Тогда
			Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
		КонецЕсли;	
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
		КонецЕсли;
		Если СписываемПоРешению Тогда
			Движение.Решение = Решение;
		КонецЕсли;	
		Движение.Сумма = - ТекСтрокаРасшифровкаСуммы.Сумма;
		
		//зачисление в резерв
		Движение = Движения.уп_РезервыОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		//если возврат средств правопреемников, то во страховой резерв
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС;
		Иначе
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
			Если ЗачислятьВРезервУмерших Тогда
				Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН;
			Иначе
				Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
			Конецесли;
		КонецЕсли;
		Движение.Сумма = ТекСтрокаРасшифровкаСуммы.Сумма;
		
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			Движение = Движения.уп_АналитикаРезерваОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипРезерва = ТекСтрокаРасшифровкаСуммы.ТипРезерва;
			Движение.ТипСуммы   = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
			//Если ТекСтрокаРасшифровкаСуммы.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
			//	Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.РезервОПС_НЧТП;
			//ИначеЕсли ТекСтрокаРасшифровкаСуммы.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты Тогда
			//	Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.РезервОПС_СрочныхВыплат;
			//КонецЕсли;
			Движение.Сумма = ТекСтрокаРасшифровкаСуммы.Сумма;
		КонецЕсли;	
		
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда 
			ВидДвижения = Перечисления.уп_ВидыДвижений.ВозвратВыплатыПравопреемникуОПСВРезерв;
		Иначе
			ВидДвижения = Перечисления.уп_ВидыДвижений.ВозвратЕВВРезерв;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(ТекСтрокаРасшифровкаСуммы.ПолучательВПлатежномПоручении) Тогда
			Получатель = ТекСтрокаРасшифровкаСуммы.ПолучательВПлатежномПоручении;
		ИначеЕсли ЗначениеЗаполнено(ТекСтрокаРасшифровкаСуммы.Получатель) Тогда
			Получатель = ТекСтрокаРасшифровкаСуммы.Получатель;
		Иначе
			Получатель = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		//здесь еще надо определить какой получатель, если через кассу - по ним надо аналитику загнать
		Если НЕ ЗначениеЗаполнено(Получатель) Тогда //через кассу
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Получатель = Правопреемник;
			Иначе
				Получатель = Участник;
			КонецЕсли;
			ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		Иначе
			ДоговорКонтрагента = Получатель.ОсновнойДоговорКонтрагента;
		КонецЕсли;
		
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС Тогда 
			уп_ОбщегоНазначенияУчетРезервов.ДобавитьСтрокуВТабБухУчет(ТабБухУчет, Дата, Организация, Перечисления.уп_ВидыДвижений.ЕдиновременнаяВыплатаПредОПС, ДоговорОПС.Участник, ДоговорОПС.ДоговорКонтрагента, 
			Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ДоговорОПС.Участник, ДоговорОПС.ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, -ТекСтрокаРасшифровкаСуммы.Сумма);
		КонецЕсли;
		Если ПроводкиПоНачислению Тогда
			уп_ОбщегоНазначенияУчетРезервов.ДобавитьСтрокуВТабБухУчет(ТабБухУчет, Дата, Организация, ВидДвижения, ТекСтрокаРасшифровкаСуммы.ДоговорОПС.Участник, ТекСтрокаРасшифровкаСуммы.ДоговорОПС.ДоговорКонтрагента,
			Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получатель, ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, -ТекСтрокаРасшифровкаСуммы.Сумма);
		КонецЕсли;
	КонецЦикла;
	
	ПроверитьСписатьРезервыНачислений();
КонецПроцедуры	

&ИзменениеИКонтроль("СформироватьДвиженияПоОтвергнутымПлатежамНеиполненнойВыплаты")
Процедура РасшОбщ_СформироватьДвиженияПоОтвергнутымПлатежамНеиполненнойВыплаты()
	//проверим остатки
	//если выплата была основная
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		Если ДокументОснование.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС
			или ДокументОснование.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			ВыборкаДетальныеЗаписи = ОстаткиПоРегиструНачислений();
			ЧтоЗакрываем = "Начисления";
		ИначеЕсли ДокументОснование.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратЕдиновременнойВыплатыОПС
			или ДокументОснование.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатПравопреемникамОПС Тогда
			ВыборкаДетальныеЗаписи = ОстаткиПоРегиструВозвратов();
			ЧтоЗакрываем = "Возвраты";
		ИначеЕсли ДокументОснование.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежЕВОПС
			или ДокументОснование.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиОПС Тогда
			ВыборкаДетальныеЗаписи = ОстаткиПоРегиструОтвергнутых();
			ЧтоЗакрываем = "Отвергнутые";
		КонецЕсли;
	Иначе  //считаем, что была первая попытка выплатить
		ВыборкаДетальныеЗаписи = ОстаткиПоРегиструНачислений();
		ЧтоЗакрываем = "Начисления";
	КонецЕсли;	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Сумма>ВыборкаДетальныеЗаписи.СуммаОстаток Тогда
			Отказ = Истина;
			Сообщить("По типу суммы "+ВыборкаДетальныеЗаписи.ТипСуммы+" остаток начислений меньше оформляемой отвергнутой выплаты.");
		Иначе
			Движение = Движения.уп_ОтвергнутыеПлатежиПрочиеНачисленияОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.Участник = Правопреемник;
			Иначе
				Движение.Участник = Участник;
			КонецЕсли;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипВыплаты = ТипВыплаты;
			Движение.ТипСуммы = ВыборкаДетальныеЗаписи.ТипСуммы;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.ТипРезерва = ВыборкаДетальныеЗаписи.ТипРезерва;
			КонецЕсли;
			Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
			Движение.НалоговаяБазаПоНДФЛ= ВыборкаДетальныеЗаписи.НалоговаяБазаПоНДФЛОстаток;
			Движение.СуммаКомпенсации = ВыборкаДетальныеЗаписи.СуммаКомпенсацииОстаток;
			Движение.СуммаВосполнения = ВыборкаДетальныеЗаписи.СуммаВосполненияОстаток;
			Движение.СуммаВозмещения = ВыборкаДетальныеЗаписи.СуммаВозмещенияОстаток;
			Движение.ДокументВыплаты = ДокументОснование;
			Движение.ДокументНачисления = Решение;
			
			Если ЧтоЗакрываем = "Начисления" Тогда
				Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				#Вставка
				// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияПоОтвергнутымПлатежамНеиполненнойВыплаты() // №277
				Движение.ХМ_Возврат = Истина;
				// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияПоОтвергнутымПлатежамНеиполненнойВыплаты() // №277
				#КонецВставки
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
					Движение.Участник = Правопреемник;
				Иначе
					Движение.Участник = Участник;
				КонецЕсли;
				Движение.ДоговорОПС = ДоговорОПС;
				Движение.ТипВыплаты = ВыборкаДетальныеЗаписи.ТипВыплаты;
				Движение.ТипСуммы = ВыборкаДетальныеЗаписи.ТипСуммы;
				Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
					Движение.ТипРезерва = ВыборкаДетальныеЗаписи.ТипРезерва;
				КонецЕсли;
				Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
				Движение.НалоговаяБазаПоНДФЛ= ВыборкаДетальныеЗаписи.НалоговаяБазаПоНДФЛОстаток;
				Движение.СуммаКомпенсации = ВыборкаДетальныеЗаписи.СуммаКомпенсацииОстаток;
				Движение.СуммаВосполнения = ВыборкаДетальныеЗаписи.СуммаВосполненияОстаток;
				Движение.СуммаВозмещения = ВыборкаДетальныеЗаписи.СуммаВозмещенияОстаток;
			ИначеЕсли ЧтоЗакрываем = "Возвраты" Тогда
				Движение = Движения.уп_ВозвратыПрочихНачисленийОПС.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
					Движение.Участник = Правопреемник;
				Иначе
					Движение.Участник = Участник;
				КонецЕсли;
				Движение.ДоговорОПС = ДоговорОПС;
				Движение.ТипВыплаты = ВыборкаДетальныеЗаписи.ТипВыплаты;
				Движение.ТипСуммы = ВыборкаДетальныеЗаписи.ТипСуммы;
				Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
					Движение.ТипРезерва = ВыборкаДетальныеЗаписи.ТипРезерва;
				КонецЕсли;
				Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
				Движение.НалоговаяБазаПоНДФЛ= ВыборкаДетальныеЗаписи.НалоговаяБазаПоНДФЛОстаток;
			ИначеЕсли ЧтоЗакрываем = "Отвергнутые" Тогда
				Движение = Движения.уп_ОтвергнутыеПлатежиПрочиеНачисленияОПС.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
					Движение.Участник = Правопреемник;
				Иначе
					Движение.Участник = Участник;
				КонецЕсли;
				Движение.ДоговорОПС = ДоговорОПС;
				Движение.ТипВыплаты = ВыборкаДетальныеЗаписи.ТипВыплаты;
				Движение.ТипСуммы = ВыборкаДетальныеЗаписи.ТипСуммы;
				Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
					Движение.ТипРезерва = ВыборкаДетальныеЗаписи.ТипРезерва;
				КонецЕсли;
				Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;
				Движение.НалоговаяБазаПоНДФЛ= ВыборкаДетальныеЗаписи.НалоговаяБазаПоНДФЛОстаток;
				Движение.СуммаКомпенсации = ВыборкаДетальныеЗаписи.СуммаКомпенсацииОстаток;
				Движение.СуммаВосполнения = ВыборкаДетальныеЗаписи.СуммаВосполненияОстаток;
				Движение.СуммаВозмещения = ВыборкаДетальныеЗаписи.СуммаВозмещенияОстаток;
			Конецесли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры	

// ХМНПФ 11.04.2018 КлименкоМИ // Новая ХМ_ОбработкаПроведения() // №1510
Процедура ХМ_ОбработкаПроведения(Движения) Экспорт
	Если ХМ_ВозвратВИЛС и ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
		Движения.уп_РезервыОПС.Очистить();	
		Для Каждого Стр из Движения.уп_АналитикаРезерваОПС Цикл
			Движение = Движения.уп_РезервыОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;	
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипСуммы = Стр.ТипСуммы;
			Движение.ТипРезерва = Стр.ТипРезерва;	
			Движение.Сумма = -Стр.Сумма;	
		КонецЦикла;
		Движения.уп_АналитикаРезерваОПС.Записывать = Ложь;
		Движения.уп_АналитикаРезерваОПС.Очистить();	
	КонецЕсли;
КонецПроцедуры

// ХМНПФ 23.03.2016 ШадринАВ // Новая ХМ_ОпределитьПлатежноеПоручение() // №278
Процедура ХМ_ОпределитьПлатежноеПоручение()
	СписокДокументов = Новый СписокЗначений;
	ВидДокумента = "ПлатежноеПоручение";
	СписокДокументов = ХМ_ФункцииОтчетов.НайтиПодчиненныйПлатежныйДокумент(ДокументОснование.Ссылка, ВидДокумента, СписокДокументов);
	Если СписокДокументов.Количество() > 0 Тогда
		ХМ_ВозвратСПлатежногоПоручения = СписокДокументов[0].Значение;
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура РасшОбщ_ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	
	//Проверка на заполенность решения и выплатной ведомости
	
	Если Дата >= Дата('20170101') и ДокументОснование.Пустая() или Решение.Пустая() Тогда 
		
		Отказ = Истина;		
		Сообщить("Не заполнены данные о решении и (или) документе выплаты.");
	КонецЕсли;	
	
	// Проверка ручной корректировки
	Если уп_ОсновнаяПоставкаСервер.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект) Тогда
		Возврат
	КонецЕсли;
	ТабБухУчет = уп_ОбщегоНазначенияУчетРезервов.СформироватьСтруктуруТаблицыБУ();
	// регистр уп_ВыплатыОПС 
	Движения.уп_ВыплатыОПС.Записывать = Истина;
	Движения.уп_ВыплатыОПС.Очистить();
	// регистр уп_ПрочиеНачисленияОПС Расход
	Движения.уп_ПрочиеНачисленияОПС.Записывать = Истина;
	Движения.уп_ПрочиеНачисленияОПС.Очистить();
	// регистр уп_РезервыОПС Приход
	Движения.уп_РезервыОПС.Записывать = Истина;
	Движения.уп_РезервыОПС.Очистить();
	
	Движения.уп_АналитикаРезерваОПС.Записывать = Истина;
	Движения.уп_АналитикаРезерваОПС.Очистить();
	
	Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц.Записывать = Истина;
	Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц.Очистить();
	// регистр уп_ВозвратыПрочихНачисленийОПС Расход
	Движения.уп_ВозвратыПрочихНачисленийОПС.Записывать = Истина;
	Движения.уп_ВозвратыПрочихНачисленийОПС.Очистить();
	
	Движения.уп_ОтвергнутыеПлатежиПрочиеНачисленияОПС.Записывать = Истина;
	Движения.уп_ОтвергнутыеПлатежиПрочиеНачисленияОПС.Очистить();
	
	ПенсионныеПравила = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
	ПроводкиПоНачислению = ПенсионныеПравила.ПроводкиПоНачислению;
	ЛицевыеСчетаПоТипамВыплат = ПенсионныеПравила.ЛицевыеСчетаПоТипамВыплат; 
	
	//куда возвращаем
	ДатаНачалаРегистраВозвратов = Константы.уп_ДатаНачалаОтдельногоВеденияВозвратов.Получить();
	Если ЗначениеЗаполнено(ДатаНачалаРегистраВозвратов) И ДатаНачалаРегистраВозвратов<=Дата Тогда
		ИспользоватьРегистрВозвратов = Истина;
	Иначе
		ИспользоватьРегистрВозвратов = Ложь;
	КонецЕсли;
	ДатаНачалаУчетаОтвергнутыеПлатежи = Константы.уп_ДатаНачалаОтдельногоВеденияОтвергнутыхПлатежей.Получить();
	Если ЗначениеЗаполнено(ДатаНачалаУчетаОтвергнутыеПлатежи) И ДатаНачалаУчетаОтвергнутыеПлатежи<=Дата Тогда
		ИспользоватьОтвергнутыеПлатежи = Истина;
	Иначе
		ИспользоватьОтвергнутыеПлатежи = Ложь;
	КонецЕсли;
	ДатаНачалаВеденияРезерваНаследников = Константы.уп_ДатаНачалаВеденияРезерваНаследников.Получить();
	Если ЗначениеЗаполнено(ДатаНачалаВеденияРезерваНаследников) И Дата>=ДатаНачалаВеденияРезерваНаследников Тогда
		ВедетсяРезервНаследников = Истина;
	Иначе
		ВедетсяРезервНаследников = Ложь;
	КонецЕсли;	
	Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
		//надо проверить с разбивкой по типам сумм была выплата или нет
		НачалоУчетаПоТипамСумм = Константы.уп_ДатаНачалаУчетаПравопреемниковПоТипамСумм.Получить();
		Если ЗначениеЗаполнено(НачалоУчетаПоТипамСумм) Тогда
			#Удаление
			Если ЗначениеЗаполнено(Решение) И НачалоУчетаПоТипамСумм<=Решение.ДатаВыплаты Тогда 
				ВедетсяУчетПоТипамСумм = Истина;
			ИначеЕсли НЕ ЗначениеЗаполнено(Решение) И НачалоУчетаПоТипамСумм<=Дата Тогда
			#КонецУдаления
			#Вставка
			// +ХМНПФ 18.10.2019 ШадринАВ // ОбработкаПроведения() // №2516
			Если ЗначениеЗаполнено(НачалоУчетаПоТипамСумм) И (НачалоУчетаПоТипамСумм<=Решение.ДатаВыплаты ИЛИ НЕ ЗначениеЗаполнено(Решение.ДатаВыплаты)) Тогда
			// -ХМНПФ 18.10.2019 ШадринАВ // ОбработкаПроведения() // №2516
			#КонецВставки
				ВедетсяУчетПоТипамСумм = Истина;
			Иначе
				ВедетсяУчетПоТипамСумм = Ложь;
			КонецЕсли;	
		Иначе
			ВедетсяУчетПоТипамСумм = Ложь;
		КонецЕсли;
	Иначе
		ВедетсяУчетПоТипамСумм = Истина;
	КонецЕсли;	
	Если ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.НеисполненнаяВыплата Тогда
		Если НачалоДня(Дата) <> НачалоДня(ДокументОснование.Дата) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Даты документа выплаты и возврата должны совпадать", ЭтотОбъект, "Дата", "Объект", Отказ);
		КонецЕсли;
		Если ИспользоватьОтвергнутыеПлатежи Тогда
			//СформироватьДвиженияПоОтвергнутымПлатежамНеиполненнойВыплаты();
		КонецЕсли;
	ИначеЕсли ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.ОтвергнутыйПлатежВРезерв Тогда
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС Тогда
			ЗачислятьВРезервУмерших = ПроверитьНаЗачислятьВРезервУмерших(Организация, ДоговорОПС, Дата);
		Иначе
			ЗачислятьВРезервУмерших = Ложь;
		КонецЕсли;	
		СформироватьДвиженияПоОтвергнутымПлатежамВРезерв(Отказ, ЗачислятьВРезервУмерших);
	ИначеЕсли ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.ВозвращенныйПлатежВРезерв Тогда
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС Тогда
			ЗачислятьВРезервУмерших = ПроверитьНаЗачислятьВРезервУмерших(Организация, ДоговорОПС, Дата);
		Иначе
			ЗачислятьВРезервУмерших = Ложь;
		КонецЕсли;	
		СформироватьДвиженияПоВозвращеннымПлатежамВРезерв(Отказ, ЗачислятьВРезервУмерших);
	ИначеЕсли ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.ВозвратВНачисленные Тогда
		СформироватьДвиженияВозвратВНачисленные(Отказ);
	ИначеЕсли ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.ВозвратВРезерв Тогда
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС Тогда
			ЗачислятьВРезервУмерших = ПроверитьНаЗачислятьВРезервУмерших(Организация, ДоговорОПС, Дата);
		Иначе
			ЗачислятьВРезервУмерших = Ложь;
		КонецЕсли;	
		СформироватьДвиженияВозвратВРезерв(Отказ, ЗачислятьВРезервУмерших);
	ИначеЕсли ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.ВозвратНачислений Тогда
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС Тогда
			ЗачислятьВРезервУмерших = ПроверитьНаЗачислятьВРезервУмерших(Организация, ДоговорОПС, Дата);
		Иначе
			ЗачислятьВРезервУмерших = Ложь;
		КонецЕсли;	
		СформироватьДвиженияВозвратНачисленийВРезерв(Отказ, ЗачислятьВРезервУмерших);
	КонецЕсли;	
		
	//параметры выплат
	Если ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.НеисполненнаяВыплата
		или ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.ВозвратВНачисленные
		или ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.ВозвратВРезерв
		или ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.ВозвратНачислений Тогда
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			ТекПараметры = уп_ОПС.ПолучитьПараметрыВыплат(Дата, Организация, ДоговорОПС, Правопреемник, ТипВыплаты, ЛицевыеСчетаПоТипамВыплат);
		Иначе
			ТекПараметры = уп_ОПС.ПолучитьПараметрыВыплат(Дата, Организация, ДоговорОПС, Участник, ТипВыплаты, ЛицевыеСчетаПоТипамВыплат);
		КонецЕсли;
		
		#Вставка
		// +ХМНПФ 29.02.2016 ШадринАВ // ОбработкаПроведения() // №244
		Если ХМ_НеПрекращатьВыплаты = Ложь Тогда
		// -ХМНПФ 29.02.2016 ШадринАВ // ОбработкаПроведения() // №244
		#КонецВставки
		Если ЗначениеЗаполнено(ТекПараметры.ФормаВыплаты) Тогда
			Движение = Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц.Добавить();
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.Период = Дата;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
				Движение.ЗастрахованноеЛицо = Правопреемник;
			Иначе
				Движение.ЗастрахованноеЛицо = Участник;
			КонецЕсли;
			Движение.ТипВыплат = ТипВыплаты;
			Движение.ФормаВыплаты = ТекПараметры.ФормаВыплаты;
			Движение.НомерЛицевогоСчета = ТекПараметры.НомерЛицевогоСчета;
			Движение.НеДействует = Истина;
			Движение.Организация = Организация;
			Движение.РасчетныйСчет = ТекПараметры.РасчетныйСчет;
			Движение.Банк = ТекПараметры.Банк;
			Движение.ТипЛицевогоСчета = ТекПараметры.ТипЛицевогоСчета;
		#Вставка
		// +ХМНПФ 29.02.2016 ШадринАВ // ОбработкаПроведения() // №244
		КонецЕсли;
		// -ХМНПФ 29.02.2016 ШадринАВ // ОбработкаПроведения() // №244
		// +ХМНПФ 11.04.2018 КлименкоМИ // ОбработкаПроведения() // №1510
		ХМ_ОбработкаПроведения(Движения);
		// -ХМНПФ 11.04.2018 КлименкоМИ // ОбработкаПроведения() // №1510
		#КонецВставки
		КонецЕсли;
	КонецЕсли;
	
	Если ОтражатьВБухгалтерскомУчете    Тогда
		уп_ОбщегоНазначенияУчетРезервов.ДополнитьТаблицуБухУчета(Дата, ТабБухУчет, Ссылка, Отказ);
		уп_ОбщегоНазначенияУчетРезервов.СделатьДвиженияПоБухУчету(ЭтотОбъект, ТабБухУчет);
	КонецЕсли;
	
КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 20.02.2016 ШадринАВ // РассчитатьДокумент() // №223
	// ХМНПФ 29.02.2016 ШадринАВ // ОбработкаПроведения() // №244
	// ХМНПФ 29.02.2016 ШадринАВ // ОбработкаПроведения() // №252
	// ХМНПФ 23.03.2016 ШадринАВ // ОпределитьДокументВыплаты() // №278
	// ХМНПФ 23.03.2016 ШадринАВ // Новая ХМ_ОпределитьПлатежноеПоручение() // №278
	// ХМНПФ 11.04.2018 КлименкоМИ // Новая ХМ_ОбработкаПроведения() // №1510
	// ХМНПФ 11.04.2018 КлименкоМИ // ОбработкаПроведения() // №1510
	// ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияПоОтвергнутымПлатежамНеиполненнойВыплаты() // №277
	// ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияПоВозвращеннымПлатежамВРезерв() // №277
	// ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияПоОтвергнутымПлатежамВРезерв() // №277
	// ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияВозвратВНачисленные() // №277
	// ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияВозвратВРезерв() // №277
	// ХМНПФ 18.03.2016 ШадринАВ // СформироватьДвиженияВозвратНачисленийВРезерв() // №277
	// ХМНПФ 18.10.2019 ШадринАВ // ОбработкаПроведения() // №2516
	
	// ХМНПФ 15.11.2017 ШадринАВ // ОбработкаПроведения() // №1228 // не актуально с релиза 4.0.35.2
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура ХМОбработкаПроведения(Отказ, Режим) 
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Документы.уп_ВозвратПрочихНачисленийОПС.уп_ВозвратПрочихНачисленийОПС(ЭтотОбъект, Отказ, Режим);

КонецПроцедуры

