//https://redmine.npf.com/issues/4713

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
    ДопПараметры = Новый Структура("МассивДокументов",ПараметрКоманды);
 	Оповещение = Новый ОписаниеОповещения("ВыбратьКаталог", ЭтотОбъект, ДопПараметры);

	ОткрытьФорму("Документ.хм_ВыгрузкаОписиИПорученииПенсияНаПочту.Форма.ХМ_ПараметрыВыводаНаПочту", ДопПараметры, ,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
//ВыгрузитьФайлы-->
Процедура ВыбратьКаталог(ПараметрыВыводаНаПочту,ДопПараметры) Экспорт
	
	Если ПараметрыВыводаНаПочту = Неопределено Тогда
		Сообщить("Не выбраны параметры вывода на почту");
		Возврат;
	КонецЕсли;
	
	ДопПараметры.Вставить("ПараметрыВыводаНаПочту",ПараметрыВыводаНаПочту);
	
 	Оповещение = Новый ОписаниеОповещения("ПолучитьДанныеИзФормы", ЭтотОбъект, ДопПараметры);
	
	
	// Создаем диалог выбора файла в режиме выбора каталога
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Заголовок = "Выберите каталог для выгрузки файлов";
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.ПроверятьСуществованиеФайла = Ложь;

	// Устанавливаем начальный каталог (если нужно)
	// ДиалогВыбора.Каталог = "C:\Выгрузка\";
	
	// Создаем оповещение для обработки результата
	
	// Асинхронно открываем диалог
	ДиалогВыбора.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
//ВыгрузитьФайлы-->
Процедура ПолучитьДанныеИзФормы(Каталог,ДопПараметры) Экспорт
	Если Каталог = Неопределено Тогда
		Сообщить("Не выбран каталог выгрузки");
		Возврат;
	КонецЕсли;
	Для Каждого Документ Из ДопПараметры.МассивДокументов Цикл
		ВыгрузитьВПапку(Каталог[0], Документ, ДопПараметры.ПараметрыВыводаНаПочту);
		Оповестить("ХМ_ВыгрузкаОписиИПорученииПенсияНаПочту_Изменение",Документ);
	КонецЦикла;
	Сообщить("Выполнена выгрузка в каталог");
	Сообщить(Каталог[0]);
КонецПроцедуры

&НаКлиенте 
//ПолучитьДанныеИзФормы-->
Процедура ВыгрузитьВПапку(Каталог, Документ, ПараметрыВыводаНаПочту)

	ПапкаНаСервере = ПолучитьПапкуНаСервере(Документ, ПараметрыВыводаНаПочту);
	Для каждого ФайлНаСервере Из ПапкаНаСервере Цикл
		СохранитьФайлНаКлиенте(Каталог, ФайлНаСервере);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте 
Процедура СохранитьФайлНаКлиенте(Каталог, ДанныеФайла, ПроверитьЗаписьФайла = Истина)
	Если ЭтоАдресВременногоХранилища(ДанныеФайла.АдресВХ) Тогда
		Данные = ПолучитьИзВременногоХранилища(ДанныеФайла.АдресВХ);
		ИмяФайла = ДанныеФайла.ИмяФайла;
		
		ПутьДоКаталога = СокрЛП(Каталог) + ?(ЗначениеЗаполнено(ДанныеФайла.Подкаталог),"\" + ДанныеФайла.Подкаталог,"");
		ПутьДоФайла = ПутьДоКаталога + "\"+ ИмяФайла;
		
		СоздатьКаталог(ПутьДоКаталога);
		Данные.Записать(ПутьДоФайла);

		УдалитьИзВременногоХранилища(ДанныеФайла.АдресВХ);
		Если ПроверитьЗаписьФайла Тогда
			Док = Новый ТекстовыйДокумент;
			Док.Прочитать(ПутьДоФайла);
			ТекстФайла = Док.ПолучитьТекст();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры         

&НаСервере
Функция ПолучитьПапкуНаСервере(Документ, ПараметрыВыводаНаПочту) 
	Возврат Документы.хм_ВыгрузкаОписиИПорученииПенсияНаПочту.ПолучитьПапкуНаСервере(Документ,ПараметрыВыводаНаПочту);
КонецФункции
