&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("РежимУточнения") Тогда 
		РежимУточнения = Истина;
    	Элементы.НомерСчета.Видимость = Ложь;
 	КонецЕсли;
КонецПроцедуры       

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если РежимУточнения = Истина Тогда        
		ТребуемоеУточнение =  Новый Структура();
		ТребуемоеУточнение.Вставить("RM_Задача",Запись.RM_Задача);
		ТребуемоеУточнение.Вставить("Описание",Запись.Описание);
		ТребуемоеУточнение.Вставить("Документ",Запись.Документ);
		ЭтаФорма.Закрыть(ТребуемоеУточнение);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) 
	Если РежимУточнения = Истина Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуИзНавигационной(НС)
    
    ПерваяТочка = Найти(НС, "e1cib/data/");
    ВтораяТочка = Найти(НС, "?ref=");
    
    ПредставлениеТипа   = Сред(НС, ПерваяТочка + 11, ВтораяТочка - ПерваяТочка - 11);
    ШаблонЗначения = ЗначениеВСтрокуВнутр(ПредопределенноеЗначение(ПредставлениеТипа + ".ПустаяСсылка"));
    ЗначениеСсылки = СтрЗаменить(ШаблонЗначения, "00000000000000000000000000000000", Сред(НС, ВтораяТочка + 5));
    Возврат ЗначениеИзСтрокиВнутр(ЗначениеСсылки);
    
КонецФункции

&НаКлиенте
Процедура НавигационнаяСсылкаПриИзменении(Элемент)
	Запись.Документ = ПолучитьСсылкуИзНавигационной(НавСсылка);
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Запись.Документ) Тогда
		НавСсылка = ПолучитьНавигационнуюСсылку(Запись.Документ); 
	Иначе
		НавСсылка = ""; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура RM_ЗадачаПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Запись.Описание) ИЛИ НЕ ЗначениеЗаполнено(Запись.RM_Задача) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХМ_Кейсы.Описание КАК Описание
		|ИЗ
		|	РегистрСведений.ХМ_Кейсы КАК ХМ_Кейсы
		|ГДЕ
		|	ХМ_Кейсы.RM_Задача = &RM_Задача";
	
	Запрос.УстановитьПараметр("RM_Задача", Запись.RM_Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Запись.Описание = ВыборкаДетальныеЗаписи.Описание;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура RM_ЗадачаПриИзменении(Элемент)
	RM_ЗадачаПриИзмененииНаСервере();
КонецПроцедуры
