Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 10.01.2017 ШадринАВ // ПриСозданииНаСервере() // №746
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура ХМПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	Если Параметры.Ключ.Пустая() Тогда
		//это новый
		Объект.Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
		#Удаление 
		Объект.Ответственный = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнойОтветственный");
		#КонецУдаления 
		#Вставка 
		// +ХМНПФ 10.01.2017 ШадринАВ // ПриСозданииНаСервере() // №746
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		// -ХМНПФ 10.01.2017 ШадринАВ // ПриСозданииНаСервере() // №746 		
		#КонецВставки
		Объект.уп_ВидДеятельности = уп_ОсновнаяПоставкаСервер.ВидДеятельностиПоТипу(Перечисления.уп_ВидыДеятельности.ОПС);
	КонецЕсли;

	УправлениеФормой(ЭтаФорма);

	ОтражатьБУ = уп_ОбщегоНазначенияКлиентСервер.СформироватьНадписьБУ(Объект.ОтражатьВБухгалтерскомУчете,
	Объект.уп_ВидДеятельности, Объект.ПодразделениеОрганизации);

КонецПроцедуры
