
&НаСервере
&ИзменениеИКонтроль("ДополнитьПараметрыПоЗаявлению")
Процедура ХМДополнитьПараметрыПоЗаявлению(ПараметрыДокумента, ПараметрКоманды)
	#Вставка
	// ЛыткинАМ //https://redmine.npf.com/issues/4270
	ПараметрыДокумента.Вставить("Срок", ПараметрКоманды.СрокВыплат);
	#КонецВставки
	ПараметрыДокумента.Вставить("Участник", ПараметрКоманды.Участник);
	ПараметрыДокумента.Вставить("Заявление", ПараметрКоманды.Ссылка); 
	ПараметрыДокумента.Вставить("ДоговорПДС", ПараметрКоманды.ДоговорПДС); 
	ПараметрыДокумента.Вставить("Организация", ПараметрКоманды.Организация);
	ПараметрыДокумента.Вставить("НомерСчета", ПараметрКоманды.НомерСчета); 
	ПараметрыДокумента.Вставить("ДатаРасчета", ТекущаяДата()); 
	Если ПараметрКоманды.ТипПенсии = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда  
		ПараметрыДокумента.Вставить("ВариантРасчета", 1);  
	Иначе
		ПараметрыДокумента.Вставить("ВариантРасчета", 0);  
	КонецЕсли;	
КонецПроцедуры
