
Процедура ХМ_НеТиповыеИзменения()
	// +ХМНПФ 28.02.2017 Кучеров // Новая Функция ХМ_ПечатьWeb()
	// -ХМНПФ 28.02.2017 Кучеров // убрал директиву #На клиенте
КонецПроцедуры

// +ХМНПФ 28.0217 Кучеров// Новая Функция ХМ_ПечатьWeb()
// для получения печатных форм со стороны Web сервисов
// аналог процедуры печать типового варианта пользовательского интерфейса
Функция ХМ_ПечатьWeb(ИмяМакета) Экспорт
	ТабДокумент = Новый ТабличныйДокумент; // заглушка на случай если не сформируется ни чего 
	Если ИмяМакета = "Решение" тогда
		ТабДокумент = ПечатьРешенияОБОтказе();
	КонецЕсли;
	Возврат ТабДокумент;
КонецФункции 

&После("ПриУстановкеНовогоНомера")
Процедура ХМ_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	ХМ_ПодпискиНаСобытия.ХМ_НомераРешенийПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);	
КонецПроцедуры
