// ХМНПФ 10.02.2016 Шадрин А.В. // Новая ХМ_ПолучитьРазницуВМесяцах() // №194
Функция ХМ_ПолучитьРазницуВМесяцах(НачДата,КонДата)
	КолМес = 0;
	МинДата = НачалоМесяца(НачДата);
	МаксДата = НачалоМесяца(КонДата);
	Пока МинДата < МаксДата Цикл
		КолМес = КолМес + 1;
		МинДата = ДобавитьМесяц(МинДата, 1);
	КонецЦикла;
	Возврат КолМес;
КонецФункции

Процедура ХМ_НеТиповыеИзменения()

	// ХМНПФ 09.02.2016 Шадрин А.В. // РассчитатьКорректировкуДляЕдиновременной() // №192
	// ХМНПФ 09.02.2016 Шадрин А.В. // РассчитатьКорректировкуДляНакопительной() // №192
	// ХМНПФ 09.02.2016 Шадрин А.В. // РассчитатьКорректировкуДляСрочной() // №192
	// ХМНПФ 09.02.2016 Шадрин А.В. // НайтиДоговорыДляКорректировки() // №192
	// ХМНПФ 10.02.2016 Шадрин А.В. // СоздатьКорректировкуДляЕдиновременной() // №193
	// ХМНПФ 10.02.2016 Шадрин А.В. // СоздатьКорректировкуДляНакопительной() // №194
	// ХМНПФ 10.02.2016 Шадрин А.В. // Новая ХМ_ПолучитьРазницуВМесяцах() // №194
	// ХМНПФ 10.02.2016 Лыткин А.М. // СоздатьКорректировкуДляНакопительной() // №203
	// ХМНПФ 16.02.2016 Шадрин А.В. // СоздатьКорректировкуДляСрочной() // №208
	// ХМНПФ 09.03.2016 Шадрин А.В. // НайтиДоговорыДляКорректировки() // №259
	// ХМНПФ 09.03.2016 Шадрин А.В. // СоздатьКорректировкуДляЕдиновременной() // №262
	// ХМНПФ 10.03.2016 Лыткин А.М. // СоздатьКорректировкуДляСрочной// №264
	// ХМНПФ 18.03.2016 ЛыткинАМ // СоздатьКорректировкуДляСрочной() // №999
	// ХМНПФ 18.03.2016 ЛыткинАМ // СоздатьКорректировкуДляЕдиновременной() // №999
	// ХМНПФ 18.03.2016 ЛыткинАМ // СоздатьКорректировкуДляНакопительной() // №999
	// ХМНПФ 07.09.2016 ЛыткинАМ // РассчитатьКорректировкуДляЕдиновременной() // Снята с поддержки
	// ХМНПФ 07.09.2016 ЛыткинАМ // НайтиПоступленияНаСервереДляКорректировки() // Снята с поддержки
	// ХМНПФ 07.09.2016 ЛыткинАМ // СоздатьКорректировкуДляЕдиновременной() // Снята с поддержки
	
КонецПроцедуры

&ИзменениеИКонтроль("НайтиДоговорыДляКорректировки")
Процедура ХМНайтиДоговорыДляКорректировки(ДанныеОбъекта)
	ДанныеОбъекта.ДоговорыОПС.Очистить();
	Если ДанныеОбъекта.ТипВыплатногоПериода = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.ЕдиновременнаяВыплата Тогда
		РассчитатьКорректировкуДляЕдиновременной(ДанныеОбъекта);
	ИначеЕсли ДанныеОбъекта.ТипВыплатногоПериода = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.НЧТП Тогда
		РассчитатьКорректировкуДляНакопительной(ДанныеОбъекта);
	ИначеЕсли ДанныеОбъекта.ТипВыплатногоПериода = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.СрочнаяВыплата Тогда
		РассчитатьКорректировкуДляСрочной(ДанныеОбъекта);
	КонецЕсли;	
	#Вставка
	// +ХМНПФ 09.02.2016 Шадрин А.В. // НайтиДоговорыДляКорректировки() // №192
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗДоговорыОПС",ДанныеОбъекта.ДоговорыОПС.Выгрузить());
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ВЫБДоговорыОПС ИЗ &ТЗДоговорыОПС КАК ДоговорыОПС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ВЫБДоговорыОПС.*  ИЗ ВЫБДоговорыОПС КАК ВЫБДоговорыОПС
	|	ГДЕ ВЫБДоговорыОПС.ДоговорОПС.Участник.уп_ФизЛицо.уп_ДатаСмерти = ДАТАВРЕМЯ(1,1,1)
	// +ХМНПФ 09.03.2016 Шадрин А.В. // НайтиДоговорыДляКорректировки() // №259
	|	И НЕ ВЫБДоговорыОПС.СуммаКорректировки < 0";
	// -ХМНПФ 09.03.2016 Шадрин А.В. // НайтиДоговорыДляКорректировки() // №259
	ДанныеОбъекта.ДоговорыОПС.Загрузить(Запрос.Выполнить().Выгрузить());
	// -ХМНПФ 09.02.2016 Шадрин А.В. // НайтиДоговорыДляКорректировки() // №192
	#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("НайтиПоступленияНаСервереДляКорректировки")
Процедура ХМНайтиПоступленияНаСервереДляКорректировки(ДанныеОбъекта)
	
	ДанныеОбъекта.ДокументыПоступления.Очистить();
	ДанныеОбъекта.ДоговорыОПС.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_РегистрацияПоступленийОПС.Ссылка
		|ИЗ
		|	Документ.уп_РегистрацияПоступленийОПС КАК уп_РегистрацияПоступленийОПС
		|ГДЕ
		|	уп_РегистрацияПоступленийОПС.Проведен = ИСТИНА
		|	И уп_РегистрацияПоступленийОПС.Дата МЕЖДУ &Дата1 И &Дата2
		|	И уп_РегистрацияПоступленийОПС.Организация = &Организация
		#Удаление
		|	И уп_РегистрацияПоступленийОПС.ЭтоНераспределенныйПлатеж = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уп_ФинансовыйРеестр.Ссылка
		|ИЗ
		|	Документ.уп_ФинансовыйРеестр КАК уп_ФинансовыйРеестр
		|ГДЕ
		|	уп_ФинансовыйРеестр.Проведен = ИСТИНА
		|	И уп_ФинансовыйРеестр.Дата МЕЖДУ &Дата1 И &Дата2
		|	И уп_ФинансовыйРеестр.Организация = &Организация";	
		#КонецУдаления
		#Вставка
		|";
		Если ДанныеОбъекта.ХМ_ДоначислениеЕДВПокварталуВыплату Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_РегистрацияПоступленийОПС.Ссылка

		|ИЗ
		|	Документ.уп_РегистрацияПоступленийОПС КАК уп_РегистрацияПоступленийОПС
		|ГДЕ
		|	уп_РегистрацияПоступленийОПС.Проведен = ИСТИНА
		//		|	И уп_РегистрацияПоступленийОПС.Дата МЕЖДУ &Дата1 И &Дата2
		|	И уп_РегистрацияПоступленийОПС.Организация = &Организация
		|	И уп_РегистрацияПоступленийОПС.ДокументОснование.ХМ_КварталВыплаты <> &ХМ_КварталВыплаты";
		Запрос.УстановитьПараметр("ХМ_КварталВыплаты", Дата(1,1,1,0,0,0));
	КонецЕсли;	
	//	Если ДанныеОбъекта.ХМ_ДоначислениеЕДВПокварталуВыплату Тогда
	//		Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	уп_РегистрацияПоступленийОПС.Ссылка
	//		|ИЗ
	//		|	Документ.уп_РегистрацияПоступленийОПС КАК уп_РегистрацияПоступленийОПС
	//		|ГДЕ
	//		|	уп_РегистрацияПоступленийОПС.Проведен = ИСТИНА
	////		|	И уп_РегистрацияПоступленийОПС.Дата МЕЖДУ &Дата1 И &Дата2
	//		|	И уп_РегистрацияПоступленийОПС.Организация = &Организация
	//		|	И уп_РегистрацияПоступленийОПС.ДокументОснование.ХМ_КварталВыплаты >= &ХМ_КварталВыплаты";
	//		Запрос.УстановитьПараметр("ХМ_КварталВыплаты", НачалоГода(ТекущаяДата()));
	//	КонецЕсли;
		#КонецВставки

	Запрос.УстановитьПараметр("Дата1", НачалоДня(ДанныеОбъекта.ДатаДокументовПоступления));
	Запрос.УстановитьПараметр("Дата2", КонецДня(ДанныеОбъекта.ДатаДокументовПоступления));
	Запрос.УстановитьПараметр("Организация", ДанныеОбъекта.Организация);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтрТЧ = ДанныеОбъекта.ДокументыПоступления.Добавить();
		НовСтрТЧ.Документ = ВыборкаДетальныеЗаписи.Ссылка;
		НовСтрТЧ.Обрабатывать = Истина;
	КонецЦикла;

КонецПроцедуры

&ИзменениеИКонтроль("РассчитатьКорректировкуДляЕдиновременной")
Процедура ХМРассчитатьКорректировкуДляЕдиновременной(ДанныеОбъекта)
	//для каждого документа поступления составим список договоров
	//найдем в нем единовременные и заполним ТЧ
	СписокПоступленийДляОбработки = Новый СписокЗначений;
	
	Для Каждого стр из ДанныеОбъекта.ДокументыПоступления Цикл
		Если стр.Обрабатывать Тогда
			СписокПоступленийДляОбработки.Добавить(стр.Документ);
		КонецЕсли;	
	КонецЦикла;	
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			#Вставка
			|	&ПустаяДата КАК ДатаПоступления,
			#КонецВставки
			|	уп_РегистрацияПоступленийОПСДоговорыОПС.ДоговорОПС КАК ДоговорОПС,
			|	СУММА(ВЫБОР
			|			КОГДА уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы В (&СписокОсн)
			|				ТОГДА уп_РегистрацияПоступленийОПСДоговорыОПС.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК СуммаОсн,
			|	СУММА(ВЫБОР
			|			КОГДА НЕ уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы В (&СписокОсн)
			|				ТОГДА уп_РегистрацияПоступленийОПСДоговорыОПС.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК СуммаДоп
			|ПОМЕСТИТЬ ДоговорыДляПроверки
			|ИЗ
			|	Документ.уп_РегистрацияПоступленийОПС.ДоговорыОПС КАК уп_РегистрацияПоступленийОПСДоговорыОПС
			|ГДЕ
			#Вставка
			|	&ХМ_ДоначислениеЕДВПокварталуВыплату = ЛОЖЬ 
			|	И
			#КонецВставки
			|	уп_РегистрацияПоступленийОПСДоговорыОПС.Ссылка В(&СсылкаНаПоступление)
			|
			|СГРУППИРОВАТЬ ПО
			|	уп_РегистрацияПоступленийОПСДоговорыОПС.ДоговорОПС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			#Удаление
			|ВЫБРАТЬ
			|	уп_ФинансовыйРеестрДоговорыОПС.ДоговорОПС,
			|	СУММА(ВЫБОР
			|			КОГДА уп_ФинансовыйРеестрДоговорыОПС.ТипСуммы В (&СписокОсн)
			|				ТОГДА уп_ФинансовыйРеестрДоговорыОПС.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ),
			|	СУММА(ВЫБОР
			|			КОГДА НЕ уп_ФинансовыйРеестрДоговорыОПС.ТипСуммы В (&СписокОсн)
			|				ТОГДА уп_ФинансовыйРеестрДоговорыОПС.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ)
			|ИЗ
			|	Документ.уп_ФинансовыйРеестр.ДоговорыОПС КАК уп_ФинансовыйРеестрДоговорыОПС
			|ГДЕ
			|	уп_ФинансовыйРеестрДоговорыОПС.Ссылка В(&СсылкаНаПоступление)
			|
			|СГРУППИРОВАТЬ ПО
			|	уп_ФинансовыйРеестрДоговорыОПС.ДоговорОПС 
			|
			#КонецУдаления
			#Вставка
			|ВЫБРАТЬ
			|	&ПустаяДата,
			|	РезервыОПС.ДоговорОПС,
			|	СУММА(ВЫБОР
			|			КОГДА РезервыОПС.ТипСуммы В (&СписокОсн)
			|				ТОГДА РезервыОПС.СуммаОстаток
			|			ИНАЧЕ 0
			|		КОНЕЦ),
			|	СУММА(ВЫБОР
			|			КОГДА НЕ РезервыОПС.ТипСуммы В (&СписокОсн)
			|				ТОГДА РезервыОПС.СуммаОстаток
			|			ИНАЧЕ 0
			|		КОНЕЦ)
			|ИЗ
			|	РегистрНакопления.уп_РезервыОПС.Остатки(
			|			&ДатаОстатков,
			|			&ХМ_ДоначислениеЕДВПокварталуВыплату = ИСТИНА
			|				И ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)) КАК РезервыОПС
			|
			|СГРУППИРОВАТЬ ПО
			|	РезервыОПС.ДоговорОПС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЕСТЬNULL(уп_РегистрацияПоступленийОПСДоговорыОПС.Ссылка.ДокументОснование.ХМ_КварталВыплаты, &ПустаяДата),
			|	уп_РегистрацияПоступленийОПСДоговорыОПС.ДоговорОПС,
			|	СУММА(-1 * ВЫБОР
			|			КОГДА уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы В (&СписокОсн)
			|				ТОГДА уп_РегистрацияПоступленийОПСДоговорыОПС.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ),
			|	СУММА(-1 * ВЫБОР
			|			КОГДА НЕ уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы В (&СписокОсн)
			|				ТОГДА уп_РегистрацияПоступленийОПСДоговорыОПС.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ)
			|ИЗ
			|	Документ.уп_РегистрацияПоступленийОПС.ДоговорыОПС КАК уп_РегистрацияПоступленийОПСДоговорыОПС
			|ГДЕ
			|	&ХМ_ДоначислениеЕДВПокварталуВыплату = ИСТИНА
			|	И уп_РегистрацияПоступленийОПСДоговорыОПС.Ссылка В(&СсылкаНаПоступление)
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСТЬNULL(уп_РегистрацияПоступленийОПСДоговорыОПС.Ссылка.ДокументОснование.ХМ_КварталВыплаты, &ПустаяДата),
			|	уп_РегистрацияПоступленийОПСДоговорыОПС.ДоговорОПС
			|
			#КонецВставки
			|ИНДЕКСИРОВАТЬ ПО
			|	ДоговорОПС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
			|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Регистратор КАК Решение,
			|	ВЫБОР
			|		КОГДА уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Регистратор ССЫЛКА Документ.уп_РешениеОЕдиновременнойВыплате
			|			ТОГДА НЕ уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Регистратор.НеУчитыватьДопВзносы
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК УчитыватьДопВзносы,
			|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Период КАК ДатаНазначения
			|ПОМЕСТИТЬ ДоговорыДляЕдиновременнойВыплат
			|ИЗ
			|	РегистрСведений.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.СрезПоследних(
			|			&Дата,
			|			ДоговорОПС В
			|				(ВЫБРАТЬ
			|					ДоговорыДляПроверки.ДоговорОПС
			|				ИЗ
			|					ДоговорыДляПроверки)) КАК уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних
			|ГДЕ
			|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние В(&СписокЗакрытых)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДоговорОПС,
			|	Решение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
			|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние
			|ПОМЕСТИТЬ ЕдиновременнаяВыплатаПоДопЧасти
			|ИЗ
			|	РегистрСведений.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.СрезПоследних(
			|			&Дата,
			|			ДоговорОПС В
			|				(ВЫБРАТЬ
			|					ДоговорыДляПроверки.ДоговорОПС
			|				ИЗ
			|					ДоговорыДляПроверки)) КАК уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних
			|ГДЕ
			|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние В(&СписокЗакрытых)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДоговорОПС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_ПроизведенныеДоначисленияСрезПоследних.ДоговорОПС КАК ДоговорОПС,
			|	уп_ПроизведенныеДоначисленияСрезПоследних.Решение КАК Решение,
			|	уп_ПроизведенныеДоначисленияСрезПоследних.ПроизведеноДоначисление,
			|	уп_ПроизведенныеДоначисленияСрезПоследних.Период КАК ДатаДоначисления
			|ПОМЕСТИТЬ СделанныеДоначисления
			|ИЗ
			|	РегистрСведений.уп_ПроизведенныеДоначисления.СрезПоследних(
			|			&Дата,
			|			ДоговорОПС В
			|				(ВЫБРАТЬ
			|					ДоговорыДляПроверки.ДоговорОПС
			|				ИЗ
			|					ДоговорыДляПроверки)) КАК уп_ПроизведенныеДоначисленияСрезПоследних
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДоговорОПС,
			|	Решение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоговорыДляЕдиновременнойВыплат.ДоговорОПС КАК ДоговорОПС,
			|	ДоговорыДляЕдиновременнойВыплат.Решение,
			|	ДоговорыДляЕдиновременнойВыплат.УчитыватьДопВзносы,
			|	ЕСТЬNULL(СделанныеДоначисления.ПроизведеноДоначисление, ЛОЖЬ) КАК ПроизведеноДоначисление,
			|	СУММА(ДоговорыДляПроверки.СуммаОсн) КАК СуммаОсн,
			|	СУММА(ДоговорыДляПроверки.СуммаДоп) КАК СуммаДоп,
			|	СделанныеДоначисления.ДатаДоначисления,
			#Вставка
			|	ДоговорыДляЕдиновременнойВыплат.Решение.ДокументОснование.Дата КАК ХМ_ДатаЗаявленияПоРешению,
			#КонецВставки
			|	ДоговорыДляЕдиновременнойВыплат.ДатаНазначения
			|ПОМЕСТИТЬ СводнаяДоговорыПоЕВ
			|ИЗ
			|	ДоговорыДляЕдиновременнойВыплат КАК ДоговорыДляЕдиновременнойВыплат
			|		ЛЕВОЕ СОЕДИНЕНИЕ СделанныеДоначисления КАК СделанныеДоначисления
			|		ПО ДоговорыДляЕдиновременнойВыплат.ДоговорОПС = СделанныеДоначисления.ДоговорОПС
			|			И ДоговорыДляЕдиновременнойВыплат.Решение = СделанныеДоначисления.Решение
			|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговорыДляПроверки КАК ДоговорыДляПроверки
			|		ПО ДоговорыДляЕдиновременнойВыплат.ДоговорОПС = ДоговорыДляПроверки.ДоговорОПС
			#Вставка
			|ГДЕ
			|	ВЫБОР КОГДА ДоговорыДляПроверки.ДатаПоступления = &ПустаяДата ТОГДА ИСТИНА ИНАЧЕ 
			|	ДоговорыДляПроверки.ДатаПоступления>ДоговорыДляЕдиновременнойВыплат.Решение.ДокументОснование.Дата КОНЕЦ
			#КонецВставки
			|
			|СГРУППИРОВАТЬ ПО
			|	ДоговорыДляЕдиновременнойВыплат.ДоговорОПС,
			|	ДоговорыДляЕдиновременнойВыплат.Решение,
			|	ДоговорыДляЕдиновременнойВыплат.УчитыватьДопВзносы,
			|	СделанныеДоначисления.ДатаДоначисления,
			|	ДоговорыДляЕдиновременнойВыплат.ДатаНазначения,
			|	ЕСТЬNULL(СделанныеДоначисления.ПроизведеноДоначисление, ЛОЖЬ)
			#Вставка
			|	, ДоговорыДляЕдиновременнойВыплат.Решение.ДокументОснование.Дата
			#КонецВставки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДоговорОПС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СводнаяДоговорыПоЕВ.ДоговорОПС,
			#Вставка
			|	СводнаяДоговорыПоЕВ.ДоговорОПС.Участник КАК Участник,
			#КонецВставки
			|	СводнаяДоговорыПоЕВ.УчитыватьДопВзносы,
			|	СводнаяДоговорыПоЕВ.СуммаОсн,
			|	СводнаяДоговорыПоЕВ.СуммаДоп,
			|	ВЫБОР
			|		КОГДА СводнаяДоговорыПоЕВ.УчитыватьДопВзносы
			|			ТОГДА СводнаяДоговорыПоЕВ.СуммаОсн + СводнаяДоговорыПоЕВ.СуммаДоп
			|		ИНАЧЕ СводнаяДоговорыПоЕВ.СуммаОсн
			|	КОНЕЦ КАК СуммаКорректировки,
			|	ИСТИНА КАК Обрабатывать,
			|	СводнаяДоговорыПоЕВ.ПроизведеноДоначисление,
			|	СводнаяДоговорыПоЕВ.ДатаДоначисления КАК ДатаПоследнегоДоначисления,
			#Вставка
			|	СводнаяДоговорыПоЕВ.ХМ_ДатаЗаявленияПоРешению,
			#КонецВставки
			|	СводнаяДоговорыПоЕВ.ДатаНазначения КАК ДатаНазначенияВыплаты
			|ИЗ
			|	СводнаяДоговорыПоЕВ КАК СводнаяДоговорыПоЕВ"+?(ДанныеОбъекта.НеУчитыватьПроизведенныеДоначисления,"","
			|ГДЕ
			|	НЕ СводнаяДоговорыПоЕВ.ПроизведеноДоначисление")+" 
			|";
			
			СписокЗакрытых = Новый СписокЗначений;
			СписокЗакрытых.Добавить(Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.ЕдиновременнаяВыплата);
			Запрос.УстановитьПараметр("СписокЗакрытых",СписокЗакрытых);
			Запрос.УстановитьПараметр("Дата",КонецДня(ДанныеОбъекта.ДатаДокументовПоступления));
			Запрос.УстановитьПараметр("СсылкаНаПоступление",СписокПоступленийДляОбработки);
			
			#Вставка
			Запрос.УстановитьПараметр("ХМ_ДоначислениеЕДВПокварталуВыплату",ДанныеОбъекта.ХМ_ДоначислениеЕДВПокварталуВыплату);
			Запрос.УстановитьПараметр("ХМ_КварталВыплаты", НачалоГода(ТекущаяДата()));
			Запрос.УстановитьПараметр("ДатаОстатков",ТекущаяДата());
			Запрос.УстановитьПараметр("ПустаяДата",Дата(1,1,1,0,0,0));
			#КонецВставки
			СписокОсн = Новый СписокЗначений;
			СписокОсн.Добавить(Справочники.уп_ТипыСуммОПС.ВзносыФиз);
			СписокОсн.Добавить(Справочники.уп_ТипыСуммОПС.ИДФиз);
			Запрос.УстановитьПараметр("СписокОсн",СписокОсн);
			
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Пока Выборка.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(ДанныеОбъекта.ДоговорыОПС.Добавить(), Выборка);
				КонецЦикла;	
			КонецЕсли;	
КонецПроцедуры

&ИзменениеИКонтроль("РассчитатьКорректировкуДляНакопительной")
Процедура ХМРассчитатьКорректировкуДляНакопительной(ДанныеОбъекта)
	//для каждого документа поступления составим список договоров
	//найдем в нем НП и заполним ТЧ
	СписокПоступленийДляОбработки = Новый СписокЗначений;
	
	Для Каждого стр из ДанныеОбъекта.ДокументыПоступления Цикл
		Если стр.Обрабатывать Тогда
			СписокПоступленийДляОбработки.Добавить(стр.Документ);
		КонецЕсли;	
	КонецЦикла;	
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			
			"ВЫБРАТЬ
			|	уп_РегистрацияПоступленийОПСДоговорыОПС.ДоговорОПС КАК ДоговорОПС,
			|	СУММА(ВЫБОР
			|			КОГДА уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы В (&СписокОсн)
			|				ТОГДА уп_РегистрацияПоступленийОПСДоговорыОПС.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК СуммаОсн,
			|	СУММА(ВЫБОР
			|			КОГДА НЕ уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы В (&СписокОсн)
			|				ТОГДА уп_РегистрацияПоступленийОПСДоговорыОПС.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК СуммаДоп
			|ПОМЕСТИТЬ ДоговорыДляПроверки
			|ИЗ
			|	Документ.уп_РегистрацияПоступленийОПС.ДоговорыОПС КАК уп_РегистрацияПоступленийОПСДоговорыОПС
			|ГДЕ
			|	уп_РегистрацияПоступленийОПСДоговорыОПС.Ссылка В(&СсылкаНаПоступление)
			|
			|СГРУППИРОВАТЬ ПО
			|	уп_РегистрацияПоступленийОПСДоговорыОПС.ДоговорОПС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	уп_ФинансовыйРеестрДоговорыОПС.ДоговорОПС,
			|	СУММА(ВЫБОР
			|			КОГДА уп_ФинансовыйРеестрДоговорыОПС.ТипСуммы В (&СписокОсн)
			|				ТОГДА уп_ФинансовыйРеестрДоговорыОПС.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ),
			|	СУММА(ВЫБОР
			|			КОГДА НЕ уп_ФинансовыйРеестрДоговорыОПС.ТипСуммы В (&СписокОсн)
			|				ТОГДА уп_ФинансовыйРеестрДоговорыОПС.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ)
			|ИЗ
			|	Документ.уп_ФинансовыйРеестр.ДоговорыОПС КАК уп_ФинансовыйРеестрДоговорыОПС
			|ГДЕ
			|	уп_ФинансовыйРеестрДоговорыОПС.Ссылка В(&СсылкаНаПоступление)
			|
			|СГРУППИРОВАТЬ ПО
			|	уп_ФинансовыйРеестрДоговорыОПС.ДоговорОПС
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДоговорОПС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
			|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Регистратор КАК Решение,
			|	ВЫБОР
			|		КОГДА уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Регистратор ССЫЛКА Документ.уп_РешениеОНазначенииНЧТП
			|			ТОГДА НЕ уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Регистратор.УчитыватьДопВзносы
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК УчитыватьДопВзносы,
			|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Период КАК ДатаНазначения
			|ПОМЕСТИТЬ ДоговорыДляЕдиновременнойВыплат
			|ИЗ
			|	РегистрСведений.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.СрезПоследних(
			|			&Дата,
			|			ДоговорОПС В
			|				(ВЫБРАТЬ
			|					ДоговорыДляПроверки.ДоговорОПС
			|				ИЗ
			|					ДоговорыДляПроверки)) КАК уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних
			|ГДЕ
			|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние В(&СписокЗакрытых)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДоговорОПС,
			|	Решение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
			|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние
			|ПОМЕСТИТЬ ЕдиновременнаяВыплатаПоДопЧасти
			|ИЗ
			|	РегистрСведений.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.СрезПоследних(
			|			&Дата,
			|			ДоговорОПС В
			|				(ВЫБРАТЬ
			|					ДоговорыДляПроверки.ДоговорОПС
			|				ИЗ
			|					ДоговорыДляПроверки)) КАК уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних
			|ГДЕ
			|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние В(&СписокЗакрытых)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДоговорОПС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_ПроизведенныеДоначисленияСрезПоследних.ДоговорОПС КАК ДоговорОПС,
			|	уп_ПроизведенныеДоначисленияСрезПоследних.Решение КАК Решение,
			|	уп_ПроизведенныеДоначисленияСрезПоследних.ПроизведеноДоначисление,
			|	уп_ПроизведенныеДоначисленияСрезПоследних.Период КАК ДатаДоначисления
			|ПОМЕСТИТЬ СделанныеДоначисления
			|ИЗ
			|	РегистрСведений.уп_ПроизведенныеДоначисления.СрезПоследних(
			|			&Дата,
			|			ДоговорОПС В
			|				(ВЫБРАТЬ
			|					ДоговорыДляПроверки.ДоговорОПС
			|				ИЗ
			|					ДоговорыДляПроверки)) КАК уп_ПроизведенныеДоначисленияСрезПоследних
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДоговорОПС,
			|	Решение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоговорыДляЕдиновременнойВыплат.ДоговорОПС КАК ДоговорОПС,
			|	ДоговорыДляЕдиновременнойВыплат.Решение,
			|	ДоговорыДляЕдиновременнойВыплат.УчитыватьДопВзносы КАК УчитыватьДопВзносы1,
			|	ЕСТЬNULL(СделанныеДоначисления.ПроизведеноДоначисление, ЛОЖЬ) КАК ПроизведеноДоначисление,
			|	ДоговорыДляПроверки.СуммаОсн,
			|	ДоговорыДляПроверки.СуммаДоп,
			|	ВЫБОР
			|		КОГДА ЕдиновременнаяВыплатаПоДопЧасти.Состояние ЕСТЬ NULL
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК УчитыватьДопВзносы,
			|	ДоговорыДляЕдиновременнойВыплат.ДатаНазначения,
			#Вставка
			// +ХМНПФ 09.02.2016 Шадрин А.В. // РассчитатьКорректировкуДляНакопительной() // №192
			|	ДоговорыДляЕдиновременнойВыплат.Решение.ДокументОснование.Дата КАК ХМ_ДатаЗаявленияПоРешению,
			// -ХМНПФ 09.02.2016 Шадрин А.В. // РассчитатьКорректировкуДляНакопительной() // №192
			#КонецВставки
			|	СделанныеДоначисления.ДатаДоначисления
			|ПОМЕСТИТЬ СводнаяДоговорыПоЕВ
			|ИЗ
			|	ДоговорыДляЕдиновременнойВыплат КАК ДоговорыДляЕдиновременнойВыплат
			|		ЛЕВОЕ СОЕДИНЕНИЕ СделанныеДоначисления КАК СделанныеДоначисления
			|		ПО ДоговорыДляЕдиновременнойВыплат.ДоговорОПС = СделанныеДоначисления.ДоговорОПС
			|			И ДоговорыДляЕдиновременнойВыплат.Решение = СделанныеДоначисления.Решение
			|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговорыДляПроверки КАК ДоговорыДляПроверки
			|		ПО ДоговорыДляЕдиновременнойВыплат.ДоговорОПС = ДоговорыДляПроверки.ДоговорОПС
			|		ЛЕВОЕ СОЕДИНЕНИЕ ЕдиновременнаяВыплатаПоДопЧасти КАК ЕдиновременнаяВыплатаПоДопЧасти
			|		ПО ДоговорыДляЕдиновременнойВыплат.ДоговорОПС = ЕдиновременнаяВыплатаПоДопЧасти.ДоговорОПС
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДоговорОПС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СводнаяДоговорыПоЕВ.ДоговорОПС,
			|	СводнаяДоговорыПоЕВ.СуммаОсн,
			|	СводнаяДоговорыПоЕВ.СуммаДоп,
			|	ИСТИНА КАК Обрабатывать,
			|	СводнаяДоговорыПоЕВ.УчитыватьДопВзносы,
			|	ВЫБОР
			|		КОГДА СводнаяДоговорыПоЕВ.УчитыватьДопВзносы
			|			ТОГДА СводнаяДоговорыПоЕВ.СуммаОсн + СводнаяДоговорыПоЕВ.СуммаДоп
			|		ИНАЧЕ СводнаяДоговорыПоЕВ.СуммаОсн
			|	КОНЕЦ КАК СуммаКорректировки,
			|	СводнаяДоговорыПоЕВ.ПроизведеноДоначисление,
			|	СводнаяДоговорыПоЕВ.ДатаНазначения КАК ДатаНазначенияВыплаты,
			#Вставка
			// +ХМНПФ 09.02.2016 Шадрин А.В. // РассчитатьКорректировкуДляНакопительной() // №192
			|	СводнаяДоговорыПоЕВ.ХМ_ДатаЗаявленияПоРешению,
			// -ХМНПФ 09.02.2016 Шадрин А.В. // РассчитатьКорректировкуДляНакопительной() // №192
			#КонецВставки
			|	СводнаяДоговорыПоЕВ.ДатаДоначисления КАК ДатаПоследнегоДоначисления
			|ИЗ
			|	СводнаяДоговорыПоЕВ КАК СводнаяДоговорыПоЕВ"+?(ДанныеОбъекта.НеУчитыватьПроизведенныеДоначисления,"","
			|ГДЕ
			|	НЕ СводнаяДоговорыПоЕВ.ПроизведеноДоначисление")+"
			|";
			
			СписокЗакрытых = Новый СписокЗначений;
			СписокЗакрытых.Добавить(Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.НЧТП);
			Запрос.УстановитьПараметр("СписокЗакрытых",СписокЗакрытых);
			Запрос.УстановитьПараметр("Дата",КонецДня(ДанныеОбъекта.ДатаДокументовПоступления));
			Запрос.УстановитьПараметр("СсылкаНаПоступление",СписокПоступленийДляОбработки);
			
			СписокОсн = Новый СписокЗначений;
			СписокОсн.Добавить(Справочники.уп_ТипыСуммОПС.ВзносыФиз);
			СписокОсн.Добавить(Справочники.уп_ТипыСуммОПС.ИДФиз);
			Запрос.УстановитьПараметр("СписокОсн",СписокОсн);
			
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.СуммаОсн<>0 ИЛИ (Выборка.УчитыватьДопВзносы И Выборка.СуммаДоп<>0) Тогда 
						ЗаполнитьЗначенияСвойств(ДанныеОбъекта.ДоговорыОПС.Добавить(), Выборка);
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;	
КонецПроцедуры

&ИзменениеИКонтроль("РассчитатьКорректировкуДляСрочной")
Процедура ХМРассчитатьКорректировкуДляСрочной(ДанныеОбъекта)
	//для каждого документа поступления составим список договоров
	//найдем в нем НП и заполним ТЧ
	СписокПоступленийДляОбработки = Новый СписокЗначений;
	
	Для Каждого стр из ДанныеОбъекта.ДокументыПоступления Цикл
		Если стр.Обрабатывать Тогда
			СписокПоступленийДляОбработки.Добавить(стр.Документ);
		КонецЕсли;	
	КонецЦикла;	
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			
			"ВЫБРАТЬ
			|	уп_РегистрацияПоступленийОПСДоговорыОПС.ДоговорОПС КАК ДоговорОПС,
			|	СУММА(ВЫБОР
			|			КОГДА уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы В (&СписокОсн)
			|				ТОГДА 0
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК СуммаОсн,
			|	СУММА(ВЫБОР
			|			КОГДА НЕ уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы В (&СписокОсн)
			|				ТОГДА уп_РегистрацияПоступленийОПСДоговорыОПС.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК СуммаДоп
			|ПОМЕСТИТЬ ДоговорыДляПроверки
			|ИЗ
			|	Документ.уп_РегистрацияПоступленийОПС.ДоговорыОПС КАК уп_РегистрацияПоступленийОПСДоговорыОПС
			|ГДЕ
			|	уп_РегистрацияПоступленийОПСДоговорыОПС.Ссылка В(&СсылкаНаПоступление)
			|
			|СГРУППИРОВАТЬ ПО
			|	уп_РегистрацияПоступленийОПСДоговорыОПС.ДоговорОПС
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	уп_ФинансовыйРеестрДоговорыОПС.ДоговорОПС,
			|	СУММА(ВЫБОР
			|			КОГДА уп_ФинансовыйРеестрДоговорыОПС.ТипСуммы В (&СписокОсн)
			|				ТОГДА 0
			|			ИНАЧЕ 0
			|		КОНЕЦ),
			|	СУММА(ВЫБОР
			|			КОГДА НЕ уп_ФинансовыйРеестрДоговорыОПС.ТипСуммы В (&СписокОсн)
			|				ТОГДА уп_ФинансовыйРеестрДоговорыОПС.Сумма
			|			ИНАЧЕ 0
			|		КОНЕЦ)
			|ИЗ
			|	Документ.уп_ФинансовыйРеестр.ДоговорыОПС КАК уп_ФинансовыйРеестрДоговорыОПС
			|ГДЕ
			|	уп_ФинансовыйРеестрДоговорыОПС.Ссылка В(&СсылкаНаПоступление)
			|
			|СГРУППИРОВАТЬ ПО
			|	уп_ФинансовыйРеестрДоговорыОПС.ДоговорОПС
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДоговорОПС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
			|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.Регистратор КАК Решение,
			|	ИСТИНА КАК УчитыватьДопВзносы,
			|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.Период КАК ДатаНазначения
			|ПОМЕСТИТЬ ДоговорыДляЕдиновременнойВыплат
			|ИЗ
			|	РегистрСведений.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.СрезПоследних(
			|			&Дата,
			|			ДоговорОПС В
			|				(ВЫБРАТЬ
			|					ДоговорыДляПроверки.ДоговорОПС
			|				ИЗ
			|					ДоговорыДляПроверки)) КАК уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних
			|ГДЕ
			|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние В(&СписокЗакрытых)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДоговорОПС,
			|	Решение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_ПроизведенныеДоначисленияСрезПоследних.ДоговорОПС КАК ДоговорОПС,
			|	уп_ПроизведенныеДоначисленияСрезПоследних.Решение КАК Решение,
			|	уп_ПроизведенныеДоначисленияСрезПоследних.ПроизведеноДоначисление,
			|	уп_ПроизведенныеДоначисленияСрезПоследних.Период КАК ДатаДоначисления
			|ПОМЕСТИТЬ СделанныеДоначисления
			|ИЗ
			|	РегистрСведений.уп_ПроизведенныеДоначисления.СрезПоследних(
			|			&Дата,
			|			ДоговорОПС В
			|				(ВЫБРАТЬ
			|					ДоговорыДляПроверки.ДоговорОПС
			|				ИЗ
			|					ДоговорыДляПроверки)) КАК уп_ПроизведенныеДоначисленияСрезПоследних
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДоговорОПС,
			|	Решение
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДоговорыДляЕдиновременнойВыплат.ДоговорОПС КАК ДоговорОПС,
			|	ДоговорыДляЕдиновременнойВыплат.Решение,
			|	ДоговорыДляЕдиновременнойВыплат.УчитыватьДопВзносы,
			|	ЕСТЬNULL(СделанныеДоначисления.ПроизведеноДоначисление, ЛОЖЬ) КАК ПроизведеноДоначисление,
			|	ДоговорыДляПроверки.СуммаОсн,
			|	ДоговорыДляПроверки.СуммаДоп,
			|	ДоговорыДляЕдиновременнойВыплат.ДатаНазначения,
			#Вставка
			// +ХМНПФ 09.02.2016 Шадрин А.В. // РассчитатьКорректировкуДляСрочной() // №192
			|	ДоговорыДляЕдиновременнойВыплат.Решение.ДокументОснование.Дата КАК ХМ_ДатаЗаявленияПоРешению,
			// -ХМНПФ 09.02.2016 Шадрин А.В. // РассчитатьКорректировкуДляСрочной() // №192
			#КонецВставки
			|	СделанныеДоначисления.ДатаДоначисления
			|ПОМЕСТИТЬ СводнаяДоговорыПоЕВ
			|ИЗ
			|	ДоговорыДляЕдиновременнойВыплат КАК ДоговорыДляЕдиновременнойВыплат
			|		ЛЕВОЕ СОЕДИНЕНИЕ СделанныеДоначисления КАК СделанныеДоначисления
			|		ПО ДоговорыДляЕдиновременнойВыплат.ДоговорОПС = СделанныеДоначисления.ДоговорОПС
			|			И ДоговорыДляЕдиновременнойВыплат.Решение = СделанныеДоначисления.Решение
			|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговорыДляПроверки КАК ДоговорыДляПроверки
			|		ПО ДоговорыДляЕдиновременнойВыплат.ДоговорОПС = ДоговорыДляПроверки.ДоговорОПС
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ДоговорОПС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СводнаяДоговорыПоЕВ.ДоговорОПС,
			|	СводнаяДоговорыПоЕВ.УчитыватьДопВзносы,
			|	СводнаяДоговорыПоЕВ.СуммаОсн,
			|	СводнаяДоговорыПоЕВ.СуммаДоп,
			|	ВЫБОР
			|		КОГДА СводнаяДоговорыПоЕВ.УчитыватьДопВзносы
			|			ТОГДА СводнаяДоговорыПоЕВ.СуммаОсн + СводнаяДоговорыПоЕВ.СуммаДоп
			|		ИНАЧЕ СводнаяДоговорыПоЕВ.СуммаОсн
			|	КОНЕЦ КАК СуммаКорректировки,
			|	ИСТИНА КАК Обрабатывать,
			|	СводнаяДоговорыПоЕВ.ПроизведеноДоначисление,
			|	СводнаяДоговорыПоЕВ.ДатаНазначения КАК ДатаНазначенияВыплаты,
			#Вставка
			// +ХМНПФ 09.02.2016 Шадрин А.В. // РассчитатьКорректировкуДляСрочной() // №192
			|	СводнаяДоговорыПоЕВ.ХМ_ДатаЗаявленияПоРешению,
			// -ХМНПФ 09.02.2016 Шадрин А.В. // РассчитатьКорректировкуДляСрочной() // №192
			#КонецВставки
			|	СводнаяДоговорыПоЕВ.ДатаДоначисления КАК ДатаПоследнегоДоначисления
			|ИЗ
			|	СводнаяДоговорыПоЕВ КАК СводнаяДоговорыПоЕВ"+?(ДанныеОбъекта.НеУчитыватьПроизведенныеДоначисления,"","
			|ГДЕ
			|	НЕ СводнаяДоговорыПоЕВ.ПроизведеноДоначисление")+"
			|";
			
			СписокЗакрытых = Новый СписокЗначений;
			СписокЗакрытых.Добавить(Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.СрочнаяВыплата);
			Запрос.УстановитьПараметр("СписокЗакрытых",СписокЗакрытых);
			Запрос.УстановитьПараметр("Дата",КонецДня(ДанныеОбъекта.ДатаДокументовПоступления));
			Запрос.УстановитьПараметр("СсылкаНаПоступление",СписокПоступленийДляОбработки);
			
			СписокОсн = Новый СписокЗначений;
			СписокОсн.Добавить(Справочники.уп_ТипыСуммОПС.ВзносыФиз);
			СписокОсн.Добавить(Справочники.уп_ТипыСуммОПС.ИДФиз);
			Запрос.УстановитьПараметр("СписокОсн",СписокОсн);
			
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.СуммаДоп<>0 Тогда
						ЗаполнитьЗначенияСвойств(ДанныеОбъекта.ДоговорыОПС.Добавить(), Выборка);
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;	
КонецПроцедуры

&ИзменениеИКонтроль("СоздатьКорректировкуДляЕдиновременной")
Процедура ХМСоздатьКорректировкуДляЕдиновременной(ДанныеОбъекта)
	
	ТабКорректировок = Новый ТаблицаЗначений;
	ТабКорректировок.Колонки.Добавить("ДоговорОПС", Новый ОписаниеТипов("СправочникСсылка.уп_ДоговорыОПС"));
	ТабКорректировок.Колонки.Добавить("УчитыватьДопВзносы", Новый ОписаниеТипов("Булево"));
	
	ТабПоступлений = Новый ТаблицаЗначений;
	ТабПоступлений.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.уп_РегистрацияПоступленийОПС, ДокументСсылка.уп_ФинансовыйРеестр"));
	
	Для Каждого стр из ДанныеОбъекта.ДоговорыОПС Цикл
		Если стр.Обрабатывать Тогда
			НовСтрТабКорректировок = ТабКорректировок.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрТабКорректировок, стр);
		КонецЕсли;	
	КонецЦикла;	
	
	Для Каждого стр из ДанныеОбъекта.ДокументыПоступления Цикл
		Если стр.Обрабатывать Тогда
			НовСтрТабПоступлений = ТабПоступлений.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрТабПоступлений, стр);
		КонецЕсли;	
	КонецЦикла;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТакКорректировок.ДоговорОПС КАК ДоговорОПС,
		|	ТакКорректировок.УчитыватьДопВзносы
		|ПОМЕСТИТЬ СписокЗЛ
		|ИЗ
		|	&ТабКорректировок КАК ТакКорректировок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабПоступлений.Документ КАК ДокументПоступления
		|ПОМЕСТИТЬ ТабПоступлений
		|ИЗ
		|	&ТабПоступлений КАК ТабПоступлений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		#Вставка
		|	&ПустаяДата КАК ДатаПоступления,
		#КонецВставки
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.ДоговорОПС,
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы,
		|	СУММА(уп_РегистрацияПоступленийОПСДоговорыОПС.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ТаблицаСумм
		|ИЗ
		|	Документ.уп_РегистрацияПоступленийОПС.ДоговорыОПС КАК уп_РегистрацияПоступленийОПСДоговорыОПС
		|ГДЕ
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.Ссылка В
		|			(ВЫБРАТЬ
		|				ТабПоступлений.ДокументПоступления
		|			ИЗ
		|				ТабПоступлений)
		#Вставка
		|	И &ХМ_УчитыватьОстатки = ЛОЖЬ
		#КонецВставки
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.ДоговорОПС,
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		#Удаление
		|ВЫБРАТЬ
		|	уп_ФинансовыйРеестрДоговорыОПС.ДоговорОПС,
		|	уп_ФинансовыйРеестрДоговорыОПС.ТипСуммы,
		|	СУММА(уп_ФинансовыйРеестрДоговорыОПС.Сумма)
		|ИЗ
		|	Документ.уп_ФинансовыйРеестр.ДоговорыОПС КАК уп_ФинансовыйРеестрДоговорыОПС
		|ГДЕ
		|	уп_ФинансовыйРеестрДоговорыОПС.Ссылка В
		|			(ВЫБРАТЬ
		|				ТабПоступлений.ДокументПоступления
		|			ИЗ
		|				ТабПоступлений)
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_ФинансовыйРеестрДоговорыОПС.ДоговорОПС,
		|	уп_ФинансовыйРеестрДоговорыОПС.ТипСуммы
		|;
		#КонецУдаления
		#Вставка
		|ВЫБРАТЬ
		|	&ПустаяДата,
		|	РезервыОПС.ДоговорОПС,
		|	РезервыОПС.ТипСуммы,
		|	СУММА(РезервыОПС.СуммаОстаток)
		|ИЗ
		|	РегистрНакопления.уп_РезервыОПС.Остатки(
		|			&ДатаОстатков,
		|			&ХМ_УчитыватьОстатки = ИСТИНА
		|				И ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)
		|				И ДоговорОПС В
		|					(ВЫБРАТЬ
		|						СписокЗЛ.ДоговорОПС
		|					ИЗ
		|						СписокЗЛ)) КАК РезервыОПС
		|
		|СГРУППИРОВАТЬ ПО
		|	РезервыОПС.ДоговорОПС,
		|	РезервыОПС.ТипСуммы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(уп_РегистрацияПоступленийОПСДоговорыОПС.Ссылка.ДокументОснование.ХМ_КварталВыплаты, &ПустаяДата),
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.ДоговорОПС,
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы,
		|	СУММА(-1 * уп_РегистрацияПоступленийОПСДоговорыОПС.Сумма)
		|ИЗ
		|	Документ.уп_РегистрацияПоступленийОПС.ДоговорыОПС КАК уп_РегистрацияПоступленийОПСДоговорыОПС
		|ГДЕ
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.Ссылка В
		|			(ВЫБРАТЬ
		|				ТабПоступлений.ДокументПоступления
		|			ИЗ
		|				ТабПоступлений)
		|	И &ХМ_ДоначислениеЕДВПокварталуВыплату = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(уп_РегистрацияПоступленийОПСДоговорыОПС.Ссылка.ДокументОснование.ХМ_КварталВыплаты, &ПустаяДата),
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.ДоговорОПС,
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы
		|;
		#КонецВставки
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
		|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Регистратор КАК Решение,
		|	ВЫБОР
		|		КОГДА уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Регистратор ССЫЛКА Документ.уп_РешениеОЕдиновременнойВыплате
		|			ТОГДА уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Регистратор.ДокументОснование
		|		ИНАЧЕ &ПустоеЗаявление
		|	КОНЕЦ КАК Заявление
		|ПОМЕСТИТЬ ДанныеОРегистрирующихДокументах
		|ИЗ
		|	РегистрСведений.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.СрезПоследних(
		|			&Дата,
		|			ДоговорОПС В
		|					(ВЫБРАТЬ
		|						СписокЗЛ.ДоговорОПС
		|					ИЗ
		|						СписокЗЛ)
		|				И Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостояниеЧастиПенсионногоСчетаОПС.ЕдиновременнаяВыплата)) КАК уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокЗЛ.ДоговорОПС КАК ДоговорОПС,
		|	СписокЗЛ.УчитыватьДопВзносы,
		|	ТаблицаСумм.ТипСуммы,
		#Вставка
		|	СУММА(ВЫБОР
		|			КОГДА НЕ ТаблицаСумм.ТипСуммы В (&СписокОсн)
		|					И НЕ СписокЗЛ.УчитыватьДопВзносы
		|				ТОГДА 0
		|			ИНАЧЕ ТаблицаСумм.Сумма
		|		КОНЕЦ) КАК Сумма,
		#КонецВставки
		#Удаление
		|	ВЫБОР
		|		КОГДА НЕ ТаблицаСумм.ТипСуммы В (&СписокОсн)
		|				И НЕ СписокЗЛ.УчитыватьДопВзносы
		|			ТОГДА 0
		|		ИНАЧЕ ТаблицаСумм.Сумма
		|	КОНЕЦ КАК Сумма,
		#КонецУдаления
		|	ДанныеОРегистрирующихДокументах.Решение,
		|	ДанныеОРегистрирующихДокументах.Заявление
		|ИЗ
		|	СписокЗЛ КАК СписокЗЛ
		#Вставка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОРегистрирующихДокументах КАК ДанныеОРегистрирующихДокументах
		|		ПО СписокЗЛ.ДоговорОПС = ДанныеОРегистрирующихДокументах.ДоговорОПС
		#КонецВставки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСумм КАК ТаблицаСумм
		|		ПО СписокЗЛ.ДоговорОПС = ТаблицаСумм.ДоговорОПС
		#Удаление
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОРегистрирующихДокументах КАК ДанныеОРегистрирующихДокументах
		|		ПО СписокЗЛ.ДоговорОПС = ДанныеОРегистрирующихДокументах.ДоговорОПС
		#КонецУдаления
		#Вставка
		|			И (ВЫБОР
		|				КОГДА ТаблицаСумм.ДатаПоступления = &ПустаяДата
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ТаблицаСумм.ДатаПоступления > ДанныеОРегистрирующихДокументах.Решение.ДокументОснование.Дата
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокЗЛ.ДоговорОПС,
		|	СписокЗЛ.УчитыватьДопВзносы,
		|	ТаблицаСумм.ТипСуммы,
		|	ДанныеОРегистрирующихДокументах.Решение,
		|	ДанныеОРегистрирующихДокументах.Заявление
		#КонецВставки
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	ДоговорОПС";
		
		#Вставка
		Запрос.УстановитьПараметр("ХМ_УчитыватьОстатки",ДанныеОбъекта.ХМ_УчитыватьОстатки);
		Запрос.УстановитьПараметр("ХМ_ДоначислениеЕДВПокварталуВыплату",ДанныеОбъекта.ХМ_ДоначислениеЕДВПокварталуВыплату);
		// +ХМНПФ 10.02.2016 Шадрин А.В. // СоздатьКорректировкуДляЕдиновременной() // №193
		Запрос.УстановитьПараметр("ДатаОстатков",ТекущаяДата());
		// -ХМНПФ 10.02.2016 Шадрин А.В. // СоздатьКорректировкуДляЕдиновременной() // №193
		Запрос.УстановитьПараметр("ПустаяДата",Дата(1,1,1,0,0,0));
		#КонецВставки
		Запрос.УстановитьПараметр("ТабКорректировок",ТабКорректировок);
		Запрос.УстановитьПараметр("ТабПоступлений",ТабПоступлений);
		Запрос.УстановитьПараметр("Дата",ДанныеОбъекта.ДатаФормированияДокументов);
		СписокОсн = Новый СписокЗначений;
		СписокОсн.Добавить(Справочники.уп_ТипыСуммОПС.ВзносыФиз);
		СписокОсн.Добавить(Справочники.уп_ТипыСуммОПС.ИДФиз);
		Запрос.УстановитьПараметр("СписокОсн",СписокОсн);
		Запрос.УстановитьПараметр("ПустоеЗаявление",Документы.уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ПустаяСсылка());
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			ВыборкаДоговоров = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДоговоров.Следующий() Цикл
				Если ВыборкаДоговоров.Сумма <> 0 Тогда
					//создаем документ
					НовыйДок = Документы.уп_РешениеОЕдиновременнойВыплате.СоздатьДокумент();
					НовыйДок.Дата = ДанныеОбъекта.ДатаФормированияДокументов;
					#Удаление
					НовыйДок.ДатаВыплаты = ДанныеОбъекта.ДатаФормированияДокументов;
					#КонецУдаления
					#Вставка
					НовыйДок.Дата = ДанныеОбъекта.ДатаФормированияДокументов;
					// ХМНПФ 09.03.2016 Шадрин А.В. // СоздатьКорректировкуДляЕдиновременной() // №262
					НовыйДок.ДатаВыплаты = Константы.ХМ_ДатаСледующейВыплаты.Получить();
					// ХМНПФ 09.03.2016 Шадрин А.В. // СоздатьКорректировкуДляЕдиновременной() // №262
					#КонецВставки
					НовыйДок.ДоговорОПС = ВыборкаДоговоров.ДоговорОПС;
					НовыйДок.ДоначислениеПоПереданномуВзносуИзПФР = Истина;
					НовыйДок.Организация = ДанныеОбъекта.Организация;
					НовыйДок.Ответственный = ДанныеОбъекта.Ответственный;
					НовыйДок.ОтражатьВБухгалтерскомУчете = ДанныеОбъекта.ОтражатьВБухгалтерскомУчете;
					НовыйДок.уп_ВидДеятельности = ДанныеОбъекта.уп_ВидДеятельности;
					НовыйДок.СуммаНаСчете = ВыборкаДоговоров.Сумма;
					НовыйДок.Участник = ВыборкаДоговоров.ДоговорОПС.Участник;
					НовыйДок.ПодразделениеОрганизации = ВыборкаДоговоров.ДоговорОПС.ПодразделениеБУ;
					
					Выборка = ВыборкаДоговоров.Выбрать();
					НомерСтр = 0;
					#Вставка
					НуженДокумент = Ложь;
					#КонецВставки
					Пока Выборка.Следующий() Цикл
						НомерСтр = НомерСтр+1;
						Если НомерСтр = 1 Тогда
							//заканчиваем заполнять шапку
							НовыйДок.ДокументОснование = Выборка.Заявление;
							НовыйДок.НеУчитыватьДопВзносы = НЕ Выборка.УчитыватьДопВзносы;
						КонецЕсли;
						Если Выборка.Сумма<>0 Тогда
							НовСтрРасшифровки = НовыйДок.РасшифровкаСуммы.Добавить();
						#Вставка
						НуженДокумент = Истина;
						#КонецВставки
							НовСтрРасшифровки.ДоговорОПС = ВыборкаДоговоров.ДоговорОПС;
                            НовСтрРасшифровки.Сумма = Выборка.Сумма;
							НовСтрРасшифровки.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений;
							НовСтрРасшифровки.ТипСуммы = Выборка.ТипСуммы;
						КонецЕсли;	
					КонецЦикла;	
					#Вставка
					Если НуженДокумент = Ложь Тогда
						Продолжить;	
					КонецЕсли;
					#КонецВставки
					НовыйДок.Записать();
					
					//добавим в таблицу
					НовСтрНачислений = ДанныеОбъекта.НовыеНачисления.Добавить();
					НовСтрНачислений.Документ = НовыйДок.Ссылка;
					НовСтрНачислений.Сумма = НовыйДок.СуммаНаСчете;
					#Вставка
					// +ХМНПФ 18.03.2016 ЛыткинАМ // СоздатьКорректировкуДляЕдиновременной() // №999
					НовСтрНачислений.ДоговорОПС = ВыборкаДоговоров.ДоговорОПС;;
					НовСтрНачислений.Участник = ВыборкаДоговоров.ДоговорОПС.Участник;
					// -ХМНПФ 18.03.2016 ЛыткинАМ // СоздатьКорректировкуДляЕдиновременной() // №999
					#КонецВставки
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
	
КонецПроцедуры

&ИзменениеИКонтроль("СоздатьКорректировкуДляНакопительной")
Процедура ХМСоздатьКорректировкуДляНакопительной(ДанныеОбъекта)
	#Вставка
	// ХМНПФ 10.02.2016 Лыткин А.М. // СоздатьКорректировкуДляНакопительной() // №203
	ОдинЧеловекНаОдинДокумент = Истина;
	#КонецВставки

	ТабКорректировок = Новый ТаблицаЗначений;
	ТабКорректировок.Колонки.Добавить("ДоговорОПС", Новый ОписаниеТипов("СправочникСсылка.уп_ДоговорыОПС"));
	ТабКорректировок.Колонки.Добавить("СуммаОсн", Новый ОписаниеТипов("Число"));
	ТабКорректировок.Колонки.Добавить("СуммаДоп", Новый ОписаниеТипов("Число"));
	ТабКорректировок.Колонки.Добавить("УчитыватьДопВзносы", Новый ОписаниеТипов("Булево"));
	ТабКорректировок.Колонки.Добавить("СрокНЧТППриНазначении", Новый ОписаниеТипов("Число"));
	ТабКорректировок.Колонки.Добавить("ПолныхЛетСДатыНазначения", Новый ОписаниеТипов("Число"));
	
	ТабПоступлений = Новый ТаблицаЗначений;
	ТабПоступлений.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.уп_РегистрацияПоступленийОПС, ДокументСсылка.уп_ФинансовыйРеестр"));
	
	Для Каждого стр из ДанныеОбъекта.ДоговорыОПС Цикл
		Если стр.Обрабатывать Тогда
			НовСтрТабКорректировок = ТабКорректировок.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрТабКорректировок, стр);
			Если НЕ стр.УчитыватьДопВзносы Тогда
				НовСтрТабКорректировок.СуммаДоп = 0;
			КонецЕсли;
			НовСтрТабКорректировок.СрокНЧТППриНазначении = стр.ДоговорОПС.СрокНЧТППриНазначении;
			НовСтрТабКорректировок.ПолныхЛетСДатыНазначения = Цел((((НачалоДня(ДанныеОбъекта.ДатаФормированияДокументов)-1) - стр.ДоговорОПС.ДатаНазначенияНЧТП)/(60*60*24))/365.25);
		КонецЕсли;	
	КонецЦикла;	
	
	Для Каждого стр из ДанныеОбъекта.ДокументыПоступления Цикл
		Если стр.Обрабатывать Тогда
			НовСтрТабПоступлений = ТабПоступлений.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрТабПоступлений, стр);
		КонецЕсли;	
	КонецЦикла;	
		
	Если ТабКорректировок.Количество()>0 Тогда
		НеУменьшатьПенсиюПриКорректировке = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("Организация", ДанныеОбъекта.Организация)).НеУменьшатьПенсиюПриКорректировке;
		
		НовыйДок = Документы.уп_ИндексацияНЧТП.СоздатьДокумент();
		НовыйДок.НеУменьшатьПенсиюПриКорректировке = НеУменьшатьПенсиюПриКорректировке;
		НовыйДок.Дата = ДанныеОбъекта.ДатаФормированияДокументов;
		НовыйДок.ДатаСумм = ДанныеОбъекта.ДатаФормированияДокументов;
		НовыйДок.ДоначислениеПоПереданномуВзносуИзПФР = Истина;
		НовыйДок.КорректировочныйКоэффициент = 1;
		НовыйДок.Организация = ДанныеОбъекта.Организация;
		НовыйДок.Ответственный = ДанныеОбъекта.Ответственный;
		НовыйДок.ОтражатьВБухгалтерскомУчете = ДанныеОбъекта.ОтражатьВБухгалтерскомУчете;
		НовыйДок.уп_ВидДеятельности = ДанныеОбъекта.уп_ВидДеятельности;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТакКорректировок.ДоговорОПС КАК ДоговорОПС,
		|	ТакКорректировок.СуммаОсн КАК СуммаОсн,
		|	ТакКорректировок.СуммаДоп КАК СуммаДоп,
		|	ТакКорректировок.УчитыватьДопВзносы КАК УчитыватьДопВзносы,
		|	ТакКорректировок.СрокНЧТППриНазначении КАК СрокНЧТППриНазначении,
		|	ТакКорректировок.ПолныхЛетСДатыНазначения КАК ПолныхЛетСДатыНазначения
		|ПОМЕСТИТЬ СписокЗЛ
		|ИЗ
		|	&ТабКорректировок КАК ТакКорректировок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_СчетчикНачисленийОПСОбороты.ДоговорОПС КАК ДоговорОПС,
		|	уп_СчетчикНачисленийОПСОбороты.КоличествоОборот КАК КоличествоСделанныхВыплат
		|ПОМЕСТИТЬ КолНачислений
		|ИЗ
		|	РегистрНакопления.уп_СчетчикНачисленийОПС.Обороты(
		|			&ДатаНачалаВремен,
		|			&ДатаРасчета,
		|			Период,
		|			ДоговорОПС В
		|					(ВЫБРАТЬ
		|						СписокЗЛ.ДоговорОПС
		|					ИЗ
		|						СписокЗЛ)
		|				И ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсийОПС.Пожизненная)) КАК уп_СчетчикНачисленийОПСОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РазмерПенсииОПССрезПервых.Регистратор.Дата КАК ДатаРешения,
		|	уп_РазмерПенсииОПССрезПервых.ДоговорОПС КАК ДоговорОПС,
		|	уп_РазмерПенсииОПССрезПервых.Регистратор.ДокументОснование.ПравоНаНакопительнуюПенсию КАК ДатаПраваНаНП,
		|	уп_РазмерПенсииОПССрезПервых.Регистратор КАК Решение
		|ПОМЕСТИТЬ ДатыРешений
		|ИЗ
		|	РегистрСведений.уп_РазмерПенсииОПС.СрезПервых(
		|			&ДатаНачалаВремен,
		|			ТипПенсии = &НЧТП
		|				И ДоговорОПС В
		|					(ВЫБРАТЬ
		|						СписокЗЛ.ДоговорОПС
		|					ИЗ
		|						СписокЗЛ)) КАК уп_РазмерПенсииОПССрезПервых
		|ГДЕ
		|	уп_РазмерПенсииОПССрезПервых.Регистратор.Дата < &ДатаСумм
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РазмерПенсииОПССрезПоследних.Размер КАК ТекРазмер,
		|	уп_РазмерПенсииОПССрезПоследних.ДоговорОПС КАК ДоговорОПС
		|ПОМЕСТИТЬ РазмерыПенсий
		|ИЗ
		|	РегистрСведений.уп_РазмерПенсииОПС.СрезПоследних(
		|			&ДатаРасчета,
		|			ТипПенсии = &НЧТП
		|				И ДоговорОПС В
		|					(ВЫБРАТЬ
		|						СписокЗЛ.ДоговорОПС
		|					ИЗ
		|						СписокЗЛ)) КАК уп_РазмерПенсииОПССрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокЗЛ.ДоговорОПС КАК ДоговорОПС,
		|	СписокЗЛ.СуммаОсн КАК СуммаОснЧастиСчета,
		|	СписокЗЛ.СуммаДоп КАК СуммаДопЧастиСчета,
		|	ВЫБОР
		|		КОГДА СписокЗЛ.СуммаДоп <> 0
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЕстьДопСчет,
		|	ВЫБОР
		|		КОГДА СписокЗЛ.СрокНЧТППриНазначении - СписокЗЛ.ПолныхЛетСДатыНазначения * 12 > &МинСрокМесяц
		|			ТОГДА СписокЗЛ.СрокНЧТППриНазначении - СписокЗЛ.ПолныхЛетСДатыНазначения * 12
		|		ИНАЧЕ &МинСрокМесяц
		|	КОНЕЦ КАК ПериодВыплатДляРасчета,
		|	(СписокЗЛ.СуммаДоп + СписокЗЛ.СуммаОсн) / ВЫБОР
		|		КОГДА СписокЗЛ.СрокНЧТППриНазначении - СписокЗЛ.ПолныхЛетСДатыНазначения * 12 > &МинСрокМесяц
		|			ТОГДА СписокЗЛ.СрокНЧТППриНазначении - СписокЗЛ.ПолныхЛетСДатыНазначения * 12
		|		ИНАЧЕ &МинСрокМесяц
		|	КОНЕЦ КАК ИндексацияДельта,
		|	ДатыРешений.ДатаРешения КАК ДатаРешения,
		|	РазмерыПенсий.ТекРазмер КАК ТекРазмер,
		|	РазмерыПенсий.ТекРазмер КАК ИндексацияПроцент,
		|	КолНачислений.КоличествоСделанныхВыплат КАК КоличествоСделанныхВыплат,
		|	ДатыРешений.ДатаПраваНаНП КАК ДатаПраваНаНП,
		|	РазмерыПенсий.ДоговорОПС.ДатаНазначенияНЧТП КАК ДатаНазначенияНЧТП,
		|	ДатыРешений.Решение КАК Решение
		|ИЗ
		|	СписокЗЛ КАК СписокЗЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РазмерыПенсий КАК РазмерыПенсий
		|		ПО СписокЗЛ.ДоговорОПС = РазмерыПенсий.ДоговорОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыРешений КАК ДатыРешений
		|		ПО СписокЗЛ.ДоговорОПС = ДатыРешений.ДоговорОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ КолНачислений КАК КолНачислений
		|		ПО СписокЗЛ.ДоговорОПС = КолНачислений.ДоговорОПС";
		
		
		Запрос.УстановитьПараметр("ДатаРасчета", НачалоДня(НовыйДок.Дата)-1);
		Запрос.УстановитьПараметр("НачалоВремен", '20090101');
		Запрос.УстановитьПараметр("КоэфИндексации", 1);
		Запрос.УстановитьПараметр("НЧТП", Перечисления.уп_ТипыПенсийОПС.Пожизненная);
		Запрос.УстановитьПараметр("ДатаСумм", НовыйДок.ДатаСумм);
		Запрос.УстановитьПараметр("ДатаНачалаВремен", '20050101');
		Запрос.УстановитьПараметр("ТабКорректировок", ТабКорректировок);
		
		МинПериодДожития = РегистрыСведений.уп_ПериодыДожития.ПолучитьПоследнее(НовыйДок.Дата, Новый Структура("ТипПериодаДожития", Перечисления.уп_ТипыПериодовДожития.Минимальный)).ЗначениеПериодаДожития;
		МинСрок = ?(МинПериодДожития = 0, 14*12, МинПериодДожития);
		Запрос.УстановитьПараметр("МинСрокМесяц", МинСрок);
		
		НомПериодДожития = РегистрыСведений.уп_ПериодыДожития.ПолучитьПоследнее(НовыйДок.Дата, Новый Структура("ТипПериодаДожития", Перечисления.уп_ТипыПериодовДожития.Номинальный)).ЗначениеПериодаДожития; 
		Запрос.УстановитьПараметр("НомСрокГод", НомПериодДожития);
		
		РазницаГод =  НомПериодДожития-МинПериодДожития;
		Запрос.УстановитьПараметр("РазницаГод", РазницаГод);
		
		Результат = Запрос.Выполнить();
		
//+ АДаниленко 08.08.2019
		ВариантРасчета = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Организация", ДанныеОбъекта.Организация)).ВариантРасчетаЛетДосрочности;
		//Если ВариантРасчета = 2 ИЛИ ВариантРасчета = 3 Тогда
		//	ДоговорыОПС = НовыйДок.ДоговорыОПС;
		//	Для Каждого Строка Из уп_ОПС.СрокПожизненнойПенсии_2019(Результат.Выгрузить().ВыгрузитьКолонку("Решение"), НовыйДок.Дата, ВариантРасчета = 2, Ложь) Цикл
		//		НовСтр = ДоговорыОПС.Добавить();
		//		НовСтр.
		//	КонецЦикла;
		//Иначе

		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НовСтр = НовыйДок.ДоговорыОПС.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
			НовСтр.ЗастрахованноеЛицо = ВыборкаДетальныеЗаписи.ДоговорОПС.Участник;
//+ АДаниленко 08.08.2019
			Если ВариантРасчета = 2 ИЛИ ВариантРасчета = 3 Тогда
				НовСтр.ПериодВыплатДляРасчета = уп_ОПС.СрокПожизненнойПенсии_2019(ВыборкаДетальныеЗаписи.Решение, НовыйДок.Дата, ВариантРасчета = 2, Истина);
			Иначе	
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаПраваНаНП) Тогда
					НовСтр.ПериодВыплатДляРасчета = уп_ОПС.СрокПожизненнойПенсии(НовСтр.ЗастрахованноеЛицо, НовыйДок.Дата, ВыборкаДетальныеЗаписи.ДатаПраваНаНП, 1);
				Иначе
					НовСтр.ПериодВыплатДляРасчета = уп_ОПС.СрокПожизненнойПенсии(НовСтр.ЗастрахованноеЛицо, НовыйДок.Дата, ВыборкаДетальныеЗаписи.ДатаНазначенияНЧТП, 1);
				КонецЕсли;
			КонецЕсли;
//- АДаниленко 08.08.2019			
			Если НеУменьшатьПенсиюПриКорректировке И (НовСтр.СуммаОснЧастиСчета+НовСтр.СуммаДопЧастиСчета)<0 Тогда
				НовСтр.ИндексацияДельта = 0;
			Иначе
				НовСтр.ИндексацияДельта = (НовСтр.СуммаОснЧастиСчета+НовСтр.СуммаДопЧастиСчета)/НовСтр.ПериодВыплатДляРасчета;
			КонецЕсли;	
		КонецЦикла;

		#Вставка
		// +ХМНПФ 10.02.2016 Шадрин А.В. // СоздатьКорректировкуДляНакопительной() // №194
		ХМ_ДатаДок = НачалоДня(ДанныеОбъекта.ДатаФормированияДокументов);
		Для Каждого	НовСтр Из НовыйДок.ДоговорыОПС Цикл
			РазницаВМесяцах = ХМ_ПолучитьРазницуВМесяцах(НовСтр.ДоговорОПС.ДатаНазначенияНЧТП,ХМ_ДатаДок);
			НовСтр.ПериодВыплатДляРасчета = ?(НовСтр.ДоговорОПС.СрокНЧТППриНазначении - РазницаВМесяцах > МинСрок, НовСтр.ДоговорОПС.СрокНЧТППриНазначении - РазницаВМесяцах, МинСрок);
			НовСтр.ИндексацияДельта = (НовСтр.СуммаОснЧастиСчета+НовСтр.СуммаДопЧастиСчета)/НовСтр.ПериодВыплатДляРасчета;
		КонецЦикла;
		// -ХМНПФ 10.02.2016 Шадрин А.В. // СоздатьКорректировкуДляНакопительной() // №194
		#КонецВставки
		//КонецЕсли;
//- АДаниленко 08.08.2019		

		//заполним расшифровку
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТакКорректировок.ДоговорОПС КАК ДоговорОПС,
		|	ТакКорректировок.УчитыватьДопВзносы
		|ПОМЕСТИТЬ СписокЗЛ
		|ИЗ
		|	&ТабКорректировок КАК ТакКорректировок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабПоступлений.Документ КАК ДокументПоступления
		|ПОМЕСТИТЬ ТабПоступлений
		|ИЗ
		|	&ТабПоступлений КАК ТабПоступлений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.ДоговорОПС,
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы,
		|	СУММА(уп_РегистрацияПоступленийОПСДоговорыОПС.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ТаблицаСумм
		|ИЗ
		|	Документ.уп_РегистрацияПоступленийОПС.ДоговорыОПС КАК уп_РегистрацияПоступленийОПСДоговорыОПС
		|ГДЕ
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.Ссылка В
		|			(ВЫБРАТЬ
		|				ТабПоступлений.ДокументПоступления
		|			ИЗ
		|				ТабПоступлений)
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.ДоговорОПС,
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уп_ФинансовыйРеестрДоговорыОПС.ДоговорОПС,
		|	уп_ФинансовыйРеестрДоговорыОПС.ТипСуммы,
		|	СУММА(уп_ФинансовыйРеестрДоговорыОПС.Сумма)
		|ИЗ
		|	Документ.уп_ФинансовыйРеестр.ДоговорыОПС КАК уп_ФинансовыйРеестрДоговорыОПС
		|ГДЕ
		|	уп_ФинансовыйРеестрДоговорыОПС.Ссылка В
		|			(ВЫБРАТЬ
		|				ТабПоступлений.ДокументПоступления
		|			ИЗ
		|				ТабПоступлений)
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_ФинансовыйРеестрДоговорыОПС.ДоговорОПС,
		|	уп_ФинансовыйРеестрДоговорыОПС.ТипСуммы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокЗЛ.ДоговорОПС КАК ДоговорОПС,
		|	СписокЗЛ.УчитыватьДопВзносы,
		|	ТаблицаСумм.ТипСуммы,
		|	ВЫБОР
		|		КОГДА НЕ ТаблицаСумм.ТипСуммы В (&СписокОсн)
		|				И НЕ СписокЗЛ.УчитыватьДопВзносы
		|			ТОГДА 0
		|		ИНАЧЕ ТаблицаСумм.Сумма
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	СписокЗЛ КАК СписокЗЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСумм КАК ТаблицаСумм
		|		ПО СписокЗЛ.ДоговорОПС = ТаблицаСумм.ДоговорОПС
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДоговорОПС";
		
		Запрос.УстановитьПараметр("ТабКорректировок",ТабКорректировок);
		Запрос.УстановитьПараметр("ТабПоступлений",ТабПоступлений);
		Запрос.УстановитьПараметр("Дата",ДанныеОбъекта.ДатаФормированияДокументов);
		СписокОсн = Новый СписокЗначений;
		СписокОсн.Добавить(Справочники.уп_ТипыСуммОПС.ВзносыФиз);
		СписокОсн.Добавить(Справочники.уп_ТипыСуммОПС.ИДФиз);
		Запрос.УстановитьПараметр("СписокОсн",СписокОсн);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НовСтр = НовыйДок.РасшифровкаСуммы.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		КонецЦикла;

		#Вставка
		// +ХМНПФ 10.02.2016 Лыткин А.М. // СоздатьКорректировкуДляНакопительной() // №203
		Если ОдинЧеловекНаОдинДокумент Тогда
			НовыйДок2 = НовыйДок.Скопировать();
			НовыйДок2.ДоговорыОПС.Очистить();
			Для Каждого	НовСтр Из НовыйДок.ДоговорыОПС Цикл
				НовыйДок3 = НовыйДок2.Скопировать();
				НовыйДок3.Дата = ДанныеОбъекта.ДатаФормированияДокументов;
				НовСтр3 = НовыйДок3.ДоговорыОПС.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр3, НовСтр);
				НовыйДок3.Записать();
				НовСтрНачислений = ДанныеОбъекта.НовыеНачисления.Добавить();
				НовСтрНачислений.Документ = НовыйДок3.Ссылка;
				НовСтрНачислений.Сумма = НовыйДок3.ДоговорыОПС.Итог("СуммаОснЧастиСчета")+НовыйДок3.ДоговорыОПС.Итог("СуммаДопЧастиСчета");
				// +ХМНПФ 18.03.2016 ЛыткинАМ // СоздатьКорректировкуДляНакопительной() // №999
				НовСтрНачислений.ДоговорОПС = НовСтр.ДоговорОПС;
				НовСтрНачислений.Участник = НовСтр.ДоговорОПС.Участник;
				// -ХМНПФ 18.03.2016 ЛыткинАМ // СоздатьКорректировкуДляНакопительной() // №999
			КонецЦикла;
		Иначе	
			// -ХМНПФ 10.02.2016 Лыткин А.М. // СоздатьКорректировкуДляНакопительной() // №203
		#КонецВставки
			НовыйДок.Записать();
			//добавим в таблицу
			НовСтрНачислений = ДанныеОбъекта.НовыеНачисления.Добавить();
			НовСтрНачислений.Документ = НовыйДок.Ссылка;
			НовСтрНачислений.Сумма = НовыйДок.ДоговорыОПС.Итог("СуммаОснЧастиСчета")+НовыйДок.ДоговорыОПС.Итог("СуммаДопЧастиСчета");

		#Вставка
		КонецЕсли; // -ХМНПФ 10.02.2016 Лыткин А.М. // СоздатьКорректировкуДляНакопительной() // №203
		#КонецВставки
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("СоздатьКорректировкуДляСрочной")
Процедура ХМСоздатьКорректировкуДляСрочной(ДанныеОбъекта)
	#Вставка
	// +ХМНПФ 16.02.2016 Шадрин А.В. // СоздатьКорректировкуДляСрочной() // №208
	ОдинЧеловекНаОдинДокумент = Истина;
	// -ХМНПФ 16.02.2016 Шадрин А.В. // СоздатьКорректировкуДляСрочной() // №208
	#КонецВставки

	ТабКорректировок = Новый ТаблицаЗначений;
	ТабКорректировок.Колонки.Добавить("ДоговорОПС", Новый ОписаниеТипов("СправочникСсылка.уп_ДоговорыОПС"));
	ТабКорректировок.Колонки.Добавить("СуммаДоп", Новый ОписаниеТипов("Число"));
	
	ТабПоступлений = Новый ТаблицаЗначений;
	ТабПоступлений.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.уп_РегистрацияПоступленийОПС, ДокументСсылка.уп_ФинансовыйРеестр"));
	
	Для Каждого стр из ДанныеОбъекта.ДоговорыОПС Цикл
		Если стр.Обрабатывать Тогда
			ЗаполнитьЗначенияСвойств(ТабКорректировок.Добавить(), стр);
		КонецЕсли;	
	КонецЦикла;	
	
	Для Каждого стр из ДанныеОбъекта.ДокументыПоступления Цикл
		Если стр.Обрабатывать Тогда
			НовСтрТабПоступлений = ТабПоступлений.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрТабПоступлений, стр);
		КонецЕсли;	
	КонецЦикла;	
		
	Если ТабКорректировок.Количество()>0 Тогда
		НеУменьшатьПенсиюПриКорректировке = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("Организация", ДанныеОбъекта.Организация)).НеУменьшатьПенсиюПриКорректировке;
		НовыйДок = Документы.уп_ИндексацияСрочнойВыплаты.СоздатьДокумент();
		НовыйДок.НеУменьшатьПенсиюПриКорректировке = НеУменьшатьПенсиюПриКорректировке;
		НовыйДок.Дата = ДанныеОбъекта.ДатаФормированияДокументов;
		НовыйДок.ДатаСумм = ДанныеОбъекта.ДатаФормированияДокументов;
		НовыйДок.ДоначислениеПоПереданномуВзносуИзПФР = Истина;
		НовыйДок.КорректировочныйКоэффициент = 1;
		НовыйДок.Организация = ДанныеОбъекта.Организация;
		НовыйДок.Ответственный = ДанныеОбъекта.Ответственный;
		НовыйДок.ОтражатьВБухгалтерскомУчете = ДанныеОбъекта.ОтражатьВБухгалтерскомУчете;
		НовыйДок.уп_ВидДеятельности = ДанныеОбъекта.уп_ВидДеятельности;		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТакКорректировок.ДоговорОПС КАК ДоговорОПС,
		|	ТакКорректировок.СуммаДоп
		|ПОМЕСТИТЬ СписокЗЛ
		|ИЗ
		|	&ТабКорректировок КАК ТакКорректировок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_КоличествоВыплатОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
		|	уп_КоличествоВыплатОПССрезПоследних.КоличествоВыплат
		|ПОМЕСТИТЬ КолВыплат
		|ИЗ
		|	РегистрСведений.уп_КоличествоВыплатОПС.СрезПоследних(
		|			&ДатаРасчета,
		|			ДоговорОПС В
		|				(ВЫБРАТЬ
		|					СписокЗЛ.ДоговорОПС
		|				ИЗ
		|					СписокЗЛ)) КАК уп_КоличествоВыплатОПССрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РазмерПенсииОПССрезПервых.Регистратор.Дата КАК ДатаРешения,
		|	уп_РазмерПенсииОПССрезПервых.ДоговорОПС КАК ДоговорОПС
		|ПОМЕСТИТЬ ДатыРешений
		|ИЗ
		|	РегистрСведений.уп_РазмерПенсииОПС.СрезПервых(
		|			&ДатаНачалаВремен,
		|			ТипПенсии = &Срочная
		|				И ДоговорОПС В
		|					(ВЫБРАТЬ
		|						СписокЗЛ.ДоговорОПС
		|					ИЗ
		|						СписокЗЛ)) КАК уп_РазмерПенсииОПССрезПервых
		|ГДЕ
		|	уп_РазмерПенсииОПССрезПервых.Регистратор.Дата < &ДатаСумм
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РазмерПенсииОПССрезПоследних.Размер КАК ТекРазмер,
		|	уп_РазмерПенсииОПССрезПоследних.ДоговорОПС КАК ДоговорОПС
		|ПОМЕСТИТЬ РазмерыПенсий
		|ИЗ
		|	РегистрСведений.уп_РазмерПенсииОПС.СрезПоследних(
		|			&ДатаРасчета,
		|			ТипПенсии = &Срочная
		|				И ДоговорОПС В
		|					(ВЫБРАТЬ
		|						СписокЗЛ.ДоговорОПС
		|					ИЗ
		|						СписокЗЛ)) КАК уп_РазмерПенсииОПССрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_СчетчикНачисленийОПСОбороты.КоличествоОборот,
		|	уп_СчетчикНачисленийОПСОбороты.ДоговорОПС КАК ДоговорОПС
		|ПОМЕСТИТЬ КолВыплачено
		|ИЗ
		|	РегистрНакопления.уп_СчетчикНачисленийОПС.Обороты(
		|			&НачалоВремен,
		|			&ДатаРасчета,
		|			Период,
		|			ДоговорОПС В
		|					(ВЫБРАТЬ
		|						СписокЗЛ.ДоговорОПС
		|					ИЗ
		|						СписокЗЛ)
		|				И ТипПенсии = &Срочная) КАК уп_СчетчикНачисленийОПСОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокЗЛ.ДоговорОПС,
		|	СписокЗЛ.СуммаДоп КАК СуммаДопЧастиСчета,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(КолВыплат.КоличествоВыплат, 0) - ЕСТЬNULL(КолВыплачено.КоличествоОборот, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(СписокЗЛ.СуммаДоп, 0) / (ЕСТЬNULL(КолВыплат.КоличествоВыплат, 0) - ЕСТЬNULL(КолВыплачено.КоличествоОборот, 0))
		|	КОНЕЦ КАК ИндексацияДельта,
		|	ЕСТЬNULL(КолВыплат.КоличествоВыплат, 0) - ЕСТЬNULL(КолВыплачено.КоличествоОборот, 0) КАК ПериодВыплатДляРасчета,
		|	СписокЗЛ.СуммаДоп,
		|	ДатыРешений.ДатаРешения,
		|	РазмерыПенсий.ТекРазмер,
		|	РазмерыПенсий.ТекРазмер КАК ИндексацияПроцент,
		|	КолВыплачено.КоличествоОборот КАК КоличествоСделанныхВыплат
		|ИЗ
		|	СписокЗЛ КАК СписокЗЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РазмерыПенсий КАК РазмерыПенсий
		|		ПО СписокЗЛ.ДоговорОПС = РазмерыПенсий.ДоговорОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ КолВыплат КАК КолВыплат
		|		ПО СписокЗЛ.ДоговорОПС = КолВыплат.ДоговорОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ КолВыплачено КАК КолВыплачено
		|		ПО СписокЗЛ.ДоговорОПС = КолВыплачено.ДоговорОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыРешений КАК ДатыРешений
		|		ПО СписокЗЛ.ДоговорОПС = ДатыРешений.ДоговорОПС";
		
		
		Запрос.УстановитьПараметр("ДатаРасчета", НачалоДня(НовыйДок.Дата)-1);
		Запрос.УстановитьПараметр("НачалоВремен", '20090101');
		Запрос.УстановитьПараметр("КоэфИндексации", 1);
		Запрос.УстановитьПараметр("Срочная", Перечисления.уп_ТипыПенсийОПС.Срочная);
		Запрос.УстановитьПараметр("ДатаСумм", НовыйДок.ДатаСумм);
		Запрос.УстановитьПараметр("ДатаНачалаВремен", '20050101');
		Запрос.УстановитьПараметр("ТабКорректировок", ТабКорректировок);
		
		Результат = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НовСтр = НовыйДок.ДоговорыОПС.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
			НовСтр.ЗастрахованноеЛицо = ВыборкаДетальныеЗаписи.ДоговорОПС.Участник;
			Если НеУменьшатьПенсиюПриКорректировке И ВыборкаДетальныеЗаписи.ИндексацияДельта<0 Тогда
				НовСтр.ИндексацияДельта = 0;
			КонецЕсли;	
		КонецЦикла;
		
		#Вставка
		// ХМНПФ+ 10.03.2016 Лыткин А.М. // СоздатьКорректировкуДляСрочной // №264
		ХМ_ДатаДок = НачалоДня(ДанныеОбъекта.ДатаФормированияДокументов);
		Для Каждого	НовСтр Из НовыйДок.ДоговорыОПС Цикл
			РазницаВМесяцах = ХМ_ПолучитьРазницуВМесяцах(НовСтр.ДоговорОПС.ДатаНазначенияСрочнойВыплаты,ХМ_ДатаДок);
			НовСтр.ПериодВыплатДляРасчета = ?(120 - РазницаВМесяцах > 0, 120 - РазницаВМесяцах, 1);
			НовСтр.ИндексацияДельта = (НовСтр.СуммаДопЧастиСчета)/НовСтр.ПериодВыплатДляРасчета;
		КонецЦикла;
		// -ХМНПФ 10.02.2016 Лыткин А.М. // СоздатьКорректировкуДляСрочной() // №264
		#КонецВставки

		//заполним расшифровку
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТакКорректировок.ДоговорОПС КАК ДоговорОПС
		|ПОМЕСТИТЬ СписокЗЛ
		|ИЗ
		|	&ТабКорректировок КАК ТакКорректировок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабПоступлений.Документ КАК ДокументПоступления
		|ПОМЕСТИТЬ ТабПоступлений
		|ИЗ
		|	&ТабПоступлений КАК ТабПоступлений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.ДоговорОПС,
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы,
		|	СУММА(уп_РегистрацияПоступленийОПСДоговорыОПС.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ТаблицаСумм
		|ИЗ
		|	Документ.уп_РегистрацияПоступленийОПС.ДоговорыОПС КАК уп_РегистрацияПоступленийОПСДоговорыОПС
		|ГДЕ
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.Ссылка В
		|			(ВЫБРАТЬ
		|				ТабПоступлений.ДокументПоступления
		|			ИЗ
		|				ТабПоступлений)
		|	И НЕ уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы В (&СписокОсн)
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.ДоговорОПС,
		|	уп_РегистрацияПоступленийОПСДоговорыОПС.ТипСуммы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уп_ФинансовыйРеестрДоговорыОПС.ДоговорОПС,
		|	уп_ФинансовыйРеестрДоговорыОПС.ТипСуммы,
		|	СУММА(уп_ФинансовыйРеестрДоговорыОПС.Сумма)
		|ИЗ
		|	Документ.уп_ФинансовыйРеестр.ДоговорыОПС КАК уп_ФинансовыйРеестрДоговорыОПС
		|ГДЕ
		|	уп_ФинансовыйРеестрДоговорыОПС.Ссылка В
		|			(ВЫБРАТЬ
		|				ТабПоступлений.ДокументПоступления
		|			ИЗ
		|				ТабПоступлений)
		|	И НЕ уп_ФинансовыйРеестрДоговорыОПС.ТипСуммы В (&СписокОсн)
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_ФинансовыйРеестрДоговорыОПС.ДоговорОПС,
		|	уп_ФинансовыйРеестрДоговорыОПС.ТипСуммы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокЗЛ.ДоговорОПС КАК ДоговорОПС,
		|	ТаблицаСумм.ТипСуммы,
		|	ТаблицаСумм.Сумма
		|ИЗ
		|	СписокЗЛ КАК СписокЗЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСумм КАК ТаблицаСумм
		|		ПО СписокЗЛ.ДоговорОПС = ТаблицаСумм.ДоговорОПС
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДоговорОПС";
		
		Запрос.УстановитьПараметр("ТабКорректировок",ТабКорректировок);
		Запрос.УстановитьПараметр("ТабПоступлений",ТабПоступлений);
		Запрос.УстановитьПараметр("Дата",ДанныеОбъекта.ДатаФормированияДокументов);
		СписокОсн = Новый СписокЗначений;
		СписокОсн.Добавить(Справочники.уп_ТипыСуммОПС.ВзносыФиз);
		СписокОсн.Добавить(Справочники.уп_ТипыСуммОПС.ИДФиз);
		Запрос.УстановитьПараметр("СписокОсн",СписокОсн);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НовСтр = НовыйДок.РасшифровкаСуммы.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
		КонецЦикла;

		#Вставка
		// +ХМНПФ 16.02.2016 Лыткин А.М. // СоздатьКорректировкуДляСрочной() // №208
		Если ОдинЧеловекНаОдинДокумент Тогда
			НовыйДок2 = НовыйДок.Скопировать();
			НовыйДок2.ДоговорыОПС.Очистить();
			Для Каждого	НовСтр Из НовыйДок.ДоговорыОПС Цикл
				НовыйДок3 = НовыйДок2.Скопировать();
				НовыйДок3.Дата = ДанныеОбъекта.ДатаФормированияДокументов;
				НовСтр3 = НовыйДок3.ДоговорыОПС.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр3, НовСтр);
				НовыйДок3.Записать();
				НовСтрНачислений = ДанныеОбъекта.НовыеНачисления.Добавить();
				НовСтрНачислений.Документ = НовыйДок3.Ссылка;
				НовСтрНачислений.Сумма = НовыйДок3.ДоговорыОПС.Итог("СуммаДопЧастиСчета");
				// +ХМНПФ 18.03.2016 ЛыткинАМ // СоздатьКорректировкуДляСрочной() // №999
				НовСтрНачислений.ДоговорОПС = НовСтр.ДоговорОПС;;
				НовСтрНачислений.Участник = НовСтр.ДоговорОПС.Участник;
				// -ХМНПФ 18.03.2016 ЛыткинАМ // СоздатьКорректировкуДляСрочной() // №999
			КонецЦикла;
		Иначе	
			// -ХМНПФ 16.02.2016 Шадрин А.В. // СоздатьКорректировкуДляСрочной() // №208
		#КонецВставки
			НовыйДок.Записать();
			//добавим в таблицу
			НовСтрНачислений = ДанныеОбъекта.НовыеНачисления.Добавить();
			НовСтрНачислений.Документ = НовыйДок.Ссылка;
			НовСтрНачислений.Сумма = НовыйДок.ДоговорыОПС.Итог("СуммаДопЧастиСчета");

		#Вставка
		КонецЕсли; // -ХМНПФ 16.02.2016 Шадрин А.В. // СоздатьКорректировкуДляСрочной() // №208
		#КонецВставки

	КонецЕсли;

КонецПроцедуры
