// +ХМНПФ 09.04.2021 ШадринАВ // уп_ЗакрытиеДоговораОПС // №3116
Процедура уп_ЗакрытиеДоговораОПС(Источник, Отказ, РежимПроведения) Экспорт
	Если Источник.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
		ТЗ_МСК = Источник.РасшифровкаСуммы.Выгрузить(Новый Структура("ТипСуммы",Справочники.уп_ТипыСуммОПС.МатКапитал));
		ТЗ_ИДМСК = Источник.РасшифровкаСуммы.Выгрузить(Новый Структура("ТипСуммы",Справочники.уп_ТипыСуммОПС.ИДМатКапитал));
		Для Каждого стрИД Из ТЗ_ИДМСК Цикл
			стрТЗ = ТЗ_МСК.Добавить();
			ЗаполнитьЗначенияСвойств(стрТЗ,стрИД);
		КонецЦикла;
		Если ТЗ_МСК.Количество()>0 Тогда
			ТЗ_МСК.Свернуть("ДоговорОПС");
			Для каждого стр Из ТЗ_МСК Цикл
				Сообщить("Есть суммы Материнского капитала на остатке у закрываемого 'По смерти' договора "+стр.ДоговорОПС+"
						|Сделано начисление с типом выплаты 'Возврат материнского капитала'. Необходимо сформировать выплатной реестр с этим типом выплаты.",СтатусСообщения.Важное);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // уп_ЗакрытиеДоговораОПС()



&ИзменениеИКонтроль("ДобавитьКомандыПечати")
Процедура РасшОбщ_ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрПФР";
	КомандаПечати.Представление = НСтр("ru = 'Реестр передаваемых сумм в ПФР'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 20;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр2010";
	КомандаПечати.Представление = НСтр("ru = 'Реестр передаваемых сумм (выделено софинансирование)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 30;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрXLS";
	КомандаПечати.Представление = НСтр("ru = 'Реестр передаваемых сумм (для загрузок)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 40;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение1";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 1 к Постановлению Правл.ПФР №177п от 20.05.2015'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 50;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение1_2";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 1 к Постановлению Правл.ПФР №177п от 20.05.2015 с адресом'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 60;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрАдресовЗЛ";
	КомандаПечати.Представление = НСтр("ru = 'Реестр адресов ЗЛ'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 70;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение2";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 2 к Постановлению Правл.ПФР №177п от 20.05.2015'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 80;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение2_2";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 2 к Постановлению Правл.ПФР №177п от 20.05.2015 с адресом'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 90;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрАдресовПравопреемников";
	КомандаПечати.Представление = НСтр("ru = 'Реестр адресов правопреемников'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 100;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Приложение3";
	КомандаПечати.Представление = НСтр("ru = 'Приложение 3 к Постановлению Правл.ПФР №177п от 20.05.2015'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 110;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗаявленияПравопреемников";
	КомандаПечати.Представление = НСтр("ru = 'Заявления правопреемников'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 120;

	
	#Вставка
	// +ХМНПФ 21.01.2019 ГригорьевМА // ДобавитьКомандыПечати() // №1980
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьУведомленийПерешедшимВДругойПФ";
	КомандаПечати.Представление = НСтр("ru = 'Печать уведомлений перешедшим в другой ПФ'");
	КомандаПечати.Обработчик    = "ХМ_ОбщийМодульПечатныеФормы.ОбработкаКомандыПечатиУведомленийПерешедшимВДругойПФ";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента";
	КомандаПечати.Порядок = 130;
	// -ХМНПФ 21.01.2019 ГригорьевМА // ДобавитьКомандыПечати() // №1980
	
	// +ХМНПФ 23.01.2019 ГригорьевМА // ДобавитьКомандыПечати() // №2004
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьПочтовогоРеестраПоПерешедшимВДругойПФ";
	КомандаПечати.Представление = НСтр("ru = 'Печать почтового реестра по перешедшим в другой ПФ'");
	КомандаПечати.Обработчик    = "ХМ_ОбщийМодульПечатныеФормы.ОбработкаКомандыПечатиПочтовогоРеестраПоПерешедшимВДругойПФ";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента";
	КомандаПечати.Порядок = 140;
	// -ХМНПФ 23.01.2019 ГригорьевМА // ДобавитьКомандыПечати() // №2004
	#КонецВставки
	//КомандаПечати.ДополнитьКомплектВнешнимиПечатнымиФормами=Истина;
КонецПроцедуры

#Область ХМНПФ

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 21.01.2019 ГригорьевМА // ДобавитьКомандыПечати() // №1980
	// ХМНПФ 23.01.2019 ГригорьевМА // ДобавитьКомандыПечати() // №2004
КонецПроцедуры

#КонецОбласти
