&ИзменениеИКонтроль("ПечатьРеестраПФР")
Функция РасшОбщ_ПечатьРеестраПФР()

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Макет       = ПолучитьОбщийМакет("уп_РеестрПФР_Расторжение");

	// Выводим шапку 
	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, Дата);
	ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
	Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(Организация, Дата);
	ФормализованноеИмя = Организация.уп_НаименованиеДляПФР; 
	#Вставка
	// +ХМНПФ 14.12.2018 ШадринАВ // ПечатьРеестраПФР() // №1939
	ФИООтветственного = ПараметрыСеанса.ТекущийПользователь.Наименование;
	// -ХМНПФ 14.12.2018 ШадринАВ // ПечатьРеестраПФР() // №1939
	#КонецВставки
	
	ОбластьОрг = Макет.ПолучитьОбласть("СекцияОрг");
	ОбластьОрг.Параметры.НаименованиеФонда = ВРЕГ(ПредставлениеОрганизации);
	ОбластьОрг.Параметры.ИНН = СведенияОбОрганизации.ИНН;
	ОбластьОрг.Параметры.ФормИмяНПФ = ВРЕГ(ФормализованноеИмя);
	#Вставка
	// +ХМНПФ 27.03.2017 ШадринАВ // ПечатьРеестраПФР() // №876
	Если НЕ ПенсионныйФонд = Константы.уп_ПенсионныйФондРФ.Получить()
		И (ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПереходДосрочный
		ИЛИ  ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.Досрочное) Тогда
		ОбластьОрг.Параметры.НаименованиеФонда = ВРЕГ(ПенсионныйФонд);
		ОбластьОрг.Параметры.ФормИмяНПФ = ВРЕГ(ПредставлениеОрганизации);
	КонецЕсли;
	// -ХМНПФ 27.03.2017 ШадринАВ // ПечатьРеестраПФР() // №876
	#КонецВставки
	
	ОбластьШапкаТабл = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.АннулированиеЛицензии
		или  ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПереходДосрочный
		или  ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.Досрочное Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.НаименованиеПолное КАК ФИОЗастрахованногоЛица,
		               |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.Пол КАК Пол,
		               |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.МестоРождения КАК МестоРождения,
		               |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.ДатаРождения КАК ДатаРождения,
		               |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР КАК НомерПФР,
		               |	ЗакрытиеДоговораОПСДоговорыОПС.Сумма КАК Сумма,
		               |	ЗакрытиеДоговораОПСДоговорыОПС.НомерСтроки КАК НомерСтроки,
		               |	ЗакрытиеДоговораОПСДоговорыОПС.Участник,
		               |	ЕСТЬNULL(ВзносыСФ.СуммаСВ, 0) КАК СуммаСВ,
		               |	ЕСТЬNULL(ВзносыСФ.СуммаДСВ, 0) КАК СуммаДСВ,
		               |	ЕСТЬNULL(ВзносыСФ.СуммаСФ, 0) КАК СуммаСФ,
		               |	ЕСТЬNULL(ВзносыСФ.СуммаМК, 0) КАК СуммаМК,
		               |	ЕСТЬNULL(ВзносыСФ.СуммаОстаток, 0) КАК СуммаОстаток,
		               |	ЕСТЬNULL(ВзносыСФ.СуммаСВ_ИД, 0) КАК СуммаСВ_ИД,
		               |	ЕСТЬNULL(ВзносыСФ.СуммаДСВ_ИД, 0) КАК СуммаДСВ_ИД,
		               |	ЕСТЬNULL(ВзносыСФ.СуммаСФ_ИД, 0) КАК СуммаСФ_ИД,
		               |	ЕСТЬNULL(ВзносыСФ.СуммаМК_ИД, 0) КАК СуммаМК_ИД,
		               |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.уп_ФИОВРеестреПФР КАК ФИОВРеестреПФР,
		               |	ЕСТЬNULL(ВзносыСФ.СуммаКомпенсации, 0) КАК СуммаКомпенсации,
		               |	ЕСТЬNULL(ВзносыСФ.СуммаВосполнения, 0) КАК СуммаВосполнения
		               |ИЗ
		               |	Документ.уп_ЗакрытиеДоговораОПС.ДоговорыОПС КАК ЗакрытиеДоговораОПСДоговорыОПС
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ДоговорОПС КАК ДоговорОПС,
		               |			СУММА(ВЫБОР
		               |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ВзносыФиз)
		               |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
		               |					ИНАЧЕ 0
		               |				КОНЕЦ) КАК СуммаСВ,
		               |			СУММА(ВЫБОР
		               |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ДопВзносы)
		               |							ИЛИ уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ВзносыЮр)
		               |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
		               |					ИНАЧЕ 0
		               |				КОНЕЦ) КАК СуммаДСВ,
		               |			СУММА(ВЫБОР
		               |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ГосПоддержка)
		               |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
		               |					ИНАЧЕ 0
		               |				КОНЕЦ) КАК СуммаСФ,
		               |			СУММА(ВЫБОР
		               |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.МатКапитал)
		               |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
		               |					ИНАЧЕ 0
		               |				КОНЕЦ) КАК СуммаМК,
		               |			СУММА(уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма) КАК СуммаОстаток,
		               |			СУММА(ВЫБОР
		               |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДФиз)
		               |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
		               |					ИНАЧЕ 0
		               |				КОНЕЦ) КАК СуммаСВ_ИД,
		               |			СУММА(ВЫБОР
		               |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДДопВзносы)
		               |							ИЛИ уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДЮр)
		               |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
		               |					ИНАЧЕ 0
		               |				КОНЕЦ) КАК СуммаДСВ_ИД,
		               |			СУММА(ВЫБОР
		               |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДГосПоддержка)
		               |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
		               |					ИНАЧЕ 0
		               |				КОНЕЦ) КАК СуммаСФ_ИД,
		               |			СУММА(ВЫБОР
		               |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДМатКапитал)
		               |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
		               |					ИНАЧЕ 0
		               |				КОНЕЦ) КАК СуммаМК_ИД,
		               |			СУММА(уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаКомпенсации) КАК СуммаКомпенсации,
		               |			СУММА(уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаВосполнения + уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаВозмещения) КАК СуммаВосполнения
		               |		ИЗ
		               |			Документ.уп_ЗакрытиеДоговораОПС.РасшифровкаСуммы КАК уп_ЗакрытиеДоговораОПСРасшифровкаСуммы
		               |		ГДЕ
		               |			уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Ссылка = &Ссылка
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ДоговорОПС) КАК ВзносыСФ
		               |		ПО ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС = ВзносыСФ.ДоговорОПС
		               |ГДЕ
		               |	ЗакрытиеДоговораОПСДоговорыОПС.Ссылка = &Ссылка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НомерСтроки
		               |ИТОГИ
		               |	СУММА(Сумма),
		               |	СУММА(СуммаСВ),
		               |	СУММА(СуммаДСВ),
		               |	СУММА(СуммаСФ),
		               |	СУММА(СуммаМК),
		               |	СУММА(СуммаОстаток),
		               |	СУММА(СуммаСВ_ИД),
		               |	СУММА(СуммаДСВ_ИД),
		               |	СУММА(СуммаСФ_ИД),
		               |	СУММА(СуммаМК_ИД),
		               |	СУММА(СуммаКомпенсации),
		               |	СУММА(СуммаВосполнения)
		               |ПО
		               |	ОБЩИЕ";
					   
	   Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	   
	   ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	   ОбластьШапка.Параметры.НомерРеестра = Номер;
	   ОбластьШапка.Параметры.ДатаРеестра = Формат(Дата,"ДФ=dd.MM.yyyy");
	   ТабДокумент.Вывести(ОбластьШапка);
	   
	   Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.АннулированиеЛицензии  Тогда
		   ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок2");
		   ОбластьТекст = Макет.ПолучитьОбласть("ТекстоваяЧасть2");
	   Иначе
		   ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок1");
		   ОбластьТекст = Макет.ПолучитьОбласть("ТекстоваяЧасть1");
	   КонецЕсли;
	   
	   ТабДокумент.Вывести(ОбластьЗаголовок);
	   ТабДокумент.Вывести(ОбластьОрг);
	   ТабДокумент.Вывести(ОбластьТекст);
	   ТабДокумент.Вывести(ОбластьШапкаТабл);
	   
	   Результат = Запрос.Выполнить();
	   ВыборкаИтогов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	   
	   Если ВыборкаИтогов.Следующий() Тогда
		   НомерСтроки = 0;
		   Выборка = ВыборкаИтогов.Выбрать();
		   Пока Выборка.Следующий() Цикл
			   ОбластьСтрока.Параметры.Заполнить(Выборка);
			   Если ЗначениеЗаполнено(Выборка.ФИОВРеестреПФР) Тогда
				   ФИО = Выборка.ФИОВРеестреПФР;
			   Иначе
				   ФИО = Выборка.ФИОЗастрахованногоЛица;
			   КонецЕсли;
			   Фам = Лев(ФИО, Найти(ФИО, " ")-1);
			   ИО = Прав(ФИО, СтрДлина(ФИО)-Найти(ФИО, " "));
			   Имя = Лев(ИО, Найти(ИО, " ")-1);
			   Отчество = Прав(ИО, СтрДлина(ИО)-Найти(ИО, " "));
			   
			   ОбластьСтрока.Параметры.ФамилияСтр = ВРЕГ(Фам);
			   ОбластьСтрока.Параметры.ИмяСтр = ВРЕГ(Имя);
			   ОбластьСтрока.Параметры.ОтчествоСтр = ВРЕГ(Отчество);
			   ОбластьСтрока.Параметры.ДатаРожденияСтр = Формат(Выборка.ДатаРождения,"ДФ=dd.MM.yyyy");
			   МестоРожденияСтр = СтрЗаменить(Выборка.МестоРождения, "0,", "");
			   ОбластьСтрока.Параметры.МестоРожденияСтр = СокрЛП(СтрЗаменить(МестоРожденияСтр,",",", "));
			   СНИЛС = уп_ОПС.ПреобразоватьНомерПФРДляРеестра(Выборка.НомерПФР); 
			   ПерваяЧастьСтраховогоНомера = Лев(СНИЛС,9);
			   ВтораяЧастьСтраховогоНомера = Прав(СНИЛС,2);
			   Попытка
				   ОбластьСтрока.Параметры.СНИЛС = Число(ПерваяЧастьСтраховогоНомера);
				   ОбластьСтрока.Параметры.КонтрольнаяСумма = Число(ВтораяЧастьСтраховогоНомера);
			   Исключение
				   Сообщить("У ЗЛ "+ФИО+" некорректный СНИЛС "+Выборка.НомерПФР);
			   КонецПопытки;
			   ОбластьСтрока.Параметры.Пол = ВРЕГ(Лев(Строка(Выборка.Пол),1));
		   	   ТабДокумент.Вывести(ОбластьСтрока);
		   КонецЦикла; 
		   
		   ОбластьПодвал.Параметры.Заполнить(ВыборкаИтогов);
		   ОбластьПодвал.Параметры.ФИОРуководителя   = Руководители.РуководительПредставление;
		   ОбластьПодвал.Параметры.ДолжностьРуководителя = Строка(Руководители.РуководительДолжность)+" "+Строка(СведенияОбОрганизации.Представление);
		   ОбластьПодвал.Параметры.ФИОИсполнителя = ФИООтветственного;
		   //Данные = Новый Структура("Объект, Тип, Вид", Организация, Перечисления.ТипыКонтактнойИнформации.Телефон, Справочники.УдалитьВидыКонтактнойИнформации.ТелефонОрганизации);
		   Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
		   Результат = Организация.КонтактнаяИнформация.НайтиСтроки(Данные);
		   Если Результат.Количество()>0 Тогда
			   ОбластьПодвал.Параметры.КонтактныйТелефон = Результат[0].Представление;
		   КонецЕсли;
		   ТабДокумент.Вывести(ОбластьПодвал);
	   КонецЕсли;
   ИначеЕсли ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
	   //здесь может быть два реестра - средства МК и возвраты по умершим
	   //это если не вступил в силу
	   Запрос = Новый Запрос;
	   Запрос.Текст = "ВЫБРАТЬ
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.НаименованиеПолное КАК ФИОЗастрахованногоЛица,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.Пол КАК Пол,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.МестоРождения КАК МестоРождения,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.ДатаРождения КАК ДатаРождения,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР КАК НомерПФР,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Сумма КАК Сумма,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.НомерСтроки КАК НомерСтроки,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаСВ, 0) КАК СуммаСВ,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаДСВ, 0) КАК СуммаДСВ,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаСФ, 0) КАК СуммаСФ,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаМК, 0) КАК СуммаМК,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаОстаток, 0) КАК СуммаОстаток,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаСВ_ИД, 0) КАК СуммаСВ_ИД,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаДСВ_ИД, 0) КАК СуммаДСВ_ИД,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаСФ_ИД, 0) КАК СуммаСФ_ИД,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаМК_ИД, 0) КАК СуммаМК_ИД,
	                  |	уп_ПредыдущиеСтраховщикиПоДоговорамОПССрезПоследних.ПредыдущийСтраховщик КАК ПредыдущийСтраховщик,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.ДатаСмерти,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.уп_ФИОВРеестреПФР КАК ФИОВРеестреПФР,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаКомпенсации, 0) КАК СуммаКомпенсации,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаВосполнения, 0) КАК СуммаВосполнения
	                  |ИЗ
	                  |	Документ.уп_ЗакрытиеДоговораОПС.ДоговорыОПС КАК ЗакрытиеДоговораОПСДоговорыОПС
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                  |			уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ДоговорОПС КАК ДоговорОПС,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ВзносыФиз)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаСВ,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ДопВзносы)
	                  |							ИЛИ уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ВзносыЮр)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаДСВ,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ГосПоддержка)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаСФ,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.МатКапитал)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаМК,
	                  |			СУММА(уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма) КАК СуммаОстаток,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДФиз)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаСВ_ИД,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДДопВзносы)
	                  |							ИЛИ уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДЮр)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаДСВ_ИД,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДГосПоддержка)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаСФ_ИД,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДМатКапитал)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаМК_ИД,
	                  |			СУММА(уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаКомпенсации) КАК СуммаКомпенсации,
	                  |			СУММА(уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаВосполнения + уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаВозмещения) КАК СуммаВосполнения
	                  |		ИЗ
	                  |			Документ.уп_ЗакрытиеДоговораОПС.РасшифровкаСуммы КАК уп_ЗакрытиеДоговораОПСРасшифровкаСуммы
	                  |		ГДЕ
	                  |			уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Ссылка = &Ссылка
	                  |		
	                  |		СГРУППИРОВАТЬ ПО
	                  |			уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ДоговорОПС) КАК ВзносыСФ
	                  |		ПО ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС = ВзносыСФ.ДоговорОПС
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПредыдущиеСтраховщикиПоДоговорамОПС.СрезПоследних(&ДатаДок, ) КАК уп_ПредыдущиеСтраховщикиПоДоговорамОПССрезПоследних
	                  |		ПО ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС = уп_ПредыдущиеСтраховщикиПоДоговорамОПССрезПоследних.ДоговорОПС
	                  |ГДЕ
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Ссылка = &Ссылка
	                  |	И ЗакрытиеДоговораОПСДоговорыОПС.ДатаВступленияВДействие > ЗакрытиеДоговораОПСДоговорыОПС.ДатаСмерти
	                  |	И уп_ПредыдущиеСтраховщикиПоДоговорамОПССрезПоследних.ПредыдущийСтраховщик = &ПФР
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |	НомерСтроки
	                  |ИТОГИ
	                  |	СУММА(Сумма),
	                  |	СУММА(СуммаСВ),
	                  |	СУММА(СуммаДСВ),
	                  |	СУММА(СуммаСФ),
	                  |	СУММА(СуммаМК),
	                  |	СУММА(СуммаОстаток),
	                  |	СУММА(СуммаСВ_ИД),
	                  |	СУММА(СуммаДСВ_ИД),
	                  |	СУММА(СуммаСФ_ИД),
	                  |	СУММА(СуммаМК_ИД),
	                  |	СУММА(СуммаКомпенсации),
	                  |	СУММА(СуммаВосполнения)
	                  |ПО
	                  |	ОБЩИЕ";
	   
	   Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	   Запрос.УстановитьПараметр("ДатаДок", ЭтотОбъект.Дата-1);
	   Запрос.УстановитьПараметр("ПФР", Константы.уп_ПенсионныйФондРФ.Получить());
	   
	   Результат = Запрос.Выполнить();
	   ВыборкаИтогов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	   Если ВыборкаИтогов.Следующий() Тогда
		   
		   ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		   ОбластьШапка.Параметры.НомерРеестра = Номер;
		   ОбластьШапка.Параметры.ДатаРеестра = Формат(Дата,"ДФ=dd.MM.yyyy");
		   ТабДокумент.Вывести(ОбластьШапка);
		   
		   ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок3");
		   ОбластьТекст = Макет.ПолучитьОбласть("ТекстоваяЧасть3");
		   
		   ТабДокумент.Вывести(ОбластьЗаголовок);
		   ТабДокумент.Вывести(ОбластьОрг);
		   ТабДокумент.Вывести(ОбластьТекст);
	  	   ТабДокумент.Вывести(ОбластьШапкаТабл);
	   
		   НомерСтроки = 0;
		   Выборка = ВыборкаИтогов.Выбрать();
		   Пока Выборка.Следующий() Цикл
			   НомерСтроки = НомерСтроки+1;
			   ОбластьСтрока.Параметры.Заполнить(Выборка);
			   Если ЗначениеЗаполнено(Выборка.ФИОВРеестреПФР) Тогда
				   ФИО = Выборка.ФИОВРеестреПФР;
			   Иначе
				   ФИО = Выборка.ФИОЗастрахованногоЛица;
			   КонецЕсли;
			   Фам = Лев(ФИО, Найти(ФИО, " ")-1);
			   ИО = Прав(ФИО, СтрДлина(ФИО)-Найти(ФИО, " "));
			   Имя = Лев(ИО, Найти(ИО, " ")-1);
			   Отчество = Прав(ИО, СтрДлина(ИО)-Найти(ИО, " "));
			   
			   ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
			   ОбластьСтрока.Параметры.ФамилияСтр = ВРЕГ(Фам);
			   ОбластьСтрока.Параметры.ИмяСтр = ВРЕГ(Имя);
			   ОбластьСтрока.Параметры.ОтчествоСтр = ВРЕГ(Отчество);
			   ОбластьСтрока.Параметры.ДатаРожденияСтр = Формат(Выборка.ДатаРождения,"ДФ=dd.MM.yyyy");
			   МестоРожденияСтр = СтрЗаменить(Выборка.МестоРождения, "0,", "");
			   ОбластьСтрока.Параметры.МестоРожденияСтр = СокрЛП(СтрЗаменить(МестоРожденияСтр,",",", "));
			   СНИЛС = уп_ОПС.ПреобразоватьНомерПФРДляРеестра(Выборка.НомерПФР); 
			   ПерваяЧастьСтраховогоНомера = Лев(СНИЛС,9);
			   ВтораяЧастьСтраховогоНомера = Прав(СНИЛС,2);
			   ОбластьСтрока.Параметры.СНИЛС = Число(ПерваяЧастьСтраховогоНомера);
			   ОбластьСтрока.Параметры.КонтрольнаяСумма = Число(ВтораяЧастьСтраховогоНомера);
			   ОбластьСтрока.Параметры.Пол = ВРЕГ(Лев(Строка(Выборка.Пол),1));
		   	   ТабДокумент.Вывести(ОбластьСтрока);
		   КонецЦикла; 
		   
		   ОбластьПодвал.Параметры.Заполнить(ВыборкаИтогов);
		   ОбластьПодвал.Параметры.ФИОРуководителя   = Руководители.РуководительПредставление;
		   ОбластьПодвал.Параметры.ДолжностьРуководителя = Строка(Руководители.РуководительДолжность)+" "+Строка(СведенияОбОрганизации.Представление);
		   ОбластьПодвал.Параметры.ФИОИсполнителя = ФИООтветственного;
		   //Данные = Новый Структура("Объект, Тип, Вид", Организация, Перечисления.ТипыКонтактнойИнформации.Телефон, Справочники.УдалитьВидыКонтактнойИнформации.ТелефонОрганизации);
		   Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
		   Результат = Организация.КонтактнаяИнформация.НайтиСтроки(Данные);
		   Если Результат.Количество()>0 Тогда
			   ОбластьПодвал.Параметры.КонтактныйТелефон = Результат[0].Представление;
		   КонецЕсли;  
		   ТабДокумент.Вывести(ОбластьПодвал);
		   
		   ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	   КонецЕсли; 
	   
	   //возвраты МК
	   Запрос = Новый Запрос;
	   Запрос.Текст = "ВЫБРАТЬ
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.НаименованиеПолное КАК ФИОЗастрахованногоЛица,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.Пол КАК Пол,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.МестоРождения КАК МестоРождения,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.ДатаРождения КАК ДатаРождения,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР КАК НомерПФР,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Сумма КАК Сумма,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.НомерСтроки КАК НомерСтроки,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаСВ, 0) КАК СуммаСВ,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаДСВ, 0) КАК СуммаДСВ,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаСФ, 0) КАК СуммаСФ,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаВР, 0) КАК СуммаВР,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаМК, 0) КАК СуммаМК,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаОстаток, 0) КАК СуммаОстаток,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаСВ_ИД, 0) КАК СуммаСВ_ИД,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаДСВ_ИД, 0) КАК СуммаДСВ_ИД,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаСФ_ИД, 0) КАК СуммаСФ_ИД,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаВР_ИД, 0) КАК СуммаВР_ИД,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаМК_ИД, 0) КАК СуммаМК_ИД,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.ДатаСмерти,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.уп_ФИОВРеестреПФР КАК ФИОВРеестреПФР,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаКомпенсации, 0) КАК СуммаКомпенсации,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаВосполнения, 0) КАК СуммаВосполнения
	                  |ИЗ
	                  |	Документ.уп_ЗакрытиеДоговораОПС.ДоговорыОПС КАК ЗакрытиеДоговораОПСДоговорыОПС
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                  |			уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ДоговорОПС КАК ДоговорОПС,
	                  |			СУММА(0) КАК СуммаСВ,
	                  |			СУММА(0) КАК СуммаДСВ,
	                  |			СУММА(0) КАК СуммаСФ,
	                  |			СУММА(0) КАК СуммаВР,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.МатКапитал)
	                  |							И уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаМК,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА (уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.МатКапитал)
	                  |							ИЛИ уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДМатКапитал))
	                  |							И уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаОстаток,
	                  |			СУММА(0) КАК СуммаСВ_ИД,
	                  |			СУММА(0) КАК СуммаДСВ_ИД,
	                  |			СУММА(0) КАК СуммаСФ_ИД,
	                  |			СУММА(0) КАК СуммаВР_ИД,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДМатКапитал)
	                  |							И уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаМК_ИД,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА (уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.МатКапитал)
	                  |							ИЛИ уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДМатКапитал))
	                  |							И уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаКомпенсации
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаКомпенсации,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА (уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.МатКапитал)
	                  |							ИЛИ уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДМатКапитал))
	                  |							И уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаВосполнения + уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаВозмещения
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаВосполнения
	                  |		ИЗ
	                  |			Документ.уп_ЗакрытиеДоговораОПС.РасшифровкаСуммы КАК уп_ЗакрытиеДоговораОПСРасшифровкаСуммы
	                  |		ГДЕ
	                  |			уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Ссылка = &Ссылка
	                  |		
	                  |		СГРУППИРОВАТЬ ПО
	                  |			уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ДоговорОПС) КАК ВзносыСФ
	                  |		ПО ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС = ВзносыСФ.ДоговорОПС
	                  |ГДЕ
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Ссылка = &Ссылка
	                  |	И ВзносыСФ.СуммаМК + ВзносыСФ.СуммаМК_ИД <> 0
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |	НомерСтроки
	                  |ИТОГИ
	                  |	СУММА(СуммаСВ),
	                  |	СУММА(СуммаДСВ),
	                  |	СУММА(СуммаСФ),
	                  |	СУММА(СуммаВР),
	                  |	СУММА(СуммаМК),
	                  |	СУММА(СуммаОстаток),
	                  |	СУММА(СуммаСВ_ИД),
	                  |	СУММА(СуммаДСВ_ИД),
	                  |	СУММА(СуммаСФ_ИД),
	                  |	СУММА(СуммаВР_ИД),
	                  |	СУММА(СуммаМК_ИД),
	                  |	СУММА(СуммаКомпенсации),
	                  |	СУММА(СуммаВосполнения)
	                  |ПО
	                  |	ОБЩИЕ";
	   
	   Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	   
	   Результат = Запрос.Выполнить();
	   ВыборкаИтогов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	   Если ВыборкаИтогов.Следующий() Тогда
		   
		   ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		   ОбластьШапка.Параметры.НомерРеестра = Номер;
		   ОбластьШапка.Параметры.ДатаРеестра = Формат(Дата,"ДФ=dd.MM.yyyy");
		   ТабДокумент.Вывести(ОбластьШапка);
		   
		   ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок4");
		   ОбластьТекст = Макет.ПолучитьОбласть("ТекстоваяЧасть4");
		   
		   ТабДокумент.Вывести(ОбластьЗаголовок);
		   ТабДокумент.Вывести(ОбластьОрг);
		   ТабДокумент.Вывести(ОбластьТекст);
	       ТабДокумент.Вывести(ОбластьШапкаТабл);
	   
		   НомерСтроки = 0;
		   Выборка = ВыборкаИтогов.Выбрать();
		   Пока Выборка.Следующий() Цикл
			   НомерСтроки = НомерСтроки+1;
			   ОбластьСтрока.Параметры.Заполнить(Выборка);
			   Если ЗначениеЗаполнено(Выборка.ФИОВРеестреПФР) Тогда
				   ФИО = Выборка.ФИОВРеестреПФР;
			   Иначе
				   ФИО = Выборка.ФИОЗастрахованногоЛица;
			   КонецЕсли;
			   Фам = Лев(ФИО, Найти(ФИО, " ")-1);
			   ИО = Прав(ФИО, СтрДлина(ФИО)-Найти(ФИО, " "));
			   Имя = Лев(ИО, Найти(ИО, " ")-1);
			   Отчество = Прав(ИО, СтрДлина(ИО)-Найти(ИО, " "));
			   
			   ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
			   ОбластьСтрока.Параметры.ФамилияСтр = ВРЕГ(Фам);
			   ОбластьСтрока.Параметры.ИмяСтр = ВРЕГ(Имя);
			   ОбластьСтрока.Параметры.ОтчествоСтр = ВРЕГ(Отчество);
			   ОбластьСтрока.Параметры.ДатаРожденияСтр = Формат(Выборка.ДатаРождения,"ДФ=dd.MM.yyyy");
			   МестоРожденияСтр = СтрЗаменить(Выборка.МестоРождения, "0,", "");
			   ОбластьСтрока.Параметры.МестоРожденияСтр = СокрЛП(СтрЗаменить(МестоРожденияСтр,",",", "));
			   СНИЛС = уп_ОПС.ПреобразоватьНомерПФРДляРеестра(Выборка.НомерПФР); 
			   ПерваяЧастьСтраховогоНомера = Лев(СНИЛС,9);
			   ВтораяЧастьСтраховогоНомера = Прав(СНИЛС,2);
			   ОбластьСтрока.Параметры.СНИЛС = Число(ПерваяЧастьСтраховогоНомера);
			   ОбластьСтрока.Параметры.КонтрольнаяСумма = Число(ВтораяЧастьСтраховогоНомера);
			   ОбластьСтрока.Параметры.Пол = ВРЕГ(Лев(Строка(Выборка.Пол),1));
			   
		   	   ТабДокумент.Вывести(ОбластьСтрока);
		   КонецЦикла; 
		   
		   ОбластьПодвал.Параметры.Заполнить(ВыборкаИтогов);
		   ОбластьПодвал.Параметры.ФИОРуководителя   = Руководители.РуководительПредставление;
		   ОбластьПодвал.Параметры.ДолжностьРуководителя = Строка(Руководители.РуководительДолжность)+" "+Строка(СведенияОбОрганизации.Представление);
		   ОбластьПодвал.Параметры.ФИОИсполнителя = ФИООтветственного;
		   //Данные = Новый Структура("Объект, Тип, Вид", Организация, Перечисления.ТипыКонтактнойИнформации.Телефон, Справочники.УдалитьВидыКонтактнойИнформации.ТелефонОрганизации);
		   Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
		   Результат = Организация.КонтактнаяИнформация.НайтиСтроки(Данные);
		   Если Результат.Количество()>0 Тогда
			   ОбластьПодвал.Параметры.КонтактныйТелефон = Результат[0].Представление;
		   КонецЕсли; 
		   ТабДокумент.Вывести(ОбластьПодвал);
		   
		   ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	   КонецЕсли; 
   ИначеЕсли ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоРешениюСуда Тогда
	   //здесь может быть два реестра - средства МК и возвраты по умершим
	   //это если не вступил в силу
	   Запрос = Новый Запрос;
	   Запрос.Текст = "ВЫБРАТЬ
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.НаименованиеПолное КАК ФИОЗастрахованногоЛица,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.Пол КАК Пол,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.МестоРождения КАК МестоРождения,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.ДатаРождения КАК ДатаРождения,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР КАК НомерПФР,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Сумма КАК Сумма,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.НомерСтроки КАК НомерСтроки,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаСВ, 0) КАК СуммаСВ,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаДСВ, 0) КАК СуммаДСВ,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаСФ, 0) КАК СуммаСФ,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаМК, 0) КАК СуммаМК,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаОстаток, 0) КАК СуммаОстаток,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаСВ_ИД, 0) КАК СуммаСВ_ИД,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаДСВ_ИД, 0) КАК СуммаДСВ_ИД,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаСФ_ИД, 0) КАК СуммаСФ_ИД,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаМК_ИД, 0) КАК СуммаМК_ИД,
	                  |	уп_ПредыдущиеСтраховщикиПоДоговорамОПССрезПоследних.ПредыдущийСтраховщик КАК ПредыдущийСтраховщик,
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.уп_ФИОВРеестреПФР КАК ФИОВРеестреПФР,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаКомпенсации, 0) КАК СуммаКомпенсации,
	                  |	ЕСТЬNULL(ВзносыСФ.СуммаВосполнения, 0) КАК СуммаВосполнения
	                  |ИЗ
	                  |	Документ.уп_ЗакрытиеДоговораОПС.ДоговорыОПС КАК ЗакрытиеДоговораОПСДоговорыОПС
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                  |			уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ДоговорОПС КАК ДоговорОПС,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ВзносыФиз)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаСВ,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ДопВзносы)
	                  |							ИЛИ уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ВзносыЮр)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаДСВ,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ГосПоддержка)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаСФ,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.МатКапитал)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаМК,
	                  |			СУММА(уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма) КАК СуммаОстаток,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДФиз)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаСВ_ИД,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДДопВзносы)
	                  |							ИЛИ уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДЮр)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаДСВ_ИД,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДГосПоддержка)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаСФ_ИД,
	                  |			СУММА(ВЫБОР
	                  |					КОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы = ЗНАЧЕНИЕ(Справочник.уп_ТипыСуммОПС.ИДМатКапитал)
	                  |						ТОГДА уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма
	                  |					ИНАЧЕ 0
	                  |				КОНЕЦ) КАК СуммаМК_ИД,
	                  |			СУММА(уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаКомпенсации) КАК СуммаКомпенсации,
	                  |			СУММА(уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаВосполнения + уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаВозмещения) КАК СуммаВосполнения
	                  |		ИЗ
	                  |			Документ.уп_ЗакрытиеДоговораОПС.РасшифровкаСуммы КАК уп_ЗакрытиеДоговораОПСРасшифровкаСуммы
	                  |		ГДЕ
	                  |			уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Ссылка = &Ссылка
	                  |		
	                  |		СГРУППИРОВАТЬ ПО
	                  |			уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ДоговорОПС) КАК ВзносыСФ
	                  |		ПО ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС = ВзносыСФ.ДоговорОПС
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПредыдущиеСтраховщикиПоДоговорамОПС.СрезПоследних(&ДатаДок, ) КАК уп_ПредыдущиеСтраховщикиПоДоговорамОПССрезПоследних
	                  |		ПО ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС = уп_ПредыдущиеСтраховщикиПоДоговорамОПССрезПоследних.ДоговорОПС
	                  |ГДЕ
	                  |	ЗакрытиеДоговораОПСДоговорыОПС.Ссылка = &Ссылка
	                  |	И уп_ПредыдущиеСтраховщикиПоДоговорамОПССрезПоследних.ПредыдущийСтраховщик = &ПФР
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |	НомерСтроки
	                  |ИТОГИ
	                  |	СУММА(Сумма),
	                  |	СУММА(СуммаСВ),
	                  |	СУММА(СуммаДСВ),
	                  |	СУММА(СуммаСФ),
	                  |	СУММА(СуммаМК),
	                  |	СУММА(СуммаОстаток),
	                  |	СУММА(СуммаСВ_ИД),
	                  |	СУММА(СуммаДСВ_ИД),
	                  |	СУММА(СуммаСФ_ИД),
	                  |	СУММА(СуммаМК_ИД),
	                  |	СУММА(СуммаКомпенсации),
	                  |	СУММА(СуммаВосполнения)
	                  |ПО
	                  |	ОБЩИЕ";
	   
	   Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	   Запрос.УстановитьПараметр("ДатаДок", ЭтотОбъект.Дата-1);
	   Запрос.УстановитьПараметр("ПФР", Константы.уп_ПенсионныйФондРФ.Получить());
	   
	   Результат = Запрос.Выполнить();
	   ВыборкаИтогов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	   Если ВыборкаИтогов.Следующий() Тогда
		   
		   ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		   ОбластьШапка.Параметры.НомерРеестра = Номер;
		   ОбластьШапка.Параметры.ДатаРеестра = Формат(Дата,"ДФ=dd.MM.yyyy");
		   ТабДокумент.Вывести(ОбластьШапка);
		   
		   ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок5");
		   ОбластьТекст = Макет.ПолучитьОбласть("ТекстоваяЧасть5");
		   
		   ТабДокумент.Вывести(ОбластьЗаголовок);
		   ТабДокумент.Вывести(ОбластьОрг);
		   ТабДокумент.Вывести(ОбластьТекст);
	  	   ТабДокумент.Вывести(ОбластьШапкаТабл);
	   
		   НомерСтроки = 0;
		   Выборка = ВыборкаИтогов.Выбрать();
		   Пока Выборка.Следующий() Цикл
			   НомерСтроки = НомерСтроки+1;
			   ОбластьСтрока.Параметры.Заполнить(Выборка);
			   Если ЗначениеЗаполнено(Выборка.ФИОВРеестреПФР) Тогда
				   ФИО = Выборка.ФИОВРеестреПФР;
			   Иначе
				   ФИО = Выборка.ФИОЗастрахованногоЛица;
			   КонецЕсли;
			   Фам = Лев(ФИО, Найти(ФИО, " ")-1);
			   ИО = Прав(ФИО, СтрДлина(ФИО)-Найти(ФИО, " "));
			   Имя = Лев(ИО, Найти(ИО, " ")-1);
			   Отчество = Прав(ИО, СтрДлина(ИО)-Найти(ИО, " "));
			   
			   ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
			   ОбластьСтрока.Параметры.ФамилияСтр = ВРЕГ(Фам);
			   ОбластьСтрока.Параметры.ИмяСтр = ВРЕГ(Имя);
			   ОбластьСтрока.Параметры.ОтчествоСтр = ВРЕГ(Отчество);
			   ОбластьСтрока.Параметры.ДатаРожденияСтр = Формат(Выборка.ДатаРождения,"ДФ=dd.MM.yyyy");
			   МестоРожденияСтр = СтрЗаменить(Выборка.МестоРождения, "0,", "");
			   ОбластьСтрока.Параметры.МестоРожденияСтр = СокрЛП(СтрЗаменить(МестоРожденияСтр,",",", "));
			   СНИЛС = уп_ОПС.ПреобразоватьНомерПФРДляРеестра(Выборка.НомерПФР); 
			   ПерваяЧастьСтраховогоНомера = Лев(СНИЛС,9);
			   ВтораяЧастьСтраховогоНомера = Прав(СНИЛС,2);
			   ОбластьСтрока.Параметры.СНИЛС = Число(ПерваяЧастьСтраховогоНомера);
			   ОбластьСтрока.Параметры.КонтрольнаяСумма = Число(ВтораяЧастьСтраховогоНомера);
			   ОбластьСтрока.Параметры.Пол = ВРЕГ(Лев(Строка(Выборка.Пол),1));
		   	   ТабДокумент.Вывести(ОбластьСтрока);
		   КонецЦикла; 
		   
		   ОбластьПодвал.Параметры.Заполнить(ВыборкаИтогов);
		   ОбластьПодвал.Параметры.ФИОРуководителя   = Руководители.РуководительПредставление;
		   ОбластьПодвал.Параметры.ДолжностьРуководителя = Строка(Руководители.РуководительДолжность)+" "+Строка(СведенияОбОрганизации.Представление);
		   ОбластьПодвал.Параметры.ФИОИсполнителя = ФИООтветственного;
		   //Данные = Новый Структура("Объект, Тип, Вид", Организация, Перечисления.ТипыКонтактнойИнформации.Телефон, Справочники.УдалитьВидыКонтактнойИнформации.ТелефонОрганизации);
		   Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
		   Результат = Организация.КонтактнаяИнформация.НайтиСтроки(Данные);
		   Если Результат.Количество()>0 Тогда
			   ОбластьПодвал.Параметры.КонтактныйТелефон = Результат[0].Представление;
		   КонецЕсли;	   
		   ТабДокумент.Вывести(ОбластьПодвал);
		   
		   ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	   КонецЕсли; 
	КонецЕсли;   

	Возврат ТабДокумент;

КонецФункции // ПечатьПоступлениеТоваров()

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура РасшОбщ_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	#Вставка
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уп_РешениеОВыплатеСредствПенсионныхНакоплений") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Дата = ДанныеЗаполнения.Дата - 86400;
		Ответственный = ДанныеЗаполнения.Ответственный;
		ПодразделениеОрганизации = ДанныеЗаполнения.ПодразделениеОрганизации;
		ПенсионныйФонд = Константы.уп_ПенсионныйФондРФ.Получить();
		ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти;
		НовСтр = ДоговорыОПС.Добавить();
		НовСтр.ДоговорОПС = ДанныеЗаполнения.ДоговорОПС;
		НовСтр.Участник = ДанныеЗаполнения.ДоговорОПС.Участник;
		НовСтр.ДатаСмерти = ДанныеЗаполнения.ДоговорОПС.Участник.уп_ФизЛицо.уп_ДатаСмерти;
		НовСтр.Состояние = РегистрыСведений.уп_СостоянияДоговораОПС.ПолучитьПоследнее(Дата, Новый Структура("ДоговорОПС", ДанныеЗаполнения.ДоговорОПС)).Состояние;
		Рассчитать();
	КонецЕсли;
	// ХМНПФ 28.01.2016 ШадринАВ // ОбработкаЗаполнения() // №156
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уп_РешениеОВыплатеСредствПНИзРезерваФондаПоОПС") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Дата = ДанныеЗаполнения.Дата - 86400;
		Ответственный = ДанныеЗаполнения.Ответственный;
		ПодразделениеОрганизации = ДанныеЗаполнения.ПодразделениеОрганизации;
		ПенсионныйФонд = Константы.уп_ПенсионныйФондРФ.Получить();
		ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти;
		НовСтр = ДоговорыОПС.Добавить();
		НовСтр.ДоговорОПС = ДанныеЗаполнения.ДоговорОПС;
		НовСтр.Участник = ДанныеЗаполнения.ДоговорОПС.Участник;
		НовСтр.ДатаСмерти = ДанныеЗаполнения.ДоговорОПС.Участник.уп_ФизЛицо.уп_ДатаСмерти;
		НовСтр.Состояние = РегистрыСведений.уп_СостоянияДоговораОПС.ПолучитьПоследнее(Дата, Новый Структура("ДоговорОПС", ДанныеЗаполнения.ДоговорОПС)).Состояние;
		Рассчитать();
	КонецЕсли;
	#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура РасшОбщ_ОбработкаПроведения(Отказ, Режим)
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);

	// Проверка ручной корректировки
	Если уп_ОсновнаяПоставкаСервер.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект,Ложь) Тогда
		Возврат
	КонецЕсли;

	#Вставка
	// +ХМНПФ 06.04.2016 ЛыткинАМ // ОбработкаПроведения() // №302
	Если ХМ_ОбработкаПроведения(Отказ, Режим) = Истина Тогда
		Возврат;
	КонецЕсли;
	// -ХМНПФ 06.04.2016 ЛыткинАМ // ОбработкаПроведения() // №302
	#КонецВставки
	МассивСообщений = Новый СписокЗначений;
	// Магера Д.В. проверим есть ли "Решения о выплате средств пенсионных накоплений"
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уп_РешениеОВыплатеСредствПенсионныхНакоплений.ДоговорОПС
	               |ИЗ
	               |	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений КАК уп_РешениеОВыплатеСредствПенсионныхНакоплений
	               |ГДЕ
	               |	уп_РешениеОВыплатеСредствПенсионныхНакоплений.ДоговорОПС В (&ДоговорОПС)
	               |	И уп_РешениеОВыплатеСредствПенсионныхНакоплений.Проведен = ИСТИНА
	               |	И уп_РешениеОВыплатеСредствПенсионныхНакоплений.Дата <= &Дата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	уп_РешениеОВыплатеСредствПенсионныхНакоплений.ДоговорОПС";
	
	Запрос.УстановитьПараметр("ДоговорОПС", ЭтотОбъект.ДоговорыОПС.Выгрузить(,"ДоговорОПС")); 
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Количество() > 0 Тогда
		
		НовСообщение = Новый СообщениеПользователю;
		НовСообщение.Текст = "По договорам есть решение о выплате , датой раньше, чем закрытие договора. Номера договоров:";
		НовСообщение.Сообщить();
		
		МассивСообщений.Добавить(НовСообщение.Текст);
	КонецЕсли;
	
	Пока Результат.Следующий() Цикл
		НовСообщение = Новый СообщениеПользователю;
		НовСообщение.Текст = строка(Результат.ДоговорОПС) ;
		НовСообщение.Сообщить();
		МассивСообщений.Добавить(НовСообщение.Текст);
	КонецЦикла;	
	
	Если Результат.Количество() > 0  Тогда		
		#Удаление
		Отказ = Истина;		
		Возврат;		
		#КонецУдаления
	КонецЕсли;

	// Укажем, что надо проверить:
	Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоРешениюСуда Тогда
		СтруктураОбязательныхПолей = Новый Структура("Организация, Ответственный");
	Иначе
		СтруктураОбязательныхПолей = Новый Структура("Организация, ПенсионныйФонд, Ответственный");
	КонецЕсли;
	уп_ОсновнаяПоставкаСервер.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ТабБухУчет = уп_ОбщегоНазначенияУчетРезервов.СформироватьСтруктуруТаблицыБУ();
	ПенсионныеПравила = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
	ПроводкиПоНачислению = ПенсионныеПравила.ПроводкиПоНачислению;
	ВозвращатьСредства = Истина;
	
	СтарыйАлгоритм = ?(РасшифровкаСуммы.Количество() = 0 и ДоговорыОПС.Итог("Сумма")<>0, Истина, Ложь);
	
	Если СтарыйАлгоритм Тогда
		ДеревоСумм = РассчитатьПоТипам();
	Иначе
		ПроверкаКорректности(Отказ, Заголовок);
	КонецЕсли;
	//СуммаДокумента = 0;
	//Для Каждого стр из ДеревоСумм.Строки Цикл
	//	Для Каждого строка из стр.Строки Цикл	
	//	КонецЦикла;
	//КонецЦикла;
	ТабОсобыхСлучаев = Новый ТаблицаЗначений;
	ТабОсобыхСлучаев.Колонки.Добавить("ДоговорОПС");
	ТабОсобыхСлучаев.Колонки.Добавить("ПредыдущийСтраховщик");
	ТабОсобыхСлучаев.Колонки.Добавить("ДатаВступленияВДействие");
	ТабОсобыхСлучаев.Колонки.Добавить("ДатаСмерти");
	
	//определим состояния, причину закрытия
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС КАК ДоговорОПС,
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.Сумма КАК Сумма,
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.ДатаСмерти КАК ДатаСмерти,
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.МатКапитал КАК МатКапитал,
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.Состояние КАК Состояние,
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.ДатаВступленияВДействие КАК ДатаВступленияВДействие,
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.НадлежащийСтраховщик КАК НадлежащийСтраховщик,
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.Заявление КАК Заявление,
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.НачисленнаяСрочнаяПенсия КАК НачисленнаяСрочнаяПенсия,
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.КоличествоПравопреемников КАК КоличествоПравопреемников,
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.СуммаГарантированная КАК СуммаГарантированная,
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.ДатаВзносаПредыдущегоСтраховщика КАК ДатаВзносаПредыдущегоСтраховщика,
	#Удаление
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.ВернутьПредыдущемуСтраховщику КАК ВернутьПредыдущемуСтраховщику,
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.СуммаОстаток КАК СуммаОстаток
	#КонецУдаления
	#Вставка
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.ВернутьПредыдущемуСтраховщику КАК ВернутьПредыдущемуСтраховщику
	#КонецВставки
	|ПОМЕСТИТЬ ДоговорыКЗакрытию
	|ИЗ
	|	Документ.уп_ЗакрытиеДоговораОПС.ДоговорыОПС КАК уп_ЗакрытиеДоговораОПСДоговорыОПС
	|ГДЕ
	|	уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	уп_ПричиныЗакрытияДоговоровОПССрезПоследних.ПричинаЗакрытия КАК ПричинаЗакрытия
	|ПОМЕСТИТЬ ПричиныЗакрытия
	|ИЗ
	|	РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(
	|			&ДатаДок,
	|			ДоговорОПС В
	|				(ВЫБРАТЬ
	|					ДоговорыКЗакрытию.ДоговорОПС
	|				ИЗ
	|					ДоговорыКЗакрытию)) КАК уп_ПричиныЗакрытияДоговоровОПССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ПредыдущиеСтраховщикиПоДоговорамОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	уп_ПредыдущиеСтраховщикиПоДоговорамОПССрезПоследних.ПредыдущийСтраховщик КАК ПредыдущийСтраховщик
	|ПОМЕСТИТЬ ПредСтрахощики
	|ИЗ
	|	РегистрСведений.уп_ПредыдущиеСтраховщикиПоДоговорамОПС.СрезПоследних(
	|			&ДатаДок,
	|			ДоговорОПС В
	|				(ВЫБРАТЬ
	|					ДоговорыКЗакрытию.ДоговорОПС
	|				ИЗ
	|					ДоговорыКЗакрытию)) КАК уп_ПредыдущиеСтраховщикиПоДоговорамОПССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние КАК СостояниеОснЧасти
	|ПОМЕСТИТЬ СостоянияОснЧасти
	|ИЗ
	|	РегистрСведений.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.СрезПоследних(
	|			&ДатаДок,
	|			ДоговорОПС В
	|				(ВЫБРАТЬ
	|					ДоговорыКЗакрытию.ДоговорОПС
	|				ИЗ
	|					ДоговорыКЗакрытию)) КАК уп_СостояниеОсновнойЧастиПенсионногоСчетаОПССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
	|	уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних.Состояние КАК СостояниеДопЧасти
	|ПОМЕСТИТЬ СостоянияДопЧасти
	|ИЗ
	|	РегистрСведений.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.СрезПоследних(
	|			&ДатаДок,
	|			ДоговорОПС В
	|				(ВЫБРАТЬ
	|					ДоговорыКЗакрытию.ДоговорОПС
	|				ИЗ
	|					ДоговорыКЗакрытию)) КАК уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКЗакрытию.ДоговорОПС КАК ДоговорОПС,
	|	ДоговорыКЗакрытию.Сумма КАК Сумма,
	|	ДоговорыКЗакрытию.ДатаСмерти КАК ДатаСмерти,
	|	ДоговорыКЗакрытию.МатКапитал КАК МатКапитал,
	|	ДоговорыКЗакрытию.Состояние КАК Состояние,
	|	ДоговорыКЗакрытию.ДатаВступленияВДействие КАК ДатаВступленияВДействие,
	|	ДоговорыКЗакрытию.НадлежащийСтраховщик КАК НадлежащийСтраховщик,
	|	ПричиныЗакрытия.ПричинаЗакрытия КАК ПричинаЗакрытия,
	|	ПредСтрахощики.ПредыдущийСтраховщик КАК ПредыдущийСтраховщик,
	|	ДоговорыКЗакрытию.Заявление КАК Заявление,
	|	ДоговорыКЗакрытию.НачисленнаяСрочнаяПенсия КАК НачисленнаяСрочнаяПенсия,
	|	ДоговорыКЗакрытию.КоличествоПравопреемников КАК КоличествоПравопреемников,
	|	ДоговорыКЗакрытию.СуммаГарантированная КАК СуммаГарантированная,
	|	СостоянияОснЧасти.СостояниеОснЧасти КАК СостояниеОснЧасти,
	|	СостоянияДопЧасти.СостояниеДопЧасти КАК СостояниеДопЧасти,
	|	ДоговорыКЗакрытию.ДатаВзносаПредыдущегоСтраховщика КАК ДатаВзносаПредыдущегоСтраховщика,
	#Удаление
	|	ДоговорыКЗакрытию.ВернутьПредыдущемуСтраховщику КАК ВернутьПредыдущемуСтраховщику,
	|	ДоговорыКЗакрытию.СуммаОстаток КАК СуммаОстаток
	#КонецУдаления
	#Вставка
	|	ДоговорыКЗакрытию.ВернутьПредыдущемуСтраховщику КАК ВернутьПредыдущемуСтраховщику
	#КонецВставки
	|ИЗ
	|	ДоговорыКЗакрытию КАК ДоговорыКЗакрытию
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПричиныЗакрытия КАК ПричиныЗакрытия
	|		ПО ДоговорыКЗакрытию.ДоговорОПС = ПричиныЗакрытия.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредСтрахощики КАК ПредСтрахощики
	|		ПО ДоговорыКЗакрытию.ДоговорОПС = ПредСтрахощики.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостоянияОснЧасти КАК СостоянияОснЧасти
	|		ПО ДоговорыКЗакрытию.ДоговорОПС = СостоянияОснЧасти.ДоговорОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ СостоянияДопЧасти КАК СостоянияДопЧасти
	|		ПО ДоговорыКЗакрытию.ДоговорОПС = СостоянияДопЧасти.ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыОПС.ДоговорОПС КАК ДоговорОПС,
	|	уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Ссылка КАК Заявление
	|ПОМЕСТИТЬ ВТ_ЗаявленияЕВ
	|ИЗ
	|	ДоговорыКЗакрытию КАК ВТ_ДоговорыОПС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уп_ЗаявлениеЗЛОЕдиновременнойВыплате КАК уп_ЗаявлениеЗЛОЕдиновременнойВыплате
	|		ПО ВТ_ДоговорыОПС.ДоговорОПС = уп_ЗаявлениеЗЛОЕдиновременнойВыплате.ДоговорОПС
	|			И (уп_ЗаявлениеЗЛОЕдиновременнойВыплате.Проведен)
	|ГДЕ
	|	&БезЗаявлений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыОПС.ДоговорОПС КАК ДоговорОПС,
	|	уп_ЗаявлениеЗЛОНазначенииНЧТП.Ссылка КАК Заявление
	|ПОМЕСТИТЬ ВТ_ЗаявленияНЧТП
	|ИЗ
	|	ДоговорыКЗакрытию КАК ВТ_ДоговорыОПС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уп_ЗаявлениеЗЛОНазначенииНЧТП КАК уп_ЗаявлениеЗЛОНазначенииНЧТП
	|		ПО ВТ_ДоговорыОПС.ДоговорОПС = уп_ЗаявлениеЗЛОНазначенииНЧТП.ДоговорОПС
	|			И (уп_ЗаявлениеЗЛОНазначенииНЧТП.Проведен)
	|ГДЕ
	|	&БезЗаявлений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыОПС.ДоговорОПС КАК ДоговорОПС,
	|	уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.Ссылка КАК Заявление
	|ПОМЕСТИТЬ ВТ_ЗаявленияСВ
	|ИЗ
	|	ДоговорыКЗакрытию КАК ВТ_ДоговорыОПС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты КАК уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты
	|		ПО ВТ_ДоговорыОПС.ДоговорОПС = уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.ДоговорОПС
	|			И (уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.Проведен)
	|ГДЕ
	|	&БезЗаявлений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаявленияЕВ.ДоговорОПС КАК ДоговорОПС
	|ПОМЕСТИТЬ ВТ_ЕстьЗаявления
	|ИЗ
	|	ВТ_ЗаявленияЕВ КАК ВТ_ЗаявленияЕВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_РешениеОбОтказеВЕдиновременнойВыплате КАК уп_РешениеОбОтказеВЕдиновременнойВыплате
	|		ПО ВТ_ЗаявленияЕВ.Заявление = уп_РешениеОбОтказеВЕдиновременнойВыплате.ДокументОснование
	|			И (уп_РешениеОбОтказеВЕдиновременнойВыплате.Проведен)
	|ГДЕ
	|	уп_РешениеОбОтказеВЕдиновременнойВыплате.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаявленияНЧТП.ДоговорОПС
	|ИЗ
	|	ВТ_ЗаявленияНЧТП КАК ВТ_ЗаявленияНЧТП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_РешениеОбОтказеНЧТП КАК уп_РешениеОбОтказеНЧТП
	|		ПО ВТ_ЗаявленияНЧТП.Заявление = уп_РешениеОбОтказеНЧТП.ДокументОснование
	|			И (уп_РешениеОбОтказеНЧТП.Проведен)
	|ГДЕ
	|	уп_РешениеОбОтказеНЧТП.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаявленияСВ.ДоговорОПС
	|ИЗ
	|	ВТ_ЗаявленияСВ КАК ВТ_ЗаявленияСВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_РешениеОбОтказеСВ КАК уп_РешениеОбОтказеСВ
	|		ПО ВТ_ЗаявленияСВ.Заявление = уп_РешениеОбОтказеСВ.ДокументОснование
	|			И (уп_РешениеОбОтказеСВ.Проведен)
	|ГДЕ
	|	уп_РешениеОбОтказеСВ.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЕстьЗаявления.ДоговорОПС КАК ДоговорОПС,
	|	ВТ_ЕстьЗаявления.ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР КАК СНИЛС
	|ИЗ
	|	ВТ_ЕстьЗаявления КАК ВТ_ЕстьЗаявления
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЕстьЗаявления.ДоговорОПС,
	|	ВТ_ЕстьЗаявления.ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаявленияЕВ.ДоговорОПС КАК ДоговорОПС
	|ПОМЕСТИТЬ ВТ_ЕстьРешенияОбОтказе
	|ИЗ
	|	ВТ_ЗаявленияЕВ КАК ВТ_ЗаявленияЕВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_РешениеОбОтказеВЕдиновременнойВыплате КАК уп_РешениеОбОтказеВЕдиновременнойВыплате
	|		ПО ВТ_ЗаявленияЕВ.Заявление = уп_РешениеОбОтказеВЕдиновременнойВыплате.ДокументОснование
	|			И (уп_РешениеОбОтказеВЕдиновременнойВыплате.Проведен)
	|ГДЕ
	|	НЕ уп_РешениеОбОтказеВЕдиновременнойВыплате.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаявленияНЧТП.ДоговорОПС
	|ИЗ
	|	ВТ_ЗаявленияНЧТП КАК ВТ_ЗаявленияНЧТП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_РешениеОбОтказеНЧТП КАК уп_РешениеОбОтказеНЧТП
	|		ПО ВТ_ЗаявленияНЧТП.Заявление = уп_РешениеОбОтказеНЧТП.ДокументОснование
	|			И (уп_РешениеОбОтказеНЧТП.Проведен)
	|ГДЕ
	|	НЕ уп_РешениеОбОтказеНЧТП.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗаявленияСВ.ДоговорОПС
	|ИЗ
	|	ВТ_ЗаявленияСВ КАК ВТ_ЗаявленияСВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_РешениеОбОтказеСВ КАК уп_РешениеОбОтказеСВ
	|		ПО ВТ_ЗаявленияСВ.Заявление = уп_РешениеОбОтказеСВ.ДокументОснование
	|			И (уп_РешениеОбОтказеСВ.Проведен)
	|ГДЕ
	|	НЕ уп_РешениеОбОтказеСВ.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЕстьРешенияОбОтказе.ДоговорОПС КАК ДоговорОПС
	|ИЗ
	|	ВТ_ЕстьРешенияОбОтказе КАК ВТ_ЕстьРешенияОбОтказе";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаДок", Дата-1);
	Запрос.УстановитьПараметр("БезЗаявлений", Истина);
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	ЕстьЗаявление = ПакетРезультатов[10].Выбрать();
	Пока ЕстьЗаявление.Следующий() Цикл
		НовСообщение = Новый СообщениеПользователю;
		НовСообщение.Текст = "По договору "+ЕстьЗаявление.ДоговорОПС+" есть заявление на выплату без отказного решения.";
		НовСообщение.Сообщить();
		
		МассивСообщений.Добавить(НовСообщение.Текст);
		Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПереходДосрочный
			или ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.Досрочное Тогда
			Отказ = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	ЕстьРешенияОбОтказе = ПакетРезультатов[12].Выбрать();
	Пока ЕстьРешенияОбОтказе.Следующий() Цикл
		НовСообщение = Новый СообщениеПользователю;
		НовСообщение.Текст = "По договору "+ЕстьРешенияОбОтказе.ДоговорОПС+" есть заявление на выплату с отказным решением.";
		НовСообщение.Сообщить();
		
		МассивСообщений.Добавить(НовСообщение.Текст);
		//Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПереходДосрочный
		//	или ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.Досрочное Тогда
		//	Отказ = Истина;
		//КонецЕсли;	
	КонецЦикла;
	
	
	Результат = ПакетРезультатов[5];
	ТекСтрокаДоговорыОПС = Результат.Выбрать();
	
	Пока ТекСтрокаДоговорыОПС.Следующий() Цикл
	//Для Каждого ТекСтрокаДоговорыОПС Из ДоговорыОПС Цикл
		ЗакрытьДоговор = Ложь;
		//надо проверить, возможно договор уже закрыт
		//ТекСостояние = РегистрыСведений.уп_СостоянияДоговораОПС.ПолучитьПоследнее(Дата-1, Новый Структура("ДоговорОПС", ТекСтрокаДоговорыОПС.ДоговорОПС)).Состояние;
		ТекСостояние = ТекСтрокаДоговорыОПС.Состояние;
		Если НЕ ДополнительнаяВыплата Тогда
			Если ТекСостояние = Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию
				или  ТекСостояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт Тогда
				Сообщить("Договор ОПС "+ТекСтрокаДоговорыОПС.ДоговорОПС.Код+" уже находится в состоянии "+ТекСостояние+".");
				МассивСообщений.Добавить("Договор ОПС "+ТекСтрокаДоговорыОПС.ДоговорОПС.Код+" уже находится в состоянии "+ТекСостояние+".");
			КонецЕсли;
			Если ТекСостояние = Перечисления.уп_СостоянияДоговоровОПС.ВыплатнойПериод Тогда
				Если ТекСтрокаДоговорыОПС.СостояниеОснЧасти = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.НЧТП
					ИЛИ ТекСтрокаДоговорыОПС.СостояниеОснЧасти = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.СрочнаяВыплата Тогда
					Сообщить("По основной части договора ОПС "+ТекСтрокаДоговорыОПС.ДоговорОПС.Код+" назначена выплата. "+ТекСтрокаДоговорыОПС.СостояниеОснЧасти+".",СтатусСообщения.Внимание);
					МассивСообщений.Добавить("По основной части договора ОПС "+ТекСтрокаДоговорыОПС.ДоговорОПС.Код+" назначена выплата. "+ТекСтрокаДоговорыОПС.СостояниеОснЧасти+".");
				КонецЕсли;
				Если ТекСтрокаДоговорыОПС.СостояниеДопЧасти = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.НЧТП
					ИЛИ ТекСтрокаДоговорыОПС.СостояниеДопЧасти = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.СрочнаяВыплата Тогда
					Сообщить("По доп. части договора ОПС "+ТекСтрокаДоговорыОПС.ДоговорОПС.Код+" назначена выплата. "+ТекСтрокаДоговорыОПС.СостояниеДопЧасти+".",СтатусСообщения.Внимание);
					МассивСообщений.Добавить("По доп. части договора ОПС "+ТекСтрокаДоговорыОПС.ДоговорОПС.Код+" назначена выплата. "+ТекСтрокаДоговорыОПС.СостояниеДопЧасти+".");
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		
		ОсобыйСлучай = Ложь;
		
		//надо сверить причины закрытия
		//ТекПричина = РегистрыСведений.уп_ПричиныЗакрытияДоговоровОПС.ПолучитьПоследнее(Дата,Новый Структура("ДоговорОПС", ТекСтрокаДоговорыОПС.ДоговорОПС)).ПричинаЗакрытия;
		ТекПричина = ТекСтрокаДоговорыОПС.ПричинаЗакрытия;
		Если (ЗначениеЗаполнено(ТекПричина)) Тогда
			Если ТекПричина<>ПричинаЗакрытия Тогда
				//Отказ = Истина;
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У договора ОПС "+ТекСтрокаДоговорыОПС.ДоговорОПС.Код+" установлена иная причина закрытия, "+ТекПричина,,Заголовок);
				МассивСообщений.Добавить("У договора ОПС "+ТекСтрокаДоговорыОПС.ДоговорОПС.Код+" установлена иная причина закрытия, "+ТекПричина);
			КонецЕсли;	
		КонецЕсли;
		
		//Если (ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти и ВозвращатьСредства)
		Если (ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти и ТекСтрокаДоговорыОПС.ВернутьПредыдущемуСтраховщику)
			или ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоРешениюСуда Тогда
			//сверим в датой смерти
			//Если ЗначениеЗаполнено(ТекСтрокаДоговорыОПС.ДатаВступленияВДействие) И ЗначениеЗаполнено(ТекСтрокаДоговорыОПС.ДатаСмерти) Тогда
			//	Если ТекСтрокаДоговорыОПС.ДатаВступленияВДействие>ТекСтрокаДоговорыОПС.ДатаСмерти Тогда
			//		ОсобыйСлучай = Истина;
			//		Сообщить("По договору №"+ТекСтрокаДоговорыОПС.ДоговорОПС+" дата вступления в действие "+Формат(ТекСтрокаДоговорыОПС.ДатаВступленияВДействие,"ДФ=dd.MM.yyyy")+", а дата смерти "+Формат(ТекСтрокаДоговорыОПС.ДатаСмерти,"ДФ=dd.MM.yyyy")+"
			//		|средства будут возвращены предыдущему страховщику.");
			//	КонецЕсли;
			//ИначеЕсли ТекСтрокаДоговорыОПС.Состояние = перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПодтвержденияПФР
			//	или ТекСтрокаДоговорыОПС.Состояние = перечисления.уп_СостоянияДоговоровОПС.ОжиданиеПоступленияВзносов Тогда
			//	ОсобыйСлучай = Истина;
			//	Сообщить("Договор №"+ТекСтрокаДоговорыОПС.ДоговорОПС+" не вступил в действие.");
			//КонецЕсли;
			Если ТекСтрокаДоговорыОПС.ВернутьПредыдущемуСтраховщику Тогда
				ОсобыйСлучай = Истина;
				Сообщить("По договору №"+ТекСтрокаДоговорыОПС.ДоговорОПС+" дата вступления в действие "+Формат(ТекСтрокаДоговорыОПС.ДатаВступленияВДействие,"ДФ=dd.MM.yyyy")+", а дата смерти "+Формат(ТекСтрокаДоговорыОПС.ДатаСмерти,"ДФ=dd.MM.yyyy")+"
				|средства будут возвращены предыдущему страховщику.");
				МассивСообщений.Добавить("По договору №"+ТекСтрокаДоговорыОПС.ДоговорОПС+" дата вступления в действие "+Формат(ТекСтрокаДоговорыОПС.ДатаВступленияВДействие,"ДФ=dd.MM.yyyy")+", а дата смерти "+Формат(ТекСтрокаДоговорыОПС.ДатаСмерти,"ДФ=dd.MM.yyyy")+"
				|средства будут возвращены предыдущему страховщику.");
			КонецЕсли;
			Если ОсобыйСлучай
				или ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоРешениюСуда Тогда
				НовСтрТаб = ТабОсобыхСлучаев.Добавить();
				НовСтрТаб.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
				Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоРешениюСуда Тогда
					НовСтрТаб.ПредыдущийСтраховщик = ТекСтрокаДоговорыОПС.НадлежащийСтраховщик;
				Иначе
					//ПредыдущийСтраховщик = РегистрыСведений.уп_ПредыдущиеСтраховщикиПоДоговорамОПС.ПолучитьПоследнее(Дата-1, Новый Структура("ДоговорОПС", ТекСтрокаДоговорыОПС.ДоговорОПС)).ПредыдущийСтраховщик;
					ПредыдущийСтраховщик = ТекСтрокаДоговорыОПС.ПредыдущийСтраховщик;
					НовСтрТаб.ПредыдущийСтраховщик = ПредыдущийСтраховщик;
				КонецЕсли;
				НовСтрТаб.ДатаВступленияВДействие = ТекСтрокаДоговорыОПС.ДатаВступленияВДействие;
				НовСтрТаб.ДатаСмерти = ТекСтрокаДоговорыОПС.ДатаСмерти;
			КонецЕсли;	
		КонецЕсли;
		//зарегистрируем дату для создания резерва умерших
		Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти И НЕ ОсобыйСлучай Тогда
			Если Не ЗначениеЗаполнено(ТекСтрокаДоговорыОПС.ДоговорОПС.ДатаРегистрацииСмерти) 
				ИЛИ (ЗначениеЗаполнено(ТекСтрокаДоговорыОПС.ДоговорОПС.ДатаРегистрацииСмерти) И ТекСтрокаДоговорыОПС.ДоговорОПС.ДокументРегистрацииСмерти = Ссылка) 
				ИЛИ (ЗначениеЗаполнено(ТекСтрокаДоговорыОПС.ДоговорОПС.ДатаРегистрацииСмерти) И НЕ ЗначениеЗаполнено(ТекСтрокаДоговорыОПС.ДоговорОПС.ДокументРегистрацииСмерти)) Тогда
				ДоговорОбъект = ТекСтрокаДоговорыОПС.ДоговорОПС.ПолучитьОбъект();
				ДоговорОбъект.ДатаРегистрацииСмерти = Дата;
				ДоговорОбъект.ДокументРегистрацииСмерти = Ссылка;
				ДоговорОбъект.Записать();
			КонецЕсли;
		КонецЕсли;	
		
		Если СтарыйАлгоритм Тогда //старый алгоритм
			ИтоговаяСтрока = ДеревоСумм.Строки.Найти(ТекСтрокаДоговорыОПС.ДоговорОПС, "ДоговорОПС");
			Если ИтоговаяСтрока<>Неопределено Тогда
				ВсегоНаСчете = ИтоговаяСтрока.СуммаОстаток;
				//СуммаДокумента = СуммаДокумента+ВсегоНаСчете;
				Если ВсегоНаСчете<>ТекСтрокаДоговорыОПС.Сумма Тогда
					уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору ОПС "+ТекСтрокаДоговорыОПС.ДоговорОПС.Код+" сумма на счете составляет "+ВсегоНаСчете+", а сумма, указанная в табличной части = "+ТекСтрокаДоговорыОПС.Сумма,,Заголовок);
					МассивСообщений.Добавить("По договору ОПС "+ТекСтрокаДоговорыОПС.ДоговорОПС.Код+" сумма на счете составляет "+ВсегоНаСчете+", а сумма, указанная в табличной части = "+ТекСтрокаДоговорыОПС.Сумма);
				КонецЕсли;
				Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
					Если ДоПриказа742 Тогда
						Если НЕ ЗначениеЗаполнено(ТекСтрокаДоговорыОПС.Заявление) Тогда
							Для Каждого стр из ИтоговаяСтрока.Строки Цикл
								// регистр РезервыОПС Расход
								Движение = Движения.уп_РезервыОПС.Добавить();
								Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
								Движение.Период = Дата;
								Движение.Организация = Организация;
								Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
								Движение.ТипРезерва = стр.ТипРезерва;
								Движение.ТипСуммы = стр.ТипСуммы;
								Движение.Сумма = стр.СуммаОстаток;
								Движение.Движение = Перечисления.уп_ВидыДвижений.ПереводВДругойПФ;
								Движение.ДокументРегистрации = ДокументРегистрации;
								
							КонецЦикла;
						КонецЕсли;
					Иначе
						Для Каждого стр из ИтоговаяСтрока.Строки Цикл
							Если стр.ТипСуммы = Справочники.уп_ТипыСуммОПС.МатКапитал 
								или стр.ТипСуммы = Справочники.уп_ТипыСуммОПС.ИДМатКапитал Тогда
								Движение = Движения.уп_РезервыОПС.Добавить();
								Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
								Движение.Период = Дата;
								Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
								Движение.Организация = Организация;
								Движение.ТипСуммы = стр.ТипСуммы;
								Движение.ТипРезерва = стр.ТипРезерва;
								Движение.Сумма = стр.СуммаОстаток;
								
								Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
								Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
								Движение.Период = Дата;
								Движение.Организация = Организация;
								Движение.Участник = ПенсионныйФонд;
								Движение.ДоговорОПС =ТекСтрокаДоговорыОПС.ДоговорОПС;
								Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапитала;
								Движение.ТипРезерва = стр.ТипРезерва; 
								Движение.ТипСуммы = стр.ТипСуммы;
								Движение.Сумма = стр.СуммаОстаток;
								
								ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.ВозвратМатеринскогоКапитала, ТекСтрокаДоговорыОПС.ДоговорОПС.Участник, ТекСтрокаДоговорыОПС.ДоговорОПС.ДоговорКонтрагента, 
								Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ПенсионныйФонд, ПенсионныйФонд.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, стр.СуммаОстаток);
							КонецЕсли;	
						КонецЦикла;	
					КонецЕсли;
				Иначе
					Для Каждого стр из ИтоговаяСтрока.Строки Цикл
						// регистр РезервыОПС Расход
						Движение = Движения.уп_РезервыОПС.Добавить();
						Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
						Движение.Период = Дата;
						Движение.Организация = Организация;
						Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
						Движение.ТипСуммы = стр.ТипСуммы;
						Движение.ТипРезерва = стр.ТипРезерва;
						Движение.Сумма = стр.СуммаОстаток;
						Движение.Движение = Перечисления.уп_ВидыДвижений.ПереводВДругойПФ;
						Движение.ДокументРегистрации = ДокументРегистрации;
						
						// регистр ПрочиеНачисленияОПС Приход
						Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
						Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
						Движение.Период = Дата;
						Движение.Организация = Организация;
						Движение.Участник = ПенсионныйФонд;
						Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
						Движение.ТипСуммы   = стр.ТипСуммы;
						Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойПФ;
						Движение.ДокументРегистрации = ДокументРегистрации;
						Движение.Сумма = стр.СуммаОстаток;
						
						ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.ПереводВДругойПФ, ТекСтрокаДоговорыОПС.Участник, ТекСтрокаДоговорыОПС.ДоговорОПС.ДоговорКонтрагента, 
						Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ПенсионныйФонд, ПенсионныйФонд.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, стр.СуммаОстаток);
					КонецЦикла;	
				КонецЕсли;
			ИначеЕсли ТекСтрокаДоговорыОПС.Сумма<>0 Тогда
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору ОПС "+ТекСтрокаДоговорыОПС.ДоговорОПС.Код+" нет возможности списать начисленную сумму, "+ТекСтрокаДоговорыОПС.Сумма+", т.к. на счете нет остатков.",,Заголовок);
				Отказ = Истина;
			ИначеЕсли ТекСтрокаДоговорыОПС.Сумма = 0 Тогда
				ВсегоНаСчете = 0;
			КонецЕсли;
		КонецЕсли;
		
		Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
			Если ДоПриказа742 Тогда
				Если НЕ ЗначениеЗаполнено(ТекСтрокаДоговорыОПС.Заявление) Тогда
					// регистр ПрочиеНачисленияОПС Приход
					Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Участник = ПенсионныйФонд;
					Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
					Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойПФ;
					Движение.ДокументРегистрации = ДокументРегистрации;
					Движение.Сумма = ВсегоНаСчете;
					
					ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.ПереводВДругойПФ, ТекСтрокаДоговорыОПС.Участник, ТекСтрокаДоговорыОПС.ДоговорОПС.ДоговорКонтрагента, 
					Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ПенсионныйФонд, ПенсионныйФонд.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ВсегоНаСчете);
				КонецЕсли;	
			КонецЕсли;
		ИначеЕсли ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.АннулированиеЛицензии
			ИЛИ ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПереходДосрочный 
			ИЛИ ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.Досрочное Тогда
			
			//и в регистр записать Следующего страховщика 
			//ТекСтраховщик = РегистрыСведений.уп_СледующиеСтраховщикиПоДоговорамОПС.Получить(Новый Структура("ДоговорОПС", ТекСтрокаДоговорыОПС.ДоговорОПС)).СледующийСтраховщик;
			////если причина еще не прописана, то
			//Если НЕ (ЗначениеЗаполнено(ТекСтраховщик)) Тогда
				//следующие страховщики
				Движение = Движения.уп_СледующиеСтраховщикиПоДоговорамОПС.Добавить();
				Движение.Период = Дата;
				Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
				Движение.СледующийСтраховщик = ПенсионныйФонд;
			//КонецЕсли;
		ИначеЕсли ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоРешениюСуда Тогда
				//следующие страховщики
				Движение = Движения.уп_СледующиеСтраховщикиПоДоговорамОПС.Добавить();
				Движение.Период = Дата;
				Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
				Движение.СледующийСтраховщик = ТекСтрокаДоговорыОПС.НадлежащийСтраховщик;
			//КонецЕсли;
		КонецЕсли;
		
		Если НЕ ДополнительнаяВыплата Тогда
			
			//регистр СостоянияДоговораОПС
			Движение = Движения.уп_СостоянияДоговораОПС.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
			Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
				Если ДоПриказа742 Тогда
					Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт;
				Иначе
					Если  (ТекСтрокаДоговорыОПС.Состояние = Перечисления.уп_СостоянияДоговоровОПС.ВыплатнойПериод 
						или ТекСтрокаДоговорыОПС.Состояние = Перечисления.уп_СостоянияДоговоровОПС.ВыплатыПриостановлены
						или ТекСтрокаДоговорыОПС.Состояние = Перечисления.уп_СостоянияДоговоровОПС.НачисленияПриостановлены)
						и ТекСтрокаДоговорыОПС.Сумма = 0 и ТекСтрокаДоговорыОПС.НачисленнаяСрочнаяПенсия = 0 Тогда    // еще добавить если выплаты приостановлены или начисления приостановлены
						//тут надо еще проверить, что за выплатной период - если там единовременная, то закрывать не стоит
						//СостояниеОснЧасти = РегистрыСведений.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.ПолучитьПоследнее(Дата-1, Новый Структура("ДоговорОПС", ТекСтрокаДоговорыОПС.ДоговорОПС)).Состояние;
						СостояниеОснЧасти = ТекСтрокаДоговорыОПС.СостояниеОснЧасти;
						Если СостояниеОснЧасти = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.ЕдиновременнаяВыплата Тогда
						//УНПФ--4.1.80.1--------00002	
						//	Если ТекСтрокаДоговорыОПС.СуммаОстаток = 0 Тогда 
						//		Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт;
						//	Иначе
								Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию; 
						//	КонецЕсли;
						//УНПФ--4.1.80.1--------00002	
						Иначе
							Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт;
						КонецЕсли;
					ИначеЕсли ОсобыйСлучай Тогда
						//это если не успел вступить в силу
						Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт;
					Иначе
						Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию;
					КонецЕсли;
				КонецЕсли;
				ФИЗОбъект = ТекСтрокаДоговорыОПС.ДоговорОПС.Участник.уп_ФизЛицо.ПолучитьОбъект();
				ФИЗОбъект.уп_ДатаСмерти = ТекСтрокаДоговорыОПС.ДатаСмерти;
				ФИЗОбъект.Записать(); 
			Иначе
				Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт;
			КонецЕсли;
			
			//и в регистр записать причину, если ее там еще нет
			//если причина еще не прописана, то
			Если НЕ (ЗначениеЗаполнено(ТекПричина)) или ТекПричина<> ПричинаЗакрытия Тогда
				//регистр ПричиныЗакрытия
				Движение = Движения.уп_ПричиныЗакрытияДоговоровОПС.Добавить();
				Движение.Период = Дата;
				Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
				Если ОсобыйСлучай Тогда
					Движение.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.НеВступилВСилу;
				Иначе
					Движение.ПричинаЗакрытия = ПричинаЗакрытия;
				КонецЕсли;
			КонецЕсли;
			
			//закрыть части счета
			//осн часть
			Движение = Движения.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
			Движение.Состояние = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.Прекращен;
			
			Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти 
				И ТекСтрокаДоговорыОПС.СостояниеОснЧасти = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.НЧТП Тогда
				Движение.Состояние = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.ПрекращениеНП;
				Движение.Расшифровка = Перечисления.уп_РасшифровкаСостоянияДоговораОПС.СведенияОСмерти;
			КонецЕсли;	
				
			//закрыть доп часть, если она была
			//ТекСостояниеДопЧасти = РегистрыСведений.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.ПолучитьПоследнее(Дата-1, Новый Структура("ДоговорОПС", ТекСтрокаДоговорыОПС.ДоговорОПС)).Состояние;
			ТекСостояниеДопЧасти = ТекСтрокаДоговорыОПС.СостояниеДопЧасти;
			Если ЗначениеЗаполнено(ТекСостояниеДопЧасти) Тогда
				Движение = Движения.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.Добавить();
				Движение.Период = Дата;
				Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
				Движение.Состояние = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.Прекращен;
				
				Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти 
					И ТекСостояниеДопЧасти = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.НЧТП Тогда
					Движение.Состояние = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.ПрекращениеНП;
					Движение.Расшифровка = Перечисления.уп_РасшифровкаСостоянияДоговораОПС.СведенияОСмерти;
				КонецЕсли;	
			КонецЕсли;

			#Вставка
			// +ХМНПФ 22.03.2016 ШадринАВ // ОбработкаПроведения() // №285
			ХМ_ОткорректироватьДвиженияПоСостояниям(ТекСтрокаДоговорыОПС);
			// -ХМНПФ 22.03.2016 ШадринАВ // ОбработкаПроведения() // №285
			#КонецВставки
		КонецЕсли;
	КонецЦикла;
	ДатаНачалаУчетаРезервовНачисления = Константы.уп_ДатаНачалаВеденияРезервовНачисления.Получить();
	Если (НЕ СтарыйАлгоритм) Тогда
		Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.Досрочное или ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.АннулированиеЛицензии 
			или ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПереходДосрочный Тогда 
			//спишем из резерва
			Для каждого стр из РасшифровкаСуммы Цикл
				Движение = Движения.уп_РезервыОПС.ДобавитьРасход();
				Движение.Организация = Организация;
				Движение.Период = Дата;
				Движение.ДоговорОПС = стр.ДоговорОПС;
				Движение.ТипРезерва = стр.ТипРезерва;
				Движение.ТипСуммы = стр.ТипСуммы;
				Движение.Сумма = стр.Сумма;
				Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
				Движение.СуммаВосполнения = стр.СуммаВосполнения;
				Движение.СуммаВозмещения = стр.СуммаВозмещения;
				Движение.Движение = Перечисления.уп_ВидыДвижений.ПереводВДругойПФ;
				

				#Вставка
				// +ХМНПФ 19.07.2016 ЛыткинАМ // ОбработкаПроведения // №433
				Если ХМ_НамНашИД И стр.ХМ_НашИД Тогда
					Движение = Движения.уп_РезервыОПС.ДобавитьПриход();
					Движение.Организация = Организация;
					Движение.Период = Дата;
					//Движение.ДоговорОПС = стр.ДоговорОПС;
					Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС;
					Движение.ТипСуммы = стр.ТипСуммы;
					Движение.Сумма = стр.Сумма;
					Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
					Движение.СуммаВосполнения = стр.СуммаВосполнения;
					Движение.СуммаВозмещения = стр.СуммаВозмещения;
					Движение.Движение = Перечисления.уп_ВидыДвижений.ПереводВДругойПФ;
							
					Движение = Движения.уп_АналитикаРезерваОПС.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.ДоговорОПС = стр.ДоговорОПС;
					Движение.ТипРезерва = стр.ТипРезерва;
					Движение.ТипСуммы   = стр.ТипСуммы;
					Движение.Сумма = стр.Сумма;
					Продолжить;
				КонецЕсли;
				// -ХМНПФ 19.07.2016 ЛыткинАМ // ОбработкаПроведения // №433
				#КонецВставки
				Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И Дата>=ДатаНачалаУчетаРезервовНачисления Тогда
					//резервы начисления
					Движение = Движения.уп_РезервыОПС.ДобавитьПриход();
					Движение.Организация = Организация;
					Движение.Период = Дата;
					Движение.ДоговорОПС = стр.ДоговорОПС;
					Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийРасторжение;
					Движение.ТипСуммы = стр.ТипСуммы;
					Движение.Сумма = стр.Сумма;
					Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
					Движение.СуммаВосполнения = стр.СуммаВосполнения;
					Движение.СуммаВозмещения = стр.СуммаВозмещения;
					Движение.Движение = Перечисления.уп_ВидыДвижений.ПереводВДругойПФ;
				КонецЕсли;
				
				//начисление
				Движение = Движения.уп_ПрочиеНачисленияОПС.ДобавитьПриход();
				Движение.Организация = Организация;
				Движение.Период = Дата;
				Движение.ДоговорОПС = стр.ДоговорОПС;
				Движение.Участник = ПенсионныйФонд;
				Движение.ТипВыплаты = перечисления.уп_ТипыВыплат.ПереводВДругойПФ;
				Движение.ТипСуммы = стр.ТипСуммы;
				Движение.Сумма = стр.Сумма;
				Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
				Движение.СуммаВосполнения = стр.СуммаВосполнения;
				Движение.СуммаВозмещения = стр.СуммаВозмещения;
				
				Если стр.СуммаКомпенсации<>0 Тогда
					Движение = Движения.уп_СуммыГарантийногоВосполнения.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.ДоговорОПС = стр.ДоговорОПС;
					Движение.Организация = Организация;
					Движение.ТипСуммы = стр.ТипСуммы;
					Движение.Вариант = Перечисления.уп_ВариантВосполнения.Компенсация;
					Движение.Сумма = стр.СуммаКомпенсации;
				КонецЕсли;
				
				Если стр.СуммаВосполнения<>0 Тогда
					Движение = Движения.уп_СуммыГарантийногоВосполнения.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.ДоговорОПС = стр.ДоговорОПС;
					Движение.Организация = Организация;
					Движение.ТипСуммы = стр.ТипСуммы;
					Движение.Вариант = Перечисления.уп_ВариантВосполнения.Восполнение;
					Движение.Сумма = стр.СуммаВосполнения;
				КонецЕсли;
				
				Если стр.СуммаВозмещения<>0 Тогда
					Движение = Движения.уп_СуммыГарантийногоВосполнения.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.ДоговорОПС = стр.ДоговорОПС;
					Движение.Организация = Организация;
					Движение.ТипСуммы = стр.ТипСуммы;
					Движение.Вариант = Перечисления.уп_ВариантВосполнения.Возмещение;
					Движение.Сумма = стр.СуммаВозмещения;
				Конецесли;	
				
				уп_ОбщегоНазначенияУчетРезервов.ДобавитьСтрокуВТабБухУчет(ТабБухУчет, Дата, Организация, Перечисления.уп_ВидыДвижений.ПереводВДругойПФ, Стр.ДоговорОПС.Участник, Стр.ДоговорОПС.ДоговорКонтрагента,
				Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ПенсионныйФонд, ПенсионныйФонд.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Стр.Сумма, ПодразделениеОрганизации, ПодразделениеОрганизации, 
				Справочники.уп_ТипыСуммОПС.ПустаяСсылка(),стр.ТипСуммы);
			КонецЦикла;
		ИначеЕсли ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПереводСПНвПДС Тогда
			//спишем из резерва
			Для каждого стр из РасшифровкаСуммы Цикл
				Движение = Движения.уп_РезервыОПС.ДобавитьРасход();
				Движение.Организация = Организация;
				Движение.Период = Дата;
				Движение.ДоговорОПС = стр.ДоговорОПС;
				Движение.ТипРезерва = стр.ТипРезерва;
				Движение.ТипСуммы = стр.ТипСуммы;
				Движение.Сумма = стр.Сумма;
				Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
				Движение.СуммаВосполнения = стр.СуммаВосполнения;
				Движение.СуммаВозмещения = стр.СуммаВозмещения;
				Движение.Движение = Перечисления.уп_ВидыДвижений.ПереводВДругойПФ;
				
				Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И Дата>=ДатаНачалаУчетаРезервовНачисления Тогда
					//резервы начисления
					Движение = Движения.уп_РезервыОПС.ДобавитьПриход();
					Движение.Организация = Организация;
					Движение.Период = Дата;
					Движение.ДоговорОПС = стр.ДоговорОПС;
					Если (стр.ТипСуммы = Справочники.уп_ТипыСуммОПС.МатКапитал 
						или стр.ТипСуммы = Справочники.уп_ТипыСуммОПС.ИДМатКапитал) И стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
						Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийВозвратМСКРПН;
					Иначе
						Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийРасторжение;
					КонецЕсли;
					
					Движение.ТипСуммы = стр.ТипСуммы;
					Движение.Сумма = стр.Сумма;
					Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
					Движение.СуммаВосполнения = стр.СуммаВосполнения;
					Движение.СуммаВозмещения = стр.СуммаВозмещения;
					////Движение.Движение = Перечисления.уп_ВидыДвижений.ПереводВДругойПФ;
				КонецЕсли;
				
				Если (стр.ТипСуммы = Справочники.уп_ТипыСуммОПС.МатКапитал 
					или стр.ТипСуммы = Справочники.уп_ТипыСуммОПС.ИДМатКапитал) И стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
					
					Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Участник = ПенсионныйФонд;
					Движение.ДоговорОПС =стр.ДоговорОПС;
					Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапитала;
					Движение.ТипРезерва = стр.ТипРезерва;
					Движение.ТипСуммы = стр.ТипСуммы;
					Движение.Сумма = стр.Сумма;
					Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
					Движение.СуммаВосполнения = стр.СуммаВосполнения;
					Движение.СуммаВозмещения = стр.СуммаВозмещения;
					
					ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.ВозвратМатеринскогоКапитала, стр.ДоговорОПС.Участник, ТекСтрокаДоговорыОПС.ДоговорОПС.ДоговорКонтрагента, 
					Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ПенсионныйФонд, ПенсионныйФонд.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, стр.Сумма);
				Иначе
					уп_ОбщегоНазначенияУчетРезервов.ДобавитьСтрокуВТабБухУчет(ТабБухУчет, Дата, Организация, Перечисления.уп_ВидыДвижений.ПереводВДругойПФ, Стр.ДоговорОПС.Участник, Стр.ДоговорОПС.ДоговорКонтрагента,
					Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ПенсионныйФонд, ПенсионныйФонд.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Стр.Сумма, ПодразделениеОрганизации, ПодразделениеОрганизации, 
					Справочники.уп_ТипыСуммОПС.ПустаяСсылка(),стр.ТипСуммы);
					
				КонецЕсли;
			КонецЦикла;
		Иначе
			ДатаНачалаВеденияРезерваНаследников = Константы.уп_ДатаНачалаВеденияРезерваНаследников.Получить();
			Если ЗначениеЗаполнено(ДатаНачалаВеденияРезерваНаследников) И Дата>=ДатаНачалаВеденияРезерваНаследников Тогда
				ВедетсяРезервНаследников = Истина;
			Иначе
				ВедетсяРезервНаследников = Ложь;
			КонецЕсли;	
			Для Каждого стр из РасшифровкаСуммы Цикл
				ТекСтрокаТаб = ТабОсобыхСлучаев.Найти(стр.ДоговорОПС,"ДоговорОПС");
				Если ТекСтрокаТаб<>Неопределено Тогда    //это особый случай
					//списываем все со счета на предыдущего страховщика
					//Если ТекСтрокаТаб.ПредыдущийСтраховщик = Справочники.Контрагенты.ПустаяСсылка() или ТекСтрокаТаб.ПредыдущийСтраховщик = Неопределено Тогда
					Если НЕ ЗначениеЗаполнено(ТекСтрокаТаб.ПредыдущийСтраховщик) Тогда   //ММВ
						Отказ = Истина;
						Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоРешениюСуда Тогда
							уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не указан надлежащий страховщик по договору №"+ТекСтрокаТаб.ДоговорОПС,,Заголовок);
						Иначе
							уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не указан предыдущий страховщик по договору №"+ТекСтрокаТаб.ДоговорОПС,,Заголовок);
						КонецЕсли;
						Продолжить;
					КонецЕсли;
					Движение = Движения.уп_РезервыОПС.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.ДоговорОПС = стр.ДоговорОПС;
					Движение.Организация = Организация;
					Движение.ТипСуммы = стр.ТипСуммы;
					Движение.ТипРезерва = стр.ТипРезерва;
					Движение.Сумма = стр.Сумма;
					Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
					Движение.СуммаВосполнения = стр.СуммаВосполнения;
					Движение.СуммаВозмещения = стр.СуммаВозмещения;
					Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И Дата>=ДатаНачалаУчетаРезервовНачисления Тогда
						//резервы начисления
						Движение = Движения.уп_РезервыОПС.ДобавитьПриход();
						Движение.Организация = Организация;
						Движение.Период = Дата;
						Движение.ДоговорОПС = стр.ДоговорОПС;
						Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийРасторжение;
						Движение.ТипСуммы = стр.ТипСуммы;
						Движение.Сумма = стр.Сумма;
						Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
						Движение.СуммаВосполнения = стр.СуммаВосполнения;
						Движение.СуммаВозмещения = стр.СуммаВозмещения;
						Движение.Движение = Перечисления.уп_ВидыДвижений.ПереводВДругойПФ;
					КонецЕсли;
				
					Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Участник = ТекСтрокаТаб.ПредыдущийСтраховщик;
					Движение.ДоговорОПС =стр.ДоговорОПС;
					Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойПФ;  //оставлять ли этот тип выплаты или проствить отдельный, 
					//чтобы эти средства в остатках были видны
					Движение.ТипСуммы = стр.ТипСуммы;
					Движение.Сумма = стр.Сумма;
					Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
					Движение.СуммаВосполнения = стр.СуммаВосполнения;
					Движение.СуммаВозмещения = стр.СуммаВозмещения;
					
					//оставлять ли такой вид движения и соответвенно проводку на счет 74.02.2 или сделать отдельный вид движения и отдельный счет?
					уп_ОбщегоНазначенияУчетРезервов.ДобавитьСтрокуВТабБухУчет(ТабБухУчет, Дата, Организация, Перечисления.уп_ВидыДвижений.ПереводВДругойПФ, стр.ДоговорОПС.Участник, стр.ДоговорОПС.ДоговорКонтрагента, 
					Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ТекСтрокаТаб.ПредыдущийСтраховщик, ТекСтрокаТаб.ПредыдущийСтраховщик.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, стр.Сумма, ПодразделениеОрганизации, ПодразделениеОрганизации, 
					Справочники.уп_ТипыСуммОПС.ПустаяСсылка(),стр.ТипСуммы);
				Иначе //стандартный порядок	
					//спишем материнский капитал
					Если (стр.ТипСуммы = Справочники.уп_ТипыСуммОПС.МатКапитал 
						или стр.ТипСуммы = Справочники.уп_ТипыСуммОПС.ИДМатКапитал) И стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
						Движение = Движения.уп_РезервыОПС.Добавить();
						Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
						Движение.Период = Дата;
						Движение.ДоговорОПС = стр.ДоговорОПС;
						Движение.Организация = Организация;
						Движение.ТипРезерва = стр.ТипРезерва;
						Движение.ТипСуммы = стр.ТипСуммы;
						Движение.Сумма = стр.Сумма;
						Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
						Движение.СуммаВосполнения = стр.СуммаВосполнения;
						Движение.СуммаВозмещения = стр.СуммаВозмещения;
						
						Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И Дата>=ДатаНачалаУчетаРезервовНачисления Тогда
							//резервы начисления
							Движение = Движения.уп_РезервыОПС.ДобавитьПриход();
							Движение.Организация = Организация;
							Движение.Период = Дата;
							Движение.ДоговорОПС = стр.ДоговорОПС;
							Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийВозвратМСКРПН;
							Движение.ТипСуммы = стр.ТипСуммы;
							Движение.Сумма = стр.Сумма;
							Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
							Движение.СуммаВосполнения = стр.СуммаВосполнения;
							Движение.СуммаВозмещения = стр.СуммаВозмещения;
							Движение.Движение = Перечисления.уп_ВидыДвижений.ПереводВДругойПФ;
						КонецЕсли;
						
						Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
						Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
						Движение.Период = Дата;
						Движение.Организация = Организация;
						Движение.Участник = ПенсионныйФонд;
						Движение.ДоговорОПС =стр.ДоговорОПС;
						Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапитала;
						Движение.ТипРезерва = стр.ТипРезерва;
						Движение.ТипСуммы = стр.ТипСуммы;
						Движение.Сумма = стр.Сумма;
						Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
						Движение.СуммаВосполнения = стр.СуммаВосполнения;
						Движение.СуммаВозмещения = стр.СуммаВозмещения;
						
						ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.ВозвратМатеринскогоКапитала, стр.ДоговорОПС.Участник, ТекСтрокаДоговорыОПС.ДоговорОПС.ДоговорКонтрагента, 
						Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ПенсионныйФонд, ПенсионныйФонд.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, стр.Сумма);
					Иначе //формируем резерв начислений
						Если ВедетсяРезервНаследников Тогда
							Если стр.ТипРезерва<>Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН 
								И стр.ТипРезерва<>Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
								Движение = Движения.уп_РезервыОПС.Добавить();
								Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
								Если стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты Тогда
									Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Перевод_Из_РСВ_в_РСВУмерших;
								Иначе
									Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Перевод_Из_РПН_в_РНПУмерших;
								КонецЕсли;
								Движение.Период = Дата;
								Движение.ДоговорОПС = стр.ДоговорОПС;
								Движение.Организация = Организация;
								Движение.ТипРезерва = стр.ТипРезерва;
								Движение.ТипСуммы = стр.ТипСуммы;
								Движение.Сумма = стр.Сумма;
								Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
								Движение.СуммаВосполнения = стр.СуммаВосполнения;
								Движение.СуммаВозмещения = стр.СуммаВозмещения;
								
								Движение = Движения.уп_РезервыОПС.Добавить();
								Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
								Движение.Период = Дата;
								Движение.ДоговорОПС = стр.ДоговорОПС;
								Движение.Организация = Организация;
								Если стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты Тогда
									Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ;
									Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Перевод_Из_РСВ_в_РСВУмерших;
								Иначе
									Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН;
									Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Перевод_Из_РПН_в_РНПУмерших;
								КонецЕсли;	
								Движение.ТипСуммы = стр.ТипСуммы;
								Движение.Сумма = стр.Сумма;
								Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
								Движение.СуммаВосполнения = стр.СуммаВосполнения;
								Движение.СуммаВозмещения = стр.СуммаВозмещения;
							КонецЕсли;
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
			
			//спишем резерв выплат
			Если ПричинаЗакрытия = ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	уп_РезервыОПСОстатки.Организация,
				               |	уп_РезервыОПСОстатки.ДоговорОПС,
				               |	уп_РезервыОПСОстатки.ТипСуммы,
				               |	уп_РезервыОПСОстатки.СуммаОстаток,
				               |	уп_РезервыОПСОстатки.СуммаКомпенсацииОстаток,
				               |	уп_РезервыОПСОстатки.СуммаВосполненияОстаток,
				               |	уп_РезервыОПСОстатки.СуммаВозмещенияОстаток
				               |ИЗ
				               |	РегистрНакопления.уп_РезервыОПС.Остатки(
				               |			&ДатаДок,
				               |			ДоговорОПС В (&СписокДоговоровОПС)
				               |				И ТипРезерва = &Выплатной) КАК уп_РезервыОПСОстатки";
				
				Запрос.УстановитьПараметр("ДатаДок", Ссылка.МоментВремени());
				СписокДоговоровОПС = ДоговорыОПС.ВыгрузитьКолонку("ДоговорОПС");
				Запрос.УстановитьПараметр("СписокДоговоровОПС", СписокДоговоровОПС);
				Запрос.УстановитьПараметр("Выплатной", Перечисления.уп_ТипыРезервовОПС.Выплатной);
				
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					Движение = Движения.уп_РезервыОПС.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.ДоговорОПС = Выборка.ДоговорОПС;
					Движение.Организация = Организация;
					Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.Выплатной;
					Движение.ТипСуммы = Выборка.ТипСуммы;
					Движение.Сумма = Выборка.СуммаОстаток;
					Движение.СуммаКомпенсации = Выборка.СуммаКомпенсацииОстаток;
					Движение.СуммаВосполнения = Выборка.СуммаВосполненияОстаток;
					Движение.СуммаВозмещения = Выборка.СуммаВозмещенияОстаток;
					
					Движение = Движения.уп_РезервыОПС.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.ДоговорОПС = Справочники.уп_ДоговорыОПС.ПустаяСсылка();
					Движение.Организация = Организация;
					Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.Выплатной;
					Движение.ТипСуммы = Выборка.ТипСуммы;
					Движение.Сумма = Выборка.СуммаОстаток;
					Движение.СуммаКомпенсации = Выборка.СуммаКомпенсацииОстаток;
					Движение.СуммаВосполнения = Выборка.СуммаВосполненияОстаток;
					Движение.СуммаВозмещения = Выборка.СуммаВозмещенияОстаток;
				КонецЦикла;
				
				//спишем начисленные пенсии
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	уп_НачисленияПенсийОПСОстатки.ДоговорОПС КАК ДоговорОПС,
				               |	уп_НачисленияПенсийОПСОстатки.НачПериода,
				               |	уп_НачисленияПенсийОПСОстатки.ПериодичностьВыплат,
				               |	уп_НачисленияПенсийОПСОстатки.ТипСуммы КАК ТипСуммы,
				               |	уп_НачисленияПенсийОПСОстатки.ТипПенсии КАК ТипПенсии,
				               |	уп_НачисленияПенсийОПСОстатки.СуммаОстаток КАК СуммаОстаток,
				               |	уп_РезервыОПСОстатки.СуммаОстаток КАК СуммаВРезервеНачислений,
				               |	уп_РезервыОПСОстатки.СуммаКомпенсацииОстаток КАК СуммаКомпенсации,
				               |	уп_РезервыОПСОстатки.СуммаВосполненияОстаток КАК СуммаВосполнения,
				               |	уп_РезервыОПСОстатки.СуммаВозмещенияОстаток КАК СуммаВозмещения
				               |ИЗ
				               |	РегистрНакопления.уп_НачисленияПенсийОПС.Остатки(&ДатаДок, ДоговорОПС В (&СписокДоговоровОПС)) КАК уп_НачисленияПенсийОПСОстатки
				               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_РезервыОПС.Остатки(
				               |				&ДатаДок,
				               |				ДоговорОПС В (&СписокДоговоровОПС)
				               |					И ТипРезерва В (&СписокВыплатныхНачислений)) КАК уп_РезервыОПСОстатки
				               |		ПО уп_НачисленияПенсийОПСОстатки.ДоговорОПС = уп_РезервыОПСОстатки.ДоговорОПС
				               |			И уп_НачисленияПенсийОПСОстатки.ТипСуммы = уп_РезервыОПСОстатки.ТипСуммы
				               |ИТОГИ
				               |	СУММА(СуммаОстаток),
				               |	МАКСИМУМ(СуммаВРезервеНачислений),
				               |	МАКСИМУМ(СуммаКомпенсации),
				               |	МАКСИМУМ(СуммаВосполнения),
				               |	МАКСИМУМ(СуммаВозмещения)
				               |ПО
				               |	ДоговорОПС,
				               |	ТипПенсии,
				               |	ТипСуммы";
				
				Запрос.УстановитьПараметр("ДатаДок", Ссылка.МоментВремени());
				Запрос.УстановитьПараметр("СписокДоговоровОПС", СписокДоговоровОПС);
				СписокВыплатныхНачислений = Новый СписокЗначений;
				СписокВыплатныхНачислений.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНП);
				СписокВыплатныхНачислений.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийСВ);
				Запрос.УстановитьПараметр("СписокВыплатныхНачислений", СписокВыплатныхНачислений);
				
				Результат = Запрос.Выполнить();
				ВыборкаДоговоров = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаДоговоров.Следующий() Цикл
					ВыборкаТипРезерва = ВыборкаДоговоров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаТипРезерва.Следующий() Цикл
						ВыборкаТипСуммы = ВыборкаТипРезерва.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаТипСуммы.Следующий() Цикл
							//здесь списываем резервы начислений, если есть и в размере начисленной пенсии
							Если ВыборкаТипСуммы.СуммаВРезервеНачислений<>0 Тогда
								Движение = Движения.уп_РезервыОПС.Добавить();
								Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
								Движение.Период = Дата;
								Движение.ДоговорОПС = ВыборкаТипСуммы.ДоговорОПС;
								Движение.Организация = Организация;
								Если ВыборкаТипСуммы.ТипПенсии = Перечисления.уп_ТипыПенсийОПС.Срочная Тогда
									Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийСВ;
								Иначе
									Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНП;
								КонецЕсли;
								Движение.ТипСуммы = ВыборкаТипСуммы.ТипСуммы;
								Движение.Сумма = Мин(ВыборкаТипСуммы.СуммаОстаток, ВыборкаТипСуммы.СуммаВРезервеНачислений);
							КонецЕсли;			
							Выборка = ВыборкаТипСуммы.Выбрать();
							Пока Выборка.Следующий() Цикл
								Движение = Движения.уп_НачисленияПенсийОПС.Добавить();
								Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
								Движение.Период = Дата;
								Движение.НачПериода = Выборка.НачПериода;
								Движение.ПериодичностьВыплат = Выборка.ПериодичностьВыплат;
								Движение.ДоговорОПС = Выборка.ДоговорОПС;
								Движение.ТипСуммы = Выборка.ТипСуммы;
								Движение.ТипПенсии = Выборка.ТипПенсии;
								Движение.Сумма = -Выборка.СуммаОстаток;
								
								Если ВыборкаТипСуммы.ТипПенсии = Перечисления.уп_ТипыПенсийОПС.Срочная Тогда
									Движение = Движения.уп_РезервыОПС.Добавить();
									Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
									Движение.Период = Дата;
									Движение.ДоговорОПС = ВыборкаТипСуммы.ДоговорОПС;
									Движение.Организация = Организация;
									Если ВедетсяРезервНаследников Тогда
										Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ;
									Иначе
										Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты;
									КонецЕсли;
									Движение.ТипСуммы = Выборка.ТипСуммы;
									Движение.Сумма = Выборка.СуммаОстаток;
								Иначе
									Движение = Движения.уп_РезервыОПС.Добавить();
									Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
									Движение.Период = Дата;
									Движение.ДоговорОПС = Справочники.уп_ДоговорыОПС.ПустаяСсылка();
									Движение.Организация = Организация;
									Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.Выплатной;
									Движение.ТипСуммы = Выборка.ТипСуммы;
									Движение.Сумма = Выборка.СуммаОстаток;
								КонецЕсли;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.Досрочное или ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПереходДосрочный 
		или ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоРешениюСуда Тогда
		//только тут не для всех досрочных и как одних от других отличить не ясно
		//поставили флаг КонтролироватьОбязательства
		Если КонтролироватьОбязательства Тогда
			//еще фиксация
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	уп_ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС,
			|	&ДатаДок КАК Период,
			|	&ДатаДок КАК ДатаФиксации
			|ИЗ
			|	Документ.уп_ЗакрытиеДоговораОПС.ДоговорыОПС КАК уп_ЗакрытиеДоговораОПСДоговорыОПС
			|ГДЕ
			|	уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("ДатаДок", Дата);
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			Результат = Запрос.Выполнить().Выгрузить();
			Движения.уп_ДатаФиксацииОбязательств.Загрузить(Результат);
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ДоговорОПС,
			|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы,
			|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Сумма,
			|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Ссылка.Дата КАК Период
			|ИЗ
			|	Документ.уп_ЗакрытиеДоговораОПС.РасшифровкаСуммы КАК уп_ЗакрытиеДоговораОПСРасшифровкаСуммы
			|ГДЕ
			|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Ссылка = &Ссылка
			|	И уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипРезерва = &РПН";
			
			Запрос.УстановитьПараметр("РПН", Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			Результат = Запрос.Выполнить().Выгрузить();
			Движения.уп_РазмерЗафиксированныхОбязательств.Загрузить(Результат);
			
		КонецЕсли;
		
		//еще текущий размер гарантирования
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ДоговорОПС,
		|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы,
		|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаГарантированная КАК Сумма,
		|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.уп_ЗакрытиеДоговораОПС.РасшифровкаСуммы КАК уп_ЗакрытиеДоговораОПСРасшифровкаСуммы
		|ГДЕ
		|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Ссылка = &Ссылка
		|	И уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипРезерва = &РПН
		|	И уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаГарантированная <> 0";
		
		Запрос.УстановитьПараметр("РПН", Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Результат = Запрос.Выполнить().Выгрузить();
		Результат.Колонки.Добавить("Организация");
		Результат.Колонки.Добавить("ВидДвижения");
		Результат.ЗаполнитьЗначения(Организация,"Организация");
		Результат.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход,"ВидДвижения");
		Движения.уп_ТекущаяСуммаГарантирования.Загрузить(Результат);
	ИначеЕсли ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
		//текущую сумму гарантирования закрываем только у тех, кто умер до вступления договора в силу
		//еще надо закрыть мат кап по РПН у всех остальных
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС КАК ДоговорОПС
		|ПОМЕСТИТЬ Возвраты
		|ИЗ
		|	Документ.уп_ЗакрытиеДоговораОПС.ДоговорыОПС КАК уп_ЗакрытиеДоговораОПСДоговорыОПС
		|ГДЕ
		|	уп_ЗакрытиеДоговораОПСДоговорыОПС.ВернутьПредыдущемуСтраховщику = ИСТИНА
		|	И уп_ЗакрытиеДоговораОПСДоговорыОПС.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ДоговорОПС КАК ДоговорОПС,
		|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы КАК ТипСуммы,
		|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаГарантированная КАК Сумма,
		|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.уп_ЗакрытиеДоговораОПС.РасшифровкаСуммы КАК уп_ЗакрытиеДоговораОПСРасшифровкаСуммы
		|ГДЕ
		|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Ссылка = &Ссылка
		|	И уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипРезерва = &РПН
		|	И уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаГарантированная <> 0
		|	И уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				Возвраты.ДоговорОПС
		|			ИЗ
		|				Возвраты)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ДоговорОПС,
		|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы,
		|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаГарантированная,
		|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Ссылка.Дата
		|ИЗ
		|	Документ.уп_ЗакрытиеДоговораОПС.РасшифровкаСуммы КАК уп_ЗакрытиеДоговораОПСРасшифровкаСуммы
		|ГДЕ
		|	уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.Ссылка = &Ссылка
		|	И уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипРезерва = &РПН
		|	И уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.СуммаГарантированная <> 0
		|	И НЕ уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ДоговорОПС В
		|				(ВЫБРАТЬ
		|					Возвраты.ДоговорОПС
		|				ИЗ
		|					Возвраты)
		|	И уп_ЗакрытиеДоговораОПСРасшифровкаСуммы.ТипСуммы В(&СуммыМатКап)";
		
		Запрос.УстановитьПараметр("РПН", Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		СуммыМатКап = Новый СписокЗначений;
		СуммыМатКап.Добавить(Справочники.уп_ТипыСуммОПС.МатКапитал);
		СуммыМатКап.Добавить(Справочники.уп_ТипыСуммОПС.ИДМатКапитал);
		Запрос.УстановитьПараметр("СуммыМатКап", СуммыМатКап);
		
		Результат = Запрос.Выполнить().Выгрузить();
		Результат.Колонки.Добавить("Организация");
		Результат.Колонки.Добавить("ВидДвижения");
		Результат.ЗаполнитьЗначения(Организация,"Организация");
		Результат.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход,"ВидДвижения");
		Движения.уп_ТекущаяСуммаГарантирования.Загрузить(Результат);
	КонецЕсли;
	
	//добавить списание задолженности из регистра задолженности
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	уп_ЗадолженностьПоПенсиямОПСОстатки.ДоговорОПС КАК ДоговорОПС,
	|	уп_ЗадолженностьПоПенсиямОПСОстатки.НачПериода КАК НачПериода,
	|	уп_ЗадолженностьПоПенсиямОПСОстатки.ПериодичностьВыплат КАК ПериодичностьВыплат,
	|	уп_ЗадолженностьПоПенсиямОПСОстатки.ТипПенсии КАК ТипПенсии,
	|	уп_ЗадолженностьПоПенсиямОПСОстатки.СуммаПенсииОстаток КАК СуммаПенсии,
	|	уп_ЗадолженностьПоПенсиямОПСОстатки.СчетчикОстаток КАК Счетчик
	|ИЗ
	|	РегистрНакопления.уп_ЗадолженностьПоПенсиямОПС.Остатки(&ДатаДок, ДоговорОПС В (&СписокДоговоровОПС)) КАК уп_ЗадолженностьПоПенсиямОПСОстатки";
	
	Запрос.УстановитьПараметр("ДатаДок", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СписокДоговоровОПС", ДоговорыОПС.ВыгрузитьКолонку("ДоговорОПС"));
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("ВидДвижения");
	Результат.Колонки.Добавить("Период");
	Результат.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход,"ВидДвижения");
	Результат.ЗаполнитьЗначения(Дата,"Период");
	Движения.уп_ЗадолженностьПоПенсиямОПС.Загрузить(Результат);
	
	
	//Добавим движения по бухгалтерии
	Если ОтражатьВБухгалтерскомУчете и ПроводкиПоНачислению Тогда
		уп_ОбщегоНазначенияУчетРезервов.ДополнитьТаблицуБухУчета(Дата, ТабБухУчет, Ссылка, Отказ);
		уп_ОбщегоНазначенияУчетРезервов.СделатьДвиженияПоБухУчету(ЭтотОбъект, ТабБухУчет);
	КонецЕсли;	
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	ДополнительныеСвойства.Вставить("МассивСообщений", МассивСообщений);
	// записываем движения регистров
	Движения.уп_РезервыОПС.Записать();
	Движения.уп_ПрочиеНачисленияОПС.Записать();
	Движения.уп_СостоянияДоговораОПС.Записать();
	Движения.уп_ПричиныЗакрытияДоговоровОПС.Записать();
КонецПроцедуры

&ИзменениеИКонтроль("Рассчитать")
Процедура РасшОбщ_Рассчитать()  Экспорт
	
	Для каждого стр из ДоговорыОПС Цикл
		стр.Сумма = 0;
	КонецЦикла;	
	РасшифровкаСуммы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уп_ТекущаяСуммаГарантированияОстатки.ДоговорОПС КАК ДоговорОПС,
	               |	уп_ТекущаяСуммаГарантированияОстатки.ТипСуммы КАК ТипСуммы,
	               |	уп_ТекущаяСуммаГарантированияОстатки.СуммаОстаток КАК СуммаГарантированная,
	               |	&РПН КАК ТипРезерва
	               |ПОМЕСТИТЬ Гарантирование
	               |ИЗ
	               |	РегистрНакопления.уп_ТекущаяСуммаГарантирования.Остатки(
	               |			&ДатаДок,
	               |			Организация = &Организация
	               |				И ДоговорОПС В (&СписокДоговоров)) КАК уп_ТекущаяСуммаГарантированияОстатки
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДоговорОПС,
	               |	ТипСуммы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(РезервыОПСОстатки.ДоговорОПС, Гарантирование.ДоговорОПС) КАК ДоговорОПС,
	               |	ЕСТЬNULL(РезервыОПСОстатки.ТипСуммы, Гарантирование.ТипСуммы) КАК ТипСуммы,
	               |	ЕСТЬNULL(РезервыОПСОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	ЕСТЬNULL(РезервыОПСОстатки.ТипРезерва, Гарантирование.ТипРезерва) КАК ТипРезерва,
	               |	ЕСТЬNULL(Гарантирование.СуммаГарантированная, 0) КАК СуммаГарантированная,
	               |	ЕСТЬNULL(РезервыОПСОстатки.СуммаКомпенсацииОстаток, 0) КАК СуммаКомпенсации,
	               |	ЕСТЬNULL(РезервыОПСОстатки.СуммаВосполненияОстаток, 0) КАК СуммаВосполнения,
	               |	ЕСТЬNULL(РезервыОПСОстатки.СуммаВозмещенияОстаток, 0) КАК СуммаВозмещения
	               |ПОМЕСТИТЬ Остатки
	               |ИЗ
	               |	РегистрНакопления.уп_РезервыОПС.Остатки(
	               |			&ДатаДок,
	               |			ДоговорОПС В (&СписокДоговоров)
	               |				И ТипРезерва В (&СписокТиповРезерва)) КАК РезервыОПСОстатки
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Гарантирование КАК Гарантирование
	               |		ПО РезервыОПСОстатки.ДоговорОПС = Гарантирование.ДоговорОПС
	               |			И РезервыОПСОстатки.ТипРезерва = Гарантирование.ТипРезерва
	               |			И РезервыОПСОстатки.ТипСуммы = Гарантирование.ТипСуммы
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДоговорОПС,
	               |	ТипСуммы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уп_СостоянияДоговораОПССрезПервых.ДоговорОПС КАК ДоговорОПС,
	               |	НАЧАЛОПЕРИОДА(уп_СостоянияДоговораОПССрезПервых.Период, ДЕНЬ) КАК ДатаВступленияВДействие
	               |ПОМЕСТИТЬ ГодыВступленияВСилу
	               |ИЗ
	               |	РегистрСведений.уп_СостоянияДоговораОПС.СрезПервых(
	               |			,
	               |			ДоговорОПС В (&СписокДоговоров)
	               |				И Состояние = &НакопительныйПериод) КАК уп_СостоянияДоговораОПССрезПервых
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДоговорОПС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС КАК ДоговорОПС,
	               |	уп_СостоянияДоговораОПССрезПоследних.Состояние КАК Состояние,
	               |	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС.ДокументДоговорОПС КАК ОткрытиеДоговора
	               |ПОМЕСТИТЬ ТекСостояние
	               |ИЗ
	               |	РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(&ДатаДок, ДоговорОПС В (&СписокДоговоров)) КАК уп_СостоянияДоговораОПССрезПоследних
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ДоговорОПС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уп_ДатыПервогоВзносаПредыдущегоСтраховщика.ДоговорОПС КАК ДоговорОПС,
	               |	уп_ДатыПервогоВзносаПредыдущегоСтраховщика.ДатаВзноса КАК ДатаВзноса
	               |ПОМЕСТИТЬ ВТ_ДатыПервогоВзноса
	               |ИЗ
	               |	РегистрСведений.уп_ДатыПервогоВзносаПредыдущегоСтраховщика КАК уп_ДатыПервогоВзносаПредыдущегоСтраховщика
	               |ГДЕ
	               |	уп_ДатыПервогоВзносаПредыдущегоСтраховщика.ДоговорОПС В(&СписокДоговоров)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уп_ЗаявлениеОНаличииПравопреемников.ДоговорОПС КАК ДоговорОПС,
	               |	МАКСИМУМ(уп_ЗаявлениеОНаличииПравопреемников.Дата) КАК Дата
	               |ПОМЕСТИТЬ ДатыПоследнегоЗаявления
	               |ИЗ
	               |	Документ.уп_ЗаявлениеОНаличииПравопреемников КАК уп_ЗаявлениеОНаличииПравопреемников
	               |ГДЕ
	               |	уп_ЗаявлениеОНаличииПравопреемников.ДоговорОПС В(&СписокДоговоров)
	               |	И уп_ЗаявлениеОНаличииПравопреемников.ПометкаУдаления = ЛОЖЬ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	уп_ЗаявлениеОНаличииПравопреемников.ДоговорОПС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДатыПоследнегоЗаявления.ДоговорОПС КАК ДоговорОПС,
	               |	уп_ЗаявлениеОНаличииПравопреемников.Ссылка КАК Заявление
	               |ПОМЕСТИТЬ Заявления
	               |ИЗ
	               |	ДатыПоследнегоЗаявления КАК ДатыПоследнегоЗаявления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ЗаявлениеОНаличииПравопреемников КАК уп_ЗаявлениеОНаличииПравопреемников
	               |		ПО ДатыПоследнегоЗаявления.ДоговорОПС = уп_ЗаявлениеОНаличииПравопреемников.ДоговорОПС
	               |			И ДатыПоследнегоЗаявления.Дата = уп_ЗаявлениеОНаличииПравопреемников.Дата
	               |ГДЕ
	               |	уп_ЗаявлениеОНаличииПравопреемников.ДоговорОПС В(&СписокДоговоров)
	               |	И уп_ЗаявлениеОНаличииПравопреемников.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТекСостояние.ДоговорОПС КАК ДоговорОПС,
	               |	Остатки.ТипСуммы КАК ТипСуммы,
	               |	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	Остатки.ТипРезерва КАК ТипРезерва,
	               |	ЕСТЬNULL(Остатки.СуммаГарантированная, 0) КАК СуммаГарантированная,
	               |	ЕСТЬNULL(Остатки.СуммаКомпенсации, 0) КАК СуммаКомпенсации,
	               |	ЕСТЬNULL(Остатки.СуммаВосполнения, 0) КАК СуммаВосполнения,
	               |	ЕСТЬNULL(Остатки.СуммаВозмещения, 0) КАК СуммаВозмещения,
	               |	ГодыВступленияВСилу.ДатаВступленияВДействие КАК ДатаВступленияВДействие,
	               |	ТекСостояние.ОткрытиеДоговора КАК ОткрытиеДоговора,
	               |	ЕСТЬNULL(Заявления.Заявление, ТекСостояние.ОткрытиеДоговора) КАК Заявление,
	               |	ВТ_ДатыПервогоВзноса.ДатаВзноса КАК ДатаПервогоВзноса
	               |ИЗ
	               |	ТекСостояние КАК ТекСостояние
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ГодыВступленияВСилу КАК ГодыВступленияВСилу
	               |		ПО ТекСостояние.ДоговорОПС = ГодыВступленияВСилу.ДоговорОПС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	               |		ПО ТекСостояние.ДоговорОПС = Остатки.ДоговорОПС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Заявления КАК Заявления
	               |		ПО ТекСостояние.ДоговорОПС = Заявления.ДоговорОПС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыПервогоВзноса КАК ВТ_ДатыПервогоВзноса
	               |		ПО ТекСостояние.ДоговорОПС = ВТ_ДатыПервогоВзноса.ДоговорОПС
	               |ИТОГИ
	               |	СУММА(СуммаОстаток),
	               |	СУММА(СуммаГарантированная),
	               |	СУММА(СуммаКомпенсации),
	               |	СУММА(СуммаВосполнения),
	               |	СУММА(СуммаВозмещения),
	               |	МАКСИМУМ(ДатаВступленияВДействие),
	               |	МАКСИМУМ(ДатаПервогоВзноса)
	               |ПО
	               |	ДоговорОПС,
	               |	Заявление
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Гарантирование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Остатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ГодыВступленияВСилу
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ТекСостояние
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_ДатыПервогоВзноса
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ДатыПоследнегоЗаявления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ Заявления";
	
	Запрос.УстановитьПараметр("ДатаДок", Дата-1);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокДоговоров", ДоговорыОПС.ВыгрузитьКолонку("ДоговорОПС"));
	Запрос.УстановитьПараметр("РПН", Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	
	СписокТиповРезерва = Новый СписокЗначений;
	СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты);
	Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.АннулированиеЛицензии 
		ИЛИ ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоРешениюСуда Тогда
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.Выплатной);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервОПС);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервЕВ);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийВозвратМСКРПН);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийВозвратМСКРСВ);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийЕВ);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРОПС);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРПН);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРСВ);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНП);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийРасторжение);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийСВ);
	ИначеЕсли ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервЕВ);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ);
	КонецЕсли;	
	Запрос.УстановитьПараметр("СписокТиповРезерва", СписокТиповРезерва);
	Запрос.УстановитьПараметр("НакопительныйПериод", Перечисления.уп_СостоянияДоговоровОПС.НакопительныйПериод);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДатаВступления = Константы.уп_ДатаВступленияВСистемуГарантирования.Получить();
	Пока Выборка.Следующий() Цикл
		СтруктураОтбора = Новый Структура();
		
		СтруктураОтбора.Вставить("ДоговорОПС",     Выборка.ДоговорОПС);
		СтрокаТабличнойЧасти = уп_ОсновнаяПоставкаСервер.НайтиСтрокуТабЧасти(ДоговорыОПС, СтруктураОтбора);
		Если СтрокаТабличнойЧасти <> Неопределено Тогда
			Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПереходДосрочный Тогда
				//сравниваем текущую сумму гарантирования и остаток на счете и ставим к выплате меньшую из них
				Если Выборка.СуммаОстаток<=Выборка.СуммаГарантированная Тогда
					//стандартный вариант, выплачиваем остаток
					СтрокаТабличнойЧасти.ДатаВступленияВДействие = Выборка.ДатаВступленияВДействие;
					СтрокаТабличнойЧасти.Сумма = Выборка.СуммаОстаток;
					СтрокаТабличнойЧасти.СуммаГарантированная = Выборка.СуммаГарантированная;
					СтрокаТабличнойЧасти.СуммаОстаток = Выборка.СуммаОстаток;
					ВыборкаЗаявлений = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Если ВыборкаЗаявлений.Следующий() Тогда
						ВыборкаТиповСумм = ВыборкаЗаявлений.Выбрать();
						Пока ВыборкатиповСумм.Следующий() Цикл
							Если ВыборкаТиповСумм.СуммаОстаток<>0 Тогда
								НовСтрРасшифровки = РасшифровкаСуммы.Добавить();
								НовСтрРасшифровки.ДоговорОПС = ВыборкаТиповСумм.ДоговорОПС;
								НовСтрРасшифровки.ТипРезерва = ВыборкаТиповСумм.ТипРезерва;
								НовСтрРасшифровки.ТипСуммы = ВыборкаТиповСумм.ТипСуммы;
								НовСтрРасшифровки.Сумма = ВыборкаТиповСумм.СуммаОстаток;
								НовСтрРасшифровки.СуммаГарантированная = ВыборкаТиповСумм.СуммаГарантированная;
								НовСтрРасшифровки.СуммаКомпенсации = ВыборкаТиповСумм.СуммаКомпенсации;
								НовСтрРасшифровки.СуммаВосполнения = ВыборкаТиповСумм.СуммаВосполнения;
								НовСтрРасшифровки.СуммаВозмещения = ВыборкаТиповСумм.СуммаВозмещения;
								НовСтрРасшифровки.СуммаОстаток = ВыборкаТиповСумм.СуммаОстаток;
							КонецЕсли;	
						КонецЦикла;	
					КонецЕсли;
				Иначе  //выплачиваем текущую сумму гарантирования (это либо взносы, либо фиксинг плюс взносы)
					СтрокаТабличнойЧасти.ДатаВступленияВДействие = Выборка.ДатаВступленияВДействие;
					СтрокаТабличнойЧасти.Сумма = Выборка.СуммаГарантированная;
					СтрокаТабличнойЧасти.СуммаГарантированная = Выборка.СуммаГарантированная;
					СтрокаТабличнойЧасти.СуммаОстаток = Выборка.СуммаОстаток;
					ВыборкаЗаявлений = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Если ВыборкаЗаявлений.Следующий() Тогда
						ВыборкаТиповСумм = ВыборкаЗаявлений.Выбрать();
						Пока ВыборкатиповСумм.Следующий() Цикл
							Если ВыборкаТиповСумм.СуммаОстаток<>0 Тогда
								НовСтрРасшифровки = РасшифровкаСуммы.Добавить();
								НовСтрРасшифровки.ДоговорОПС = ВыборкаТиповСумм.ДоговорОПС;
								НовСтрРасшифровки.ТипРезерва = ВыборкаТиповСумм.ТипРезерва;
								НовСтрРасшифровки.ТипСуммы = ВыборкаТиповСумм.ТипСуммы;
								НовСтрРасшифровки.Сумма = ВыборкаТиповСумм.СуммаГарантированная;
								НовСтрРасшифровки.СуммаГарантированная = ВыборкаТиповСумм.СуммаГарантированная;
								НовСтрРасшифровки.СуммаКомпенсации = ВыборкаТиповСумм.СуммаКомпенсации;
								НовСтрРасшифровки.СуммаВосполнения = ВыборкаТиповСумм.СуммаВосполнения;
								НовСтрРасшифровки.СуммаВозмещения = ВыборкаТиповСумм.СуммаВозмещения;
								НовСтрРасшифровки.СуммаОстаток = ВыборкаТиповСумм.СуммаОстаток;
							КонецЕсли;	
						КонецЦикла;	
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.Досрочное И ЗначениеЗаполнено(ДатаВступления) И Дата>=ДатаВступления и Дата>'20160101' Тогда
				//выбираем большую сумму
				Если Выборка.СуммаОстаток>=Выборка.СуммаГарантированная Тогда
					//стандартный вариант, выплачиваем остаток
					СтрокаТабличнойЧасти.ДатаВступленияВДействие = Выборка.ДатаВступленияВДействие;
					СтрокаТабличнойЧасти.Сумма = Выборка.СуммаОстаток;
					СтрокаТабличнойЧасти.СуммаГарантированная = Выборка.СуммаГарантированная;
					СтрокаТабличнойЧасти.СуммаОстаток = Выборка.СуммаОстаток;
					ВыборкаЗаявлений = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Если ВыборкаЗаявлений.Следующий() Тогда
						ВыборкаТиповСумм = ВыборкаЗаявлений.Выбрать();
						Пока ВыборкатиповСумм.Следующий() Цикл
							Если ВыборкаТиповСумм.СуммаОстаток<>0 Тогда
								НовСтрРасшифровки = РасшифровкаСуммы.Добавить();
								НовСтрРасшифровки.ДоговорОПС = ВыборкаТиповСумм.ДоговорОПС;
								НовСтрРасшифровки.ТипРезерва = ВыборкаТиповСумм.ТипРезерва;
								НовСтрРасшифровки.ТипСуммы = ВыборкаТиповСумм.ТипСуммы;
								НовСтрРасшифровки.Сумма = ВыборкаТиповСумм.СуммаОстаток;
								НовСтрРасшифровки.СуммаГарантированная = ВыборкаТиповСумм.СуммаГарантированная;
								НовСтрРасшифровки.СуммаКомпенсации = ВыборкаТиповСумм.СуммаКомпенсации;
								НовСтрРасшифровки.СуммаВосполнения = ВыборкаТиповСумм.СуммаВосполнения;
								НовСтрРасшифровки.СуммаВозмещения = ВыборкаТиповСумм.СуммаВозмещения;
								НовСтрРасшифровки.СуммаОстаток = ВыборкаТиповСумм.СуммаОстаток;
							КонецЕсли;	
						КонецЦикла;
					КонецЕсли;
				Иначе  //выплачиваем текущую сумму гарантирования (это либо взносы, либо фиксинг плюс взносы)
					СтрокаТабличнойЧасти.ДатаВступленияВДействие = Выборка.ДатаВступленияВДействие;
					СтрокаТабличнойЧасти.Сумма = Выборка.СуммаГарантированная;
					СтрокаТабличнойЧасти.СуммаГарантированная = Выборка.СуммаГарантированная;
					СтрокаТабличнойЧасти.СуммаОстаток = Выборка.СуммаОстаток;
					ВыборкаЗаявлений = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Если ВыборкаЗаявлений.Следующий() Тогда
						ВыборкаТиповСумм = ВыборкаЗаявлений.Выбрать();
						Пока ВыборкатиповСумм.Следующий() Цикл
							Если ВыборкаТиповСумм.СуммаОстаток<>0 Тогда
								НовСтрРасшифровки = РасшифровкаСуммы.Добавить();
								НовСтрРасшифровки.ДоговорОПС = ВыборкаТиповСумм.ДоговорОПС;
								НовСтрРасшифровки.ТипРезерва = ВыборкаТиповСумм.ТипРезерва;
								НовСтрРасшифровки.ТипСуммы = ВыборкаТиповСумм.ТипСуммы;
								НовСтрРасшифровки.Сумма = ВыборкаТиповСумм.СуммаГарантированная;
								НовСтрРасшифровки.СуммаГарантированная = ВыборкаТиповСумм.СуммаГарантированная;
								НовСтрРасшифровки.СуммаКомпенсации = ВыборкаТиповСумм.СуммаКомпенсации;
								НовСтрРасшифровки.СуммаВосполнения = ВыборкаТиповСумм.СуммаВосполнения;
								НовСтрРасшифровки.СуммаВозмещения = ВыборкаТиповСумм.СуммаВозмещения;
								НовСтрРасшифровки.СуммаОстаток = ВыборкаТиповСумм.СуммаОстаток;
								
								Если ВыборкаТиповСумм.СуммаОстаток<ВыборкаТиповСумм.СуммаГарантированная Тогда
									Сообщить("По договору №"+ВыборкаТиповСумм.ДоговорОПС+" по типу суммы "+ВыборкаТиповСумм.ТипСуммы+" сумма на счете меньше гарантированной. Необходимо произвести гарантийное восполнение.");
								КонецЕсли;
							КонецЕсли;	
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			Иначе  //к выплате ставим остаток, но указываем если остаток меньше гарантированной суммы
				СтрокаТабличнойЧасти.ДатаВступленияВДействие = Выборка.ДатаВступленияВДействие;
				СтрокаТабличнойЧасти.Сумма = Выборка.СуммаОстаток;
				ЗаполняемГарантирование = Истина;
				Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти 
					И ЗначениеЗаполнено(Выборка.ДоговорОПС.ДокументРегистрацииСмерти)
					И Выборка.ДоговорОПС.ДокументРегистрацииСмерти <> Ссылка Тогда
					//не заполняем текущую сумму гарантирования
					ЗаполняемГарантирование = Ложь;
				Иначе
					СтрокаТабличнойЧасти.СуммаГарантированная = Выборка.СуммаГарантированная;
				КонецЕсли;
				СтрокаТабличнойЧасти.СуммаОстаток = Выборка.СуммаОстаток;
				Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
					//ДатаВступленияВДействие = уп_ОПС.ДатаНачалаДействия(СтрокаТабличнойЧасти.ДоговорОПС);
					//ДатаПервогоВзноса = уп_ОПС.ДатаПервогоВзноса(СтрокаТабличнойЧасти.ДоговорОПС);
					//СтрокаТабличнойЧасти.ДатаВступленияВДействие = ДатаВступленияВДействие;
					//СтрокаТабличнойЧасти.ДатаВзносаПредыдущегоСтраховщика = ДатаПервогоВзноса;
					#Удаление
					СтрокаТабличнойЧасти.ДатаВступленияВДействие = Выборка.ДатаВступленияВДействие;
					СтрокаТабличнойЧасти.ДатаВзносаПредыдущегоСтраховщика = Выборка.ДатаПервогоВзноса;
					#КонецУдаления
					#Вставка
					// +ХМНПФ 24.02.2021 ШадринАВ // Рассчитать() // №3095
					ДатаВступленияВДействие = уп_ОПС.ДатаНачалаДействия(Выборка.ДоговорОПС);
					ДатаПервогоВзноса = уп_ОПС.ДатаПервогоВзноса(Выборка.ДоговорОПС);
					//СтрокаТабличнойЧасти.ДатаВступленияВДействие = Выборка.ДатаВступленияВДействие;
					СтрокаТабличнойЧасти.ДатаВступленияВДействие = ДатаВступленияВДействие;
					//СтрокаТабличнойЧасти.ДатаВзносаПредыдущегоСтраховщика = Выборка.ДатаПервогоВзноса;
					СтрокаТабличнойЧасти.ДатаВзносаПредыдущегоСтраховщика = ДатаПервогоВзноса;
					// -ХМНПФ 24.02.2021 ШадринАВ // Рассчитать() // №3095
					#КонецВставки
				КонецЕсли;
				ВыборкаЗаявлений = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Если ВыборкаЗаявлений.Следующий() Тогда
					Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
						Если ВыборкаЗаявлений.Заявление.Правопреемники.Количество()<>0  Тогда
							СтрокаТабличнойЧасти.Заявление = ВыборкаЗаявлений.Заявление;
						ИначеЕсли ТипЗнч(ВыборкаЗаявлений.Заявление) = Тип("ДокументСсылка.уп_ЗаявлениеОНаличииПравопреемников") Тогда
							СтрокаТабличнойЧасти.Заявление = ВыборкаЗаявлений.Заявление;
						Иначе
							СтрокаТабличнойЧасти.Заявление = Неопределено;
						КонецЕсли;
					КонецЕсли;
					ВыборкаТиповСумм = ВыборкаЗаявлений.Выбрать();
					Пока ВыборкатиповСумм.Следующий() Цикл
						Если ВыборкаТиповСумм.СуммаОстаток<>0 Тогда
							НовСтрРасшифровки = РасшифровкаСуммы.Добавить();
							НовСтрРасшифровки.ДоговорОПС = ВыборкаТиповСумм.ДоговорОПС;
							НовСтрРасшифровки.ТипРезерва = ВыборкаТиповСумм.ТипРезерва;
							НовСтрРасшифровки.ТипСуммы = ВыборкаТиповСумм.ТипСуммы;
							НовСтрРасшифровки.Сумма = ВыборкаТиповСумм.СуммаОстаток;
							Если ЗаполняемГарантирование Тогда
								НовСтрРасшифровки.СуммаГарантированная = ВыборкаТиповСумм.СуммаГарантированная;
							КонецЕсли;
							НовСтрРасшифровки.СуммаКомпенсации = ВыборкаТиповСумм.СуммаКомпенсации;
							НовСтрРасшифровки.СуммаВосполнения = ВыборкаТиповСумм.СуммаВосполнения;
							НовСтрРасшифровки.СуммаВозмещения = ВыборкаТиповСумм.СуммаВозмещения;
							НовСтрРасшифровки.СуммаОстаток = ВыборкаТиповСумм.СуммаОстаток;
							
							Если ЗначениеЗаполнено(ДатаВступления) И Дата>=ДатаВступления Тогда
								Если ВыборкаТиповСумм.СуммаОстаток<ВыборкаТиповСумм.СуммаГарантированная Тогда
									Сообщить("По договору №"+ВыборкаТиповСумм.ДоговорОПС+" по типу суммы "+ВыборкаТиповСумм.ТипСуммы+" сумма на счете меньше гарантированной");
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;	
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
	//	Для каждого стр из ДоговорыОПС Цикл

			#Вставка
			// +ХМНПФ 22.03.2017 ШадринАВ // Рассчитать() // №869
			#КонецВставки
	//		ДатаВступленияВДействие = уп_ОПС.ДатаНачалаДействия(стр.ДоговорОПС);


			#Вставка
			//ДатаВступленияВДействие = уп_ОПС.ДатаНачалаДействия(стр.ДоговорОПС, Дата);
			// -ХМНПФ 22.03.2017 ШадринАВ // Рассчитать() // №869
			#КонецВставки
	//   		ДатаПервогоВзноса = уп_ОПС.ДатаПервогоВзноса(стр.ДоговорОПС);
	//		стр.ДатаВступленияВДействие = ДатаВступленияВДействие;
	//		стр.ДатаВзносаПредыдущегоСтраховщика = ДатаПервогоВзноса;
	//		
	//		Запрос = Новый Запрос;
	//		Запрос.Текст = "ВЫБРАТЬ
	//		|	ОткрытиеДоговораОПС.Ссылка КАК Заявление,
	//		|	ОткрытиеДоговораОПС.Дата КАК Дата
	//		|ИЗ
	//		|	Документ.уп_ОткрытиеДоговораОПС КАК ОткрытиеДоговораОПС
	//		|ГДЕ
	//		|	ОткрытиеДоговораОПС.ДоговорОПС = &ТекДоговорОПС
	//		|
	//		|ОБЪЕДИНИТЬ ВСЕ
	//		|
	//		|ВЫБРАТЬ
	//		|	ЗаявлениеОНаличииПравопреемников.Ссылка,
	//		|	ЗаявлениеОНаличииПравопреемников.Дата
	//		|ИЗ
	//		|	Документ.уп_ЗаявлениеОНаличииПравопреемников КАК ЗаявлениеОНаличииПравопреемников
	//		|ГДЕ
	//		|	ЗаявлениеОНаличииПравопреемников.ДоговорОПС = &ТекДоговорОПС
	//		|	И ЗаявлениеОНаличииПравопреемников.ПометкаУдаления = ЛОЖЬ
	//		|
	//		|УПОРЯДОЧИТЬ ПО
	//		|	Дата УБЫВ";
	//		
	//		Запрос.УстановитьПараметр("ТекДоговорОПС", стр.ДоговорОПС);
	//		
	//		Результат = Запрос.Выполнить();
	//		Выборка = Результат.Выбрать();
	//		
	//		Если Выборка.Следующий() Тогда
	//			Если Выборка.Заявление.Правопреемники.Количество()<>0  Тогда
	//				стр.Заявление = Выборка.Заявление;
	//			Иначе
	//				стр.Заявление = Неопределено;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;	
	
	//расчет материнского капитала
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РезервыОПСОстатки.ДоговорОПС,
	               |	СУММА(РезервыОПСОстатки.СуммаОстаток) КАК СуммаОстаток
	               |ПОМЕСТИТЬ МатКапитал
	               |ИЗ
	               |	РегистрНакопления.уп_РезервыОПС.Остатки(
	               |			&ДатаДок,
	               |			ДоговорОПС В (&СписокДоговоровОПС)
	               |				И ТипСуммы В (&СписокТиповСумм)
	               |				И ТипРезерва = &Накопительный) КАК РезервыОПСОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РезервыОПСОстатки.ДоговорОПС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уп_НачисленияПенсийОПСОстатки.ДоговорОПС,
	               |	СУММА(уп_НачисленияПенсийОПСОстатки.СуммаОстаток) КАК СуммаОстаток
	               |ПОМЕСТИТЬ СрочныеПенсии
	               |ИЗ
	               |	РегистрНакопления.уп_НачисленияПенсийОПС.Остатки(
	               |			&ДатаДок,
	               |			ДоговорОПС В (&СписокДоговоровОПС)
	               |				И ТипПенсии = &СрочныхВыплат) КАК уп_НачисленияПенсийОПСОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	уп_НачисленияПенсийОПСОстатки.ДоговорОПС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС,
	               |	уп_СостоянияДоговораОПССрезПоследних.Состояние,
	               |	ЕСТЬNULL(СрочныеПенсии.СуммаОстаток, 0) КАК СрочнаяПенсия,
	               |	ЕСТЬNULL(МатКапитал.СуммаОстаток, 0) КАК МатКапитал
	               |ИЗ
	               |	РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(&ДатаДок, ДоговорОПС В (&СписокДоговоровОПС)) КАК уп_СостоянияДоговораОПССрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ МатКапитал КАК МатКапитал
	               |		ПО уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС = МатКапитал.ДоговорОПС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СрочныеПенсии КАК СрочныеПенсии
	               |		ПО уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС = СрочныеПенсии.ДоговорОПС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ СрочныеПенсии
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ МатКапитал";
	
	Запрос.УстановитьПараметр("ДатаДок", Дата-1);
	Запрос.УстановитьПараметр("СписокДоговоровОПС", ДоговорыОПС.ВыгрузитьКолонку("ДоговорОПС"));
	СписокТиповСумм = Новый СписокЗначений;
	СписокТиповСумм.Добавить(Справочники.уп_ТипыСуммОПС.МатКапитал);
	СписокТиповСумм.Добавить(Справочники.уп_ТипыСуммОПС.ИДМатКапитал);
	Запрос.УстановитьПараметр("СписокТиповСумм", СписокТиповСумм);
	Запрос.УстановитьПараметр("Накопительный", Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	Запрос.УстановитьПараметр("СрочныхВыплат", Перечисления.уп_ТипыПенсийОПС.Срочная);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураОтбора = Новый Структура();
		
		СтруктураОтбора.Вставить("ДоговорОПС",     Выборка.ДоговорОПС);
		СтрокаТабличнойЧасти = уп_ОсновнаяПоставкаСервер.НайтиСтрокуТабЧасти(ДоговорыОПС, СтруктураОтбора);
		Если СтрокаТабличнойЧасти <> Неопределено Тогда
			СтрокаТабличнойЧасти.Состояние = Выборка.Состояние;
			СтрокаТабличнойЧасти.МатКапитал = Выборка.МатКапитал;
			СтрокаТабличнойЧасти.НачисленнаяСрочнаяПенсия = Выборка.СрочнаяПенсия;
		КонецЕсли;
	КонецЦикла;
	
	//ds расчет количества правоприемников.
	Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
		Для каждого стр из ДоговорыОПС Цикл
			Если ТипЗнч(стр.Заявление) = ТипЗнч(Неопределено)  Тогда
				СтрокаСооб = "Для договора " + Строка(стр.ДоговорОПС) +" не заполнено заявление о наличии правоприемников";
				стр.КоличествоПравопреемников = 0;
				Сообщить(СтрокаСооб); 
			Иначе	
				стр.КоличествоПравопреемников = стр.Заявление.Правопреемники.Количество();
			КонецЕсли;
			Если ЗначениеЗаполнено(стр.ДатаВступленияВДействие) И ЗначениеЗаполнено(стр.ДатаСмерти) Тогда
				Если стр.ДатаВступленияВДействие>стр.ДатаСмерти Тогда
					стр.ВернутьПредыдущемуСтраховщику = Истина;
				КонецЕсли;
			ИначеЕсли НЕ ЗначениеЗаполнено(стр.ДатаВступленияВДействие) Тогда
				стр.ВернутьПредыдущемуСтраховщику = Истина;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	#Вставка
	// +ХМНПФ 21.10.2016 ШадринАВ // Рассчитать() // №602
	ХМ_ОткорректироватьТЧПослеРасчета();
	// -ХМНПФ 21.10.2016 ШадринАВ // Рассчитать() // №602
	// +ХМНПФ 19.07.2016 ЛыткинАМ // Рассчитать // №433
	ХМ_Рассчитать_ВыделитьНашИД(Истина,Истина);
	// -ХМНПФ 19.07.2016 ЛыткинАМ // Рассчитать // №433
	#КонецВставки
КонецПроцедуры	

// ХМНПФ 06.04.2016 ЛыткинАМ // Новая ХМ_ОбработкаПроведения() // №302
Функция ХМ_ОбработкаПроведения(Отказ, Режим) Экспорт
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ХМ_ПереносСредствНаДругойДоговорФизЛица
			// +ХМНПФ 24.04.2020 ШадринАВ // ХМ_ОбработкаПроведения() // №2805
			И Не ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ХМ_НазначенаВыплатаПредыдущимСтраховщиком Тогда
			// -ХМНПФ 24.04.2020 ШадринАВ // ХМ_ОбработкаПроведения() // №2805
		Возврат Ложь;
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Организация, Ответственный");
	уп_ОсновнаяПоставкаСервер.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Для каждого ТекСтрокаДоговорыОПС Из ДоговорыОПС Цикл
		Движение = Движения.уп_СостоянияДоговораОПС.Добавить();
		Движение.Период = Дата;
		Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
		Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт;
		
		Движение = Движения.уп_ПричиныЗакрытияДоговоровОПС.Добавить();
		Движение.Период = Дата;
		Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
		Движение.ПричинаЗакрытия = ПричинаЗакрытия;
				
		// +ХМНПФ 24.04.2020 ШадринАВ // ХМ_ОбработкаПроведения() // №2805
		Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ХМ_ПереносСредствНаДругойДоговорФизЛица Тогда
		// -ХМНПФ 24.04.2020 ШадринАВ // ХМ_ОбработкаПроведения() // №2805
			Движение = Движения.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
			Движение.Состояние = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.Прекращен;
			Движение = Движения.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
			Движение.Состояние = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.Прекращен;
			
			РасшифровкаСуммыПоДоговору = РасшифровкаСуммы.НайтиСтроки(Новый Структура("ДоговорОПС",ТекСтрокаДоговорыОПС.ДоговорОПС));
			
			Для каждого стр из РасшифровкаСуммыПоДоговору Цикл
				Движение = Движения.уп_РезервыОПС.ДобавитьРасход();
				Движение.Организация = Организация;
				Движение.Период = Дата;
				Движение.ДоговорОПС = стр.ДоговорОПС;
				Движение.ТипРезерва = стр.ТипРезерва;
				Движение.ТипСуммы = стр.ТипСуммы;
				Движение.Сумма = стр.Сумма;
				Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
				Движение.СуммаВосполнения = стр.СуммаВосполнения;
				Движение.СуммаВозмещения = стр.СуммаВозмещения;
				Движение.Движение = Перечисления.уп_ВидыДвижений.ХМ_ПереносСредствНаДругойДоговорФизЛица;
				
				Движение = Движения.уп_РезервыОПС.ДобавитьПриход();
				Движение.Организация = Организация;
				Движение.Период = Дата;
				Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ХМ_ДоговорОПС_Действующий;
				Движение.ТипРезерва = стр.ТипРезерва;
				Движение.ТипСуммы = стр.ТипСуммы;
				Движение.Сумма = стр.Сумма;
				Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
				Движение.СуммаВосполнения = стр.СуммаВосполнения;
				Движение.СуммаВозмещения = стр.СуммаВозмещения;
				Движение.Движение = Перечисления.уп_ВидыДвижений.ХМ_ПереносСредствНаДругойДоговорФизЛица;
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат Истина;
	КонецЕсли;
	
	// записываем движения регистров
	Движения.уп_РезервыОПС.Записать();
	Движения.уп_ПрочиеНачисленияОПС.Записать();
	Движения.уп_СостоянияДоговораОПС.Записать();
	Движения.уп_ПричиныЗакрытияДоговоровОПС.Записать();
	
	Возврат Истина;
КонецФункции

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, РежимПроведения, СтрокаТЗ = Неопределено, СтруктураТЧ = Неопределено) Экспорт
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_СледующиеСтраховщикиПоДоговорамОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПричиныЗакрытияДоговоровОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПрочиеНачисленияОПС);
			// +ХМНПФ 27.02.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №838
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_СостоянияДоговораОПС);
			// -ХМНПФ 27.02.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №838
		#КонецЕсли
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПричинаЗакрытия) Тогда
		ТабНеВступилиВСилу = Новый Массив();
		Для каждого ТекСтрокаДоговорыОПС Из ДоговорыОПС Цикл
			Движение = Движения.уп_ПричиныЗакрытияДоговоровОПС.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
		// +ХМНПФ 01.08.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №392
			Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
				ДатаВступленияВДействие = уп_ОПС.ДатаНачалаДействия(ТекСтрокаДоговорыОПС.ДоговорОПС, Дата);
				Если ДатаВступленияВДействие=Неопределено
						ИЛИ (ЗначениеЗаполнено(ТекСтрокаДоговорыОПС.ДатаСмерти) И ТекСтрокаДоговорыОПС.ДатаСмерти < ДатаВступленияВДействие) Тогда
					Движение.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.НеВступилВСилу;
					ТабНеВступилиВСилу.Добавить(ТекСтрокаДоговорыОПС.ДоговорОПС);
				Иначе
					Движение.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти;
				КонецЕсли;
			Иначе
		// -ХМНПФ 01.08.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №392
				Движение.ПричинаЗакрытия = ПричинаЗакрытия;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
		Для каждого ТекСтрокаДоговорыОПС Из ДоговорыОПС Цикл
			Движение = Движения.уп_СостоянияДоговораОПС.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
			// +ХМНПФ 01.08.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №392
			ТЗПричина = РегистрыСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(Дата-1,Новый Структура("ДоговорОПС",ТекСтрокаДоговорыОПС.ДоговорОПС));
			Если ТЗПричина.Количество() > 0 Тогда
				ТекущаяПричина = ТЗПричина[0].ПричинаЗакрытия;
				ДатаТекПричины = ТЗПричина[0].Период;
			Иначе
				ТекущаяПричина = Неопределено;
				ДатаТекПричины = Неопределено;
			КонецЕсли;
			ТекущееСостояние = РегистрыСведений.уп_СостоянияДоговораОПС.ПолучитьПоследнее(Дата-1,Новый Структура("ДоговорОПС",ТекСтрокаДоговорыОПС.ДоговорОПС)).Состояние;
			Если ТабНеВступилиВСилу.Количество()>0 И НЕ ТабНеВступилиВСилу.Найти(ТекСтрокаДоговорыОПС.ДоговорОПС)=Неопределено Тогда
				Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт;
			// -ХМНПФ 01.08.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №392
			// +ХМНПФ 27.02.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №838
			ИначеЕсли ЗначениеЗаполнено(ТекущаяПричина) И ТекущееСостояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт 
						И (ТекущаяПричина = Перечисления.уп_ПричиныЗакрытияДоговораОПС.Досрочное ИЛИ ТекущаяПричина = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПереходДосрочный)
						И ДатаТекПричины > ТекСтрокаДоговорыОПС.ДатаСмерти Тогда  // переход в др. НПФ "не вступил в силу"
				Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию;
			ИначеЕсли НЕ (ТекущееСостояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт ИЛИ ТекущееСостояние = Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию) Тогда
				Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию;
			КонецЕсли;
			Если Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.ПустаяСсылка() Тогда
				Движения.уп_СостоянияДоговораОПС.Удалить(Движение);
			КонецЕсли;
			// -ХМНПФ 27.02.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №838
		КонецЦикла;
		// +ХМНПФ 01.08.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №392
		//ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПрочиеНачисленияОПС);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_СостоянияДоговораОПС);
		// -ХМНПФ 01.08.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №392
	КонецЕсли;
	
	Если ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.Досрочное Тогда
		Для каждого ТекСтрокаДоговорыОПС Из ДоговорыОПС Цикл
			Движение = Движения.уп_СледующиеСтраховщикиПоДоговорамОПС.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
			Движение.СледующийСтраховщик = ПенсионныйФонд;
		КонецЦикла;
		Для каждого стр из РасшифровкаСуммы Цикл
			Движение = Движения.уп_РезервыОПС.ДобавитьРасход();
			Движение.Организация = Организация;
			Движение.Период = стр.ХМ_ДатаВыплаты;
			Движение.ДоговорОПС = стр.ДоговорОПС;
			Движение.ТипРезерва = стр.ТипРезерва;
			Движение.ТипСуммы = стр.ТипСуммы;
			Движение.Сумма = стр.Сумма;
			Движение.Движение = Перечисления.уп_ВидыДвижений.ПереводВДругойПФ;
			           
			//начисление
			Движение = Движения.уп_ПрочиеНачисленияОПС.ДобавитьПриход();
			Движение.Организация = Организация;
			Движение.Период = стр.ХМ_ДатаВыплаты;
			Движение.ДоговорОПС = стр.ДоговорОПС;
			Движение.Участник = ПенсионныйФонд;
			Движение.ТипВыплаты = перечисления.уп_ТипыВыплат.ПереводВДругойПФ;
			Движение.ТипСуммы = стр.ТипСуммы;
			Движение.Сумма = стр.Сумма;
			Движение.СуммаКомпенсации = стр.СуммаКомпенсации;
			Движение.СуммаВосполнения = стр.СуммаВосполнения;
			Движение.СуммаВозмещения = стр.СуммаВозмещения;
		КонецЦикла;
	КонецЕсли;	

#Если Сервер Тогда
	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_СледующиеСтраховщикиПоДоговорамОПС);
	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПричиныЗакрытияДоговоровОПС);
	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПрочиеНачисленияОПС);
#КонецЕсли
	Если НЕ ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
		ХМ_ЗАГРУЗКА_ОбработкаПроведения_уп_ВыплатныеРеестры(Перечисления.уп_ТипыВыплат.ПереводВДругойПФ);
	КонецЕсли;
КонецПроцедуры

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения_уп_ВыплатныеРеестры(ТипВыплаты) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_ВыплатныеРеестры.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.уп_ВыплатныеРеестры КАК уп_ВыплатныеРеестры
		|ГДЕ
		|	уп_ВыплатныеРеестры.ХМ_ЗакрытиеДоговораОПС = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Реестр = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		Реестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
		Реестр.ХМ_ЗакрытиеДоговораОПС = Ссылка;
	КонецЕсли;
	Реестр.Дата = ЭтотОбъект.Дата;
	Реестр.Номер = ЭтотОбъект.Номер;
	Реестр.Проведен = ЭтотОбъект.Проведен;
	Реестр.ПометкаУдаления = ЭтотОбъект.ПометкаУдаления;
	Реестр.Организация = ЭтотОбъект.Организация;
	Реестр.ТипВыплаты = ТипВыплаты;
	Реестр.Оплачено = Истина;
	Реестр.Ответственный = ЭтотОбъект.Ответственный;
	Реестр.РучнаяКорректировка = Истина;
	Реестр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет;
	Реестр.Комментарий = "Выплата по "+Ссылка;
	Реестр.ПричинаВыплаты = ПричинаЗакрытия;
	
	Реестр.ДоговорыОПС.Очистить();
	Для каждого ТекСтрокаДоговорыОПС Из ДоговорыОПС Цикл
		СтрокаДоговора = Реестр.ДоговорыОПС.Добавить();
		СтрокаДоговора.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
		СтрокаДоговора.Участник = ТекСтрокаДоговорыОПС.Участник;
		СтрокаДоговора.Сумма = ТекСтрокаДоговорыОПС.Сумма;
	КонецЦикла;
	
	Реестр.РасшифровкаСуммы.Очистить();
	Для каждого Расшифровка ИЗ РасшифровкаСуммы Цикл
		СтрокаРасшифровка = Реестр.РасшифровкаСуммы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРасшифровка,Расшифровка);
	КонецЦикла;

	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Реестр);
	
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Реестр.Движения.уп_ПрочиеНачисленияОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Реестр.Движения.уп_ВыплатыОПС);
		#КонецЕсли
		Возврат;	
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Движения.уп_ПрочиеНачисленияОПС Цикл
		Движение = Реестр.Движения.уп_ПрочиеНачисленияОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ТекСтрока.Период;
		Движение.Организация = ТекСтрока.Организация;
		Движение.Участник = ТекСтрока.Участник;
		Движение.ДоговорОПС = ТекСтрока.ДоговорОПС;
		Движение.ТипВыплаты = ТипВыплаты;
		Движение.ТипРезерва = ТекСтрока.ТипРезерва;//!!!
		Движение.ТипСуммы = ТекСтрока.ТипСуммы;
		Движение.Сумма = ТекСтрока.Сумма;
		
		Движение = Реестр.Движения.уп_ВыплатыОПС.Добавить();
		Движение.ДоговорОПС = ТекСтрока.ДоговорОПС;
		Движение.Организация = ТекСтрока.Организация;
		Движение.Период = ТекСтрока.Период;
		Движение.Участник = ТекСтрока.Участник;
		Движение.ТипВыплаты = ТипВыплаты;
		Движение.Сумма = ТекСтрока.Сумма;
		Движение.Выплата = ТекСтрока.Сумма;
	КонецЦикла;	
	
	#Если Сервер Тогда
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Реестр.Движения.уп_ПрочиеНачисленияОПС);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Реестр.Движения.уп_ВыплатыОПС);
	#КонецЕсли
	
КонецПроцедуры	

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения_ХМ_pf_fond_npf_pfr(Отказ, РежимПроведения) Экспорт
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПрочиеНачисленияОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПричиныЗакрытияДоговоровОПС);
		#КонецЕсли
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПричинаЗакрытия) Тогда
		Для каждого ТекСтрокаДоговорыОПС Из ДоговорыОПС Цикл
			Движение = Движения.уп_ПричиныЗакрытияДоговоровОПС.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
			Движение.ПричинаЗакрытия = ПричинаЗакрытия;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого СтрокаСуммы Из РасшифровкаСуммы Цикл
		Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = СтрокаСуммы.ХМ_ДатаВыплаты;
		Движение.Организация = Организация;
		Движение.Участник = ПенсионныйФонд;
		Движение.ДоговорОПС = СтрокаСуммы.ДоговорОПС;
		Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойПФ;
		Движение.ТипРезерва = СтрокаСуммы.ТипРезерва;
		Движение.Сумма = СтрокаСуммы.Сумма;
		
		
		Движение = Движения.уп_РезервыОПС.ДобавитьРасход();
		Движение.Организация = Организация;
		Движение.Период = СтрокаСуммы.ХМ_ДатаВыплаты;
		Движение.ДоговорОПС = СтрокаСуммы.ДоговорОПС;
		Движение.ТипРезерва = СтрокаСуммы.ТипРезерва;
		Движение.ТипСуммы = СтрокаСуммы.ТипСуммы;
		Движение.Сумма = СтрокаСуммы.Сумма;
		Движение.Движение = Перечисления.уп_ВидыДвижений.ПереводВДругойПФ;
	КонецЦикла;	
	#Если Сервер Тогда
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПрочиеНачисленияОПС);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПричиныЗакрытияДоговоровОПС);
	#КонецЕсли
	
	ХМ_ЗАГРУЗКА_ОбработкаПроведения_уп_ВыплатныеРеестры(Перечисления.уп_ТипыВыплат.ПереводВДругойПФ);
КонецПроцедуры

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения_ХМ_УдалитьВыплату() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_ВыплатныеРеестры.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.уп_ВыплатныеРеестры КАК уп_ВыплатныеРеестры
		|ГДЕ
		|	уп_ВыплатныеРеестры.ХМ_ЗакрытиеДоговораОПС = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбъектНаУдаление = Выборка.Ссылка.ПолучитьОбъект();
		Для каждого Движение Из ОбъектНаУдаление.Движения Цикл
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движение);	
		КонецЦикла;
		ОбъектНаУдаление.Удалить();
	КонецЕсли;		
КонецПроцедуры

// ХМНПФ 22.03.2016 ШадринАВ // Новая ХМ_ОткорректироватьДвиженияПоСостояниям() // №285
Процедура ХМ_ОткорректироватьДвиженияПоСостояниям(ТекСтрокаДоговорыОПС)
	//ТекСостояние = ТекСтрокаДоговорыОПС.Состояние;
	ТекСостояние = РегистрыСведений.уп_СостоянияДоговораОПС.ПолучитьПоследнее(Дата-1,Новый Структура("ДоговорОПС",ТекСтрокаДоговорыОПС.ДоговорОПС)).Состояние;
	ТекПричина = ТекСтрокаДоговорыОПС.ПричинаЗакрытия;
	СовпадаетПричинаЗакрытия = (ТекПричина = ПричинаЗакрытия ИЛИ ТекПричина = Перечисления.уп_ПричиныЗакрытияДоговораОПС.НеВступилВСилу);
	ТекущееСостояниеЗакрыт = (ТекСостояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт
						  ИЛИ ТекСостояние = Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию);
						  
	// состояние договора
	Если Движения.уп_СостоянияДоговораОПС.Количество()>0 Тогда
		ПоследнееСостояниеДоговора = Движения.уп_СостоянияДоговораОПС[Движения.уп_СостоянияДоговораОПС.Количество()-1];
		ЕстьПоследнееСостояниеДоговора = ПоследнееСостояниеДоговора.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
	Иначе
		ЕстьПоследнееСостояниеДоговора = Ложь;
	КонецЕсли;
	Если ЕстьПоследнееСостояниеДоговора И СовпадаетПричинаЗакрытия И ТекущееСостояниеЗакрыт Тогда
		Движения.уп_СостоянияДоговораОПС.Удалить(ПоследнееСостояниеДоговора);		
	КонецЕсли;
	
	// причина закрытия
	Если Движения.уп_ПричиныЗакрытияДоговоровОПС.Количество()>0 Тогда
		ПоследняяПричинаЗакрытия = Движения.уп_ПричиныЗакрытияДоговоровОПС[Движения.уп_ПричиныЗакрытияДоговоровОПС.Количество()-1];
		ЕстьПоследняяПричинаЗакрытия = ПоследняяПричинаЗакрытия.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
	Иначе
		ЕстьПоследняяПричинаЗакрытия = Ложь;
	КонецЕсли;
	Если ЕстьПоследняяПричинаЗакрытия И СовпадаетПричинаЗакрытия И ТекущееСостояниеЗакрыт Тогда
		Движения.уп_ПричиныЗакрытияДоговоровОПС.Удалить(ПоследняяПричинаЗакрытия);		
	КонецЕсли;
	
	// состояние осн. части
	Если Движения.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.Количество()>0 Тогда
		ПоследнееСостояниеОснЧасти = Движения.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС[Движения.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.Количество()-1];
		ЕстьПоследнееСостояниеОснЧасти = ПоследнееСостояниеОснЧасти.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
	Иначе
		ЕстьПоследнееСостояниеОснЧасти = Ложь;
	КонецЕсли;
	СостояниеОснЧастиПрекращен = ТекСтрокаДоговорыОПС.СостояниеОснЧасти = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.Прекращен;
	Если ЕстьПоследнееСостояниеОснЧасти И СостояниеОснЧастиПрекращен Тогда 
		//((СовпадаетПричинаЗакрытия И ТекущееСостояниеЗакрыт) ИЛИ СостояниеОснЧастиПрекращен) Тогда
		Движения.уп_СостояниеОсновнойЧастиПенсионногоСчетаОПС.Удалить(ПоследнееСостояниеОснЧасти);		
	КонецЕсли;
	
	// состояние доп. части
	Если Движения.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.Количество()>0 Тогда
		ПоследнееСостояниеДопЧасти = Движения.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС[Движения.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.Количество()-1];
		ЕстьПоследнееСостояниеДопЧасти = ПоследнееСостояниеДопЧасти.ДоговорОПС = ТекСтрокаДоговорыОПС.ДоговорОПС;
	Иначе
		ЕстьПоследнееСостояниеДопЧасти = Ложь;
	КонецЕсли;
	СостояниеДопЧастиПрекращен = ТекСтрокаДоговорыОПС.СостояниеДопЧасти = Перечисления.уп_СостояниеЧастиПенсионногоСчетаОПС.Прекращен;
	Если ЕстьПоследнееСостояниеДопЧасти И СостояниеДопЧастиПрекращен Тогда
		//((СовпадаетПричинаЗакрытия И ТекущееСостояниеЗакрыт) ИЛИ СостояниеДопЧастиПрекращен) Тогда
		Движения.уп_СостояниеДополнительнойЧастиПенсионногоСчетаОПС.Удалить(ПоследнееСостояниеДопЧасти);		
	КонецЕсли;
КонецПроцедуры

// ХМНПФ 21.10.2016 ШадринАВ // Новая ХМ_ОткорректироватьТЧПослеРасчета() // №602
Процедура ХМ_ОткорректироватьТЧПослеРасчета(ДоговорОПС = Неопределено) Экспорт
	СтрокиКУдалению = Новый СписокЗначений;
	Если ДоговорОПС = Неопределено Тогда
		// из ТЧ Расшифровка убрать строки договоров, по которым общая сумма строк = 0 
		ТЗДоговоры = РасшифровкаСуммы.Выгрузить(,"ДоговорОПС, Сумма");
		ТЗДоговоры.Свернуть("ДоговорОПС","Сумма");
		Отбор = Новый Структура();
		Отбор.Вставить("Сумма",0);
		ДоговорыКУдалению = ТЗДоговоры.НайтиСтроки(Отбор);
		Для Каждого Договор Из ДоговорыКУдалению Цикл
			Для Каждого стр из РасшифровкаСуммы Цикл
				Если стр.ДоговорОПС = Договор.ДоговорОПС Тогда
					СтрокиКУдалению.Добавить(стр);
				КонецЕсли;	
			КонецЦикла;	
		КонецЦикла;
	Иначе
		// из ТЧ Расшифровка убрать строки договора = ДоговорОПС, если общая сумма строк по нему = 0
		Отбор = Новый Структура();
		Отбор.Вставить("ДоговорОПС",ДоговорОПС);
		ТЗДоговоры = РасшифровкаСуммы.Выгрузить(Отбор,"ДоговорОПС, Сумма");
		ТЗДоговоры.Свернуть("ДоговорОПС","Сумма");
		Если ТЗДоговоры.Количество() <> 0 И ТЗДоговоры.Итог("Сумма") = 0 Тогда
			Для Каждого стр из РасшифровкаСуммы Цикл
				Если стр.ДоговорОПС = ДоговорОПС Тогда
					СтрокиКУдалению.Добавить(стр);
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	Для а = 0 по СтрокиКУдалению.Количество()-1 Цикл
		СтрокаКУдалению = СтрокиКУдалению.Получить(а).Значение;
		РасшифровкаСуммы.Удалить(СтрокаКУдалению);
	КонецЦикла;	
КонецПроцедуры // ХМ_ОткорректироватьТЧПослеРасчета()

// ХМНПФ 19.07.2016 ЛыткинАМ // Новая ХМ_Рассчитать_ВыделитьНашИД // №433
Процедура ХМ_Рассчитать_ВыделитьНашИД(УменьшитьРасшифровку = Ложь, УменьшитьОстатокВРасшифровке = Ложь)  Экспорт
	// +ХМНПФ 20.07.2016 ШадринАВ // ХМ_Рассчитать_ВыделитьНашИД() // №436
	// определить сумму ИД фонда по договорам в разрезе типов резерва и типов сумм
	// найти в ТЧ Расшифровка строки с ИД и уменьшить сумму ИД на сумму ИД фонда с учетом типа резерва и типа суммы
	// добавить в ТЧ Расшифровка строки с ИД фонда
	// заполнить сумму ХМ_НашИД в ТЧ ДоговорыОПС
	Если НЕ УменьшитьРасшифровку Тогда
	// -ХМНПФ 20.07.2016 ШадринАВ // ХМ_Рассчитать_ВыделитьНашИД() // №436
		НайденныеСтроки = РасшифровкаСуммы.НайтиСтроки(Новый Структура("ХМ_НашИД",Истина));
		Для каждого СтрокаСуммы Из НайденныеСтроки Цикл
			РасшифровкаСуммы.Удалить(СтрокаСуммы);
		КонецЦикла;
		Для каждого СтрокаСуммы Из ДоговорыОПС Цикл
			СтрокаСуммы.Сумма = СтрокаСуммы.Сумма - СтрокаСуммы.ХМ_НашИД;
			СтрокаСуммы.ХМ_НашИД = 0;
		КонецЦикла;
	КонецЕсли;
		
	Если Не ХМ_НамНашИД тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РезервыОПС.ДоговорОПС,
	|	РезервыОПС.ТипСуммы,
	|	СУММА(ЕСТЬNULL(РезервыОПС.Сумма, 0)) КАК СуммаОстаток,
	|	РезервыОПС.ТипРезерва,
	|	0 КАК СуммаГарантированная,
	|	0 КАК СуммаКомпенсации,
	|	0 КАК СуммаВосполнения,
	|	0 КАК СуммаВозмещения
	|ПОМЕСТИТЬ ИДФонда
	|ИЗ
	|	РегистрНакопления.уп_РезервыОПС КАК РезервыОПС
	|ГДЕ
	|	РезервыОПС.Регистратор ССЫЛКА Документ.уп_РаспределениеИДОПС
	|	И РезервыОПС.Период <= &ДатаДок
	|	И РезервыОПС.ДоговорОПС В(&СписокДоговоров)
	|	И РезервыОПС.ТипРезерва В(&СписокТиповРезерва)
	|
	|СГРУППИРОВАТЬ ПО
	|	РезервыОПС.ТипСуммы,
	|	РезервыОПС.ТипРезерва,
	|	РезервыОПС.ДоговорОПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИДФонда.ДоговорОПС,
	|	ИДФонда.ТипСуммы,
	|	ИДФонда.СуммаОстаток,
	|	ИДФонда.ТипРезерва,
	|	ИДФонда.СуммаГарантированная,
	|	ИДФонда.СуммаКомпенсации,
	|	ИДФонда.СуммаВосполнения,
	|	ИДФонда.СуммаВозмещения
	|ИЗ
	|	ИДФонда КАК ИДФонда
	|ГДЕ
	|	ИДФонда.СуммаОстаток <> 0";
	
	Запрос.УстановитьПараметр("ДатаДок", Дата-1);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокДоговоров", ДоговорыОПС.ВыгрузитьКолонку("ДоговорОПС"));
	
	СписокТиповРезерва = Новый СписокЗначений;
	СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты);
	Запрос.УстановитьПараметр("СписокТиповРезерва", СписокТиповРезерва);
	
	Результат = Запрос.Выполнить();
	ВыборкаТиповСумм = Результат.Выбрать();
	Пока ВыборкаТиповСумм.Следующий() Цикл
	// +ХМНПФ 20.07.2016 ШадринАВ // ХМ_Рассчитать_ВыделитьНашИД() // №436
		Если УменьшитьРасшифровку Тогда
			ОтборСтрок = Новый Структура("ДоговорОПС,ТипРезерва,ТипСуммы,ХМ_НашИД",ВыборкаТиповСумм.ДоговорОПС,ВыборкаТиповСумм.ТипРезерва,ВыборкаТиповСумм.ТипСуммы,Ложь);
			НайденныеСтроки = РасшифровкаСуммы.НайтиСтроки(ОтборСтрок);
			Если НайденныеСтроки.Количество()>0 Тогда
				НайденныеСтроки[0].Сумма = НайденныеСтроки[0].Сумма - ВыборкаТиповСумм.СуммаОстаток;
				Если УменьшитьОстатокВРасшифровке Тогда
					НайденныеСтроки[0].СуммаОстаток = НайденныеСтроки[0].СуммаОстаток - ВыборкаТиповСумм.СуммаОстаток;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	// -ХМНПФ 20.07.2016 ШадринАВ // ХМ_Рассчитать_ВыделитьНашИД() // №436
		НовСтрРасшифровки = РасшифровкаСуммы.Добавить();
		НовСтрРасшифровки.ДоговорОПС = ВыборкаТиповСумм.ДоговорОПС;
		НовСтрРасшифровки.ТипРезерва = ВыборкаТиповСумм.ТипРезерва;
		НовСтрРасшифровки.ТипСуммы = ВыборкаТиповСумм.ТипСуммы;
		НовСтрРасшифровки.Сумма = ВыборкаТиповСумм.СуммаОстаток;
		Если УменьшитьОстатокВРасшифровке Тогда
			НовСтрРасшифровки.СуммаОстаток = ВыборкаТиповСумм.СуммаОстаток;
		КонецЕсли;
		НовСтрРасшифровки.СуммаГарантированная = ВыборкаТиповСумм.СуммаГарантированная;
		НовСтрРасшифровки.СуммаКомпенсации = ВыборкаТиповСумм.СуммаКомпенсации;
		НовСтрРасшифровки.СуммаВосполнения = ВыборкаТиповСумм.СуммаВосполнения;
		НовСтрРасшифровки.СуммаВозмещения = ВыборкаТиповСумм.СуммаВозмещения;
		НовСтрРасшифровки.ХМ_НашИД = Истина;
		НайденныеСтроки = ДоговорыОПС.НайтиСтроки(Новый Структура("ДоговорОПС",ВыборкаТиповСумм.ДоговорОПС));
		СтрокаСуммы = НайденныеСтроки[0];
		СтрокаСуммы.ХМ_НашИД = СтрокаСуммы.ХМ_НашИД + ВыборкаТиповСумм.СуммаОстаток;
	// +ХМНПФ 20.07.2016 ШадринАВ // ХМ_Рассчитать_ВыделитьНашИД() // №436
		Если НЕ УменьшитьРасшифровку Тогда
			СтрокаСуммы.Сумма = СтрокаСуммы.Сумма + ВыборкаТиповСумм.СуммаОстаток;
		КонецЕсли;
	// -ХМНПФ 20.07.2016 ШадринАВ // ХМ_Рассчитать_ВыделитьНашИД() // №436
	КонецЦикла;
КонецПроцедуры	

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 27.01.2016 ШадринАВ // Новая ОбработкаЗаполнения() // №151
	// ХМНПФ 28.01.2016 ШадринАВ // ОбработкаЗаполнения() // №156
	// ХМНПФ 22.03.2016 ШадринАВ // ОбработкаПроведения() // №285
	// ХМНПФ 22.03.2016 ШадринАВ // Новая ХМ_ОткорректироватьДвиженияПоСостояниям() // №285
	// ХМНПФ 06.04.2016 ЛыткинАМ // ОбработкаПроведения() // №302
	// ХМНПФ 06.04.2016 ЛыткинАМ // Новая ХМ_ОбработкаПроведения() // №302
	// ХМНПФ 19.07.2016 ЛыткинАМ // Новая ХМ_Рассчитать_ВыделитьНашИД() // №433
	// ХМНПФ 19.07.2016 ЛыткинАМ // Рассчитать() // №433
	// ХМНПФ 19.07.2016 ЛыткинАМ // ОбработкаПроведения() // №433
	// ХМНПФ 01.08.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №392
	// ХМНПФ 21.10.2016 ШадринАВ // Рассчитать() // №602
	// ХМНПФ 22.03.2017 ШадринАВ // Рассчитать() // №869
	// ХМНПФ 27.03.2017 ШадринАВ // ПечатьРеестраПФР() // №876
	// ХМНПФ 09.04.2018 ШадринАВ // ОбработкаПроведения() // №1493
	// ХМНПФ 14.12.2018 ШадринАВ // ПечатьРеестраПФР() // №1939
КонецПроцедуры	

&После("ОбработкаПроведения")
Процедура ХМОбработкаПроведения(Отказ, Режим)
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Документы.уп_ЗакрытиеДоговораОПС.уп_ЗакрытиеДоговораОПС(ЭтотОбъект, Отказ, Режим);

КонецПроцедуры

&После("ПриУстановкеНовогоНомера")
Процедура ХМ_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	ХМ_ПодпискиНаСобытия.ХМ_НомераРешенийПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);	
КонецПроцедуры

&ИзменениеИКонтроль("ПечатьПриложение1")
Функция ХМПечатьПриложение1(ПечататьОборот)

	ТабДокумент = Новый ТабличныйДокумент;
	Макет       = ПолучитьМакет("Приложение1");
	СведенияОбОрг = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, Дата);
	НаименованиеНПФ = СведенияОбОрг.ПолноеНаименование;
	АдресНПФ = СведенияОбОрг.ФактическийАдрес+".";
	ДанныеОтветственного = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Организация, Ответственный.ФизическоеЛицо, Дата);
	Исполнитель = ""+ДанныеОтветственного.Фамилия+" "+Лев(ДанныеОтветственного.Имя,1)+". "+Лев(ДанныеОтветственного.Отчество,1)+".";
	ДолжностьОтветственного = ДанныеОтветственного.Должность;
	ТелефонИсполнителя = СведенияОбОрг.Телефоны;
	Данные = Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо", Организация, Перечисления.ОтветственныеЛицаОрганизаций.Уполномоченныйпредставитель);
	Результат = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Дата, Данные);
	Если Результат.Количество()>0 Тогда
		УполномоченноеЛицо = Результат[0].Должность;
		#Вставка 
		ФИОУполномоченного = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Результат[0].ФизическоеЛицо);
		#КонецВставки
		ФИОУполномоченного = уп_ОбщегоНазначенияКлиентСервер.ФамилияИнициалыФизЛица(Результат[0].ФизическоеЛицо);
	Иначе
		УполномоченноеЛицо = "";
		ФИОУполномоченного = "";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо КАК ФизЛицо
	|ИЗ
	|	Документ.уп_ЗакрытиеДоговораОПС.ДоговорыОПС КАК ЗакрытиеДоговораОПСДоговорыОПС
	|ГДЕ
	|	ЗакрытиеДоговораОПСДоговорыОПС.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);

	СписокУчастников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизЛицо");


	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК Адрес
	|ПОМЕСТИТЬ ТабАдресов
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|ГДЕ
	|	ФизическиеЛицаКонтактнаяИнформация.Тип = &Адрес
	|	И ФизическиеЛицаКонтактнаяИнформация.Вид = &ФактАдрес
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакрытиеДоговораОПСДоговорыОПС.Участник.НаименованиеПолное КАК ФИОЗастрахованногоЛица,
	|	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.ДатаРождения КАК ДатаРождения,
	|	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР КАК НомерПФР,
	|	ЗакрытиеДоговораОПСДоговорыОПС.Сумма КАК Сумма,
	|	ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС.Код КАК НомерДоговора,
	|	ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС.ДатаЗаключения КАК ДатаДоговора,
	|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
	|	ТабАдресов.Адрес КАК Адрес
	|ИЗ
	|	Документ.уп_ЗакрытиеДоговораОПС.ДоговорыОПС КАК ЗакрытиеДоговораОПСДоговорыОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&Дата, ) КАК ФИОФизЛицСрезПоследних
	|		ПО ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо = ФИОФизЛицСрезПоследних.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабАдресов КАК ТабАдресов
	|		ПО ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо = ТабАдресов.Ссылка
	|ГДЕ
	|	ЗакрытиеДоговораОПСДоговорыОПС.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗакрытиеДоговораОПСДоговорыОПС.НомерСтроки";

	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("СписокУчастников", СписокУчастников);
	Запрос.УстановитьПараметр("Адрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
	Запрос.УстановитьПараметр("ФактАдрес", Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
	Запрос.УстановитьПараметр("Дата", Дата);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	ОбластьМакета = Макет.ПолучитьОбласть("Отчет");
	ОбластьОборот = Макет.ПолучитьОбласть("ОтчетОборот");
	Пока Выборка.Следующий() Цикл
		ОбластьМакета.Параметры.ДатаДокЧисло = Формат(Дата,"ДФ=dd");
		ОбластьМакета.Параметры.ДатаДокГод = Формат(Дата,"ДФ=yy");
		ДатаДокМесяц = Формат(Дата,"ДЛФ=DD");
		ДатаДокМесяц = СтрЗаменить(ДатаДокМесяц, Формат(Дата,"ДФ=d")+" ", "");
		ОбластьМакета.Параметры.ДатаДокМесяц = Лев(ДатаДокМесяц, Найти(ДатаДокМесяц, " ")-1);
		ОбластьМакета.Параметры.НомерДок = Номер;

		ОбластьМакета.Параметры.ФИОЗастрахованногоЛица = Выборка.ФИОЗастрахованногоЛица;

		ОбластьМакета.Параметры.НомерПФР = уп_ОПС.ПреобразоватьНомерПФР(Выборка.НомерПФР);

		ОбластьМакета.Параметры.ДРЧисло = Формат(Выборка.ДатаРождения,"ДФ=dd");
		ОбластьМакета.Параметры.ДРГод = Формат(Выборка.ДатаРождения,"ДФ=yyyy");
		ДРМесяц = Формат(Выборка.ДатаРождения,"ДЛФ=DD");
		ДРМесяц = СтрЗаменить(ДРМесяц, Формат(Выборка.ДатаРождения,"ДФ=d")+" ", "");
		ОбластьМакета.Параметры.ДРМесяц = Лев(ДРМесяц, Найти(ДРМесяц, " ")-1);

		Областьмакета.Параметры.НаименованиеНПФ = НаименованиеНПФ;

		Областьмакета.Параметры.ДатаДоговораЧисло = Формат(Выборка.ДатаДоговора, "ДФ=dd");
		Областьмакета.Параметры.ДатаДоговораГод = Формат(Выборка.ДатаДоговора, "ДФ=yy");
		ДатаДоговораМесяц = Формат(Выборка.ДатаДоговора,"ДЛФ=DD");
		ДатаДоговораМесяц = СтрЗаменить(ДатаДоговораМесяц, Формат(Выборка.ДатаДоговора,"ДФ=d")+" ", "");
		ОбластьМакета.Параметры.ДатаДоговораМесяц = Лев(ДатаДоговораМесяц, Найти(ДатаДоговораМесяц, " ")-1);
		Областьмакета.Параметры.НомерДоговора = СокрЛП(Выборка.НомерДоговора);

		ОбластьМакета.Параметры.Сумма = Формат(Выборка.Сумма,"ЧДЦ = 2");

		ОбластьМакета.Параметры.АдресНПФ = АдресНПФ;

		ОбластьМакета.Параметры.УполномоченноеЛицо = УполномоченноеЛицо;
		ОбластьМакета.Параметры.ФИОУполномоченного = ФИОУполномоченного;

		ОбластьМакета.Параметры.Исполнитель = Исполнитель;
		ОбластьМакета.Параметры.ТелефонИсполнителя = ТелефонИсполнителя;

		ТабДокумент.Вывести(ОбластьМакета);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

		Если ПечататьОборот Тогда
			ОбластьОборот.Параметры.ФИОЗастрахованногоЛица = Выборка.Фамилия+" "+Выборка.Имя+" "+Выборка.Отчество;
			ОбластьОборот.Параметры.АдресЗастрахованногоЛица = Выборка.Адрес;

			ТабДокумент.Вывести(ОбластьОборот);
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;	
	КонецЦикла;

	Возврат ТабДокумент;

КонецФункции

&ИзменениеИКонтроль("ПечатьПриложение2")
Функция ХМПечатьПриложение2()

	ТабДокумент = Новый ТабличныйДокумент;
	//ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПоступлениеТоваровУслуг_Накладная";
	Макет       = ПолучитьМакет("Приложение2");
	//ДатаДок = Формат(Дата, "ДФ = дд.ММ.гггг")+"г. ";
	НомерДок = Номер;
	СведенияОбОрг = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, Дата);
	//Руководители = ОтветственныеЛица(Организация, Дата);
	НаименованиеНПФ = СведенияОбОрг.ПолноеНаименование;
	АдресНПФ = СведенияОбОрг.ФактическийАдрес+".";
	ДанныеОтветственного = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Организация, Ответственный.ФизическоеЛицо, Дата);
	Исполнитель = ""+ДанныеОтветственного.Фамилия+" "+Лев(ДанныеОтветственного.Имя,1)+". "+Лев(ДанныеОтветственного.Отчество,1)+".";
	ДолжностьОтветственного = ДанныеОтветственного.Должность;
	ТелефонИсполнителя = СведенияОбОрг.Телефоны;
	Данные = Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо", Организация, Перечисления.ОтветственныеЛицаОрганизаций.Уполномоченныйпредставитель);
	Результат = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Дата, Данные);
	Если Результат.Количество()>0 Тогда
		УполномоченноеЛицо = Результат[0].Должность;
		#Вставка 
		ФИОУполномоченного = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Результат[0].ФизическоеЛицо);
		#КонецВставки
		ФИОУполномоченного = уп_ОбщегоНазначенияКлиентСервер.ФамилияИнициалыФизЛица(Результат[0].ФизическоеЛицо);
	Иначе
		УполномоченноеЛицо = "";
		ФИОУполномоченного = "";
	КонецЕсли;

	ПенсионныеПравила = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
	ВозвращатьСредства = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗакрытиеДоговораОПСДоговорыОПС.Участник.НаименованиеПолное КАК ФИОЗастрахованногоЛица,
	|	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР КАК НомерПФР,
	|	ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС.Код КАК НомерДоговора,
	|	ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС.ДатаЗаключения КАК ДатаДоговора,
	|	ЗакрытиеДоговораОПСДоговорыОПС.Заявление,
	|	ЗакрытиеДоговораОПСДоговорыОПС.ДатаСмерти,
	|	ЗакрытиеДоговораОПСДоговорыОПС.ДатаВступленияВДействие
	|ИЗ
	|	Документ.уп_ЗакрытиеДоговораОПС.ДоговорыОПС КАК ЗакрытиеДоговораОПСДоговорыОПС
	|ГДЕ
	|	ЗакрытиеДоговораОПСДоговорыОПС.Ссылка = &Ссылка "+?(ВозвращатьСредства, "
	|    И НЕ ЗакрытиеДоговораОПСДоговорыОПС.ДатаВступленияВДействие>ЗакрытиеДоговораОПСДоговорыОПС.ДатаСмерти","")+"
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗакрытиеДоговораОПСДоговорыОПС.НомерСтроки";

	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	ОбластьМакета = Макет.ПолучитьОбласть("Отчет");
	////ds
	//ОбластьМакетаОборот = Макет.ПолучитьОбласть("ОтчетОборот");
	////ds
	ДанныеОбнаружены = Ложь;
	//ОбластьОборот = Макет.ПолучитьОбласть("Оборот");
	Пока Выборка.Следующий() Цикл
		Если Выборка.Заявление <> Неопределено Тогда
			Для Каждого стр из Выборка.Заявление.Правопреемники Цикл
				ДанныеОбнаружены = Истина;
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ОбластьМакета.Параметры.ФИОПравопреемникаЗастрахованногоЛица = стр.Фамилия+" "+стр.Имя+" "+стр.Отчество;
				ОбластьМакета.Параметры.ДатаСмертиЗастрахованногоЛица = Формат(Выборка.ДатаСмерти,"ДЛФ=DD");
				//ОбластьМакета.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора,"ДЛФ=DD");
				Областьмакета.Параметры.ДатаДоговораЧисло = Формат(Выборка.ДатаДоговора, "ДФ=dd");
				Областьмакета.Параметры.ДатаДоговораГод = Формат(Выборка.ДатаДоговора, "ДФ=yy");
				ДатаДоговораМесяц = Формат(Выборка.ДатаДоговора,"ДЛФ=DD");
				ДатаДоговораМесяц = СтрЗаменить(ДатаДоговораМесяц, Формат(Выборка.ДатаДоговора,"ДФ=d")+" ", "");
				ОбластьМакета.Параметры.ДатаДоговораМесяц = Лев(ДатаДоговораМесяц, Найти(ДатаДоговораМесяц, " ")-1);
				ОбластьМакета.Параметры.НомерДоговора = СокрЛП(Выборка.НомерДоговора);
				ОбластьМакета.Параметры.НомерПФР = уп_ОПС.ПреобразоватьНомерПФР(Выборка.НомерПФР);
				//ОбластьМакета.Параметры.ДатаДок = ДатаДок;
				ОбластьМакета.Параметры.ДатаДокЧисло = Формат(Дата,"ДФ=dd");
				ОбластьМакета.Параметры.ДатаДокГод = Формат(Дата,"ДФ=yy");
				ДатаДокМесяц = Формат(Дата,"ДЛФ=DD");
				ДатаДокМесяц = СтрЗаменить(ДатаДокМесяц, Формат(Дата,"ДФ=d")+" ", "");
				ОбластьМакета.Параметры.ДатаДокМесяц = Лев(ДатаДокМесяц, Найти(ДатаДокМесяц, " ")-1);
				ОбластьМакета.Параметры.НомерДок = НомерДок;
				Областьмакета.Параметры.НаименованиеНПФ = НаименованиеНПФ;
				ОбластьМакета.Параметры.АдресНПФ = АдресНПФ;
				ОбластьМакета.Параметры.УполномоченноеЛицо = УполномоченноеЛицо;
				ОбластьМакета.Параметры.ФИОУполномоченного = ФИОУполномоченного;
				ОбластьМакета.Параметры.Исполнитель = Исполнитель;
				ОбластьМакета.Параметры.ТелефонИсполнителя = ТелефонИсполнителя;
				ТабДокумент.Вывести(ОбластьМакета);
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				////ds
				//ОбластьМакетаОборот.Параметры.АдресПравопреемникаЗастрахованногоЛица = стр.Адрес;
				//ОбластьМакетаОборот.Параметры.ФИОПравопреемникаЗастрахованногоЛица = стр.Фамилия+" "+стр.Имя+" "+стр.Отчество;
				//ТабДокумент.Вывести(ОбластьМакетаОборот);
				//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				////ds
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
	Если Не ДанныеОбнаружены Тогда
		Сообщить("Нет данных для печати. Правопреемники не зарегистрированы.");
		ТабДокумент = Неопределено;
	КонецЕсли;	
	Возврат ТабДокумент;

КонецФункции

&ИзменениеИКонтроль("ПечатьПриложение3")
Функция ХМПечатьПриложение3()

	ТабДокумент = Новый ТабличныйДокумент;
	//ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПоступлениеТоваровУслуг_Накладная";
	Макет       = ПолучитьМакет("Приложение3");
	//ДатаДок = Формат(Дата, "ДФ = дд.ММ.гггг")+"г. ";
	НомерДок = Номер;
	СведенияОбОрг = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, Дата);
	//Руководители = ОтветственныеЛица(Организация, Дата);
	НаименованиеНПФ = СведенияОбОрг.ПолноеНаименование;
	ДанныеОтветственного = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Организация, Ответственный.ФизическоеЛицо, Дата);
	Исполнитель = ""+ДанныеОтветственного.Фамилия+" "+Лев(ДанныеОтветственного.Имя,1)+". "+Лев(ДанныеОтветственного.Отчество,1)+".";
	ДолжностьОтветственного = ДанныеОтветственного.Должность;
	ТелефонИсполнителя = СведенияОбОрг.Телефоны;
	Данные = Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо", Организация, Перечисления.ОтветственныеЛицаОрганизаций.Уполномоченныйпредставитель);
	Результат = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Дата, Данные);
	Если Результат.Количество()>0 Тогда
		УполномоченноеЛицо = Результат[0].Должность;
		#Вставка 
		ФИОУполномоченного = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Результат[0].ФизическоеЛицо);
		#КонецВставки
		ФИОУполномоченного = уп_ОбщегоНазначенияКлиентСервер.ФамилияИнициалыФизЛица(Результат[0].ФизическоеЛицо);
	Иначе
		УполномоченноеЛицо = "";
		ФИОУполномоченного = "";
	КонецЕсли;
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//ОбластьМакета.Параметры.ДатаДок = ДатаДок;
	ОбластьМакета.Параметры.ДатаДокЧисло = Формат(Дата,"ДФ=dd");
	ОбластьМакета.Параметры.ДатаДокГод = Формат(Дата,"ДФ=yy");
	ДатаДокМесяц = Формат(Дата,"ДЛФ=DD");
	ДатаДокМесяц = СтрЗаменить(ДатаДокМесяц, Формат(Дата,"ДФ=d")+" ", "");
	ОбластьМакета.Параметры.ДатаДокМесяц = Лев(ДатаДокМесяц, Найти(ДатаДокМесяц, " ")-1);
	ОбластьМакета.Параметры.НомерДок = НомерДок;
	ОбластьМакета.Параметры.НаименованиеНПФ = НаименованиеНПФ;
	ОбластьМакета.Параметры.ИНННПФ = СокрЛП(Организация.ИНН);

	ТабДокумент.Вывести(ОбластьМакета);


	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗакрытиеДоговораОПСДоговорыОПС.Участник.НаименованиеПолное КАК ФИОЗастрахованногоЛица,
	|	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР КАК НомерПФР,
	|	ЗакрытиеДоговораОПСДоговорыОПС.НомерСтроки КАК НомерСтроки,
	|	ЗакрытиеДоговораОПСДоговорыОПС.Ссылка.ПричинаЗакрытия
	|ИЗ
	|	Документ.уп_ЗакрытиеДоговораОПС.ДоговорыОПС КАК ЗакрытиеДоговораОПСДоговорыОПС
	|ГДЕ
	|	ЗакрытиеДоговораОПСДоговорыОПС.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ОбластьМакета.Параметры.НомерПФР = уп_ОПС.ПреобразоватьНомерПФР(Выборка.НомерПФР);
		Если Выборка.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.АннулированиеЛицензии Тогда
			Областьмакета.Параметры.ПричинаЗакрытия = "аннулирование лицензии";
		ИначеЕсли Выборка.ПричинаЗакрытия = Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
			ОбластьМакета.Параметры.ПричинаЗакрытия = "смерть застрахованного лица";
		КонецЕсли;	
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;

	// Вывести подписи
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.УполномоченноеЛицо = УполномоченноеЛицо;
	ОбластьМакета.Параметры.ФИОУполномоченного = ФИОУполномоченного;
	ОбластьМакета.Параметры.Исполнитель = Исполнитель;
	ОбластьМакета.Параметры.ТелефонИсполнителя = ТелефонИсполнителя;
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции

&ИзменениеИКонтроль("ПечатьПриложение2_2")
Функция ХМПечатьПриложение2_2()

	ТабДокумент = Новый ТабличныйДокумент;
	//ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПоступлениеТоваровУслуг_Накладная";
	Макет       = ПолучитьМакет("Приложение2_2");
	//ДатаДок = Формат(Дата, "ДФ = дд.ММ.гггг")+"г. ";
	НомерДок = Номер;
	СведенияОбОрг = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, Дата);
	//Руководители = ОтветственныеЛица(Организация, Дата);
	НаименованиеНПФ = СведенияОбОрг.ПолноеНаименование;
	АдресНПФ = СведенияОбОрг.ФактическийАдрес+".";
	ДанныеОтветственного = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Организация, Ответственный.ФизическоеЛицо, Дата);
	Исполнитель = ""+ДанныеОтветственного.Фамилия+" "+Лев(ДанныеОтветственного.Имя,1)+". "+Лев(ДанныеОтветственного.Отчество,1)+".";
	ДолжностьОтветственного = ДанныеОтветственного.Должность;
	ТелефонИсполнителя = СведенияОбОрг.Телефоны;
	Данные = Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо", Организация, Перечисления.ОтветственныеЛицаОрганизаций.Уполномоченныйпредставитель);
	Результат = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Дата, Данные);
	Если Результат.Количество()>0 Тогда
		УполномоченноеЛицо = Результат[0].Должность;
		#Вставка 
		ФИОУполномоченного = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Результат[0].ФизическоеЛицо);
		#КонецВставки
		ФИОУполномоченного = уп_ОбщегоНазначенияКлиентСервер.ФамилияИнициалыФизЛица(Результат[0].ФизическоеЛицо);
	Иначе
		УполномоченноеЛицо = "";
		ФИОУполномоченного = "";
	КонецЕсли;

	ПенсионныеПравила = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
	ВозвращатьСредства = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗакрытиеДоговораОПСДоговорыОПС.Участник.НаименованиеПолное КАК ФИОЗастрахованногоЛица,
	|	ЗакрытиеДоговораОПСДоговорыОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР КАК НомерПФР,
	|	ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС.Код КАК НомерДоговора,
	|	ЗакрытиеДоговораОПСДоговорыОПС.ДоговорОПС.ДатаЗаключения КАК ДатаДоговора,
	|	ЗакрытиеДоговораОПСДоговорыОПС.Заявление,
	|	ЗакрытиеДоговораОПСДоговорыОПС.ДатаСмерти,
	|	ЗакрытиеДоговораОПСДоговорыОПС.ДатаВступленияВДействие
	|ИЗ
	|	Документ.уп_ЗакрытиеДоговораОПС.ДоговорыОПС КАК ЗакрытиеДоговораОПСДоговорыОПС
	|ГДЕ
	|	ЗакрытиеДоговораОПСДоговорыОПС.Ссылка = &Ссылка "+?(ВозвращатьСредства, "
	|    И НЕ ЗакрытиеДоговораОПСДоговорыОПС.ДатаВступленияВДействие>ЗакрытиеДоговораОПСДоговорыОПС.ДатаСмерти","")+"
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗакрытиеДоговораОПСДоговорыОПС.НомерСтроки";

	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	ОбластьМакета = Макет.ПолучитьОбласть("Отчет");
	//ds
	ОбластьМакетаОборот = Макет.ПолучитьОбласть("ОтчетОборот");
	//ds
	ДанныеОбнаружены = Ложь;
	//ОбластьОборот = Макет.ПолучитьОбласть("Оборот");
	Пока Выборка.Следующий() Цикл
		Если Выборка.Заявление <> Неопределено Тогда
			Для Каждого стр из Выборка.Заявление.Правопреемники Цикл
				ДанныеОбнаружены = Истина;
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ОбластьМакета.Параметры.ФИОПравопреемникаЗастрахованногоЛица = стр.Фамилия+" "+стр.Имя+" "+стр.Отчество;
				ОбластьМакета.Параметры.ДатаСмертиЗастрахованногоЛица = Формат(Выборка.ДатаСмерти,"ДЛФ=DD");
				//ОбластьМакета.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора,"ДЛФ=DD");
				Областьмакета.Параметры.ДатаДоговораЧисло = Формат(Выборка.ДатаДоговора, "ДФ=dd");
				Областьмакета.Параметры.ДатаДоговораГод = Формат(Выборка.ДатаДоговора, "ДФ=yy");
				ДатаДоговораМесяц = Формат(Выборка.ДатаДоговора,"ДЛФ=DD");
				ДатаДоговораМесяц = СтрЗаменить(ДатаДоговораМесяц, Формат(Выборка.ДатаДоговора,"ДФ=d")+" ", "");
				ОбластьМакета.Параметры.ДатаДоговораМесяц = Лев(ДатаДоговораМесяц, Найти(ДатаДоговораМесяц, " ")-1);
				ОбластьМакета.Параметры.НомерДоговора = СокрЛП(Выборка.НомерДоговора);
				ОбластьМакета.Параметры.НомерПФР = уп_ОПС.ПреобразоватьНомерПФР(Выборка.НомерПФР);
				//ОбластьМакета.Параметры.ДатаДок = ДатаДок;
				ОбластьМакета.Параметры.ДатаДокЧисло = Формат(Дата,"ДФ=dd");
				ОбластьМакета.Параметры.ДатаДокГод = Формат(Дата,"ДФ=yy");
				ДатаДокМесяц = Формат(Дата,"ДЛФ=DD");
				ДатаДокМесяц = СтрЗаменить(ДатаДокМесяц, Формат(Дата,"ДФ=d")+" ", "");
				ОбластьМакета.Параметры.ДатаДокМесяц = Лев(ДатаДокМесяц, Найти(ДатаДокМесяц, " ")-1);
				ОбластьМакета.Параметры.НомерДок = НомерДок;
				Областьмакета.Параметры.НаименованиеНПФ = НаименованиеНПФ;
				ОбластьМакета.Параметры.АдресНПФ = АдресНПФ;
				ОбластьМакета.Параметры.УполномоченноеЛицо = УполномоченноеЛицо;
				ОбластьМакета.Параметры.ФИОУполномоченного = ФИОУполномоченного;
				ОбластьМакета.Параметры.Исполнитель = Исполнитель;
				ОбластьМакета.Параметры.ТелефонИсполнителя = ТелефонИсполнителя;
				ТабДокумент.Вывести(ОбластьМакета);
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				//ds
				ОбластьМакетаОборот.Параметры.АдресПравопреемникаЗастрахованногоЛица = стр.Адрес;
				//
				ОбластьМакетаОборот.Параметры.ФИОПравопреемникаЗастрахованногоЛица = стр.Фамилия+" "+стр.Имя+" "+стр.Отчество;
				ТабДокумент.Вывести(ОбластьМакетаОборот);
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				//ds
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
	Если Не ДанныеОбнаружены Тогда
		Сообщить("Нет данных для печати. Правопреемники не зарегистрированы.");
		ТабДокумент = Неопределено;
	КонецЕсли;	
	Возврат ТабДокумент;

КонецФункции
