
&НаСервере
&ИзменениеИКонтроль("ПолучитьЗначенияПеререгистрацияПриостановкаВосстановление")
Функция НПФ_ПолучитьЗначенияПеререгистрацияПриостановкаВосстановление(Данные, Протокол)
	
	Прочитанное = Новый Массив;
	НачатьТранзакцию();
	ЕстьОшибки = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ОтборПодразделение) Тогда
		УсловиеНаПодразделение = " И уп_ПараметрыПенсионногоДоговораСрезПоследних.ПенсионныйДоговор.ПодразделениеБУ В ИЕРАРХИИ (&ОтборПодразделение)";
	Иначе
		УсловиеНаПодразделение = "";
	КонецЕсли;	
	
	Если Объект.ПриостанавливатьНепрошедших Тогда 
		Если Объект.БезКонтрольнойДаты Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = 
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ПенсионныйДоговор КАК ПенсионныйДоговор,
			|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.ПравилоВосстановленияВыплатПослеПеререгистрации КАК Правило,
			|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.ПеререгистрироватьТолькоПожизненные КАК ПеререгистрироватьТолькоПожизненные
			|ПОМЕСТИТЬ Договоры
			|ИЗ
			|	РегистрСведений.уп_ПараметрыПенсионногоДоговора.СрезПоследних(&Дата, ПенсионныйДоговор.Организация = &Организация) КАК уп_ПараметрыПенсионногоДоговораСрезПоследних
			|ГДЕ
			|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.ИспользоватьЕжегоднуюПеререгистрацию
			|	И уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.БезКонтрольнойДаты "+УсловиеНаПодразделение+"
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_СостоянияПССрезПоследних.НомерСчета КАК НомерСчета,
			|	уп_СостоянияПССрезПоследних.НомерСчета.Участник КАК Участник,
			|	Договоры.ПенсионныйДоговор КАК ПенсионныйДоговор,
			|	Договоры.Правило КАК Правило,
			|	уп_СостоянияПССрезПоследних.Состояние КАК Состояние,
			|	Договоры.ПеререгистрироватьТолькоПожизненные КАК ПеререгистрироватьТолькоПожизненные
			|ПОМЕСТИТЬ Счета
			|ИЗ
			|	Договоры КАК Договоры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияПС.СрезПоследних(
			|				&Дата,
			|				НомерСчета.ТипПенсионногоСчета = &Физики
			|					И НомерСчета.Владелец В
			|						(ВЫБРАТЬ
			|							Договоры.ПенсионныйДоговор КАК ПенсионныйДоговор
			|						ИЗ
			|							Договоры КАК Договоры)) КАК уп_СостоянияПССрезПоследних
			|		ПО Договоры.ПенсионныйДоговор = уп_СостоянияПССрезПоследних.НомерСчета.Владелец
			|ГДЕ
			|	уп_СостоянияПССрезПоследних.Состояние = &Состояние
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_СрокиПеререгистрацииСрезПоследних.НомерСчета КАК НомерСчета,
			|	уп_СрокиПеререгистрацииСрезПоследних.ДатаСледующейПеререгистрации КАК ДатаСледующейПеререгистрации
			|ПОМЕСТИТЬ СрокиСледующейПеререгистрации
			|ИЗ
			|	РегистрСведений.уп_СрокиПеререгистрации.СрезПоследних(
			|			&Дата,
			|			НомерСчета В
			|				(ВЫБРАТЬ
			|					Счета.НомерСчета
			|				ИЗ
			|					Счета)) КАК уп_СрокиПеререгистрацииСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Счета.НомерСчета КАК НомерСчета,
			|	Счета.Участник КАК Участник,
			|	Счета.ПенсионныйДоговор КАК ПенсионныйДоговор,
			|	Счета.Правило КАК Правило,
			|	Счета.Состояние КАК Состояние,
			|	ЕСТЬNULL(СрокиСледующейПеререгистрации.ДатаСледующейПеререгистрации, &ПустаяДата) КАК ДатаСледующейПеререгистрации,
			|	ВЫБОР
			|		КОГДА уп_СхемаСчетаСрезПоследних.Схема.ТипПенсионнойСхемы = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.Смешанная)
			|			ТОГДА уп_СхемаСчетаСрезПоследних.ТипПенсии
			|		ИНАЧЕ уп_СхемаСчетаСрезПоследних.Схема.ТипПенсионнойСхемы
			|	КОНЕЦ КАК ТипПенсии,
			|	Счета.ПеререгистрироватьТолькоПожизненные КАК ПеререгистрироватьТолькоПожизненные
			|ПОМЕСТИТЬ СчетаИДаты
			|ИЗ
			|	Счета КАК Счета
			#Удаление
			|		ЛЕВОЕ СОЕДИНЕНИЕ СрокиСледующейПеререгистрации КАК СрокиСледующейПеререгистрации
			#КонецУдаления
			#Вставка
			//https://redmine.npf.com/issues/4262 - нет перерегистрации не надо и приостанавливать
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СрокиСледующейПеререгистрации КАК СрокиСледующейПеререгистрации
			#КонецВставки
			|		ПО Счета.НомерСчета = СрокиСледующейПеререгистрации.НомерСчета
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СхемаСчета.СрезПоследних(
			|				&ДатаКонтроля,
			|				НомерСчета В
			|					(ВЫБРАТЬ
			|						Счета.НомерСчета
			|					ИЗ
			|						Счета)) КАК уп_СхемаСчетаСрезПоследних
			|		ПО Счета.НомерСчета = уп_СхемаСчетаСрезПоследних.НомерСчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СчетаИДаты.НомерСчета КАК НомерСчета,
			|	СчетаИДаты.Участник КАК Участник,
			|	СчетаИДаты.ПенсионныйДоговор КАК ПенсионныйДоговор,
			|	СчетаИДаты.Правило КАК Правило,
			|	СчетаИДаты.Состояние КАК Состояние,
			|	СчетаИДаты.ДатаСледующейПеререгистрации КАК ДатаСледующейПеререгистрации,
			|	ВЫБОР
			|		КОГДА НЕ СчетаИДаты.ПеререгистрироватьТолькоПожизненные
			|			ТОГДА ИСТИНА
			|		КОГДА СчетаИДаты.ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.ПожизненныхВыплат)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК НадоПеререгистрировать
			|ПОМЕСТИТЬ ИтоговаяТабСчетов
			|ИЗ
			|	СчетаИДаты КАК СчетаИДаты
			|ГДЕ
			|	СчетаИДаты.ДатаСледующейПеререгистрации <= &ДатаКонтроля
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИтоговаяТабСчетов.НомерСчета КАК НомерСчета,
			|	ИтоговаяТабСчетов.ПенсионныйДоговор КАК ПенсионныйДоговор,
			|	ИтоговаяТабСчетов.Правило КАК Правило,
			|	ИтоговаяТабСчетов.Участник КАК Участник
			|ИЗ
			|	ИтоговаяТабСчетов КАК ИтоговаяТабСчетов
			|ГДЕ
			|	ИтоговаяТабСчетов.НадоПеререгистрировать"; 
			Запрос.УстановитьПараметр("ДатаКонтроля", КонецДня(Объект.Дата));
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			#Удаление
			|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ПенсионныйДоговор КАК ПенсионныйДоговор,
			#КонецУдаления
			#Вставка
			//++ЛыткинАМ //https://redmine.npf.com/issues/4260
			|РАЗЛИЧНЫЕ
			|	уп_СрокиПеререгистрацииСрезПоследних.НомерСчета.Владелец КАК ПенсионныйДоговор,
			//--ЛыткинАМ //https://redmine.npf.com/issues/4260
			#КонецВставки
			|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.ПравилоВосстановленияВыплатПослеПеререгистрации КАК Правило,
			|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.ПеререгистрироватьТолькоПожизненные КАК ПеререгистрироватьТолькоПожизненные
			|ПОМЕСТИТЬ Договоры
			|ИЗ
			#Удаление
			|	РегистрСведений.уп_ПараметрыПенсионногоДоговора.СрезПоследних(
			|			&Дата,
			|			ПенсионныйДоговор.Организация = &Организация) КАК уп_ПараметрыПенсионногоДоговораСрезПоследних
			|ГДЕ
			|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.ИспользоватьЕжегоднуюПеререгистрацию 
			|	И  НЕ уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.БезКонтрольнойДаты "+УсловиеНаПодразделение+"
			#КонецУдаления
			#Вставка
			//++ЛыткинАМ //https://redmine.npf.com/issues/4260
			|	РегистрСведений.уп_СрокиПеререгистрации.СрезПоследних(
			|			&ДатаКонтроля,
			|			ДатаСледующейПеререгистрации <= &ДатаКонтроля
			|				И НомерСчета.ТипПенсионногоСчета = &Физики) КАК уп_СрокиПеререгистрацииСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПараметрыПенсионногоДоговора.СрезПоследних(
			|				&ДатаКонтроля,
			|				ПенсионныйДоговор.Организация = &Организация
			|					И ШаблонДоговора.ИспользоватьЕжегоднуюПеререгистрацию) КАК уп_ПараметрыПенсионногоДоговораСрезПоследних
			|		ПО уп_СрокиПеререгистрацииСрезПоследних.НомерСчета.Владелец = уп_ПараметрыПенсионногоДоговораСрезПоследних.ПенсионныйДоговор
			//--ЛыткинАМ //https://redmine.npf.com/issues/4260
			#КонецВставки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_СостоянияПССрезПоследних.НомерСчета КАК НомерСчета,
			|	уп_СостоянияПССрезПоследних.НомерСчета.Участник КАК Участник,
			|	Договоры.ПенсионныйДоговор КАК ПенсионныйДоговор,
			|	Договоры.Правило КАК Правило,
			|	уп_СостоянияПССрезПоследних.Состояние КАК Состояние,
			|	Договоры.ПеререгистрироватьТолькоПожизненные КАК ПеререгистрироватьТолькоПожизненные
			|ПОМЕСТИТЬ Счета
			|ИЗ
			|	Договоры КАК Договоры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияПС.СрезПоследних(
			|				&Дата,
			|				НомерСчета.ТипПенсионногоСчета = &Физики
			|					И НомерСчета.Владелец В
			|						(ВЫБРАТЬ
			|							Договоры.ПенсионныйДоговор КАК ПенсионныйДоговор
			|						ИЗ
			|							Договоры КАК Договоры)) КАК уп_СостоянияПССрезПоследних
			|		ПО Договоры.ПенсионныйДоговор = уп_СостоянияПССрезПоследних.НомерСчета.Владелец
			|ГДЕ
			|	уп_СостоянияПССрезПоследних.Состояние = &Состояние
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_СрокиПеререгистрацииСрезПоследних.НомерСчета КАК НомерСчета,
			|	уп_СрокиПеререгистрацииСрезПоследних.ДатаСледующейПеререгистрации КАК ДатаСледующейПеререгистрации
			|ПОМЕСТИТЬ СрокиСледующейПеререгистрации
			|ИЗ
			|	РегистрСведений.уп_СрокиПеререгистрации.СрезПоследних(
			|			&Дата,
			|			НомерСчета В
			|				(ВЫБРАТЬ
			|					Счета.НомерСчета
			|				ИЗ
			|					Счета)) КАК уп_СрокиПеререгистрацииСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Счета.НомерСчета КАК НомерСчета,
			|	Счета.Участник КАК Участник,
			|	Счета.ПенсионныйДоговор КАК ПенсионныйДоговор,
			|	Счета.Правило КАК Правило,
			|	Счета.Состояние КАК Состояние,
			|	ЕСТЬNULL(СрокиСледующейПеререгистрации.ДатаСледующейПеререгистрации, &ПустаяДата) КАК ДатаСледующейПеререгистрации,
			|	ВЫБОР
			#Вставка
			|		КОГДА &ХМ_ОпределятьТипПенсииТолькоПоРегистру = ИСТИНА И НЕ уп_СхемаСчетаСрезПоследних.ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.ПустаяСсылка)
			|			ТОГДА уп_СхемаСчетаСрезПоследних.ТипПенсии
			#КонецВставки
			|		КОГДА уп_СхемаСчетаСрезПоследних.Схема.ТипПенсионнойСхемы = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.Смешанная)
			|			ТОГДА уп_СхемаСчетаСрезПоследних.ТипПенсии
			|		ИНАЧЕ уп_СхемаСчетаСрезПоследних.Схема.ТипПенсионнойСхемы
			|	КОНЕЦ КАК ТипПенсии,
			|	Счета.ПеререгистрироватьТолькоПожизненные КАК ПеререгистрироватьТолькоПожизненные
			|ПОМЕСТИТЬ СчетаИДаты
			|ИЗ
			|	Счета КАК Счета
			#Удаление
			|		ЛЕВОЕ СОЕДИНЕНИЕ СрокиСледующейПеререгистрации КАК СрокиСледующейПеререгистрации
			#КонецУдаления
			#Вставка
			//https://redmine.npf.com/issues/4262 - нет перерегистрации не надо и приостанавливать
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СрокиСледующейПеререгистрации КАК СрокиСледующейПеререгистрации
			#КонецВставки
			|		ПО Счета.НомерСчета = СрокиСледующейПеререгистрации.НомерСчета
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СхемаСчета.СрезПоследних(
			|				&ДатаКонтроля,
			|				НомерСчета В
			|					(ВЫБРАТЬ
			|						Счета.НомерСчета
			|					ИЗ
			|						Счета)) КАК уп_СхемаСчетаСрезПоследних
			|		ПО Счета.НомерСчета = уп_СхемаСчетаСрезПоследних.НомерСчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СчетаИДаты.НомерСчета КАК НомерСчета,
			|	СчетаИДаты.Участник КАК Участник,
			|	СчетаИДаты.ПенсионныйДоговор КАК ПенсионныйДоговор,
			|	СчетаИДаты.Правило КАК Правило,
			|	СчетаИДаты.Состояние КАК Состояние,
			|	СчетаИДаты.ДатаСледующейПеререгистрации КАК ДатаСледующейПеререгистрации,
			|	ВЫБОР
			|		КОГДА НЕ СчетаИДаты.ПеререгистрироватьТолькоПожизненные
			|			ТОГДА ИСТИНА
			|		КОГДА СчетаИДаты.ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.ПожизненныхВыплат)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК НадоПеререгистрировать
			|ПОМЕСТИТЬ ИтоговаяТабСчетов
			|ИЗ
			|	СчетаИДаты КАК СчетаИДаты
			|ГДЕ
			|	СчетаИДаты.ДатаСледующейПеререгистрации <= &ДатаКонтроля
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИтоговаяТабСчетов.НомерСчета КАК НомерСчета,
			|	ИтоговаяТабСчетов.ПенсионныйДоговор КАК ПенсионныйДоговор,
			|	ИтоговаяТабСчетов.Правило КАК Правило,
			|	ИтоговаяТабСчетов.Участник КАК Участник
			|ИЗ
			|	ИтоговаяТабСчетов КАК ИтоговаяТабСчетов
			|ГДЕ
			|	ИтоговаяТабСчетов.НадоПеререгистрировать";
			Запрос.УстановитьПараметр("ДатаКонтроля", КонецДня(Объект.ДатаКонтроля));
		КонецЕсли;
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("Месяц", Месяц(Объект.ДатаКонтроля));
		Запрос.УстановитьПараметр("Состояние", Перечисления.уп_СостоянияПС.ВыплатнойПериод);
		Запрос.УстановитьПараметр("День", День(Объект.ДатаКонтроля));
		Запрос.УстановитьПараметр("Физики", Перечисления.уп_ТипыПенсионныхСчетов.ПенсионныйСчетУчастника);
		Запрос.УстановитьПараметр("ПустаяДата", '00010101');
		Запрос.УстановитьПараметр("Организация", Объект.Организация);  
		Запрос.УстановитьПараметр("ОтборПодразделение", Объект.ОтборПодразделение);  
		#Вставка
		Запрос.УстановитьПараметр("ХМ_ОпределятьТипПенсииТолькоПоРегистру", Объект.ХМ_ОпределятьТипПенсииТолькоПоРегистру);  
		#КонецВставки
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаДанных = Новый Структура;
			
			Документ = Документы.уп_ПриостановкаВыплат.СоздатьДокумент();
			Документ.ВидОперации         = Перечисления.уп_ВидыОперацийПриостановкаНПО.Приостановка;
			Документ.Организация         = Объект.Организация;
			Документ.Дата                = Объект.Дата;
			Если Объект.БезКонтрольнойДаты Тогда
				Документ.ДатаНачала          = Объект.Дата; 
			Иначе
				Документ.ДатаНачала          = Объект.ДатаКонтроля;
			КонецЕсли;
			Документ.Участник            = Выборка.Участник;
			Документ.ПричинаПриостановки = Справочники.уп_ПричиныПриостановок.ОтсутствиеПеререгистрации;
			Документ.ТипПриостановки     = 0;
			Документ.Ответственный       = Объект.Ответственный;
			Документ.Комментарий         = Объект.Комментарий;
			
			НовСтр = Документ.СписокСчетов.Добавить();
			НовСтр.НомерСчета          = Выборка.НомерСчета;
			НовСтр.Участник            = Выборка.Участник;
			НовСтр.ПенсионныйДоговор   = Выборка.ПенсионныйДоговор;
			НовСтр.ТипПриостановки     = Выборка.Правило; 
			
			Попытка
				Документ.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				ОтменитьТранзакцию();
				Протокол.ДобавитьСтроку("Ошибка: При формировании документов произошла ошибка.");
				Возврат Неопределено;
			КонецПопытки;
			
			СтрокаДанных.Вставить("Документ", Документ.Ссылка);
			СтрокаДанных.Вставить("Участник", Выборка.Участник);
			СтрокаДанных.Вставить("ПорядокВосстановленияСчета", НовСтр.ТипПриостановки);
			Прочитанное.Добавить(СтрокаДанных);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Объект.ВосстанавливатьПеререгистрированных Тогда 
		Если Объект.БезКонтрольнойДаты Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ПенсионныйДоговор КАК ПенсионныйДоговор,
			|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.ПравилоВосстановленияВыплатПослеПеререгистрации КАК Правило
			|ПОМЕСТИТЬ Договоры
			|ИЗ
			|	РегистрСведений.уп_ПараметрыПенсионногоДоговора.СрезПоследних(
			|			&Дата,
			|				ПенсионныйДоговор.Организация = &Организация) КАК уп_ПараметрыПенсионногоДоговораСрезПоследних
			|ГДЕ
			|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.ИспользоватьЕжегоднуюПеререгистрацию
			|	И уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.БезКонтрольнойДаты "+УсловиеНаПодразделение+"
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_СостоянияПССрезПоследних.НомерСчета КАК НомерСчета,
			|	Договоры.ПенсионныйДоговор КАК ПенсионныйДоговор,
			|	Договоры.Правило КАК Правило,
			|	уп_СостоянияПССрезПоследних.Расшифровка КАК Расшифровка
			|ПОМЕСТИТЬ Счета
			|ИЗ
			|	Договоры КАК Договоры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияПС.СрезПоследних(
			|				&Дата,
			|				НомерСчета.Владелец В
			|					(ВЫБРАТЬ
			|						Договоры.ПенсионныйДоговор КАК ПенсионныйДоговор
			|					ИЗ
			|						Договоры КАК Договоры)) КАК уп_СостоянияПССрезПоследних
			|		ПО Договоры.ПенсионныйДоговор = уп_СостоянияПССрезПоследних.НомерСчета.Владелец
			|ГДЕ
			|	уп_СостоянияПССрезПоследних.Состояние = &Состояние
			|	И уп_СостоянияПССрезПоследних.Расшифровка В(&СписокРасшифровок)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Счета.НомерСчета КАК НомерСчета,
			|	Счета.ПенсионныйДоговор КАК ПенсионныйДоговор,
			|	Счета.Правило КАК Правило,
			|	Счета.Расшифровка КАК Расшифровка,
			|	Счета.НомерСчета.Участник КАК Участник,
			|	уп_СрокиПеререгистрацииСрезПоследних.ДатаСледующейПеререгистрации КАК ДатаСледующейПеререгистрации,
			|	уп_СрокиПеререгистрацииСрезПоследних.Регистратор.ДатаЗаявления КАК ДатаРегистрации
			|ИЗ
			|	Счета КАК Счета,
			|	РегистрСведений.уп_СрокиПеререгистрации.СрезПоследних(
			|			&Дата,
			|			НомерСчета В
			|				(ВЫБРАТЬ
			|					Счета.НомерСчета
			|				ИЗ
			|					Счета)) КАК уп_СрокиПеререгистрацииСрезПоследних
			|ГДЕ
			|	уп_СрокиПеререгистрацииСрезПоследних.ДатаСледующейПеререгистрации > &ДатаКонтроля";
			Запрос.УстановитьПараметр("ДатаКонтроля", Объект.Дата);
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			#Удаление
			|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ПенсионныйДоговор КАК ПенсионныйДоговор,
			#КонецУдаления
			#Вставка
			//++ЛыткинАМ //https://redmine.npf.com/issues/4260
			|РАЗЛИЧНЫЕ
			|	уп_СрокиПеререгистрацииСрезПоследних.НомерСчета.Владелец КАК ПенсионныйДоговор,
			//--ЛыткинАМ //https://redmine.npf.com/issues/4260
			#КонецВставки
			|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.ПравилоВосстановленияВыплатПослеПеререгистрации КАК Правило
			|ПОМЕСТИТЬ Договоры
			|ИЗ
			#Удаление
			|	РегистрСведений.уп_ПараметрыПенсионногоДоговора.СрезПоследних(
			|			&Дата,
			|				ПенсионныйДоговор.Организация = &Организация) КАК уп_ПараметрыПенсионногоДоговораСрезПоследних
			|ГДЕ
			|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.ИспользоватьЕжегоднуюПеререгистрацию 
			|	И НЕ уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.БезКонтрольнойДаты
			|	И уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.ЧислоОкончанияПеререгистрации = &День
			|	И уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора.МесяцОкончанияПеререгистрации = &Месяц "+УсловиеНаПодразделение+"
			#КонецУдаления
			#Вставка
			//++ЛыткинАМ //https://redmine.npf.com/issues/4260
			|	РегистрСведений.уп_СрокиПеререгистрации.СрезПоследних(
			|			&ДатаКонтроля,
			|			ДатаСледующейПеререгистрации > &ДатаКонтроля
			|				И НомерСчета.ТипПенсионногоСчета = &Физики) КАК уп_СрокиПеререгистрацииСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПараметрыПенсионногоДоговора.СрезПоследних(
			|				&ДатаКонтроля,
			|				ПенсионныйДоговор.Организация = &Организация
			|					И ШаблонДоговора.ИспользоватьЕжегоднуюПеререгистрацию) КАК уп_ПараметрыПенсионногоДоговораСрезПоследних
			|		ПО уп_СрокиПеререгистрацииСрезПоследних.НомерСчета.Владелец = уп_ПараметрыПенсионногоДоговораСрезПоследних.ПенсионныйДоговор
			//--ЛыткинАМ //https://redmine.npf.com/issues/4260
			#КонецВставки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_СостоянияПССрезПоследних.НомерСчета КАК НомерСчета,
			|	Договоры.ПенсионныйДоговор КАК ПенсионныйДоговор,
			|	Договоры.Правило КАК Правило,
			|	уп_СостоянияПССрезПоследних.Расшифровка КАК Расшифровка
			|ПОМЕСТИТЬ Счета
			|ИЗ
			|	Договоры КАК Договоры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияПС.СрезПоследних(
			|				&Дата,
			|				НомерСчета.Владелец В
			|					(ВЫБРАТЬ
			|						Договоры.ПенсионныйДоговор КАК ПенсионныйДоговор
			|					ИЗ
			|						Договоры КАК Договоры)) КАК уп_СостоянияПССрезПоследних
			|		ПО Договоры.ПенсионныйДоговор = уп_СостоянияПССрезПоследних.НомерСчета.Владелец
			|ГДЕ
			|	уп_СостоянияПССрезПоследних.Состояние = &Состояние
			|	И уп_СостоянияПССрезПоследних.Расшифровка В(&СписокРасшифровок)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Счета.НомерСчета КАК НомерСчета,
			|	Счета.ПенсионныйДоговор КАК ПенсионныйДоговор,
			|	Счета.Правило КАК Правило,
			|	Счета.Расшифровка КАК Расшифровка,
			|	Счета.НомерСчета.Участник КАК Участник,
			|	уп_СрокиПеререгистрацииСрезПоследних.ДатаСледующейПеререгистрации КАК ДатаСледующейПеререгистрации,
			|	уп_СрокиПеререгистрацииСрезПоследних.Регистратор.ДатаЗаявления КАК ДатаРегистрации
			|ИЗ
			|	Счета КАК Счета,
			|	РегистрСведений.уп_СрокиПеререгистрации.СрезПоследних(
			|			&Дата,
			|			НомерСчета В
			|				(ВЫБРАТЬ
			|					Счета.НомерСчета
			|				ИЗ
			|					Счета)) КАК уп_СрокиПеререгистрацииСрезПоследних
			|ГДЕ
			|	уп_СрокиПеререгистрацииСрезПоследних.ДатаСледующейПеререгистрации > &ДатаКонтроля";  
			Запрос.УстановитьПараметр("ДатаКонтроля", Объект.ДатаКонтроля);
		КонецЕсли;
		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Запрос.УстановитьПараметр("Месяц", Месяц(Объект.ДатаКонтроля));
		Запрос.УстановитьПараметр("Состояние", Перечисления.уп_СостоянияПС.НачисленияПриостановлены);
		СписокРасшифровок = Новый Массив;
		СписокРасшифровок.Добавить(Перечисления.уп_РасшифровкаСостоянийПС.НеПрошёлПеререгистрациюПриостановлен);
		СписокРасшифровок.Добавить(Перечисления.уп_РасшифровкаСостоянийПС.НеПрошёлПеререгистрациюПриостановленБезКомпенсации);
		СписокРасшифровок.Добавить(Перечисления.уп_РасшифровкаСостоянийПС.НеПрошёлПеререгистрациюПриостановленСКомпенсацией);
		Запрос.УстановитьПараметр("СписокРасшифровок", СписокРасшифровок);
		Запрос.УстановитьПараметр("День", День(Объект.ДатаКонтроля));
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.УстановитьПараметр("ОтборПодразделение", Объект.ОтборПодразделение); 
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаДанных = Новый Структура;
			
			Документ = Документы.уп_ПриостановкаВыплат.СоздатьДокумент();
			Документ.ВидОперации         = Перечисления.уп_ВидыОперацийПриостановкаНПО.ОтменаПриостановки;
			Документ.Организация         = Объект.Организация;
			Документ.Дата                = Объект.Дата;
			Документ.ДатаКонца           = Выборка.ДатаРегистрации;
			Документ.Участник            = Выборка.Участник;
			Документ.Ответственный       = Объект.Ответственный;
			Документ.Комментарий         = Объект.Комментарий;
			
			НовСтр = Документ.СписокСчетов.Добавить();
			НовСтр.НомерСчета          = Выборка.НомерСчета;
			НовСтр.Участник            = Выборка.Участник;
			НовСтр.ПенсионныйДоговор   = Выборка.ПенсионныйДоговор;
			
			Если Выборка.Расшифровка = Перечисления.уп_РасшифровкаСостоянийПС.НеПрошёлПеререгистрациюПриостановленСКомпенсацией Тогда
				НовСтр.ТипПриостановки = Перечисления.уп_ВосстановлениеВыплатПослеПриостановки.СКомпенсацией;
			ИначеЕсли Выборка.Расшифровка = Перечисления.уп_РасшифровкаСостоянийПС.НеПрошёлПеререгистрациюПриостановленБезКомпенсации Тогда
				НовСтр.ТипПриостановки = Перечисления.уп_ВосстановлениеВыплатПослеПриостановки.БезКомпенсации;
			Иначе
				НовСтр.ТипПриостановки = Объект.ПорядокВосстановления;
				НовСтр.ИзменятьТипПриостановки = Истина;
			КонецЕсли;
			
			Попытка
				Документ.Записать(РежимЗаписиДокумента.Запись);
			Исключение
				ОтменитьТранзакцию();
				Протокол.ДобавитьСтроку("Ошибка: При загрузке данных произошла ошибка. Необходимо повторить загрузку!");
				Возврат Неопределено;
			КонецПопытки;
			
			СтрокаДанных.Вставить("Документ", Документ.Ссылка);
			СтрокаДанных.Вставить("Участник", Выборка.Участник);
			СтрокаДанных.Вставить("ПорядокВосстановленияСчета", НовСтр.ТипПриостановки);
			Прочитанное.Добавить(СтрокаДанных);
			
		КонецЦикла;

	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	ДанныеДляЗаполнения = Новый Структура;
	ДанныеДляЗаполнения.Вставить("ЕстьОшибки", ЕстьОшибки);
	ДанныеДляЗаполнения.Вставить("Прочитанное", Прочитанное);
	
	Возврат ДанныеДляЗаполнения;
	
КонецФункции

&НаСервере
&После("ПриСозданииНаСервере")
Процедура ХМПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	ХМ_ДополнитьФорму();
КонецПроцедуры

Процедура ХМ_ДополнитьФорму()

	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма, "ХМ_ОпределятьТипПенсииТолькоПоРегистру", Элементы.ГруппаПриостановкаВосстановление, "Объект.ХМ_ОпределятьТипПенсииТолькоПоРегистру", 
		Новый Структура("Вид, ВставитьПередЭлементом", ВидПоляФормы.ПолеФлажка,Элементы.ПриостанавливатьНепрошедших));
		
КонецПроцедуры

