// ХМНПФ 13.01.2016 Шадрин А.В. // Новая ХМ_ПриОткрытии()
&НаКлиенте
Процедура ХМ_ПриОткрытии()
	// +ХМНПФ 13.01.2016 Шадрин А.В. // ХМ_ПриОткрытии() // №130
	// +ХМНПФ 07.05.2018 КлименкоМИ // Новая ХМ_ПолучитьФильтроватьЗаявления() // №1531	
	//--Если ПараметрыСеанса.ТекущийПользователь.ХМ_ФильтроватьЗаявления Тогда
	Если ХМ_ПолучитьФильтроватьЗаявления() Тогда
	// -ХМНПФ 07.05.2018 КлименкоМИ // Новая ХМ_ПолучитьФильтроватьЗаявления() // №1531		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПринятоеРешение", Неопределено , ВидСравненияКомпоновкиДанных.Равно, ,	Истина,	
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ХМ_ДатаВОПУ", '00010101000000', ВидСравненияКомпоновкиДанных.НеРавно, ,	Истина,	
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
		ЭлементыПользовательскихНастроек = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
		Для Каждого Элемент Из ЭлементыПользовательскихНастроек Цикл
			Если ТипЗнч(Элемент) = ТипЗнч(Список.КомпоновщикНастроек.Настройки.Порядок) Тогда
				Элемент.Элементы.Очистить();
				УсловиеСортировки = Элемент.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
				УсловиеСортировки.Поле = Новый ПолеКомпоновкиДанных("ХМ_ДатаВОПУ");
				УсловиеСортировки.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
				УсловиеСортировки.Использование = Истина;
			КонецЕсли;    
		КонецЦикла;
  	
	КонецЕсли;
	// -ХМНПФ 13.01.2016 Шадрин А.В. // ХМ_ПриОткрытии() // №130
КонецПроцедуры

// ХМНПФ 07.05.2018 КлименкоМИ // Новая ХМ_ПолучитьФильтроватьЗаявления() // №1531
&НаСервере
Функция ХМ_ПолучитьФильтроватьЗаявления()
	Возврат ПараметрыСеанса.ТекущийПользователь.ХМ_ФильтроватьЗаявления;	
КонецФункции

Процедура ХМ_НеТиповыеИзменения()
	
	// ХМНПФ+ 14.12.2015 Лыткин А.М. // Добавлен ХМ_ДатаВОПУ //№81
	// ХМНПФ 13.01.2016 Шадрин А.В. // Новая ХМ_ПриОткрытии()
	// ХМНПФ 13.01.2016 Шадрин А.В. // Новая ХМ_УстановитьДействияФормы()
	// ХМНПФ 13.01.2016 Шадрин А.В. // ПриСозданииНаСервере
	// ХМНПФ 13.01.2016 Шадрин А.В. // ХМ_ПриОткрытии() // №130
	// ХМНПФ 07.05.2018 КлименкоМИ // Новая ХМ_ПолучитьФильтроватьЗаявления() // №1531
	
КонецПроцедуры

&НаКлиенте
Процедура ХМПриОткрытииПосле(Отказ)
	// ХМНПФ 13.01.2016 Шадрин А.В. // Новая ХМ_УстановитьДействияФормы()
	ХМ_ПриОткрытии();
КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму();
КонецПроцедуры

Процедура ХМДополнитьФорму() 
	
	// ХМНПФ+ 14.12.2015 ЛыткинАМ // добавлена колонка ХМ_ДатаВОПУ //№81
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,"НаличиеФайлов.ЕстьФайлы КАК ЕстьФайлы","НаличиеФайлов.ЕстьФайлы КАК ЕстьФайлы, Документуп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты.ХМ_ДатаВОПУ КАК ХМ_ДатаВОПУ");
	// ХМНПФ+ 14.12.2015 ЛыткинАМ // добавлена колонка ХМ_ДатаВОПУ //№81
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("ВставитьПередЭлементом", Элементы.ПринятоеРешение);  
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ДатаВОПУ",Элементы.Список,"Список.ХМ_ДатаВОПУ",СвойстваПоля);
		
КонецПроцедуры 
