
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 22.08.2016 ШадринАВ // длина номера изменена с 8 до 27 // №459
	// ХМНПФ 15.02.2017 ШадринАВ // Новая ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №779
КонецПроцедуры

// ХМНПФ 15.02.2017 ШадринАВ // Новая ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №779
Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ, СтруктураТЧ) Экспорт
	Если Проведен Тогда
		ОбработкаПроведения(Отказ, Режим);
	Иначе
		ОбработкаУдаленияПроведения(Отказ)
	КонецЕсли;
КонецПроцедуры

