
&НаСервере
Процедура ЗачиститьИсториюНДФЛпоЗадолженностиНаСервере()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_ЗадолженностьПоПенсиям.НомерСчета КАК НомерСчета,
		|	МИНИМУМ(НАЧАЛОПЕРИОДА(уп_ЗадолженностьПоПенсиям.НачалоПериода, ГОД)) КАК НачалоПериода
		|ПОМЕСТИТЬ ЗадолженностьНаЗачистку
		|ИЗ
		|	РегистрНакопления.уп_ЗадолженностьПоПенсиям КАК уп_ЗадолженностьПоПенсиям
		|ГДЕ
		|	(уп_ЗадолженностьПоПенсиям.НомерСчета = &НомерСчета
		|			ИЛИ &НомерСчета = ЗНАЧЕНИЕ(Справочник.уп_ПенсионныеСчета.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_ЗадолженностьПоПенсиям.НомерСчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_НДФЛСведенияОДоходахУчастников.Регистратор КАК Регистратор,
		|	""Доходы"" КАК ДанныеНаЗачистку
		|ПОМЕСТИТЬ Итог
		|ИЗ
		|	ЗадолженностьНаЗачистку КАК ЗадолженностьНаЗачистку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.уп_НДФЛСведенияОДоходахУчастников КАК уп_НДФЛСведенияОДоходахУчастников
		|		ПО ЗадолженностьНаЗачистку.НомерСчета = уп_НДФЛСведенияОДоходахУчастников.НомерСчета
		|			И (уп_НДФЛСведенияОДоходахУчастников.Период > ЗадолженностьНаЗачистку.НачалоПериода)
		|ГДЕ
		|	уп_НДФЛСведенияОДоходахУчастников.Регистратор.Дата < &ГраницаЗачистки
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_НДФЛСведенияОДоходахУчастников.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уп_НДФЛСведенияОДоходахУчастников.Регистратор,
		|	""НДФЛ""
		|ИЗ
		|	ЗадолженностьНаЗачистку КАК ЗадолженностьНаЗачистку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.уп_НДФЛУчастниковРасчетыСБюджетом КАК уп_НДФЛСведенияОДоходахУчастников
		|		ПО ЗадолженностьНаЗачистку.НомерСчета = уп_НДФЛСведенияОДоходахУчастников.НомерСчета
		|			И (уп_НДФЛСведенияОДоходахУчастников.Период > ЗадолженностьНаЗачистку.НачалоПериода)
		|ГДЕ
		|	уп_НДФЛСведенияОДоходахУчастников.Регистратор.Дата < &ГраницаЗачистки
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_НДФЛСведенияОДоходахУчастников.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Регистратор КАК Регистратор,
		|	Итог.ДанныеНаЗачистку КАК ДанныеНаЗачистку
		|ИЗ
		|	Итог КАК Итог
		|
		|УПОРЯДОЧИТЬ ПО
		|	Итог.Регистратор.Дата";
	
	Запрос.УстановитьПараметр("ГраницаЗачистки",ГраницаЗачистки);
	Запрос.УстановитьПараметр("НомерСчета",НомерСчета);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ПерваяТекущаяДата = ТекущаяДата();
	Количество = Выборка.Количество();
	КоличествоПрошло = 0;
	ВремяПрошло = 0;
	Пока Выборка.Следующий() Цикл
		ТекущаяДата = ТекущаяДата();
		Если Выборка.ДанныеНаЗачистку = "Доходы" Тогда
			Регистр = РегистрыНакопления.уп_НДФЛСведенияОДоходахУчастников.СоздатьНаборЗаписей();
			Регистр.Отбор.Регистратор.Установить(Выборка.Регистратор); 
			Регистр.Записать();
			Регистр = РегистрыНакопления.СведенияОДоходахНДФЛ.СоздатьНаборЗаписей();
			Регистр.Отбор.Регистратор.Установить(Выборка.Регистратор); 
			Регистр.Записать();
		КонецЕсли;
		Если Выборка.ДанныеНаЗачистку = "НДФЛ" Тогда
			Регистр = РегистрыНакопления.уп_НДФЛУчастниковРасчетыСБюджетом.СоздатьНаборЗаписей();
			Регистр.Отбор.Регистратор.Установить(Выборка.Регистратор); 
			Регистр.Записать();
			Регистр = РегистрыНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СоздатьНаборЗаписей();
			Регистр.Отбор.Регистратор.Установить(Выборка.Регистратор); 
			Регистр.Записать();
			Регистр = РегистрыНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.СоздатьНаборЗаписей();
			Регистр.Отбор.Регистратор.Установить(Выборка.Регистратор);
			Если ЗначениеЗаполнено(Регистр.Отбор.Регистратор.Значение) Тогда
				Регистр.Записать();
			КонецЕсли;
		КонецЕсли;
		Регистратор = Выборка.Регистратор.ПолучитьОбъект();
		Регистратор.РучнаяКорректировка = Истина;
		Регистратор.ОбменДанными.Загрузка = Истина;
		Регистратор.Записать();
		КоличествоПрошло = КоличествоПрошло + 1;
		ВремяПрошло =  ВремяПрошло + (ТекущаяДата() - ТекущаяДата);
		Скорость = ВремяПрошло/КоличествоПрошло;
		Осталось = Скорость * (Количество - КоличествоПрошло);
		Закончится = ТекущаяДата() + Осталось;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗачиститьИсториюНДФЛпоЗадолженности(Команда)
	ЗачиститьИсториюНДФЛпоЗадолженностиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ГраницаЗачистки = НачалоГода(ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура ВсяЗадолдженностьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_НДФЛСведенияОДоходахУчастников.Регистратор КАК Регистратор,
		|	""Доходы"" КАК ДанныеНаЗачистку
		|ПОМЕСТИТЬ Итог
		|ИЗ
		|	РегистрНакопления.уп_НДФЛСведенияОДоходахУчастников КАК уп_НДФЛСведенияОДоходахУчастников
		|ГДЕ
		|	уп_НДФЛСведенияОДоходахУчастников.Регистратор.Дата < &ГраницаЗачистки
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_НДФЛСведенияОДоходахУчастников.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уп_НДФЛСведенияОДоходахУчастников.Регистратор,
		|	""НДФЛ""
		|ИЗ
		|	РегистрНакопления.уп_НДФЛУчастниковРасчетыСБюджетом КАК уп_НДФЛСведенияОДоходахУчастников
		|ГДЕ
		|	уп_НДФЛСведенияОДоходахУчастников.Регистратор.Дата < &ГраницаЗачистки
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_НДФЛСведенияОДоходахУчастников.Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Регистратор КАК Регистратор,
		|	Итог.ДанныеНаЗачистку КАК ДанныеНаЗачистку
		|ИЗ
		|	Итог КАК Итог
		|
		|УПОРЯДОЧИТЬ ПО
		|	Итог.Регистратор.Дата";
	
	Запрос.УстановитьПараметр("ГраницаЗачистки",ГраницаЗачистки);
	Запрос.УстановитьПараметр("НомерСчета",НомерСчета);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ПерваяТекущаяДата = ТекущаяДата();
	Количество = Выборка.Количество();
	КоличествоПрошло = 0;
	ВремяПрошло = 0;
	Пока Выборка.Следующий() Цикл
		ТекущаяДата = ТекущаяДата();
		Если Выборка.ДанныеНаЗачистку = "Доходы" Тогда
			Регистр = РегистрыНакопления.уп_НДФЛСведенияОДоходахУчастников.СоздатьНаборЗаписей();
			Регистр.Отбор.Регистратор.Установить(Выборка.Регистратор); 
			Регистр.Записать();
			Регистр = РегистрыНакопления.СведенияОДоходахНДФЛ.СоздатьНаборЗаписей();
			Регистр.Отбор.Регистратор.Установить(Выборка.Регистратор); 
			Регистр.Записать();
		КонецЕсли;
		Если Выборка.ДанныеНаЗачистку = "НДФЛ" Тогда
			Регистр = РегистрыНакопления.уп_НДФЛУчастниковРасчетыСБюджетом.СоздатьНаборЗаписей();
			Регистр.Отбор.Регистратор.Установить(Выборка.Регистратор); 
			Регистр.Записать();
			Регистр = РегистрыНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.СоздатьНаборЗаписей();
			Регистр.Отбор.Регистратор.Установить(Выборка.Регистратор); 
			Регистр.Записать();
			Регистр = РегистрыНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.СоздатьНаборЗаписей();
			Регистр.Отбор.Регистратор.Установить(Выборка.Регистратор);
			Если ЗначениеЗаполнено(Регистр.Отбор.Регистратор.Значение) Тогда
				Регистр.Записать();
			КонецЕсли;
		КонецЕсли;
		Регистратор = Выборка.Регистратор.ПолучитьОбъект();
		Регистратор.РучнаяКорректировка = Истина;
		Регистратор.ОбменДанными.Загрузка = Истина;
		Регистратор.Записать();
		КоличествоПрошло = КоличествоПрошло + 1;
		ВремяПрошло =  ВремяПрошло + (ТекущаяДата() - ТекущаяДата);
		Скорость = ВремяПрошло/КоличествоПрошло;
		Скорость = 10;
		Осталось = Скорость * (Количество - КоличествоПрошло);
		Закончится = ТекущаяДата() + Осталось;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВсяЗадолдженность(Команда)
	ВсяЗадолдженностьНаСервере();
КонецПроцедуры
