
&НаСервере
Процедура НПФ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Вкладчик") Тогда
		Вкладчик = Параметры.Вкладчик;
		//
		ЭлементОтбора = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Вкладчик");
		ЭлементОтбора.ПравоеЗначение = Вкладчик;
		
	КонецЕсли;

КонецПроцедуры

