Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 24.02.2016 ШадринАВ // новая колонка "Дата начала выплат" // №217
КонецПроцедуры  

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму();
КонецПроцедуры

Процедура ХМДополнитьФорму() 

	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("ВставитьПередЭлементом", Элементы.Комментарий);  
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_НачальнаяДата",Элементы.Список,"Список.НачальнаяДата",СвойстваПоля);
	
КонецПроцедуры 