
Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ = Неопределено, СтруктураТЧ = Неопределено) Экспорт
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ДоверенныеЛицаУчастников);
		#КонецЕсли
		Возврат;	
	КонецЕсли;

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Для Каждого ТекСтрокаУчастники Из Участники Цикл
		// регистр ЛицевыеСчетаУчастников 
		Движение = Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Если НЕ ЗначениеЗаполнено(ТекСтрокаУчастники.ДоговорОПС) Тогда
			Движение.ДоговорОПС = Справочники.уп_ДоговорыОПС.ПустаяСсылка();
		Иначе
			Движение.ДоговорОПС = ТекСтрокаУчастники.ДоговорОПС;
		КонецЕсли;
		Движение.ЗастрахованноеЛицо = ТекСтрокаУчастники.Участник;
		Движение.ТипЛицевогоСчета = ТекСтрокаУчастники.ТипЛицевогоСчета;
		Движение.НомерЛицевогоСчета = ТекСтрокаУчастники.НомерЛицевогоСчета;
		Если НЕ ЗначениеЗаполнено(ТекСтрокаУчастники.Получатель) Тогда
			Движение.Банк = Справочники.Контрагенты.ПустаяСсылка();
		Иначе
			Движение.Банк = ТекСтрокаУчастники.Получатель;
			Движение.РасчетныйСчет = ТекСтрокаУчастники.РасчетныйСчет;
		КонецЕсли;
		Движение.ФормаВыплаты = ТекСтрокаУчастники.ФормаВыплаты;
		
		Если ЗначениеЗаполнено(ТекСтрокаУчастники.ДоверенноеЛицо) Тогда
			Движение = Движения.уп_ДоверенныеЛицаУчастников.Добавить();
			Движение.Период = Дата;
			Движение.Участник = ТекСтрокаУчастники.Участник;
			Движение.ДоверенноеЛицо = ТекСтрокаУчастники.ДоверенноеЛицо;
		КонецЕсли;	
	КонецЦикла;
	// записываем движения регистров
	#Если Сервер Тогда
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ДоверенныеЛицаУчастников);
	#КонецЕсли
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

