
&НаСервере
Процедура НПФ_ОтметитьФизЛицаПослеНаСервере()  
	
	спВидовОперации = Новый Массив;
	спВидовОперации.Добавить(Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ВыплатыПенсийНПО);	
	спВидовОперации.Добавить(Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ВыкупныеСуммыПравопреемникамНПО);
	спВидовОперации.Добавить(Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ВыкупныеСуммыРасторженцамНПО);
	
	Для каждого СтрокаДокумента Из Объект.ПлатежныеДокументы Цикл  
		Если СтрокаДокумента.Документ.Контрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			Если спВидовОперации.Найти(СтрокаДокумента.ВидОперации) <> Неопределено Тогда
				СтрокаДокумента.Выгружать = Истина;                                                                                            
			КонецЕсли;
		Иначе                                                                                                                              
			СтрокаДокумента.Выгружать = Ложь;                                                                                            
		КонецЕсли;
	КонецЦикла;
 
	ПлатежныеДокументыОбновитьИтогиВПодвале();

КонецПроцедуры

&НаКлиенте
Процедура НПФ_ОтметитьФизЛицаПосле(Команда)
	НПФ_ОтметитьФизЛицаПослеНаСервере();
КонецПроцедуры
