// ХМНПФ 26.08.2016 ШадринАВ // Новая ХМ_ЭтоБюджетнаяОрганизацияПриИзменении() // №493
&НаКлиенте
Процедура ХМ_ЭтоБюджетнаяОрганизацияПриИзменении(Элемент)
	Если  Объект.ХМ_ЭтоБюджетнаяОрганизация Тогда
		Элементы.ХМ_ВидОтраслиБюджетнойОрганизации.Видимость = Истина;
		Объект.ХМ_ВидОтраслиБюджетнойОрганизации = ПредопределенноеЗначение("Перечисление.ХМ_ВидыОтраслейБюджетнойСферы.Другое");
	Иначе
		Элементы.ХМ_ВидОтраслиБюджетнойОрганизации.Видимость = Ложь;
		Объект.ХМ_ВидОтраслиБюджетнойОрганизации = ПредопределенноеЗначение("Перечисление.ХМ_ВидыОтраслейБюджетнойСферы.ПустаяСсылка");	
	КонецЕсли;
КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 26.08.2016 ШадринАВ // новая группа ХМ_БюджетнаяОрганизация, флаг ХМ_ЭтоБюджетнаяОрганизация и поле ХМ_ВидОтраслиБюджетнойОрганизации на форме // №493
	// ХМНПФ 26.08.2016 ШадринАВ // УстановитьВидимостьЭлементов() // №493
	// ХМНПФ 26.08.2016 ШадринАВ // Новая ХМ_ЭтоБюджетнаяОрганизацияПриИзменении() // №493
	// ХМНПФ 16.06.2017 ШадринАВ // ПриОткрытии() // №1044
	// ХМНПФ 05.07.2019 ГригорьевМА // ЗаполнитьДаннымиИБ() // №2343
КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму();	
КонецПроцедуры

&НаСервере
Процедура ХМДополнитьФорму() 
	
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьОбычнуюГруппу(ЭтаФорма,"ХМ_БюджетнаяОрганизация",Элементы.ГруппаГлавное);	
	
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("Вид", ВидПоляФормы.ПолеФлажка);  
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ЭтоБюджетнаяОрганизация",Элементы["ХМ_БюджетнаяОрганизация"],"Объект.ХМ_ЭтоБюджетнаяОрганизация",СвойстваПоля);
	уп_ДинамическиеЭлементыСервер.ХМ_УставноитьДействие(Элементы["ХМ_ЭтоБюджетнаяОрганизация"],"ПриИзменении","ХМ_ЭтоБюджетнаяОрганизацияПриИзменении");
	
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ВидОтраслиБюджетнойОрганизации",Элементы["ХМ_БюджетнаяОрганизация"],"Объект.ХМ_ВидОтраслиБюджетнойОрганизации");
	
КонецПроцедуры
