
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 21.12.2015 ШадринАВ // Новая ХМ_ВывестиИсполнителя() // №114
	// ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложение1() // №114
	// ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложение2() // №114
	// ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложение3() // №114
	// ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложение4() // №114
	// ХМНПФ 26.01.2016 ШадринАВ // ПечатьПриложение1() // №149
	// ХМНПФ 26.01.2016 ШадринАВ // Изменен макет Приложение1_2015: // №149
	//	- в области Таблица1 добавлен параметр "СуммаНакопленийПрописью"
	// ХМНПФ 24.03.2016 ШадринАВ // ПечатьПриложение1() // №295
	// ХМНПФ 12.04.2017 ШадринАВ // ПечатьПриложение2() // №931
	// ХМНПФ 17.04.2020 ШадринАВ // ПечатьПриложение2() // №2796
КонецПроцедуры

// +ХМНПФ 21.12.2015 ШадринАВ // Новая ХМ_ВывестиИсполнителя() // №114
Процедура ХМ_ВывестиИсполнителя(ТабДок) Экспорт
	ХМ_Отчет = Новый ТабличныйДокумент;
	ХМ_Макет = ПолучитьОбщийМакет("ХМ_Разное");
	ХМ_ОблИсполнитель = ХМ_Макет.ПолучитьОбласть("Исполнитель");
	ХМ_ОблИсполнитель.Параметры.ФИОИсполн = ПараметрыСеанса.ТекущийПользователь.Наименование;
	ТелефонИсполн = ХМ_ФункцииОтчетов.ПолучитьТелефонПользователя();
	ХМ_ОблИсполнитель.Параметры.ТелефонИсполн = ТелефонИсполн.Представление;
	ХМ_Отчет.Вывести(ХМ_ОблИсполнитель);
	ХМ_ФункцииОтчетов.ДобавитьОтчет(ТабДок,ХМ_Отчет);
КонецПроцедуры

&ИзменениеИКонтроль("ПечатьПриложение1")
Функция РасшОбщ_ПечатьПриложение1(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ИмяПараметровПечати = ПараметрыПечати.ИмяПараметровПечати;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	
	
	ТабличныйДокумент.КлючПараметровПечати = ИмяПараметровПечати;
	
	//УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ОбъектПечати Из МассивОбъектов Цикл
		
		Если ОбъектПечати.ПометкаУдаления Тогда
			Продолжить;	
		КонецЕсли;
		Если ОбъектПечати.ДополнительнаяВыплата Тогда
			Продолжить;	
		КонецЕсли;
		
		Если ПараметрыПечати.Свойство("ПечатьАдреса") И ПараметрыПечати.ПечатьАдреса Тогда
			МассивПравопреемников = Новый Массив;
			КоличествоКопий = 0;
			Для Каждого стр из ОбъектПечати.Заявления Цикл
				Если стр.Разрешить Тогда
					КоличествоКопий = КоличествоКопий+1;
					МассивПравопреемников.Добавить(стр.Правопреемник)
				КонецЕсли;	
			КонецЦикла;
			ПечататьАдрес = Истина;
		Иначе
			КоличествоКопий = 1;
			ПечататьАдрес = Ложь;
		КонецЕсли;
		
		Для а=1 По КоличествоКопий Цикл
			Если НЕ ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(ОбъектПечати.Организация, ОбъектПечати.Дата);
			
			ТаблицаДокумента = Новый ТаблицаЗначений;
			ТаблицаДокумента.Колонки.Добавить("Документ");
			ТаблицаДокумента.Колонки.Добавить("Ссылка");
			ТаблицаДокумента.Колонки.Добавить("Организация");
			ТаблицаДокумента.Колонки.Добавить("Руководитель");
			
			
			СведенияОДокументе = ТаблицаДокумента.Добавить();
			СведенияОДокументе.Документ = ОбъектПечати.Ссылка;
			СведенияОДокументе.Ссылка = ОбъектПечати.Ссылка;
			СведенияОДокументе.Организация = ОбъектПечати.Организация;
			СведенияОДокументе.Руководитель = Руководители.Руководитель;
			
			Дата = ОбъектПечати.Дата;
			
			Если Дата<'20150101' Тогда
				Макет = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("Приложение1");
			Иначе
				//Макет = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("Приложение1_2015");
				Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПФ_MXL_Приложение1_2015");
			КонецЕсли;	
			// Заголовок
			
			СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ОбъектПечати.Организация, Дата);
			ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
					
			Область = Макет.ПолучитьОбласть("Шапка");
			Область.Параметры.Число = Формат(Дата, "ДФ=дд");
			Область.Параметры.Месяц = Сред(Формат(Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Дата, "ДЛФ=дд")))-10);
			Область.Параметры.Год = Формат(Дата, "ДФ=гггг");
			Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;
			Область.Параметры.НомерРешения = ОбъектПечати.Номер;
			
			ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ОбъектПечати.ДоговорОПС.Участник.уп_ФизЛицо));
			Фамилия = ФИОФизЛица.Фамилия;
			Имя = ФИОФизЛица.Имя;                
			Отчество = ФИОФизЛица.Отчество;
			#Удаление
			Область.Параметры.ФИОЗастрахованного = Фамилия+" "+Имя+" "+Отчество;
			#КонецУдаления
			#Вставка
			// +ХМНПФ 26.01.2016 ШадринАВ // ПечатьПриложение1() // №149
			Область.Параметры.ФИОЗастрахованного = уп_ОбщегоНазначенияУчетРезервов.СклонятьФИО(Фамилия+" "+Имя+" "+Отчество,Лев(Строка(ОбъектПечати.ДоговорОПС.Участник.уп_ФизЛицо.Пол),1),"Р");
			// -ХМНПФ 26.01.2016 ШадринАВ // ПечатьПриложение1() // №149
			#КонецВставки
			Область.Параметры.СтраховойНомер = уп_ОПС.ПреобразоватьНомерПФР(ОбъектПечати.ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
			Область.Параметры.Картинка1 = "V";
			ТабличныйДокумент.Вывести(Область);
			
			//посмотрим по проводкам, если там по типам резерва начислено, то печатную форму оттуда формируем
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	уп_ПрочиеНачисленияОПСОбороты.Участник,
			|	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
			|	СУММА(уп_ПрочиеНачисленияОПСОбороты.СуммаПриход) КАК СуммаПриход,
			|	ВЫБОР
			|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРПН)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)
			|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРСВ)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервСрочнойВыплаты)
			|		ИНАЧЕ уп_ПрочиеНачисленияОПСОбороты.ТипРезерва
			|	КОНЕЦ КАК ТипРезерва
			|ПОМЕСТИТЬ Начисления
			|ИЗ
			|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
			|			,
			|			,
			|			Регистратор,
			|			ДоговорОПС = &ДоговорОПС
			|				И ТипВыплаты = &ВыплатаПравопреемникам) КАК уп_ПрочиеНачисленияОПСОбороты
			|ГДЕ
			|	уп_ПрочиеНачисленияОПСОбороты.Регистратор = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	уп_ПрочиеНачисленияОПСОбороты.Участник,
			|	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
			|	ВЫБОР
			|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРПН)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)
			|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРСВ)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервСрочнойВыплаты)
			|		ИНАЧЕ уп_ПрочиеНачисленияОПСОбороты.ТипРезерва
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление,
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник,
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Процент,
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Сумма
			|ПОМЕСТИТЬ ДанныеЗаявлений
			|ИЗ
			|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления
			|ГДЕ
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление,
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник,
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Процент,
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.СуммаМК
			|ПОМЕСТИТЬ ДанныеЗаявлений31
			|ИЗ
			|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Правопреемники31 КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31
			|ГДЕ
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(ДанныеЗаявлений.Заявление, ДанныеЗаявлений31.Заявление) КАК Заявление,
			|	ЕСТЬNULL(ДанныеЗаявлений.Правопреемник, ДанныеЗаявлений31.Правопреемник) КАК Правопреемник,
			|	ЕСТЬNULL(ДанныеЗаявлений.Процент, ДанныеЗаявлений31.Процент) КАК Процент,
			|	ЕСТЬNULL(ДанныеЗаявлений.Сумма, ДанныеЗаявлений31.СуммаМК) КАК Сумма
			|ПОМЕСТИТЬ Заявления
			|ИЗ
			|	ДанныеЗаявлений КАК ДанныеЗаявлений
			|		ПОЛНОЕ СОЕДИНЕНИЕ ДанныеЗаявлений31 КАК ДанныеЗаявлений31
			|		ПО ДанныеЗаявлений.Правопреемник = ДанныеЗаявлений31.Правопреемник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Начисления.Участник КАК Правопреемник,
			|	Начисления.ТипСуммы,
			|	Начисления.СуммаПриход КАК Сумма,
			|	Начисления.ТипРезерва КАК ТипРезерва,
			|	Заявления.Заявление,
			|	Заявления.Процент,
			|	Заявления.Сумма КАК СуммаТЧ
			|ИЗ
			|	Начисления КАК Начисления
			|		ЛЕВОЕ СОЕДИНЕНИЕ Заявления КАК Заявления
			|		ПО Начисления.Участник = Заявления.Правопреемник
			|
			|УПОРЯДОЧИТЬ ПО
			|	ТипРезерва";
			
			Запрос.УстановитьПараметр("ВыплатаПравопреемникам", Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС);
			Запрос.УстановитьПараметр("ДоговорОПС", ОбъектПечати.ДоговорОПС);
			Запрос.УстановитьПараметр("Ссылка", ОбъектПечати.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			ФормируемПоПроводкам = Ложь;
			Если Выборка.Следующий() Тогда //проверим как формировать печатную форму
				Если ЗначениеЗаполнено(Выборка.ТипРезерва) Тогда
					ФормируемПоПроводкам = Истина;
				КонецЕсли;	
			КонецЕсли;
			Если ФормируемПоПроводкам Тогда
				Выборка.Сбросить();
				ТаблицаРПН = Новый ТаблицаЗначений;
				ТаблицаРПН.Колонки.Добавить("Правопреемник");
				ТаблицаРПН.Колонки.Добавить("Заявление");
				ТаблицаРПН.Колонки.Добавить("Процент");
				ТаблицаРПН.Колонки.Добавить("Сумма");
				
				ТаблицаРСВ = Новый ТаблицаЗначений;
				ТаблицаРСВ = ТаблицаРПН.Скопировать();
				
				ТаблицаМСК = Новый ТаблицаЗначений;
				ТаблицаМСК = ТаблицаРПН.Скопировать();
				
				Пока Выборка.Следующий() Цикл
					Если Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений 
						или Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН Тогда
						НовСтр =  ТаблицаРПН.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
					ИначеЕсли Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты 
						или Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
						Если Выборка.ТипСуммы<>Справочники.уп_ТипыСуммОПС.МатКапитал И Выборка.ТипСуммы<>Справочники.уп_ТипыСуммОПС.ИДМатКапитал Тогда
							НовСтр =  ТаблицаРСВ.Добавить();
							ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
						Иначе
							НовСтр =  ТаблицаМСК.Добавить();
							ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
						КонецЕсли;
					Иначе
						НовСтр =  ТаблицаРПН.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
					КонецЕсли;
				КонецЦикла;
				ТаблицаРПН.Свернуть("Правопреемник, Заявление, Процент", "Сумма");
				ТаблицаРСВ.Свернуть("Правопреемник, Заявление, Процент", "Сумма");
				ТаблицаМСК.Свернуть("Правопреемник, Заявление, Процент", "Сумма");
				
				ОбластьТаблица1 = Макет.ПолучитьОбласть("Таблица1");
				ОбластьТаблица1.Параметры.СуммаНакоплений = ТаблицаРПН.Итог("Сумма");
				#Вставка
				// +ХМНПФ 26.01.2016 ШадринАВ // ПечатьПриложение1() // №149
				ОбластьТаблица1.Параметры.СуммаНакопленийПрописью = ЧислоПрописью(ОбластьТаблица1.Параметры.СуммаНакоплений,"Л=ru_RU","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
				// -ХМНПФ 26.01.2016 ШадринАВ // ПечатьПриложение1() // №149
				#КонецВставки
          		ТабличныйДокумент.Вывести(ОбластьТаблица1);
				ОбластьСтрока1 = Макет.ПолучитьОбласть("Строка1");
				НомерПП = 0;
				Для Каждого стр из ТаблицаРПН Цикл
					НомерПП = НомерПП+1;
					//ОбластьСтрока1.Параметры.Заполнить(стр);
					ОбластьСтрока1.Параметры.НомерПП = НомерПП;
					ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
					ОбластьСтрока1.Параметры.ФамилияП = ФИОПП.Фамилия;
					ОбластьСтрока1.Параметры.ИмяП = ФИОПП.Имя;
					ОбластьСтрока1.Параметры.ОтчествоП = ФИОПП.Отчество;
					ОбластьСтрока1.Параметры.ДатаЗаявления = стр.Заявление.ДатаРегистрации;
					ОбластьСтрока1.Параметры.НомерЗаявления = стр.Заявление.Номер;
					ОбластьСтрока1.Параметры.РазмерДоли = стр.Процент;
					ОбластьСтрока1.Параметры.Сумма1 = стр.Сумма;
					ТабличныйДокумент.Вывести(ОбластьСтрока1);
				КонецЦикла;
				
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьТаблица2 = Макет.ПолучитьОбласть("Таблица2");
				ОбластьТаблица2.Параметры.СуммаНаСчетеСрочныхВыплат = ТаблицаРСВ.Итог("Сумма");
				ТабличныйДокумент.Вывести(ОбластьТаблица2);
				ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка2");
				НомерПП = 0;
				Для каждого стр из ТаблицаРСВ Цикл
					НомерПП = НомерПП+1;
					//ОбластьСтрока2.Параметры.Заполнить(стр);
					ОбластьСтрока2.Параметры.НомерПП = НомерПП;
					ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
					ОбластьСтрока2.Параметры.ФамилияП = ФИОПП.Фамилия;
					ОбластьСтрока2.Параметры.ИмяП = ФИОПП.Имя;
					ОбластьСтрока2.Параметры.ОтчествоП = ФИОПП.Отчество;
					ОбластьСтрока2.Параметры.ДатаЗаявления = стр.Заявление.ДатаРегистрации;
					ОбластьСтрока2.Параметры.НомерЗаявления = стр.Заявление.Номер;
					ОбластьСтрока2.Параметры.РазмерДоли = стр.Процент;
					ОбластьСтрока2.Параметры.Сумма2 = стр.Сумма;
					ТабличныйДокумент.Вывести(ОбластьСтрока2);
				КонецЦикла;	
				
				Если Дата>='20150101' Тогда
					//суммы МК в резерве быть не должно - он передается в ПФР при передаче средств в резерв
					ОбластьТаблица3 = Макет.ПолучитьОбласть("Таблица3");
					ОбластьТаблица3.Параметры.СуммаМатеринскогоКапитала = ТаблицаМСК.Итог("Сумма");
					ТабличныйДокумент.Вывести(ОбластьТаблица3);
					ОбластьСтрока3 = Макет.ПолучитьОбласть("Строка3");
					НомерПП = 0;
					Для каждого стр из ТаблицаМСК Цикл
						НомерПП = НомерПП+1;
						//ОбластьСтрока3.Параметры.Заполнить(стр);
						ОбластьСтрока3.Параметры.НомерПП = НомерПП;
						ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
						ОбластьСтрока3.Параметры.ФамилияП = ФИОПП.Фамилия;
						ОбластьСтрока3.Параметры.ИмяП = ФИОПП.Имя;
						ОбластьСтрока3.Параметры.ОтчествоП = ФИОПП.Отчество;
						ОбластьСтрока2.Параметры.ДатаЗаявления = стр.Заявление.ДатаРегистрации;
						ОбластьСтрока2.Параметры.НомерЗаявления = стр.Заявление.Номер;
						ОбластьСтрока2.Параметры.РазмерДоли = стр.Процент;
						ОбластьСтрока2.Параметры.СуммаМК = стр.Сумма;
						ТабличныйДокумент.Вывести(ОбластьСтрока3);
					КонецЦикла;
				КонецЕсли;	
				
			Иначе //как обычно
					
				//получим списки
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник) КАК Правопреемник,
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление.Номер, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление.Номер) КАК НомерЗаявления,
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление.ДатаРегистрации, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление.ДатаРегистрации) КАК ДатаЗаявления,
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Разрешить, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Разрешить) КАК Разрешить,
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Процент, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Процент) КАК РазмерДоли,
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Сумма, 0) КАК Сумма,
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.СуммаМК, 0) КАК СуммаМК,
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка) КАК ТекДок
				|ИЗ
				|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления
				|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Правопреемники31 КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31
				|		ПО уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник = уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник
				|			И уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка = уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка
				|ГДЕ
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка) = &Ссылка
				|	И ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Разрешить, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Разрешить) = ИСТИНА";
				
				Запрос.УстановитьПараметр("Ссылка", ОбъектПечати.Ссылка);
				
				ТаблицаПравопреемников = Запрос.Выполнить().Выгрузить();
				ТаблицаПравопреемников.Колонки.Добавить("Сумма1", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 2));
				ТаблицаПравопреемников.Колонки.Добавить("Сумма2", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 2));
				
				СуммаНакоплений = 0;
				СуммаСрочныхВыплат = 0;
				
				Для Каждого стр из ОбъектПечати.РасшифровкаСуммы Цикл
					Если стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений 
						или стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН Тогда
						СуммаНакоплений = СуммаНакоплений+стр.Сумма;
					ИначеЕсли стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты 
						или стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
						Если стр.ТипСуммы<>Справочники.уп_ТипыСуммОПС.МатКапитал И стр.ТипСуммы<>Справочники.уп_ТипыСуммОПС.ИДМатКапитал Тогда
							СуммаСрочныхВыплат = СуммаСрочныхВыплат+стр.Сумма;
						КонецЕсли;
					Иначе
						СуммаНакоплений = СуммаНакоплений+стр.Сумма;
					КонецЕсли;	
				КонецЦикла;
				
				ОбластьТаблица1 = Макет.ПолучитьОбласть("Таблица1");
				ОбластьТаблица1.Параметры.СуммаНакоплений = СуммаНакоплений;
				ТабличныйДокумент.Вывести(ОбластьТаблица1);
				ОбластьСтрока1 = Макет.ПолучитьОбласть("Строка1");
				Остаток1 = СуммаНакоплений;
				Остаток2 = СуммаСрочныхВыплат;
				НомерПП = 0;
				Для Каждого стр из ТаблицаПравопреемников Цикл
					Если стр.Разрешить Тогда
						//распределим ее между резервом накопления и срочной выплаты
						Если СуммаНакоплений>0 И СуммаСрочныхВыплат>0 Тогда
							//распределяем
							сумма1Пред = Окр(стр.Сумма*СуммаНакоплений/(СуммаНакоплений+СуммаСрочныхВыплат),2);
							сумма1 = Мин(сумма1Пред,Остаток1);
							сумма2 = стр.Сумма-сумма1;
							Остаток1 = Остаток1-Сумма1;
							Остаток2 = Остаток2-Сумма2;
							стр.Сумма1 = Сумма1;
							стр.Сумма2 = Сумма2;
						ИначеЕсли СуммаНакоплений>0 Тогда
							//записываем все на сумму1
							стр.Сумма1 = стр.Сумма;
							стр.Сумма2 = 0;
						ИначеЕсли СуммаСрочныхВыплат>0 Тогда
							//записываем все на сумму2
							стр.Сумма1 = 0;
							стр.Сумма2 = стр.Сумма;
						КонецЕсли;
						Если стр.Сумма1>0 или стр.Сумма = 0 Тогда
							НомерПП = НомерПП+1;
							ОбластьСтрока1.Параметры.Заполнить(стр);
							ОбластьСтрока1.Параметры.НомерПП = НомерПП;
							ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
							ОбластьСтрока1.Параметры.ФамилияП = ФИОПП.Фамилия;
							ОбластьСтрока1.Параметры.ИмяП = ФИОПП.Имя;
							ОбластьСтрока1.Параметры.ОтчествоП = ФИОПП.Отчество;
							ТабличныйДокумент.Вывести(ОбластьСтрока1);
						КонецЕсли;	
					КонецЕсли;
				КонецЦикла;
				
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьТаблица2 = Макет.ПолучитьОбласть("Таблица2");
				ОбластьТаблица2.Параметры.СуммаНаСчетеСрочныхВыплат = СуммаСрочныхВыплат;
				ТабличныйДокумент.Вывести(ОбластьТаблица2);
				ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка2");
				НомерПП = 0;
				Для каждого стр из ТаблицаПравопреемников Цикл
					Если Дата<'20150101' Тогда
						Если стр.Сумма2>0 или стр.СуммаМК>0 Тогда
							НомерПП = НомерПП+1;
							ОбластьСтрока2.Параметры.Заполнить(стр);
							ОбластьСтрока2.Параметры.НомерПП = НомерПП;
							ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
							ОбластьСтрока2.Параметры.ФамилияП = ФИОПП.Фамилия;
							ОбластьСтрока2.Параметры.ИмяП = ФИОПП.Имя;
							ОбластьСтрока2.Параметры.ОтчествоП = ФИОПП.Отчество;
							ТабличныйДокумент.Вывести(ОбластьСтрока2);
						Конецесли;
					Иначе
						Если стр.Сумма2>0 Тогда
							НомерПП = НомерПП+1;
							ОбластьСтрока2.Параметры.Заполнить(стр);
							ОбластьСтрока2.Параметры.НомерПП = НомерПП;
							ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
							ОбластьСтрока2.Параметры.ФамилияП = ФИОПП.Фамилия;
							ОбластьСтрока2.Параметры.ИмяП = ФИОПП.Имя;
							ОбластьСтрока2.Параметры.ОтчествоП = ФИОПП.Отчество;
							ТабличныйДокумент.Вывести(ОбластьСтрока2);
						Конецесли;
					КонецЕсли;
				КонецЦикла;	
				
				Если Дата>='20150101' Тогда
					//суммы МК в резерве быть не должно - он передается в ПФР при передаче средств в резерв
					ОбластьТаблица3 = Макет.ПолучитьОбласть("Таблица3");
					ОбластьТаблица3.Параметры.СуммаМатеринскогоКапитала = 0;
					ТабличныйДокумент.Вывести(ОбластьТаблица3);
					ОбластьСтрока3 = Макет.ПолучитьОбласть("Строка3");
					НомерПП = 0;
					Для каждого стр из ТаблицаПравопреемников Цикл
						Если стр.СуммаМК>0 Тогда
							НомерПП = НомерПП+1;
							ОбластьСтрока3.Параметры.Заполнить(стр);
							ОбластьСтрока3.Параметры.НомерПП = НомерПП;
							ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
							ОбластьСтрока3.Параметры.ФамилияП = ФИОПП.Фамилия;
							ОбластьСтрока3.Параметры.ИмяП = ФИОПП.Имя;
							ОбластьСтрока3.Параметры.ОтчествоП = ФИОПП.Отчество;
							ТабличныйДокумент.Вывести(ОбластьСтрока3);
						Конецесли;	
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли;
			
			Область = Макет.ПолучитьОбласть("Подвал");
			
			СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПустаяСсылка(),ОбъектПечати.Организация,ОбъектПечати.ДоговорОПС.Филиал,Пользователи.ТекущийПользователь(),"Приложение1",Дата);
			Область.Параметры.ДолжностьОтветственного = СведенияОбОтветственном.Должность;
			Область.Параметры.ФИООтветственного = СведенияОбОтветственном.Фамилия+" "+Лев(СведенияОбОтветственном.Имя,1)+"."+" "+Лев(СведенияОбОтветственном.Отчество,1)+".";
			
			ТабличныйДокумент.Вывести(Область); 	
			
			Если ПечататьАдрес Тогда
				ТекПравопреемник = МассивПравопреемников.Получить(а-1);
				//ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ТекПравопреемник.уп_ФизЛицо));
				
				Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
				ДанныеАдреса = ТекПравопреемник.уп_ФизЛицо.КонтактнаяИнформация.НайтиСтроки(Данные);
				Если ДанныеАдреса.Количество() > 0 Тогда
					ДанныеАдреса = ДанныеАдреса[0];
					АдресПредставление = ДанныеАдреса.Представление;
				Иначе
					ДанныеАдреса = Неопределено;
					АдресПредставление = "";
				КонецЕсли;
				Куда = АдресПредставление;
				Кому = ФИОПП.Фамилия + " "+ФИОПП.Имя+" "+ФИОПП.Отчество;
				Область = Макет.ПолучитьОбласть("ОбластьКудаКому");
				Область.Рисунки.ТекстКудаКому.Текст = "Кому: "+Кому+Символы.ПС+"Куда: "+Куда;
				ТабличныйДокумент.Вывести(Область);
			КонецЕсли;
			
			
			// В табличном документе зададим имя области, в которую был 
			// выведен объект. Нужно для возможности печати покомплектно.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, СведенияОДокументе.Документ);
			
			//УправлениеПечатьюБП.ДополнитьДокументПодписьюИПечатью(ТабличныйДокумент, СведенияОДокументе, ОбъектыПечати, ПараметрыПечати);
			УправлениеПечатьюБП.ДоработатьФаксимильнуюПодписьИПечать(ТабличныйДокумент, ОбъектыПечати, ОбъектПечати.Организация, СведенияОДокументе.Документ);
		#Вставка
		// +ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложение1() // №114
		ХМ_ВывестиИсполнителя(ТабличныйДокумент);
		// -ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложение1() // №114
		#КонецВставки
      	КонецЦикла;
	КонецЦикла;	
	Возврат ТабличныйДокумент;
КонецФункции

// +ХМНПФ 12.04.2017 ШадринАВ // ПечатьПриложение2() // №931
//Функция ПечатьПриложение2(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
// -ХМНПФ 12.04.2017 ШадринАВ // ПечатьПриложение2() // №931
&ИзменениеИКонтроль("ПечатьПриложение2")
Функция РасшОбщ_ПечатьПриложение2(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ХМ_Рассылка = Ложь) Экспорт
// -ХМНПФ 12.04.2017 ШадринАВ // ПечатьПриложение2() // №931
	
	ИмяПараметровПечати = ПараметрыПечати.ИмяПараметровПечати;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	
	
	ТабличныйДокумент.КлючПараметровПечати = ИмяПараметровПечати;
	
	//УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ОбъектПечати Из МассивОбъектов Цикл
		
		Если ОбъектПечати.ПометкаУдаления Тогда
			Продолжить;	
		КонецЕсли;
		Если НЕ ОбъектПечати.ДополнительнаяВыплата Тогда
			Продолжить;	
		КонецЕсли;
		
		Если ПараметрыПечати.Свойство("ПечатьАдреса") И ПараметрыПечати.ПечатьАдреса Тогда
			МассивПравопреемников = Новый Массив;
			КоличествоКопий = 0;
			Для Каждого стр из ОбъектПечати.Заявления Цикл
				Если стр.Разрешить Тогда
					КоличествоКопий = КоличествоКопий+1;
					МассивПравопреемников.Добавить(стр.Правопреемник)
				КонецЕсли;	
			КонецЦикла;
			ПечататьАдрес = Истина;
		Иначе
			КоличествоКопий = 1;
			ПечататьАдрес = Ложь;
		КонецЕсли;
		
		Для а=1 По КоличествоКопий Цикл
			
			Если НЕ ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(ОбъектПечати.Организация, ОбъектПечати.Дата);
			
			ТаблицаДокумента = Новый ТаблицаЗначений;
			ТаблицаДокумента.Колонки.Добавить("Документ");
			ТаблицаДокумента.Колонки.Добавить("Ссылка");
			ТаблицаДокумента.Колонки.Добавить("Организация");
			ТаблицаДокумента.Колонки.Добавить("Руководитель");
			
			
			СведенияОДокументе = ТаблицаДокумента.Добавить();
			СведенияОДокументе.Документ = ОбъектПечати.Ссылка;
			СведенияОДокументе.Ссылка = ОбъектПечати.Ссылка;
			СведенияОДокументе.Организация = ОбъектПечати.Организация;
			СведенияОДокументе.Руководитель = Руководители.Руководитель;
			
			Дата = ОбъектПечати.Дата;
			
			Если Дата<'20150101' Тогда
				Макет = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("Приложение2");
			Иначе
				Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПФ_MXL_Приложение2_2015");
			КонецЕсли;
			// Заголовок
			
			СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ОбъектПечати.Организация, Дата);
			ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
		
			
			Область = Макет.ПолучитьОбласть("Шапка");
			Область.Параметры.Число = Формат(Дата, "ДФ=дд");
			Область.Параметры.Месяц = Сред(Формат(Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Дата, "ДЛФ=дд")))-10);
			Область.Параметры.Год = Формат(Дата, "ДФ=гггг");
			Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;
			Область.Параметры.НомерРешения = ОбъектПечати.Номер;
			
			ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ОбъектПечати.ДоговорОПС.Участник.уп_ФизЛицо));
			Фамилия = ФИОФизЛица.Фамилия;
			Имя = ФИОФизЛица.Имя;                
			Отчество = ФИОФизЛица.Отчество;
			Область.Параметры.ФИОЗастрахованного = Фамилия+" "+Имя+" "+Отчество;
			Область.Параметры.СтраховойНомер = уп_ОПС.ПреобразоватьНомерПФР(ОбъектПечати.ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
			ТабличныйДокумент.Вывести(Область);
			
			//посмотрим по проводкам, если там по типам резерва начислено, то печатную форму оттуда формируем
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	уп_ПрочиеНачисленияОПСОбороты.Участник,
			|	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
			|	СУММА(уп_ПрочиеНачисленияОПСОбороты.СуммаПриход) КАК СуммаПриход,
			|	ВЫБОР
			|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРПН)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)
			|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРСВ)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервСрочнойВыплаты)
			|		ИНАЧЕ уп_ПрочиеНачисленияОПСОбороты.ТипРезерва
			|	КОНЕЦ КАК ТипРезерва
			|ПОМЕСТИТЬ Начисления
			|ИЗ
			|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
			|			,
			|			,
			|			Регистратор,
			|			ДоговорОПС = &ДоговорОПС
			|				И ТипВыплаты = &ВыплатаПравопреемникам) КАК уп_ПрочиеНачисленияОПСОбороты
			|ГДЕ
			|	уп_ПрочиеНачисленияОПСОбороты.Регистратор = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	уп_ПрочиеНачисленияОПСОбороты.Участник,
			|	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
			|	ВЫБОР
			|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРПН)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)
			|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРСВ)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервСрочнойВыплаты)
			|		ИНАЧЕ уп_ПрочиеНачисленияОПСОбороты.ТипРезерва
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_ПрочиеНачисленияОПСОбороты.Участник,
			|	МАКСИМУМ(уп_ПрочиеНачисленияОПСОбороты.Период) КАК ДатаВыплаты,
			|	СУММА(ВЫБОР
			|			КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипСуммы В (&МСК)
			|				ТОГДА уп_ПрочиеНачисленияОПСОбороты.СуммаРасход
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК СуммаМСКДо,
			|	СУММА(ВЫБОР
			|			КОГДА НЕ уп_ПрочиеНачисленияОПСОбороты.ТипСуммы В (&МСК)
			|					И уп_ПрочиеНачисленияОПСОбороты.ТипРезерва В (&РПН)
			|				ТОГДА уп_ПрочиеНачисленияОПСОбороты.СуммаРасход
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК СуммаРПНДо,
			|	СУММА(ВЫБОР
			|			КОГДА НЕ уп_ПрочиеНачисленияОПСОбороты.ТипСуммы В (&МСК)
			|					И уп_ПрочиеНачисленияОПСОбороты.ТипРезерва В (&РСВ)
			|				ТОГДА уп_ПрочиеНачисленияОПСОбороты.СуммаРасход
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК СуммаРСВДо
			|ПОМЕСТИТЬ НачисленияДо
			|ИЗ
			|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
			|			,
			|			&ДатаДоДокумента,
			|			Регистратор,
			|			ДоговорОПС = &ДоговорОПС
			#Вставка
			// +ХМНПФ 17.04.2020 ШадринАВ // ПечатьПриложение2() // №2796
			|				И НЕ ХМ_Возврат
			// -ХМНПФ 17.04.2020 ШадринАВ // ПечатьПриложение2() // №2796
			#КонецВставки
			|				И ТипВыплаты = &ВыплатаПравопреемникам
			|				И ТипРезерва <> ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервОПС)) КАК уп_ПрочиеНачисленияОПСОбороты
			|ГДЕ
			|	уп_ПрочиеНачисленияОПСОбороты.Регистратор ССЫЛКА Документ.уп_ВыплатныеРеестры
			|
			|СГРУППИРОВАТЬ ПО
			|	уп_ПрочиеНачисленияОПСОбороты.Участник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление,
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник,
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Процент,
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Сумма
			|ПОМЕСТИТЬ ДанныеЗаявлений
			|ИЗ
			|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления
			|ГДЕ
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление,
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник,
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Процент,
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.СуммаМК
			|ПОМЕСТИТЬ ДанныеЗаявлений31
			|ИЗ
			|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Правопреемники31 КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31
			|ГДЕ
			|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(ДанныеЗаявлений.Заявление, ДанныеЗаявлений31.Заявление) КАК Заявление,
			|	ЕСТЬNULL(ДанныеЗаявлений.Правопреемник, ДанныеЗаявлений31.Правопреемник) КАК Правопреемник,
			|	ЕСТЬNULL(ДанныеЗаявлений.Процент, ДанныеЗаявлений31.Процент) КАК Процент,
			|	ЕСТЬNULL(ДанныеЗаявлений.Сумма, ДанныеЗаявлений31.СуммаМК) КАК Сумма
			|ПОМЕСТИТЬ Заявления
			|ИЗ
			|	ДанныеЗаявлений КАК ДанныеЗаявлений
			|		ПОЛНОЕ СОЕДИНЕНИЕ ДанныеЗаявлений31 КАК ДанныеЗаявлений31
			|		ПО ДанныеЗаявлений.Правопреемник = ДанныеЗаявлений31.Правопреемник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Начисления.Участник КАК Правопреемник,
			|	Начисления.ТипСуммы,
			|	Начисления.СуммаПриход КАК Сумма,
			|	Начисления.ТипРезерва КАК ТипРезерва,
			|	Заявления.Заявление,
			|	Заявления.Процент,
			|	Заявления.Сумма КАК СуммаТЧ,
			|	НачисленияДо.ДатаВыплаты,
			|	ЕСТЬNULL(НачисленияДо.СуммаМСКДо, 0) КАК СуммаМСКДо,
			|	ЕСТЬNULL(НачисленияДо.СуммаРПНДо, 0) КАК СуммаРПНДо,
			|	ЕСТЬNULL(НачисленияДо.СуммаРСВДо, 0) КАК СуммаРСВДо
			|ИЗ
			|	Начисления КАК Начисления
			|		ЛЕВОЕ СОЕДИНЕНИЕ Заявления КАК Заявления
			|		ПО Начисления.Участник = Заявления.Правопреемник
			|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияДо КАК НачисленияДо
			|		ПО Начисления.Участник = НачисленияДо.Участник
			|
			|УПОРЯДОЧИТЬ ПО
			|	ТипРезерва";
			
			Запрос.УстановитьПараметр("ВыплатаПравопреемникам", Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС);
			Запрос.УстановитьПараметр("ДоговорОПС", ОбъектПечати.ДоговорОПС);
			Запрос.УстановитьПараметр("Ссылка", ОбъектПечати.Ссылка);
			Запрос.УстановитьПараметр("ДатаДоДокумента", Дата-1);
			РПН = Новый СписокЗначений();
			РПН.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
			РПН.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН);
			РПН.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервЕВ);
			РСВ = Новый СписокЗначений();
			РСВ.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты);
			РСВ.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ);
			МСК = Новый СписокЗначений();
			МСК.Добавить(Справочники.уп_ТипыСуммОПС.МатКапитал);
			МСК.Добавить(Справочники.уп_ТипыСуммОПС.ИДМатКапитал);
			Запрос.УстановитьПараметр("РПН", РПН);
			Запрос.УстановитьПараметр("РСВ", РСВ);
			Запрос.УстановитьПараметр("МСК", МСК);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			ФормируемПоПроводкам = Ложь;
			Если Выборка.Следующий() Тогда //проверим как формировать печатную форму
				Если ЗначениеЗаполнено(Выборка.ТипРезерва) Тогда
					ФормируемПоПроводкам = Истина;
				КонецЕсли;	
			КонецЕсли;
			Если ФормируемПоПроводкам Тогда
				Выборка.Сбросить();
				ТаблицаРПН = Новый ТаблицаЗначений;
				ТаблицаРПН.Колонки.Добавить("Правопреемник");
				ТаблицаРПН.Колонки.Добавить("Заявление");
				ТаблицаРПН.Колонки.Добавить("Процент");
				ТаблицаРПН.Колонки.Добавить("Сумма");
				ТаблицаРПН.Колонки.Добавить("ДатаВыплаты");
				ТаблицаРПН.Колонки.Добавить("СуммаДо");
				
				ТаблицаРСВ = Новый ТаблицаЗначений;
				ТаблицаРСВ = ТаблицаРПН.Скопировать();
				
				ТаблицаМСК = Новый ТаблицаЗначений;
				ТаблицаМСК = ТаблицаРПН.Скопировать();
				
				Пока Выборка.Следующий() Цикл
					Если Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений 
						или Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН Тогда
						НовСтр =  ТаблицаРПН.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
						Если Выборка.СуммаРПНДо>0 Тогда
							НовСтр.СуммаДо = Выборка.СуммаРПНДо;
							НовСтр.ДатаВыплаты = Выборка.ДатаВыплаты;
						Иначе
							НовСтр.СуммаДо = 0;
							НовСтр.ДатаВыплаты = "";
						КонецЕсли;
					ИначеЕсли Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты 
						или Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
						Если Выборка.ТипСуммы<>Справочники.уп_ТипыСуммОПС.МатКапитал И Выборка.ТипСуммы<>Справочники.уп_ТипыСуммОПС.ИДМатКапитал Тогда
							НовСтр =  ТаблицаРСВ.Добавить();
							ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
							Если Выборка.СуммаРСВДо>0 Тогда
								НовСтр.СуммаДо = Выборка.СуммаРСВДо;
								НовСтр.ДатаВыплаты = Выборка.ДатаВыплаты;
							Иначе
								НовСтр.СуммаДо = 0;
								НовСтр.ДатаВыплаты = "";
							КонецЕсли;
						Иначе
							НовСтр =  ТаблицаМСК.Добавить();
							ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
							Если Выборка.СуммаМСКДо>0 Тогда
								НовСтр.СуммаДо = Выборка.СуммаМСКДо;
								НовСтр.ДатаВыплаты = Выборка.ДатаВыплаты;
							Иначе
								НовСтр.СуммаДо = 0;
								НовСтр.ДатаВыплаты = "";
							КонецЕсли;
						КонецЕсли;
					Иначе
						НовСтр =  ТаблицаРПН.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
						Если Выборка.СуммаРПНДо>0 Тогда
							НовСтр.СуммаДо = Выборка.СуммаРПНДо;
							НовСтр.ДатаВыплаты = Выборка.ДатаВыплаты;
						Иначе
							НовСтр.СуммаДо = 0;
							НовСтр.ДатаВыплаты = "";
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				ТаблицаРПН.Свернуть("Правопреемник, Заявление, Процент, ДатаВыплаты, СуммаДо", "Сумма");
				ТаблицаРСВ.Свернуть("Правопреемник, Заявление, Процент, ДатаВыплаты, СуммаДо", "Сумма");
				ТаблицаМСК.Свернуть("Правопреемник, Заявление, Процент, ДатаВыплаты, СуммаДо", "Сумма");
				
				ОбластьТаблица1 = Макет.ПолучитьОбласть("Таблица1");
				ОбластьТаблица1.Параметры.СуммаНакоплений = ТаблицаРПН.Итог("Сумма");
				ТабличныйДокумент.Вывести(ОбластьТаблица1);
				ОбластьСтрока1 = Макет.ПолучитьОбласть("Строка1");
				НомерПП = 0;
				Для Каждого стр из ТаблицаРПН Цикл
					НомерПП = НомерПП+1;
					//ОбластьСтрока1.Параметры.Заполнить(стр);
					ОбластьСтрока1.Параметры.НомерПП = НомерПП;
					ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
					ОбластьСтрока1.Параметры.ФамилияП = ФИОПП.Фамилия;
					ОбластьСтрока1.Параметры.ИмяП = ФИОПП.Имя;
					ОбластьСтрока1.Параметры.ОтчествоП = ФИОПП.Отчество;
					ОбластьСтрока1.Параметры.ДатаЗаявления = стр.Заявление.ДатаРегистрации;
					ОбластьСтрока1.Параметры.НомерЗаявления = стр.Заявление.Номер;
					ОбластьСтрока1.Параметры.РазмерДоли = стр.Процент;
					ОбластьСтрока1.Параметры.Сумма1 = стр.Сумма;
					ОбластьСтрока1.Параметры.ДатаВыплаты = стр.ДатаВыплаты;
					ОбластьСтрока1.Параметры.СуммаДо = стр.СуммаДо;
					
					ТабличныйДокумент.Вывести(ОбластьСтрока1);
				КонецЦикла;
				#Удаление
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				#КонецУдаления
				#Вставка
				// +ХМНПФ 28.03.2022 МилевскийАЮ // ПечатьПриложение2() // №3447
				#КонецВставки
				ОбластьТаблица2 = Макет.ПолучитьОбласть("Таблица2");
				ОбластьТаблица2.Параметры.СуммаНаСчетеСрочныхВыплат = ТаблицаРСВ.Итог("Сумма");
				ТабличныйДокумент.Вывести(ОбластьТаблица2);
				ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка2");
				НомерПП = 0;
				Для каждого стр из ТаблицаРСВ Цикл
					НомерПП = НомерПП+1;
					//ОбластьСтрока2.Параметры.Заполнить(стр);
					ОбластьСтрока2.Параметры.НомерПП = НомерПП;
					ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
					ОбластьСтрока2.Параметры.ФамилияП = ФИОПП.Фамилия;
					ОбластьСтрока2.Параметры.ИмяП = ФИОПП.Имя;
					ОбластьСтрока2.Параметры.ОтчествоП = ФИОПП.Отчество;
					ОбластьСтрока2.Параметры.ДатаЗаявления = стр.Заявление.ДатаРегистрации;
					ОбластьСтрока2.Параметры.НомерЗаявления = стр.Заявление.Номер;
					ОбластьСтрока2.Параметры.РазмерДоли = стр.Процент;
					ОбластьСтрока2.Параметры.Сумма2 = стр.Сумма;
					ОбластьСтрока2.Параметры.ДатаВыплаты = стр.ДатаВыплаты;
					ОбластьСтрока2.Параметры.СуммаДо = стр.СуммаДо;
					
					ТабличныйДокумент.Вывести(ОбластьСтрока2);
				КонецЦикла;	
				
				Если Дата>='20150101' Тогда
					//суммы МК в резерве быть не должно - он передается в ПФР при передаче средств в резерв
					ОбластьТаблица3 = Макет.ПолучитьОбласть("Таблица3");
					ОбластьТаблица3.Параметры.СуммаМатеринскогоКапитала = ТаблицаМСК.Итог("Сумма");
					ТабличныйДокумент.Вывести(ОбластьТаблица3);
					ОбластьСтрока3 = Макет.ПолучитьОбласть("Строка3");
					НомерПП = 0;
					Для каждого стр из ТаблицаМСК Цикл
						НомерПП = НомерПП+1;
						//ОбластьСтрока3.Параметры.Заполнить(стр);
						ОбластьСтрока3.Параметры.НомерПП = НомерПП;
						ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
						ОбластьСтрока3.Параметры.ФамилияП = ФИОПП.Фамилия;
						ОбластьСтрока3.Параметры.ИмяП = ФИОПП.Имя;
						ОбластьСтрока3.Параметры.ОтчествоП = ФИОПП.Отчество;
						ОбластьСтрока3.Параметры.ДатаЗаявления = стр.Заявление.ДатаРегистрации;
						ОбластьСтрока3.Параметры.НомерЗаявления = стр.Заявление.Номер;
						ОбластьСтрока3.Параметры.РазмерДоли = стр.Процент;
						ОбластьСтрока3.Параметры.СуммаМК = стр.Сумма;
						ОбластьСтрока3.Параметры.ДатаВыплаты = стр.ДатаВыплаты;
						ОбластьСтрока3.Параметры.СуммаДо = стр.СуммаДо;
						
						ТабличныйДокумент.Вывести(ОбластьСтрока3);
					КонецЦикла;
				КонецЕсли;	
			Иначе
				//получим списки
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник) КАК Правопреемник,
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление.Номер, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление.Номер) КАК НомерЗаявления,
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление.ДатаРегистрации, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление.ДатаРегистрации) КАК ДатаЗаявления,
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Разрешить, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Разрешить) КАК Разрешить,
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Процент, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Процент) КАК РазмерДоли,
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Сумма, 0) КАК Сумма,
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.СуммаМК, 0) КАК СуммаМК,
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка) КАК ТекДок
				|ИЗ
				|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления
				|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Правопреемники31 КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31
				|		ПО уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник = уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник
				|			И уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка = уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка
				|ГДЕ
				|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка) = &Ссылка
				|	И ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Разрешить, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Разрешить) = ИСТИНА";
				
				Запрос.УстановитьПараметр("Ссылка", ОбъектПечати.Ссылка);
				
				ТаблицаПравопреемников = Запрос.Выполнить().Выгрузить();
				ТаблицаПравопреемников.Колонки.Добавить("Сумма1", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 2));
				ТаблицаПравопреемников.Колонки.Добавить("Сумма2", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 2));
				
				СуммаНакоплений = 0;
				СуммаСрочныхВыплат = 0;
				
				Для Каждого стр из ОбъектПечати.РасшифровкаСуммы Цикл
					Если стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений 
						ИЛИ стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН Тогда
						СуммаНакоплений = СуммаНакоплений+стр.Сумма;
					ИначеЕсли стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты 
						ИЛИ стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
						Если стр.ТипСуммы<>Справочники.уп_ТипыСуммОПС.МатКапитал И стр.ТипСуммы<>Справочники.уп_ТипыСуммОПС.ИДМатКапитал Тогда
							СуммаСрочныхВыплат = СуммаСрочныхВыплат+стр.Сумма;
						КонецЕсли;
					Иначе
						СуммаНакоплений = СуммаНакоплений+стр.Сумма;
					КонецЕсли;	
				КонецЦикла;
				
				ОбластьТаблица1 = Макет.ПолучитьОбласть("Таблица1");
				ОбластьТаблица1.Параметры.СуммаНакоплений = СуммаНакоплений;
				ТабличныйДокумент.Вывести(ОбластьТаблица1);
				ОбластьСтрока1 = Макет.ПолучитьОбласть("Строка1");
				Остаток1 = СуммаНакоплений;
				Остаток2 = СуммаСрочныхВыплат;
				НомерПП = 0;
				Для Каждого стр из ТаблицаПравопреемников Цикл
					Если стр.Разрешить Тогда
						//распределим ее между резервом накопления и срочной выплаты
						Если СуммаНакоплений>0 И СуммаСрочныхВыплат>0 Тогда
							//распределяем
							сумма1Пред = Окр(стр.Сумма*СуммаНакоплений/(СуммаНакоплений+СуммаСрочныхВыплат),2);
							сумма1 = Мин(сумма1Пред,Остаток1);
							сумма2 = стр.Сумма-сумма1;
							Остаток1 = Остаток1-Сумма1;
							Остаток2 = Остаток2-Сумма2;
							стр.Сумма1 = Сумма1;
							стр.Сумма2 = Сумма2;
						ИначеЕсли СуммаНакоплений>0 Тогда
							//записываем все на сумму1
							стр.Сумма1 = стр.Сумма;
							стр.Сумма2 = 0;
						ИначеЕсли СуммаСрочныхВыплат>0 Тогда
							//записываем все на сумму2
							стр.Сумма1 = 0;
							стр.Сумма2 = стр.Сумма;
						КонецЕсли;
						Если стр.Сумма1>0 или стр.Сумма = 0 Тогда
							НомерПП = НомерПП+1;
							ОбластьСтрока1.Параметры.Заполнить(стр);
							ОбластьСтрока1.Параметры.НомерПП = НомерПП;
							ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
							ОбластьСтрока1.Параметры.ФамилияП = ФИОПП.Фамилия;
							ОбластьСтрока1.Параметры.ИмяП = ФИОПП.Имя;
							ОбластьСтрока1.Параметры.ОтчествоП = ФИОПП.Отчество;
							ТабличныйДокумент.Вывести(ОбластьСтрока1);
						КонецЕсли;	
					КонецЕсли;
				КонецЦикла;
				
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьТаблица2 = Макет.ПолучитьОбласть("Таблица2");
				ОбластьТаблица2.Параметры.СуммаНаСчетеСрочныхВыплат = СуммаСрочныхВыплат;
				ТабличныйДокумент.Вывести(ОбластьТаблица2);
				ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка2");
				НомерПП = 0;
				Для каждого стр из ТаблицаПравопреемников Цикл
					Если Дата<'20150101' Тогда
						Если стр.Сумма2>0 или стр.СуммаМК>0 Тогда
							НомерПП = НомерПП+1;
							ОбластьСтрока2.Параметры.Заполнить(стр);
							ОбластьСтрока2.Параметры.НомерПП = НомерПП;
							ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
							ОбластьСтрока2.Параметры.ФамилияП = ФИОПП.Фамилия;
							ОбластьСтрока2.Параметры.ИмяП = ФИОПП.Имя;
							ОбластьСтрока2.Параметры.ОтчествоП = ФИОПП.Отчество;
							ТабличныйДокумент.Вывести(ОбластьСтрока2);
						Конецесли;
					Иначе
						Если стр.Сумма2>0 Тогда
							НомерПП = НомерПП+1;
							ОбластьСтрока2.Параметры.Заполнить(стр);
							ОбластьСтрока2.Параметры.НомерПП = НомерПП;
							ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
							ОбластьСтрока2.Параметры.ФамилияП = ФИОПП.Фамилия;
							ОбластьСтрока2.Параметры.ИмяП = ФИОПП.Имя;
							ОбластьСтрока2.Параметры.ОтчествоП = ФИОПП.Отчество;
							ТабличныйДокумент.Вывести(ОбластьСтрока2);
						Конецесли;
					КонецЕсли;
				КонецЦикла;	
				
				Если Дата>='20150101' Тогда
					//суммы МК в резерве быть не должно - он передается в ПФР при передаче средств в резерв
					ОбластьТаблица3 = Макет.ПолучитьОбласть("Таблица3");
					ОбластьТаблица3.Параметры.СуммаМатеринскогоКапитала = 0;
					ТабличныйДокумент.Вывести(ОбластьТаблица3);
					ОбластьСтрока3 = Макет.ПолучитьОбласть("Строка3");
					НомерПП = 0;
					Для каждого стр из ТаблицаПравопреемников Цикл
						Если стр.СуммаМК>0 Тогда
							НомерПП = НомерПП+1;
							ОбластьСтрока3.Параметры.Заполнить(стр);
							ОбластьСтрока3.Параметры.НомерПП = НомерПП;
							ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
							ОбластьСтрока3.Параметры.ФамилияП = ФИОПП.Фамилия;
							ОбластьСтрока3.Параметры.ИмяП = ФИОПП.Имя;
							ОбластьСтрока3.Параметры.ОтчествоП = ФИОПП.Отчество;
							ТабличныйДокумент.Вывести(ОбластьСтрока3);
						Конецесли;	
					КонецЦикла;
				КонецЕсли;	
			КонецЕсли;
			Область = Макет.ПолучитьОбласть("Подвал");
			
			СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПустаяСсылка(),ОбъектПечати.Организация,ОбъектПечати.ДоговорОПС.Филиал,Пользователи.ТекущийПользователь(),"Приложение1",Дата);
			Область.Параметры.ДолжностьОтветственного = СведенияОбОтветственном.Должность;
			Область.Параметры.ФИООтветственного = Лев(СведенияОбОтветственном.Имя,1)+"."+Лев(СведенияОбОтветственном.Отчество,1)+"."+СведенияОбОтветственном.Фамилия;
  
			#Вставка
			// +ХМНПФ 12.04.2017 ШадринАВ // ПечатьПриложение2() // №931
			Если ХМ_Рассылка Тогда
				ХМ_МакетРассылка = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("ХМ_ПодвалПриложение2_2015дляРассылки");
				Область = ХМ_МакетРассылка.ПолучитьОбласть("Подвал");
			КонецЕсли;
			// -ХМНПФ 12.04.2017 ШадринАВ // ПечатьПриложение2() // №931
			#КонецВставки
			ТабличныйДокумент.Вывести(Область);
			#Вставка
			// +ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложение2() // №114
			ХМ_ВывестиИсполнителя(ТабличныйДокумент);
			// -ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложение2() // №114
			#КонецВставки
			
			Если ПечататьАдрес Тогда
				ТекПравопреемник = МассивПравопреемников.Получить(а-1);
				//ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ТекПравопреемник.уп_ФизЛицо));
				
				Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
				ДанныеАдреса = ТекПравопреемник.уп_ФизЛицо.КонтактнаяИнформация.НайтиСтроки(Данные);
				Если ДанныеАдреса.Количество() > 0 Тогда
					ДанныеАдреса = ДанныеАдреса[0];
					АдресПредставление = ДанныеАдреса.Представление;
				Иначе
					ДанныеАдреса = Неопределено;
					АдресПредставление = "";
				КонецЕсли;
				Куда = АдресПредставление;
				Кому = ФИОПП.Фамилия + " "+ФИОПП.Имя+" "+ФИОПП.Отчество;
				Область = Макет.ПолучитьОбласть("ОбластьКудаКому");
				Область.Рисунки.ТекстКудаКому.Текст = "Кому: "+Кому+Символы.ПС+"Куда: "+Куда;
				ТабличныйДокумент.Вывести(Область);
			КонецЕсли;
			
			
			// В табличном документе зададим имя области, в которую был 
			// выведен объект. Нужно для возможности печати покомплектно.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, СведенияОДокументе.Документ);
			
			//УправлениеПечатьюБП.ДополнитьДокументПодписьюИПечатью(ТабличныйДокумент, СведенияОДокументе, ОбъектыПечати, ПараметрыПечати);
			УправлениеПечатьюБП.ДоработатьФаксимильнуюПодписьИПечать(ТабличныйДокумент, ОбъектыПечати, ОбъектПечати.Организация, СведенияОДокументе.Документ);
			#Вставка
			// +ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложение2() // №114
			ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
			// -ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложение2() // №114
			#КонецВставки
		КонецЦикла;
	КонецЦикла;	
	Возврат ТабличныйДокумент;
	
КонецФункции

&ИзменениеИКонтроль("ПечатьПриложение3")
Функция РасшОбщ_ПечатьПриложение3(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ИмяПараметровПечати = ПараметрыПечати.ИмяПараметровПечати;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	
	
	ТабличныйДокумент.КлючПараметровПечати = ИмяПараметровПечати;
	
	//УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ОбъектПечати Из МассивОбъектов Цикл
		
		Если ОбъектПечати.ПометкаУдаления Тогда
			Продолжить;	
		КонецЕсли;
		
		Если ПараметрыПечати.Свойство("ПечатьАдреса") И ПараметрыПечати.ПечатьАдреса Тогда
			ПечататьАдрес = Истина;
		Иначе
			ПечататьАдрес = Ложь;
		КонецЕсли;
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		
		Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(ОбъектПечати.Организация, ОбъектПечати.Дата);
		
		Дата = ОбъектПечати.Дата;
		
		//Если Дата<'20150101' Тогда
		//	Макет = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("Приложение3");
		//Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПФ_MXL_Приложение3_2015");
		//КонецЕсли;
		
		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ОбъектПечати.Организация, Дата);
		ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
		
		
		//получим списки
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник) КАК Правопреемник,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление.Номер, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление.Номер) КАК НомерЗаявления,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление.ДатаРегистрации, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление.ДатаРегистрации) КАК ДатаЗаявления,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Разрешить, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Разрешить) КАК Разрешить,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.СуммаМК, 0) КАК СуммаМК,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка) КАК ТекДок,
		|	ЕстьNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.ПричинаОтказа,0) КАК ПричинаОтказа1,
		|	ЕстьNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.ПричинаОтказа,0) КАК ПричинаОтказа2
		|ИЗ
		|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Правопреемники31 КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31
		|		ПО уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник = уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник
		|			И уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка = уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка
		|ГДЕ
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка) = &Ссылка
		|	И ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Разрешить, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Разрешить) = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Ссылка", ОбъектПечати.Ссылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		НомерПП = 0;
		
		ПерваяСтрока = Истина;
		
		Пока Выборка.Следующий() Цикл
			НомерПП = НомерПП+1;
			
			Если НЕ ПерваяСтрока Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПерваяСтрока = Ложь;
			
			ТаблицаДокумента = Новый ТаблицаЗначений;
			ТаблицаДокумента.Колонки.Добавить("Документ");
			//ТаблицаДокумента.Колонки.Добавить("Ссылка");
			ТаблицаДокумента.Колонки.Добавить("Организация");
			ТаблицаДокумента.Колонки.Добавить("Руководитель");
			ТаблицаДокумента.Колонки.Добавить("ГлавныйБухгалтер");
			
			СведенияОДокументе = ТаблицаДокумента.Добавить();
			Если НомерПП = 1 Тогда
				СведенияОДокументе.Документ = ОбъектПечати.Ссылка;
			Иначе
				СведенияОДокументе.Документ = ""+ОбъектПечати.Ссылка+"_"+НомерПП;
			КонецЕсли;
			//СведенияОДокументе.Ссылка = ОбъектПечати.Ссылка;
			СведенияОДокументе.Организация = ОбъектПечати.Организация;
			СведенияОДокументе.Руководитель = Руководители.Руководитель;
			СведенияОДокументе.ГлавныйБухгалтер = Руководители.Руководитель;
			
			// Запомним номер строки, с которой начали выводить текущий документ.
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			// Заголовок
			Область = Макет.ПолучитьОбласть("Страница1");
			Область2 = Макет.ПолучитьОбласть("Страница2");
			Область.Параметры.Число = Формат(Дата, "ДФ=дд");
			Область.Параметры.Месяц = Сред(Формат(Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Дата, "ДЛФ=дд")))-10);
			Область.Параметры.Год = Формат(Дата, "ДФ=гггг");
			Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;
			Область.Параметры.НомерРешения = ОбъектПечати.Номер+"/"+НомерПП;
			//НомерПП = НомерПП+1;
			
			ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", Выборка.Правопреемник.уп_ФизЛицо));
			Фамилия = ФИОФизЛица.Фамилия;
			Имя = ФИОФизЛица.Имя;                
			Отчество = ФИОФизЛица.Отчество;
			Область.Параметры.ФИОДатаРождения = Фамилия+" "+Имя+" "+Отчество+", "+Формат(Выборка.Правопреемник.уп_ФизЛицо.ДатаРождения,"ДЛФ=DD");
			Область.Параметры.ЧислоЗ = Формат(Выборка.ДатаЗаявления, "ДФ=дд");
			Область.Параметры.МесяцЗ = Сред(Формат(Выборка.ДатаЗаявления, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Выборка.ДатаЗаявления, "ДЛФ=дд")))-10);
			Область.Параметры.ГодЗ = Формат(Выборка.ДатаЗаявления, "ДФ=гггг");
			Область.Параметры.НомерЗаявления = Выборка.НомерЗаявления;
			ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ОбъектПечати.ДоговорОПС.Участник.уп_ФизЛицо));
			Фамилия = ФИОФизЛица.Фамилия;
			Имя = ФИОФизЛица.Имя;                
			Отчество = ФИОФизЛица.Отчество;
			Область.Параметры.ФИОЗастрахованного = Фамилия+" "+Имя+" "+Отчество;
			Область.Параметры.СтраховойНомер = ОбъектПечати.ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР;
			
			Картинка1 = "";
			Картинка2 = "";
			Картинка3 = "";
			Картинка4 = "";
			Картинка5 = "";
			Картинка6 = "";
			Картинка7 = "";
			Картинка8 = "";
			Если Выборка.ПричинаОтказа1 = 1 или Выборка.ПричинаОтказа2 = 1 Тогда
				Картинка1 = "V";
			ИначеЕсли Выборка.ПричинаОтказа1 = 2 или Выборка.ПричинаОтказа2 = 2 Тогда
				Картинка2 = "V";
			ИначеЕсли Выборка.ПричинаОтказа1 = 3 или Выборка.ПричинаОтказа2 = 3 Тогда
				Картинка3 = "V";
			ИначеЕсли Выборка.ПричинаОтказа1 = 4 или Выборка.ПричинаОтказа2 = 4 Тогда
				Картинка4 = "V";
			ИначеЕсли Выборка.ПричинаОтказа1 = 5 или Выборка.ПричинаОтказа2 = 5 Тогда
				Картинка5 = "V";
			ИначеЕсли Выборка.ПричинаОтказа1 = 6 или Выборка.ПричинаОтказа2 = 6 Тогда
				Картинка6 = "V";
			ИначеЕсли Выборка.ПричинаОтказа1 = 7 или Выборка.ПричинаОтказа2 = 7 Тогда
				Картинка7 = "V";
			ИначеЕсли Выборка.ПричинаОтказа1 = 8 или Выборка.ПричинаОтказа2 = 8 Тогда
				Картинка8 = "V";
			КонецЕсли;	
			Область.Параметры.Картинка1 = Картинка1;
			Область.Параметры.Картинка2 = Картинка2;
			Область.Параметры.Картинка3 = Картинка3;
			Область.Параметры.Картинка4 = Картинка4;
			Область.Параметры.Картинка5 = Картинка5;
			Область2.Параметры.Картинка6 = Картинка6;
			Область2.Параметры.Картинка7 = Картинка7;
			//Если Дата>='20150101' Тогда
				Область2.Параметры.Картинка8 = Картинка8;
			//КонецЕсли;
			
			СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПустаяСсылка(),ОбъектПечати.Организация,ОбъектПечати.ДоговорОПС.Филиал,Пользователи.ТекущийПользователь(),"Приложение1",Дата);
			Область2.Параметры.ДолжностьОтветственного = СведенияОбОтветственном.Должность;
			Область2.Параметры.ФИООтветственного = Лев(СведенияОбОтветственном.Имя,1)+"."+Лев(СведенияОбОтветственном.Отчество,1)+"."+СведенияОбОтветственном.Фамилия;
			
			ТабличныйДокумент.Вывести(Область);
 
			#Вставка
			// +ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложение3() // №114
			ХМ_ВывестиИсполнителя(ТабличныйДокумент);
			// -ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложение3() // №114			
			#КонецВставки
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокумент.Вывести(Область2);
			
			Если ПечататьАдрес Тогда
				ТекПравопреемник = Выборка.Правопреемник;
				//ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				ФИОПП = ФИОФизЛица;
				
				Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
				ДанныеАдреса = ТекПравопреемник.уп_ФизЛицо.КонтактнаяИнформация.НайтиСтроки(Данные);
				Если ДанныеАдреса.Количество() > 0 Тогда
					ДанныеАдреса = ДанныеАдреса[0];
					АдресПредставление = ДанныеАдреса.Представление;
				Иначе
					ДанныеАдреса = Неопределено;
					АдресПредставление = "";
				КонецЕсли;
				Куда = АдресПредставление;
				Кому = ФИОПП.Фамилия + " "+ФИОПП.Имя+" "+ФИОПП.Отчество;
				Область = Макет.ПолучитьОбласть("ОбластьКудаКому");
				Область.Рисунки.ТекстКудаКому.Текст = "Кому: "+Кому+Символы.ПС+"Куда: "+Куда;
				ТабличныйДокумент.Вывести(Область);
			КонецЕсли;
			
			
			// В табличном документе зададим имя области, в которую был 
			// выведен объект. Нужно для возможности печати покомплектно.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, СведенияОДокументе.Документ);
			
			//УправлениеПечатьюБП.ДополнитьДокументПодписьюИПечатью(ТабличныйДокумент, СведенияОДокументе, ОбъектыПечати, ПараметрыПечати); 
			УправлениеПечатьюБП.ДоработатьФаксимильнуюПодписьИПечать(ТабличныйДокумент, ОбъектыПечати, ОбъектПечати.Организация, ОбъектПечати.Ссылка);
		КонецЦикла;		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&ИзменениеИКонтроль("ПечатьПриложение4")
Функция РасшОбщ_ПечатьПриложение4(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ИмяПараметровПечати = ПараметрыПечати.ИмяПараметровПечати;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	
	
	ТабличныйДокумент.КлючПараметровПечати = ИмяПараметровПечати;
	
	//УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ОбъектПечати Из МассивОбъектов Цикл
		
		Если ОбъектПечати.ПометкаУдаления Тогда
			Продолжить;	
		КонецЕсли;
		Если НЕ ОбъектПечати.ДополнительнаяВыплата Тогда
			Продолжить;	
		КонецЕсли;
		
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(ОбъектПечати.Организация, ОбъектПечати.Дата);
		
		ТаблицаДокумента = Новый ТаблицаЗначений;
		ТаблицаДокумента.Колонки.Добавить("Документ");
		ТаблицаДокумента.Колонки.Добавить("Ссылка");
		ТаблицаДокумента.Колонки.Добавить("Организация");
		ТаблицаДокумента.Колонки.Добавить("Руководитель");
		
		
		СведенияОДокументе = ТаблицаДокумента.Добавить();
		СведенияОДокументе.Документ = ОбъектПечати.Ссылка;
		СведенияОДокументе.Ссылка = ОбъектПечати.Ссылка;
		СведенияОДокументе.Организация = ОбъектПечати.Организация;
		СведенияОДокументе.Руководитель = Руководители.Руководитель;
		
		Дата = ОбъектПечати.Дата;
		
		Если Дата<'20150101' Тогда
			Макет = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("Приложение4");
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Приложение4_2015");
		КонецЕсли;
		
		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ОбъектПечати.Организация, Дата);
		ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник,
		|	РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка.Номер,
		|	РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка.Дата
		|ИЗ
		|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК РешениеОВыплатеСредствПенсионныхНакопленийЗаявления
		|ГДЕ
		|	РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка.Проведен = ИСТИНА
		|	И РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка.ДоговорОПС = &ДоговорОПС
		|	И РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка.ДополнительнаяВыплата = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ДоговорОПС", ОбъектПечати.ДоговорОПС);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Если ТЗ.Количество()>0 Тогда
			Для каждого стр из ОбъектПечати.Заявления Цикл
				ТекСтрока = ТЗ.Найти(стр.Правопреемник, "Правопреемник");
				Если ТекСтрока = Неопределено Тогда
					//ТабДок = Новый ТабличныйДокумент;
					// Заголовок
					Область = Макет.ПолучитьОбласть("Шапка");
					Область.Параметры.Число = Формат(Дата, "ДФ=дд");
					Область.Параметры.Месяц = Сред(Формат(Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Дата, "ДЛФ=дд")))-10);
					Область.Параметры.Год = Формат(Дата, "ДФ=гггг");
					Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;
					Область.Параметры.НомерРешения = ОбъектПечати.Номер;
					
					ТабличныйДокумент.Вывести(Область);
					
					Область = Макет.ПолучитьОбласть("ТекстоваяЧасть");
					ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ОбъектПечати.ДоговорОПС.Участник.уп_ФизЛицо));
					Фамилия = ФИОФизЛица.Фамилия;
					Имя = ФИОФизЛица.Имя;                
					Отчество = ФИОФизЛица.Отчество;
					Область.Параметры.ФИОЗастрахованного = Фамилия+" "+Имя+" "+Отчество;
					Область.Параметры.СтраховойНомер = ОбъектПечати.ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР;
					Область.Параметры.ДоговорОПС = "договор №"+ОбъектПечати.ДоговорОПС.Код+" от "+Формат(ОбъектПечати.ДоговорОПС.ДатаЗаключения, "ДЛФ=DD");
					
					//информация о правопреемнике
					ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", Стр.Правопреемник.уп_ФизЛицо));
					Область.Параметры.Фамилия = ФИОФизЛица.Фамилия;
					Область.Параметры.Имя = ФИОФизЛица.Имя;                
					Область.Параметры.Отчество = ФИОФизЛица.Отчество;
					Область.Параметры.ДатаРождения = стр.Правопреемник.уп_ФизЛицо.ДатаРождения;
					ПаспортныеДанные = уп_ОсновнаяПоставкаСервер.ПолучитьДанныеДокументаУдостоверяющегоЛичность(Стр.Правопреемник.уп_ФизЛицо, Дата);
					Область.Параметры.ДокументВид = ПаспортныеДанные.ВидДокумента.Наименование;
					Область.Параметры.СерияНомер =  "серия "+ПаспортныеДанные.Серия+" №"+ПаспортныеДанные.Номер;
					Область.Параметры.Число = Формат(стр.Заявление.ДатаРегистрации, "ДФ=дд");
					Область.Параметры.Месяц = Сред(Формат(стр.Заявление.ДатаРегистрации, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(стр.Заявление.ДатаРегистрации, "ДЛФ=дд")))-10);
					Область.Параметры.Год = Формат(стр.Заявление.ДатаРегистрации, "ДФ=гггг");
					Область.Параметры.Номер = стр.Заявление.Номер;
					
					ТекСтрТЗ = ТЗ.Получить(0);
					Область.Параметры.Число1 = Формат(ТекСтрТЗ.Дата, "ДФ=дд");
					Область.Параметры.Месяц1 = Сред(Формат(ТекСтрТЗ.Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(ТекСтрТЗ.Дата, "ДЛФ=дд")))-10);
					Область.Параметры.Год1 = Формат(ТекСтрТЗ.Дата, "ДФ=гггг");
					Область.Параметры.ФИОПравопреемника = ФИОФизЛица.Фамилия+" "+ФИОФизЛица.Имя+" "+ФИОФизЛица.Отчество;
					
					ТабличныйДокумент.Вывести(Область);
					
					Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
					ТабличныйДокумент.Вывести(Область);
					
					Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
					Область.Параметры.СуммаНаСчете = ОбъектПечати.СуммаНаСчете;
					Область.Параметры.Доля = стр.Процент;
					Область.Параметры.Сумма = стр.Сумма;
					ТабличныйДокумент.Вывести(Область);
					
					Область = Макет.ПолучитьОбласть("Подвал");
					
					
					СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПустаяСсылка(),ОбъектПечати.Организация,ОбъектПечати.ДоговорОПС.Филиал,Пользователи.ТекущийПользователь(),"Приложение4",Дата);
					Область.Параметры.ДолжностьОтветственного = СведенияОбОтветственном.Должность;
					Область.Параметры.ФИООтветственного = Лев(СведенияОбОтветственном.Имя,1)+"."+Лев(СведенияОбОтветственном.Отчество,1)+"."+СведенияОбОтветственном.Фамилия;
					
					ТабличныйДокумент.Вывести(Область); 
			
					#Вставка
					// +ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложение4() // №114
					ХМ_ВывестиИсполнителя(ТабличныйДокумент);
					// -ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложение4() // №114
					#КонецВставки
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;		
		
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, СведенияОДокументе.Документ);
		
		//УправлениеПечатьюБП.ДополнитьДокументПодписьюИПечатью(ТабличныйДокумент, СведенияОДокументе, ОбъектыПечати, ПараметрыПечати); 
		УправлениеПечатьюБП.ДоработатьФаксимильнуюПодписьИПечать(ТабличныйДокумент, ОбъектыПечати, ОбъектПечати.Организация, СведенияОДокументе.Документ);
	КонецЦикла;	
	Возврат ТабличныйДокумент;
	
КонецФункции

