
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 12.11.2015 ШадринАВ // СоответствиеПравопреемникуПоЗаявлению() // №36	
	// ХМНПФ+ 12.11.2015 ШадринАВ // Добавлена табличная часть ХМ_Отказы // №37	
	// ХМНПФ 12.11.2015 ШадринАВ // ЗаполнитьТЧДокумента() // №37
	// ХМНПФ 12.11.2015 ШадринАВ // Новая ЗаполнитьТЧОтказы() // №37
	// ХМНПФ 16.11.2015 ШадринАВ // СоответствиеПравопреемникуПоЗаявлению() // №41
	// ХМНПФ 20.11.2015 ШадринАВ // ЗаполнитьТЧДокумента() // №45
	// ХМНПФ 20.11.2015 ШадринАВ // Новая ХМ_КорректироватьРаспределение() // №45
	// ХМНПФ 26.11.2015 ШадринАВ // ОбработкаПроведения() // №53
	// ХМНПФ 18.12.2015 ШадринАВ // ПечатьПриложения1() // №108
	// ХМНПФ 21.12.2015 ШадринАВ // Новая ХМ_ВывестиИсполнителя() // №114
	// ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложения1() // №114
	// ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложения2() // №114
	// ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложения3() // №114
	// ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложения4() // №114
	// ХМНПФ 26.01.2016 ШадринАВ // ПечатьПриложения1() // №149
	// ХМНПФ 26.01.2016 ШадринАВ // Изменен макет Приложение1_2015: // №149
	//	- текст в областях Шапка и Таблица1 выровнен по ширине таблиц
	//	- в области Шапка текст "накоплений <2> за счет" заменен на "накоплений <1> за счет"
	//	- в шапках таблиц добавлен текст в заголовках столбцов 9 и 10
	//	- в области Таблица2 в заголовке столбца 8 текст "Сумма средств" заменен на "Сумма остатка средств"
	//	- в области Таблица1 добавлен параметр "СуммаНакопленийПрописью"
	// ХМНПФ 24.03.2016 ШадринАВ // ПечатьПриложения1() // №295
	// ХМНПФ 21.04.2016 ШадринАВ // СоответствиеПравопреемникуПоЗаявлению() // №325
	// ХМНПФ 22.04.2016 ШадринАВ // Новая ХМ_ПолучитьДолюОтказавшихся() // №325
	// ХМНПФ 22.04.2016 ШадринАВ // Новая ХМ_ПолучитьСуммуПеречисленийВРОПС() // №325
	// ХМНПФ 28.04.2016 ШадринАВ // Изменен макет Приложение1_2015: увеличен шрифт на 4 пункта // №328
	// ХМНПФ 10.09.2016 ЛыткинАМ //ПроверкаКорректности
	// ХМНПФ 07.10.2016 ШадринАВ // Печать() // №568
	// ХМНПФ 12.04.2017 ШадринАВ // ПечатьПриложения2() // №931
	// ХМНПФ 17.04.2020 ШадринАВ // ПечатьПриложения2Сервер() // №2796
	// ХМНПФ 31.03.2021 ШадринАВ // Новая ХМ_ПечатьПриложения2Сервер() // №3152
	// ХМНПФ 26.01.2016 ШадринАВ // В макет ПФ_MXL_Приложение2_2015 добавлен горизонтальный разрыв страницы в области Таблица2 // №3152
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьТЧДокумента")
Функция РасшОбщ_ЗаполнитьТЧДокумента() Экспорт

//Процедура ЗаполнитьТЧДокумента() Экспорт
	//очистим таблицу
	Заявления.Очистить();
	РасшифровкаСуммы.Очистить();
	Правопреемники31.Очистить();
	Участник = ДоговорОПС.Участник;
	#Вставка
	// +ХМНПФ 12.11.2015 ШадринАВ // ЗаполнитьТЧДокумента() // №37
	ХМ_Отказы.Очистить();
	ЗаполнитьТЧОтказы();
	// -ХМНПФ 12.11.2015 ШадринАВ // ЗаполнитьТЧДокумента() // №37
	#КонецВставки
	СоставитьСписокЗаявлений();
	
	//заполнить список заявлений
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_ДолиПравопреемниковСрезПоследних.Доля КАК Доля,
	|	уп_ДолиПравопреемниковСрезПоследних.Заявление КАК Заявление,
	|	уп_ДолиПравопреемниковСрезПоследних.ДоговорОПС КАК ДоговорОПС
	|ПОМЕСТИТЬ Доли
	|ИЗ
	|	РегистрСведений.уп_ДолиПравопреемников.СрезПоследних(
	|			&ДатаДок,
	|			Заявление В (&СписокЗаявлений)
	|				И ДоговорОПС = &ДоговорОПС) КАК уп_ДолиПравопреемниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаявлениеПравопреемникаОВыплатеОПС.Ссылка КАК Ссылка,
	|	ЗаявлениеПравопреемникаОВыплатеОПС.Основание КАК Основание,
	|	ЗаявлениеПравопреемникаОВыплатеОПС.СтепеньРодства КАК СтепеньРодства,
	|	ВЫБОР
	|		КОГДА ЗаявлениеПравопреемникаОВыплатеОПС.Основание = 1
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПоДоговору,
	|	ВЫБОР
	|		КОГДА ЗаявлениеПравопреемникаОВыплатеОПС.СтепеньРодства = 1
	|				ИЛИ ЗаявлениеПравопреемникаОВыплатеОПС.СтепеньРодства = 2
	|				ИЛИ ЗаявлениеПравопреемникаОВыплатеОПС.СтепеньРодства = 3
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПервойОчереди,
	|	ВЫБОР
	|		КОГДА ЗаявлениеПравопреемникаОВыплатеОПС.Основание = 2
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПоЗакону,
	|	ВЫБОР
	|		КОГДА ЗаявлениеПравопреемникаОВыплатеОПС.СтепеньРодства = 4
	|				ИЛИ ЗаявлениеПравопреемникаОВыплатеОПС.СтепеньРодства = 5
	|				ИЛИ ЗаявлениеПравопреемникаОВыплатеОПС.СтепеньРодства = 6
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВторойОчереди,
	|	ЗаявлениеПравопреемникаОВыплатеОПС.Дата КАК Дата,
	|	ЗаявлениеПравопреемникаОВыплатеОПС.ДатаСудебногоРешения КАК ДатаСудебногоРешения,
	|	ЗаявлениеПравопреемникаОВыплатеОПС.ПоРешениюСуда КАК ПоРешениюСуда,
	|	Доли.Доля КАК Доля
	|ИЗ
	|	Документ.уп_ЗаявлениеПравопреемникаОВыплатеОПС КАК ЗаявлениеПравопреемникаОВыплатеОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Доли КАК Доли
	|		ПО ЗаявлениеПравопреемникаОВыплатеОПС.Ссылка = Доли.Заявление
	|ГДЕ
	|	ЗаявлениеПравопреемникаОВыплатеОПС.ДоговорОПС = &ДоговорОПС
	|	И ЗаявлениеПравопреемникаОВыплатеОПС.Проведен = ИСТИНА
	|	И ЗаявлениеПравопреемникаОВыплатеОПС.Ссылка В(&СписокЗаявлений)
	|	И НЕ ЗаявлениеПравопреемникаОВыплатеОПС.Ссылка В
	|				(ВЫБРАТЬ
	|					уп_РешениеОбОтказеВВыплатеСредствПенсионныхНакоплений.Заявление
	|				ИЗ
	|					Документ.уп_РешениеОбОтказеВВыплатеСредствПенсионныхНакоплений КАК уп_РешениеОбОтказеВВыплатеСредствПенсионныхНакоплений
	|				ГДЕ
	|					уп_РешениеОбОтказеВВыплатеСредствПенсионныхНакоплений.Проведен = ИСТИНА)
	|	И ЗаявлениеПравопреемникаОВыплатеОПС.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Основание,
	|	СтепеньРодства
	|ИТОГИ
	|	СУММА(ПоДоговору),
	|	СУММА(ПервойОчереди),
	|	СУММА(ПоЗакону),
	|	СУММА(ВторойОчереди)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокЗаявлений", СписокЗаявлений);
	Запрос.УстановитьПараметр("ДатаДок", Дата);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЕстьПоЗаявлению = Ложь;
	ЕстьПоЗакону = Ложь;
	ЕстьПервойОчереди = Ложь;
	ЕстьВторойОчереди = Ложь;
	ВсегоПоЗаявлению = 0;
	ВсегоПервойОчереди = 0;
	ВсегоВторойОчереди = 0;
	
	Если  Выборка.Следующий() Тогда
		Если Выборка.ПоДоговору>0 Тогда
			ЕстьПоЗаявлению = Истина;
		КонецЕсли;
		Если Выборка.ПоЗакону>0 Тогда
			ЕстьПоЗакону = Истина;
		КонецЕсли;	
		Если Выборка.ПервойОчереди>0 Тогда
			ЕстьПервойОчереди = Истина;
		КонецЕсли;
		Если Выборка.ВторойОчереди>0 Тогда
			ЕстьВторойОчереди = Истина;
		КонецЕсли;
		ВсегоПоЗаявлению = Выборка.ПоДоговору;
		ВсегоПервойОчереди = Выборка.ПервойОчереди;
		ВсегоВторойОчереди = Выборка.ВторойОчереди;
		
		ДатаСрока = ДобавитьМесяц(ДоговорОПС.Участник.уп_ФизЛицо.уп_ДатаСмерти,6);
		
		ВыборкаСтрок =Выборка.Выбрать();
		Пока ВыборкаСтрок.Следующий() Цикл
			НовСтр = Заявления.Добавить();
			НовСтр.Заявление = ВыборкаСтрок.Ссылка;
			НовСтр.Правопреемник = ВыборкаСтрок.Ссылка.Правопреемник;
			//НовСтр.Основание = ВыборкаСтрок.Основание;
			//НовСтр.СтепеньРодства = ВыборкаСтрок.СтепеньРодства;
			Если ЕстьПоЗаявлению = Истина и ВыборкаСтрок.Основание = 1 Тогда
				Если НачалоДня(ВыборкаСтрок.Дата)<=НачалоДня(ДатаСрока)
					или  ВыборкаСтрок.ПоРешениюСуда Тогда
					НовСтр.Разрешить = Истина;
				Иначе
					НовСтр.ПричинаОтказа = 3;
				КонецЕсли;
			ИначеЕсли ЕстьПоЗаявлению = Ложь и 	ЕстьПервойОчереди = Истина 
				и ВыборкаСтрок.СтепеньРодства>0 и ВыборкаСтрок.СтепеньРодства<4 Тогда
				Если НачалоДня(ВыборкаСтрок.Дата)<=НачалоДня(ДатаСрока)
					или  ВыборкаСтрок.ПоРешениюСуда Тогда
					НовСтр.Разрешить = Истина;
				Иначе
					НовСтр.ПричинаОтказа = 3;
				КонецЕсли;
			ИначеЕсли ЕстьПоЗаявлению = Ложь и 	ЕстьПервойОчереди = Ложь и ЕстьВторойОчереди = Истина 
				и ВыборкаСтрок.СтепеньРодства>3 Тогда
				Если НачалоДня(ВыборкаСтрок.Дата)<=НачалоДня(ДатаСрока)
					или  ВыборкаСтрок.ПоРешениюСуда Тогда
					НовСтр.Разрешить = Истина;
				Иначе
					НовСтр.ПричинаОтказа = 3;
				КонецЕсли;
			КонецЕсли;
			НовСтр.Основание=ВыборкаСтрок.Основание;
			НовСтр.СтепеньРодства=ВыборкаСтрок.СтепеньРодства;
			Если ЗначениеЗаполнено(ВыборкаСтрок.Доля) Тогда
				НовСтр.Процент=ВыборкаСтрок.Доля;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
	//Найти заявление
	
	ТекЗаявление = НайтиЗаявление();
	//ds ЗаполнитьТекстПроЗаявление(ТекЗаявление);
	
	//найти сумму на счете
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РезервыОПСОстатки.ДоговорОПС КАК ДоговорОПС,
	               |	СУММА(ВЫБОР
	               |			КОГДА НЕ РезервыОПСОстатки.ТипСуммы В (&МатКапитал)
	               |				ТОГДА РезервыОПСОстатки.СуммаОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК СуммаОстаток,
	               |	СУММА(ВЫБОР
	               |			КОГДА РезервыОПСОстатки.ТипСуммы В (&МатКапитал)
	               |					И РезервыОПСОстатки.ТипРезерва В (&Накопительный)
	               |				ТОГДА РезервыОПСОстатки.СуммаОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК МатеринскийКапитал,
	               |	СУММА(ВЫБОР
	               |			КОГДА РезервыОПСОстатки.ТипСуммы В (&МатКапитал)
	               |					И РезервыОПСОстатки.ТипРезерва В (&СрочныхВыплат)
	               |				ТОГДА РезервыОПСОстатки.СуммаОстаток
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК МатеринскийКапиталВыплатной
	               |ИЗ
	               |	РегистрНакопления.уп_РезервыОПС.Остатки(
	               |			&ДатаДок,
	               |			Организация = &Организация
	               |				И ДоговорОПС = &ДоговорОПС
	               |				И (ТипРезерва В (&СрочныхВыплат)
	               |					ИЛИ ТипРезерва В (&Накопительный))) КАК РезервыОПСОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РезервыОПСОстатки.ДоговорОПС";
	
	Запрос.УстановитьПараметр("ДатаДок", Дата-1);
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	Запрос.УстановитьПараметр("Организация", Организация);
	Накопительный = Новый СписокЗначений;
	Накопительный.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	Накопительный.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН);
	Накопительный.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервЕВ);
	Запрос.УстановитьПараметр("Накопительный", Накопительный);
	СрочныхВыплат = Новый СписокЗначений;
	СрочныхВыплат.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты);
	СрочныхВыплат.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ);
	Запрос.УстановитьПараметр("СрочныхВыплат", СрочныхВыплат);
	
	
	СМК = Новый СписокЗначений;
	СМК.Добавить(Справочники.уп_ТипыСуммОПС.МатКапитал);
	СМК.Добавить(Справочники.уп_ТипыСуммОПС.ИДМатКапитал);
	
	Запрос.УстановитьПараметр("МатКапитал", СМК);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СуммаНаСчете = Выборка.СуммаОстаток;
		СуммаМатКапитала = Выборка.МатеринскийКапитал;
		СуммаМатКапиталаНаСчетеСрочныхВыплат = Выборка.МатеринскийКапиталВыплатной;
	Иначе
		СуммаНаСчете = 0;
		СуммаМатКапитала = 0;
		СуммаМатКапиталаНаСчетеСрочныхВыплат = 0;
	КонецЕсли;
	
	ТекСумма            = Строка(СуммаНаСчете) + " руб.";
	ТекСуммаМК          = Строка(СуммаМатКапитала) + " руб.";
	ТекСуммаМКВыплатной = Строка(СуммаМатКапиталаНаСчетеСрочныхВыплат) + " руб.";
	
	//остаток в резерве ОПС
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РезервыОПСОстатки.ДоговорОПС КАК ДоговорОПС,
	               |	СУММА(РезервыОПСОстатки.СуммаОстаток) КАК ОстатокВРезервеОПС
	               |ИЗ
	               |	РегистрНакопления.уп_РезервыОПС.Остатки(
	               |			&ДатаДок,
	               |			Организация = &Организация
	               |				И ДоговорОПС = &ДоговорОПС
	               |				И ТипРезерва = &РезервОПС) КАК РезервыОПСОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РезервыОПСОстатки.ДоговорОПС";
	Запрос.УстановитьПараметр("ДатаДок", Дата-1);
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("РезервОПС", Перечисления.уп_ТипыРезервовОПС.РезервОПС);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СуммаВРезервеОПС = Выборка.ОстатокВРезервеОПС;
	Иначе
		СуммаВРезервеОПС = 0;
	КонецЕсли;
	ТекСуммаВРезервеОПС            = Строка(СуммаВРезервеОПС) + " руб.";
	
	//для создания функции
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("ТекСумма", ТекСумма);
	Соответствие.Вставить("ТекСуммаМК", ТекСуммаМК);
	Соответствие.Вставить("ТекСуммаМКВыплатной", ТекСуммаМКВыплатной);
	Соответствие.Вставить("ТекСуммаВРезервеОПС", ТекСуммаВРезервеОПС);
	
	//Заполнить табличную часть Расшифровка суммы
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	уп_ТекущаяСуммаГарантированияОстатки.ТипСуммы КАК ТипСуммы,
	               |	уп_ТекущаяСуммаГарантированияОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	&РПН КАК ТипРезерва
	               |ПОМЕСТИТЬ Гарантирование
	               |ИЗ
	               |	РегистрНакопления.уп_ТекущаяСуммаГарантирования.Остатки(
	               |			&ДатаДок,
	               |			Организация = &Организация
	               |				И ДоговорОПС = &ДоговорОПС) КАК уп_ТекущаяСуммаГарантированияОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	уп_РезервыОПСОстатки.ТипСуммы КАК ТипСуммы,
	               |	уп_РезервыОПСОстатки.СуммаОстаток КАК СуммаОстаток,
	               |	уп_РезервыОПСОстатки.ТипРезерва КАК ТипРезерва,
	               |	уп_РезервыОПСОстатки.СуммаКомпенсацииОстаток КАК СуммаКомпенсации,
	               |	уп_РезервыОПСОстатки.СуммаВосполненияОстаток КАК СуммаВосполнения,
	               |	уп_РезервыОПСОстатки.СуммаВозмещенияОстаток КАК СуммаВозмещения
	               |ПОМЕСТИТЬ ОстаткиВРезерве
	               |ИЗ
	               |	РегистрНакопления.уп_РезервыОПС.Остатки(
	               |			&ДатаДок,
	               |			Организация = &Организация
	               |				И ДоговорОПС = &ДоговорОПС
	               |				И (ТипРезерва В (&СрочныхВыплат)
	               |					ИЛИ ТипРезерва В (&Накопительный))) КАК уп_РезервыОПСОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ОстаткиВРезерве.ТипСуммы, Гарантирование.ТипСуммы) КАК ТипСуммы,
	               |	ОстаткиВРезерве.СуммаОстаток КАК СуммаОстаток,
	               |	ЕСТЬNULL(ОстаткиВРезерве.ТипРезерва, Гарантирование.ТипРезерва) КАК ТипРезерва,
	               |	Гарантирование.СуммаОстаток КАК СуммаГарантированная,
	               |	ОстаткиВРезерве.СуммаКомпенсации КАК СуммаКомпенсации,
	               |	ОстаткиВРезерве.СуммаВосполнения КАК СуммаВосполнения,
	               |	ОстаткиВРезерве.СуммаВозмещения КАК СуммаВозмещения
	               |ПОМЕСТИТЬ Остатки
	               |ИЗ
	               |	ОстаткиВРезерве КАК ОстаткиВРезерве
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Гарантирование КАК Гарантирование
	               |		ПО ОстаткиВРезерве.ТипРезерва = Гарантирование.ТипРезерва
	               |			И ОстаткиВРезерве.ТипСуммы = Гарантирование.ТипСуммы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Остатки.ТипСуммы КАК ТипСуммы,
	               |	Остатки.СуммаОстаток КАК СуммаОстаток,
	               |	Остатки.ТипРезерва КАК ТипРезерва,
	               |	Остатки.СуммаКомпенсации КАК СуммаКомпенсации,
	               |	Остатки.СуммаВосполнения КАК СуммаВосполнения,
	               |	Остатки.СуммаВозмещения КАК СуммаВозмещения,
	               |	Остатки.СуммаГарантированная КАК СуммаГарантированная
	               |ИЗ
	               |	Остатки КАК Остатки";
	
	Запрос.УстановитьПараметр("ДатаДок", Дата-1);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	Накопительный = Новый СписокЗначений;
	Накопительный.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	Накопительный.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН);
	Накопительный.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервЕВ);
	Запрос.УстановитьПараметр("Накопительный", Накопительный);
	СрочныхВыплат = Новый СписокЗначений;
	СрочныхВыплат.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты);
	СрочныхВыплат.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ);
	Запрос.УстановитьПараметр("СрочныхВыплат", СрочныхВыплат);
	
	ДатаНачалаВеденияРезерваНаследников = Константы.уп_ДатаНачалаВеденияРезерваНаследников.Получить();
	Если ЗначениеЗаполнено(ДатаНачалаВеденияРезерваНаследников) И Дата>=ДатаНачалаВеденияРезерваНаследников Тогда
		Запрос.УстановитьПараметр("РПН",Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН);
	Иначе
		Запрос.УстановитьПараметр("РПН",Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	КонецЕсли;	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.СуммаОстаток<>0 Тогда
			НовСтрРасшифровки = РасшифровкаСуммы.Добавить();
			НовСтрРасшифровки.ДоговорОПС = ДоговорОПС;
			НовСтрРасшифровки.ТипРезерва = Выборка.ТипРезерва;
			НовСтрРасшифровки.ТипСуммы = Выборка.ТипСуммы;
			НовСтрРасшифровки.Сумма = Выборка.СуммаОстаток;
			НовСтрРасшифровки.СуммаГарантированная = Выборка.СуммаГарантированная;
			НовСтрРасшифровки.СуммаКомпенсации = Выборка.СуммаКомпенсации;
			НовСтрРасшифровки.СуммаВосполнения = Выборка.СуммаВосполнения;
			НовСтрРасшифровки.СуммаВозмещения = Выборка.СуммаВозмещения;
		КонецЕсли;
	КонецЦикла;
	
	//bardoshina+
	//итоговая сумма вместе с выплаченным правопреемникам
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уп_ПрочиеНачисленияОПСОбороты.Участник КАК Правопреемник,
		|	уп_ПрочиеНачисленияОПСОбороты.СуммаПриход КАК Сумма
		|ИЗ
		|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
		|			,
		|			&ДатаДок,
		|			,
		|			Организация = &Организация
		|				И ДоговорОПС = &ДоговорОПС
		|				И ТипВыплаты = ЗНАЧЕНИЕ(Перечисление.уп_ТипыВыплат.ВыплатыНаследникамОПС)) КАК уп_ПрочиеНачисленияОПСОбороты";

	Запрос.УстановитьПараметр("ДатаДок", Дата-1);
	Запрос.УстановитьПараметр("Организация", Организация);
    Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
    ВыплаченныеСуммы = Запрос.Выполнить().Выгрузить();
	#Удаление
	СуммаИтого = СуммаНаСчете + ВыплаченныеСуммы.Итог("Сумма");
	#КонецУдаления
	#Вставка
	// +ХМНПФ 21.04.2016 ШадринАВ // ЗаполнитьТЧДокумента() // №325
	ХМ_ПеречисленоВРОПС = ХМ_ПолучитьСуммуПеречисленийВРОПС();
	СуммаИтого = СуммаНаСчете + ВыплаченныеСуммы.Итог("Сумма") + ХМ_ПеречисленоВРОПС;
	// -ХМНПФ 21.04.2016 ШадринАВ // ЗаполнитьТЧДокумента() // №325
	#КонецВставки
	//bardoshina-

	//распределить суммы
	//если есть заявление, то в соответствии с указанными в нем процентами
	//если проценты не указаны то поровну
	Распределено = 0;
	Если ТекЗаявление<>Неопределено Тогда
		ПравопреемникиПоЗаявлению = ТекЗаявление.Правопреемники.Выгрузить();
		ПравопреемникиВБазе = ЭтотОбъект.Заявления.ВыгрузитьКолонку("Правопреемник");
		//поиск соответствия по ФИО и дате рождения
		СоответствиеПравопреемникуПоЗаявлению(ПравопреемникиПоЗаявлению, ПравопреемникиВБазе, 4, ВсегоПоЗаявлению, Распределено, ВыплаченныеСуммы);		
		Если ПравопреемникиВБазе.Количество() > 0 И ПравопреемникиПоЗаявлению.Количество() > 0 Тогда
			//поиск по имени, отчеству и дате рождения
			СоответствиеПравопреемникуПоЗаявлению(ПравопреемникиПоЗаявлению, ПравопреемникиВБазе, 3, ВсегоПоЗаявлению, Распределено, ВыплаченныеСуммы);
		КонецЕсли;
		Если ПравопреемникиВБазе.Количество() > 0 И ПравопреемникиПоЗаявлению.Количество() > 0 Тогда
			//поиск по фамилии, имени и отчеству 
			СоответствиеПравопреемникуПоЗаявлению(ПравопреемникиПоЗаявлению, ПравопреемникиВБазе, 3.5, ВсегоПоЗаявлению, Распределено, ВыплаченныеСуммы);
		КонецЕсли;
		Если ПравопреемникиВБазе.Количество() > 0 И ПравопреемникиПоЗаявлению.Количество() > 0 Тогда
			//поиск по имени и отчеству
			СоответствиеПравопреемникуПоЗаявлению(ПравопреемникиПоЗаявлению, ПравопреемникиВБазе, 2, ВсегоПоЗаявлению, Распределено, ВыплаченныеСуммы);
		КонецЕсли;	
		Если ПравопреемникиПоЗаявлению.Количество() = 1 И ПравопреемникиВБазе.Количество() = 1 Тогда
			текСтр = ЭтотОбъект.Заявления.Найти(ПравопреемникиВБазе[0],"Правопреемник");
			Если ВыплаченныеСуммы.Количество() > 0 И ВыплаченныеСуммы.Найти(ПравопреемникиВБазе[0], "Правопреемник")<> Неопределено Тогда
				СуммаВыплачено = ВыплаченныеСуммы.Найти(ПравопреемникиВБазе[0], "Правопреемник").Сумма; 
			Иначе
				СуммаВыплачено = 0;
			КонецЕсли;
			Если ПравопреемникиПоЗаявлению[0].Доля = 0 Тогда  //поровну
				Если ВсегоПоЗаявлению<>0 Тогда
					текСтр.Процент = 100/ВсегоПоЗаявлению;
				Иначе
					текСтр.Процент = 100;
				КонецЕсли;	
			Иначе
				текСтр.Процент = ПравопреемникиПоЗаявлению[0].Доля;
			КонецЕсли;
			текСтр.СуммаВыплачено = СуммаВыплачено;
			#Удаление
			СуммаВыплатыИтого = Окр(текСтр.Процент/100*СуммаИтого,2,РежимОкругления.Окр15как10); 
			#КонецУдаления
			#Вставка
			// +ХМНПФ 21.04.2016 ШадринАВ // ЗаполнитьТЧДокумента() // №325
			ХМ_ДоляОтказавшихся = ХМ_ПолучитьДолюОтказавшихся(ПравопреемникиПоЗаявлению);
			СуммаВыплатыИтого = Цел(текСтр.Процент / (100 - ХМ_ДоляОтказавшихся) * 100 * СуммаИтого) / 100;
			// -ХМНПФ 21.04.2016 ШадринАВ // ЗаполнитьТЧДокумента() // №325
			#КонецВставки
			текСтр.СуммаВыплатыИтого = СуммаВыплатыИтого;
			СуммаКВыплате = СуммаВыплатыИтого-СуммаВыплачено;
			Если СуммаКВыплате < 0 Тогда 
				текСтр.Сумма = 0;
				СообщениеОбОшибке = "Отрицательная сумма к выплате по правопреемнику " + ПравопреемникиВБазе[0].Наименование + " (договор "+СокрЛП(ДоговорОПС.Наименование)+").";
				Сообщить(СообщениеОбОшибке, СтатусСообщения.Важное);
			Иначе
				текСтр.Сумма = СуммаКВыплате;
			КонецЕсли;	
			Если (Распределено+текСтр.Сумма)>СуммаНаСчете Тогда
				текСтр.Сумма = СуммаНаСчете - Распределено;
			КонецЕсли;	
			Распределено = Распределено+текСтр.Сумма;
			Сообщить("Данные правопреемника " + ПравопреемникиВБазе[0]+ " не совпадают с данными в заявлении о наличии правопреемников"+ " (договор "+СокрЛП(ДоговорОПС.Наименование)+").");
		Иначе
			Если ПравопреемникиВБазе.Количество() > 0 Тогда
				Всего = ВсегоПоЗаявлению;
				Если Всего = 0 Тогда
					Всего = ВсегоПервойОчереди;
				КонецЕсли;
				Если Всего = 0 Тогда
					Всего = ВсегоВторойОчереди;
				КонецЕсли;	
				Для каждого стрПравопреемник Из ПравопреемникиВБазе Цикл
					текСтр = ЭтотОбъект.Заявления.Найти(стрПравопреемник,"Правопреемник");
					Если ВыплаченныеСуммы.Количество() > 0 И ВыплаченныеСуммы.Найти(стрПравопреемник, "Правопреемник")<> Неопределено Тогда
						СуммаВыплачено = ВыплаченныеСуммы.Найти(стрПравопреемник, "Правопреемник").Сумма; 
					Иначе
						СуммаВыплачено = 0;
					КонецЕсли;
					текСтр.Процент = 100/Всего;
					текСтр.СуммаВыплачено = СуммаВыплачено;
					#Удаление
					СуммаВыплатыИтого = Окр(текСтр.Процент/100*СуммаИтого,2,РежимОкругления.Окр15как10); 
					#КонецУдаления
					#Вставка
					// +ХМНПФ 21.04.2016 ШадринАВ // ЗаполнитьТЧДокумента() // №325
					ХМ_ДоляОтказавшихся = ХМ_ПолучитьДолюОтказавшихся(ПравопреемникиПоЗаявлению);
					СуммаВыплатыИтого = Цел(текСтр.Процент / (100 - ХМ_ДоляОтказавшихся) * 100 * СуммаИтого) / 100;
					// -ХМНПФ 21.04.2016 ШадринАВ // ЗаполнитьТЧДокумента() // №325
					#КонецВставки
					текСтр.СуммаВыплатыИтого = СуммаВыплатыИтого;
					СуммаКВыплате = СуммаВыплатыИтого-СуммаВыплачено;
					Если СуммаКВыплате < 0 Тогда 
						текСтр.Сумма = 0;
						СообщениеОбОшибке = "Отрицательная сумма к выплате по правопреемнику " + стрПравопреемник.Наименование + " (договор "+СокрЛП(ДоговорОПС.Наименование)+").";
						Сообщить(СообщениеОбОшибке, СтатусСообщения.Важное);
					Иначе
						текСтр.Сумма = СуммаКВыплате;
					КонецЕсли;	
					Если (Распределено+текСтр.Сумма)>СуммаНаСчете Тогда
						текСтр.Сумма = СуммаНаСчете - Распределено;
					КонецЕсли;	
					Распределено = Распределено+текСтр.Сумма;
					Сообщить("Данные правопреемника " + стрПравопреемник + " не совпадают с данными в заявлении о наличии правопреемников, доля определена пропорционально"+ " (договор "+СокрЛП(ДоговорОПС.Наименование)+").");
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//если нет заявления по между первой очередью
	Если ТекЗаявление = Неопределено и ВсегоПервойОчереди>0 Тогда
		Доли = ОпределитьПроцент(ЭтотОбъект.Заявления, "ПерваяОчередь", ВсегоПервойОчереди, ДоговорОПС);
		Для каждого текСтр из ЭтотОбъект.Заявления Цикл
			#Удаление
			Если текСтр.Заявление.СтепеньРодства>0 и текСтр.Заявление.СтепеньРодства<4 Тогда
			#КонецУдаления
			#Вставка
			// +ХМНПФ 21.04.2016 ШадринАВ // ЗаполнитьТЧДокумента() // №325
			Если текСтр.Заявление.СтепеньРодства>0 и текСтр.Заявление.СтепеньРодства<4 и текСтр.Разрешить Тогда
			// -ХМНПФ 21.04.2016 ШадринАВ // ЗаполнитьТЧДокумента() // №325
			#КонецВставки
				Если ВыплаченныеСуммы.Количество() > 0 И ВыплаченныеСуммы.Найти(текСтр.Правопреемник, "Правопреемник")<> Неопределено Тогда
					СуммаВыплачено = ВыплаченныеСуммы.Найти(текСтр.Правопреемник, "Правопреемник").Сумма; 
				Иначе
					СуммаВыплачено = 0;
				КонецЕсли;
				текСтр.Процент = Доли.Найти(текСтр.Заявление,"Заявление").Доля;
				текСтр.СуммаВыплачено = СуммаВыплачено;
				#Удаление
				СуммаВыплатыИтого = Окр(текСтр.Процент/100*СуммаИтого,2,РежимОкругления.Окр15как10);
				#КонецУдаления
				#Вставка
				// +ХМНПФ 21.04.2016 ШадринАВ // ЗаполнитьТЧДокумента() // №325
				СуммаВыплатыИтого = Цел(текСтр.Процент*СуммаИтого)/100;
				// -ХМНПФ 21.04.2016 ШадринАВ // ЗаполнитьТЧДокумента() // №325
				#КонецВставки
				текСтр.СуммаВыплатыИтого = СуммаВыплатыИтого;
				СуммаКВыплате = СуммаВыплатыИтого-СуммаВыплачено;
				Если СуммаКВыплате < 0 Тогда 
					текСтр.Сумма = 0;
					СообщениеОбОшибке = "Отрицательная сумма к выплате по правопреемнику " + текСтр.Правопреемник.Наименование + " (договор "+СокрЛП(ДоговорОПС.Наименование)+").";
					Сообщить(СообщениеОбОшибке, СтатусСообщения.Важное);
				Иначе
					текСтр.Сумма = СуммаКВыплате;
				КонецЕсли;	 
				Если (Распределено+текСтр.Сумма)>СуммаНаСчете Тогда
					текСтр.Сумма = СуммаНаСчете - Распределено;
				КонецЕсли;
				Распределено = Распределено+текСтр.Сумма;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	//если нет и первой очереди, то межлу второй
	Если ТекЗаявление = Неопределено и ВсегоПервойОчереди=0 и ВсегоВторойОчереди>0 Тогда
		Доли = ОпределитьПроцент(ЭтотОбъект.Заявления, "ВтораяОчередь", ВсегоВторойОчереди, ДоговорОПС);
		Для каждого текСтр из ЭтотОбъект.Заявления Цикл
			Если текСтр.Заявление.СтепеньРодства>3 Тогда
				Если ВыплаченныеСуммы.Количество() > 0 И ВыплаченныеСуммы.Найти(текСтр.Правопреемник, "Правопреемник")<> Неопределено Тогда
					СуммаВыплачено = ВыплаченныеСуммы.Найти(текСтр.Правопреемник, "Правопреемник").Сумма; 
				Иначе
					СуммаВыплачено = 0;
				КонецЕсли;
				текСтр.Процент = Доли.Найти(текСтр.Заявление,"Заявление").Доля;
				текСтр.СуммаВыплачено = СуммаВыплачено;
				#Удаление
				СуммаВыплатыИтого = Окр(текСтр.Процент/100*СуммаИтого,2,РежимОкругления.Окр15как10);
				#КонецУдаления
				#Вставка
				// +ХМНПФ 21.04.2016 ШадринАВ // ЗаполнитьТЧДокумента() // №325
				СуммаВыплатыИтого = Цел(текСтр.Процент*СуммаИтого)/100;
				// -ХМНПФ 21.04.2016 ШадринАВ // ЗаполнитьТЧДокумента() // №325
				#КонецВставки
				текСтр.СуммаВыплатыИтого = СуммаВыплатыИтого;
				СуммаКВыплате = СуммаВыплатыИтого-СуммаВыплачено;
				Если СуммаКВыплате < 0 Тогда 
					текСтр.Сумма = 0;
					СообщениеОбОшибке = "Отрицательная сумма к выплате по правопреемнику " + текСтр.Правопреемник.Наименование + " (договор "+СокрЛП(ДоговорОПС.Наименование)+").";
					Сообщить(СообщениеОбОшибке, СтатусСообщения.Важное);
				Иначе
					текСтр.Сумма = СуммаКВыплате;
				КонецЕсли;	
				Если (Распределено+текСтр.Сумма)>СуммаНаСчете Тогда
					текСтр.Сумма = СуммаНаСчете - Распределено;
				КонецЕсли;
				Распределено = Распределено+текСтр.Сумма;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	
	//bardoshina +
	Если ТекЗаявление = Неопределено и ВсегоПервойОчереди=0 и ВсегоВторойОчереди=0 И ВсегоПоЗаявлению>0 Тогда
		Доли = ОпределитьПроцент(ЭтотОбъект.Заявления, "Разрешить", ВсегоПоЗаявлению, ДоговорОПС);
		Для каждого текСтр из ЭтотОбъект.Заявления Цикл
			Если текСтр.Разрешить Тогда
				Если ВыплаченныеСуммы.Количество() > 0 И ВыплаченныеСуммы.Найти(текСтр.Правопреемник, "Правопреемник")<> Неопределено Тогда
					СуммаВыплачено = ВыплаченныеСуммы.Найти(текСтр.Правопреемник, "Правопреемник").Сумма; 
				Иначе
					СуммаВыплачено = 0;
				КонецЕсли;
				текСтр.Процент = Доли.Найти(текСтр.Заявление,"Заявление").Доля;
				текСтр.СуммаВыплачено = СуммаВыплачено;
				#Удаление
				СуммаВыплатыИтого = Окр(текСтр.Процент/100*СуммаИтого,2,РежимОкругления.Окр15как10);
				#КонецУдаления
				#Вставка
				// +ХМНПФ 21.04.2016 ШадринАВ // ЗаполнитьТЧДокумента() // №325
				СуммаВыплатыИтого = Цел(текСтр.Процент*СуммаИтого)/100;
				// -ХМНПФ 21.04.2016 ШадринАВ // ЗаполнитьТЧДокумента() // №325
				#КонецВставки
				текСтр.СуммаВыплатыИтого = СуммаВыплатыИтого;
				СуммаКВыплате = СуммаВыплатыИтого-СуммаВыплачено;
				Если СуммаКВыплате < 0 Тогда 
					текСтр.Сумма = 0;
					СообщениеОбОшибке = "Отрицательная сумма к выплате по правопреемнику " + текСтр.Правопреемник.Наименование + " (договор "+СокрЛП(ДоговорОПС.Наименование)+").";
					Сообщить(СообщениеОбОшибке, СтатусСообщения.Важное);
				Иначе
					текСтр.Сумма = СуммаКВыплате;
				КонецЕсли;	
				Если (Распределено+текСтр.Сумма)>СуммаНаСчете Тогда
					текСтр.Сумма = СуммаНаСчете - Распределено;
				КонецЕсли;
				Распределено = Распределено+текСтр.Сумма;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	Если ЭтотОбъект.Заявления.Итог("Сумма") < СуммаНаСчете И ЭтотОбъект.Заявления.Количество() > 0 И Окр(Заявления.Итог("Процент")) = 100 Тогда
		Распределено = 0;
		Разница = СуммаНаСчете - ЭтотОбъект.Заявления.Итог("Сумма");
		Дораспределить = Окр(Разница/ЭтотОбъект.Заявления.Количество(),2,РежимОкругления.Окр15как10);
		
		Пока Дораспределить*ЭтотОбъект.Заявления.Количество()> Разница Цикл
			Дораспределить = Дораспределить-0.01;
		КонецЦикла;
		
		Для каждого текСтр Из ЭтотОбъект.Заявления Цикл
			Если текСтр.Разрешить Тогда
				текСтр.Сумма = текСтр.Сумма + Дораспределить;
				//Если текСтр = ЭтотОбъект.Заявления[ЭтотОбъект.Заявления.Количество()-1] Тогда
				//	текСтр.Сумма = СуммаНаСчете - Распределено;
				//КонецЕсли;
				Распределено = Распределено+текСтр.Сумма;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	//bardoshina -
	Если СуммаНаСчете<0 Тогда  //обнулим все распределение
		Для каждого текСтр Из ЭтотОбъект.Заявления Цикл
			текСтр.Сумма = 0;
		КонецЦикла;	
	КонецЕсли;	
	#Вставка
	// +ХМНПФ 20.11.2015 ШадринАВ // ЗаполнитьТЧДокумента() // №45
	ХМ_КорректироватьРаспределение(Распределено);
	// -ХМНПФ 20.11.2015 ШадринАВ // ЗаполнитьТЧДокумента() // №45
	#КонецВставки
	
	Остаток = СуммаНаСчете-Распределено;
	//если нет и второй, а это уже дополнительная выплата, то в ПФР
	
	//заполним правопреемников по п.3.1
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	уп_ЗаявлениеПравопреемникаОВыплатеОПС.Ссылка,
				   |	уп_ЗаявлениеПравопреемникаОВыплатеОПС.Правопреемник
				   |ИЗ
				   |	Документ.уп_ЗаявлениеПравопреемникаОВыплатеОПС КАК уп_ЗаявлениеПравопреемникаОВыплатеОПС
				   |ГДЕ
				   |	уп_ЗаявлениеПравопреемникаОВыплатеОПС.Ссылка В(&СписокЗаявлений)
				   |	И уп_ЗаявлениеПравопреемникаОВыплатеОПС.Проведен = ИСТИНА
				   |	И уп_ЗаявлениеПравопреемникаОВыплатеОПС.Правопреемник31 = ИСТИНА
				   |	И уп_ЗаявлениеПравопреемникаОВыплатеОПС.ДоговорОПС = &ДоговорОПС";
	
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	Запрос.УстановитьПараметр("СписокЗаявлений", СписокЗаявлений);
	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	КолПравопреемниковПоП31 = Выборка.Количество();
	Если КолПравопреемниковПоП31>0 Тогда
		СуммаПравопреемнику = Окр(СуммаМатКапиталаНаСчетеСрочныхВыплат/КолПравопреемниковПоП31,2,РежимОкругления.Окр15как10); 
		Распределено = 0;
		Пока Выборка.Следующий() Цикл
			НовСтр = Правопреемники31.Добавить();
			НовСтр.Заявление = Выборка.Ссылка;
			НовСтр.Правопреемник = Выборка.Правопреемник;
			НовСтр.Процент = 1/КолПравопреемниковПоП31*100;
			НовСтр.Разрешить = Истина;
			НовСтр.СуммаМК = СуммаПравопреемнику;
			Распределено = Распределено+СуммаПравопреемнику;
			Если Распределено>СуммаМатКапиталаНаСчетеСрочныхВыплат Тогда
				НовСтр.СуммаМК = СуммаМатКапиталаНаСчетеСрочныхВыплат-Распределено;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	ОснованиеПередачиСредств = 0;
	
	Возврат Соответствие;
КонецФункции

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура РасшОбщ_ОбработкаПроведения(Отказ, Режим)
	//Заголовок = Строка(ЭтотОбъект);
		
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки
	Если уп_ОсновнаяПоставкаСервер.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект,Ложь) Тогда
		Возврат
	КонецЕсли;

	//СостояниеДоговора = РегистрыСведений.уп_СостоянияДоговораОПС.ПолучитьПоследнее(Дата-1,Новый Структура("ДоговорОПС",ДоговорОПС)).Состояние;
	СостояниеДоговора = РегистрыСведений.уп_СостоянияДоговораОПС.ПолучитьПоследнее(МоментВремени(),Новый Структура("ДоговорОПС",ДоговорОПС)).Состояние;
	
	Если СостояниеДоговора <> Перечисления.уп_СостоянияДоговоровОПС.Закрыт и СостояниеДоговора <> Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию Тогда
		уп_ОсновнаяПоставкаСервер.ОшибкаПриПроведении("Не введен документ закрытия договора.", Отказ, Заголовок);
	Конецесли;
	ПричинаЗакрытия = РегистрыСведений.уп_ПричиныЗакрытияДоговоровОПС.ПолучитьПоследнее(Дата,Новый Структура("ДоговорОПС", ДоговорОПС)).ПричинаЗакрытия;
	Если ПричинаЗакрытия<>Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти Тогда
		уп_ОсновнаяПоставкаСервер.ОшибкаПриПроведении("Причиной закрытия счета не является смерть застрахованного лица.", Отказ, Заголовок);
	КонецЕсли;	
	
	ТабБухУчет = уп_ОбщегоНазначенияУчетРезервов.СформироватьСтруктуруТаблицыБУ();
	
	ПенсионныеПравила =  РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
	ПроводкиПоНачислению = ПенсионныеПравила.ПроводкиПоНачислению;
	//СчитаемНДФЛ = ПенсионныеПравила.НДФЛПравопреемниковОПС;
	СчитаемНДФЛ = Ложь;
	ПереводВРезервОПСОтдельнымДокументом = ПенсионныеПравила.ПереводВРезервОПСОтдельнымДокументом; 
	
	ОпределитьКодДохода();
	
	Если (НЕ ЗначениеЗаполнено(КодДохода)) И СчитаемНДФЛ Тогда
		Отказ = Истина;
		Сообщить("Не заполнен код дохода по НДФЛ для правопреемников застрахованных лиц в плане видов характеристик ""Основные начисления организации"".");
	КонецЕсли;
	
	// Проверим на присутствие заявлений правоприемников к этому договору 
	
	ЗапросПоЗаявлениям = Новый Запрос;
	
	ЗапросПоЗаявлениям.Текст = "ВЫБРАТЬ
	                           |	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление КАК Заявление
	                           |ИЗ
	                           |	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления
	                           |ГДЕ
	                           |	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка = &Ссылка
	                           |
	                           |ОБЪЕДИНИТЬ ВСЕ
	                           |
	                           |ВЫБРАТЬ
	                           |	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление
	                           |ИЗ
	                           |	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Правопреемники31 КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31
	                           |ГДЕ
	                           |	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка = &Ссылка";
	ЗапросПоЗаявлениям.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Если  ЗапросПоЗаявлениям.Выполнить().Пустой() Тогда
		
		//Отказ = Истина;
		
		Сообщить("Нет заявлений правоприемников к данному договору!!!");		
		
	КонецЕсли; 	
	
	СтарыйАлгоритм = ?(РасшифровкаСуммы.Количество()=0 И СуммаНаСчете = 0 И СуммаВРезервеОПС = 0, ИСТИНА, ЛОЖЬ);
	
	//писать с регистра резервов
	ТаблицаСписания = ПолучитьОстатки();
	ТаблицаМатКапитала = ПолучитьМатКапитал();
	ТаблицаМатКапиталаСВ = ПолучитьМатКапиталВыплатной();
	
	ИтогПоТаблице = ТаблицаСписания.Итог("Сумма");
	ИтогПоМатКапиталу = ТаблицаМатКапитала.Итог("Сумма");
	ИтогПоМатКапиталуСВ = ТаблицаМатКапиталаСВ.Итог("Сумма");
	
	СуммаНаследникам = 0;
	СуммаМКНаследникам = 0;
	Для каждого стр из Заявления Цикл
		Если стр.Разрешить Тогда
			СуммаНаследникам = СуммаНаследникам+стр.Сумма;
		КонецЕсли;
	КонецЦикла;
	Для Каждого стр из Правопреемники31 Цикл
		Если стр.Разрешить Тогда
			СуммаМКНаследникам = СуммаМКНаследникам+стр.СуммаМК;
		КонецЕсли;	
	КонецЦикла;	
	Если ДополнительнаяВыплата или ОснованиеПередачиСредств > 0 Тогда
		СуммаКСписанию = СуммаНаСчете;
		//СуммаВПФР = СуммаНаСчете-Заявления.Итог("Сумма");
		СуммаВПФР = СуммаНаСчете-СуммаНаследникам;
	Иначе
		//СуммаКСписанию = Заявления.Итог("Сумма");
		СуммаКСписанию = СуммаНаследникам;
		СуммаВПФР = 0;
	КонецЕсли;
	Если ДополнительнаяВыплата Тогда
		СуммаМКВПФР = СуммаМатКапиталаНаСчетеСрочныхВыплат - СуммаМКНаследникам;
	Иначе
		СуммаМКВПФР = 0;
	КонецЕсли;	
	ДатаНачалаУчетаРезервовНачисления = Константы.уп_ДатаНачалаВеденияРезервовНачисления.Получить();
	ДатаНачалаУчетаПППоТипамСумм = Константы.уп_ДатаНачалаУчетаПравопреемниковПоТипамСумм.Получить();
	Если СтарыйАлгоритм Тогда
		Если ИтогПоТаблице<>СуммаНаСчете Тогда
			уп_ОсновнаяПоставкаСервер.ОшибкаПриПроведении("Необходимо рассчитать документ: Сумма остатка на счете не соответствует сумме, записанной в документе.", Отказ, Заголовок);
		КонецЕсли;	
		Если ИтогПоТаблице<Заявления.Итог("Сумма") Тогда
			уп_ОсновнаяПоставкаСервер.ОшибкаПриПроведении("Сумма остатка на счете не соответствует сумме, распределенной в документе.", Отказ, Заголовок);
		КонецЕсли;
		Если ИтогПоМатКапиталу<>СуммаМатКапитала Тогда
			уп_ОсновнаяПоставкаСервер.ОшибкаПриПроведении("Необходимо рассчитать документ: Сумма материнского капитала на счете не соответствует сумме, записанной в документе.", Отказ, Заголовок);
		КонецЕсли;
		СуммаОсталосьСписать = СуммаКСписанию;
		Для Каждого стр из ТаблицаСписания Цикл
			ТекСуммаКСписанию = Мин(СуммаОсталосьСписать,стр.Сумма);
			Движение = Движения.уп_РезервыОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ДатаВыплаты;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.Организация = Организация;
			Движение.ТипРезерва = стр.ТипРезерва;
			Движение.ТипСуммы = стр.ТипСуммы;
			Движение.Сумма = ТекСуммаКСписанию;
			СуммаОсталосьСписать = СуммаОсталосьСписать-ТекСуммаКСписанию;
		КонецЦикла;
		
		Для Каждого стр из ТаблицаМатКапитала Цикл
			Движение = Движения.уп_РезервыОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ДатаВыплаты;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.Организация = Организация;
			Движение.ТипРезерва = стр.ТипРезерва;
			Движение.ТипСуммы = стр.ТипСуммы;
			Движение.Сумма = стр.Сумма;
			
			Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ДатаВыплаты;
			Движение.Организация = Организация;
			Движение.Участник = ПенсионныйФондРФ;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапитала;
			Движение.ТипРезерва = стр.ТипРезерва;
			Движение.ТипСуммы = стр.ТипСуммы;
			Движение.Сумма = стр.Сумма;
			Если ИспользоватьАналитикуРешение Тогда
				Движение.Решение = Ссылка;
			КонецЕсли;	
			Если ОтражатьВБухгалтерскомУчете и ПроводкиПоНачислению Тогда
				ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.ВозвратМатеринскогоКапитала, ДоговорОПС.Участник, ДоговорОПС.ДоговорКонтрагента, 
				Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ПенсионныйФондРФ, ПенсионныйФондРФ.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, стр.Сумма);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ПроверкаКорректности(Отказ, Заголовок);
		Если СуммаНаследникам>РасшифровкаСуммы.Итог("Сумма") И СуммаНаследникам>0 Тогда
			Отказ = Истина;
			уп_ОсновнаяПоставкаСервер.ОшибкаПриПроведении("Необходимо рассчитать документ: сумма, распределенная правопреемникам больше суммы, указанной в расшифровке остатка на счете.", Отказ, Заголовок);
		КонецЕсли;
		#Удаление
		Если (СуммаНаследникам+СуммаМКНаследникам+СуммаВПФР+СуммаМКВПФР)>РасшифровкаСуммы.Итог("Сумма") И РасшифровкаСуммы.Итог("Сумма")>0 И (СуммаНаследникам+СуммаМКНаследникам+СуммаВПФР+СуммаМКВПФР)>0 Тогда
		#КонецУдаления
		#Вставка
		Если (СуммаНаследникам+СуммаМКНаследникам+СуммаВПФР+СуммаМКВПФР)>РасшифровкаСуммы.Итог("Сумма") И РасшифровкаСуммы.Итог("Сумма")>0 И (СуммаНаследникам+СуммаМКНаследникам+СуммаВПФР+СуммаМКВПФР)>0 и ХМ_НеПроверять=Ложь Тогда
		#КонецВставки
			Отказ = Истина;
			уп_ОсновнаяПоставкаСервер.ОшибкаПриПроведении("Сумма расшифровки остатка на счете меньше суммы, распределенной в документе.", Отказ, Заголовок);
		КонецЕсли;
		Если  РасшифровкаСуммы.Итог("Сумма")<0 Тогда
			Сообщить("Обратите внимание, остаток на счете меньше 0.", СтатусСообщения.Внимание);
		КонецЕсли;	
		Если СуммаМКНаследникам>СуммаМатКапиталаНаСчетеСрочныхВыплат Тогда
			Отказ = Истина;
			уп_ОсновнаяПоставкаСервер.ОшибкаПриПроведении("Сумма распределенная правопреемникам по п.3.1 превышает доступный к выплате остаток материнского капитала.", Отказ, Заголовок);
		КонецЕсли;	
		
		// делаем таблицу остатков на счетах
		ТОстатков = Новый ТаблицаЗначений;
		ТОстатков.Колонки.Добавить("ТипРезерва");
		ТОстатков.Колонки.Добавить("ТипСуммы");
		ТОстатков.Колонки.Добавить("Сумма");
		ТОстатков.Колонки.Добавить("СуммаГарантированная");
		ТОстатков.Колонки.Добавить("СуммаКомпенсации");
		ТОстатков.Колонки.Добавить("СуммаВосполнения");
		ТОстатков.Колонки.Добавить("СуммаВозмещения");
		
		ТОстатковМК = Новый ТаблицаЗначений;
		ТОстатковМК.Колонки.Добавить("ТипРезерва");
		ТОстатковМК.Колонки.Добавить("ТипСуммы");
		ТОстатковМК.Колонки.Добавить("Сумма");
		ТОстатковМК.Колонки.Добавить("СуммаГарантированная");
		ТОстатковМК.Колонки.Добавить("СуммаКомпенсации");
		ТОстатковМК.Колонки.Добавить("СуммаВосполнения");
		ТОстатковМК.Колонки.Добавить("СуммаВозмещения");
		
		ДатаВступления = Константы.уп_ДатаВступленияВСистемуГарантирования.Получить();
		//еще система гарантирования
		ТабФиксации = Новый ТаблицаЗначений;
		ТабФиксации.Колонки.Добавить("ТипСуммы");
		ТабФиксации.Колонки.Добавить("Сумма");
		
		СуммаИзРСВ = 0;
		//спишем из резерва
		Для каждого стр из РасшифровкаСуммы Цикл
			//Движение = Движения.уп_РезервыОПС.ДобавитьРасход();
			//Движение.Организация = Организация;
			//Движение.Период = Дата;
			//Движение.ДоговорОПС = стр.ДоговорОПС;
			//Движение.ТипРезерва = стр.ТипРезерва;
			//Движение.ТипСуммы = стр.ТипСуммы;
			//Движение.Сумма = стр.Сумма;
			//Движение.Движение = Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамОПС;
			
			Если стр.ТипСуммы<>Справочники.уп_ТипыСуммОПС.МатКапитал 
				и стр.ТипСуммы<>Справочники.уп_ТипыСуммОПС.ИДМатКапитал Тогда  
				НовСтрОстатков = ТОстатков.Добавить();
				НовСтрОстатков.ТипРезерва = стр.ТипРезерва;
				НовСтрОстатков.ТипСуммы   = стр.ТипСуммы;
				НовСтрОстатков.Сумма      = стр.Сумма;
				НовСтрОстатков.СуммаГарантированная      = стр.СуммаГарантированная;
				НовСтрОстатков.СуммаКомпенсации      = стр.СуммаКомпенсации;
				НовСтрОстатков.СуммаВосполнения      = стр.СуммаВосполнения;
				НовСтрОстатков.СуммаВозмещения      = стр.СуммаВозмещения;
				
				Если стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты
					ИЛИ стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
					СуммаИзРСВ = СуммаИзРСВ+стр.Сумма;
				КонецЕсли;	
			ИначеЕсли стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты
				ИЛИ стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
				НовСтрОстатков = ТОстатковМК.Добавить();
				НовСтрОстатков.ТипРезерва = стр.ТипРезерва;
				НовСтрОстатков.ТипСуммы   = стр.ТипСуммы;
				НовСтрОстатков.Сумма      = стр.Сумма;
				НовСтрОстатков.СуммаГарантированная      = стр.СуммаГарантированная;
				НовСтрОстатков.СуммаКомпенсации      = стр.СуммаКомпенсации;
				НовСтрОстатков.СуммаВосполнения      = стр.СуммаВосполнения;
				НовСтрОстатков.СуммаВозмещения      = стр.СуммаВозмещения;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДатаВступления) И Дата>=ДатаВступления Тогда
				//еще фиксированные обязательства
				//фиксируем в сумме на дату выплаты (вот не знаю - или как раз стоит вычесть)
				Если НЕ ДополнительнаяВыплата Тогда
					Если стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений 
						ИЛИ стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН Тогда
						
						НовСтрТабФиксации = ТабФиксации.Добавить(); 
						НовСтрТабФиксации.ТипСуммы = стр.ТипСуммы;
						НовСтрТабФиксации.Сумма = стр.Сумма;
						
					КонецЕсли;
				КонецЕсли;
				
				//еще текущая сумма гарантирования (вот тут точно реальную пишем, т.е. уменьшаем на выплату)
				Если стр.СуммаГарантированная<>0 Тогда
					Движение = Движения.уп_ТекущаяСуммаГарантирования.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = ДатаВыплаты;
					Движение.ДоговорОПС = ДоговорОПС;
					Движение.Организация = Организация;
					Движение.ТипСуммы = стр.ТипСуммы;
					Движение.Сумма = стр.СуммаГарантированная;
				КонецЕсли;

			КонецЕсли;	
		КонецЦикла;
		//регистр уп_РазмерЗафиксированныхОбязательств - таблицу надо свернуть на случай, если есть и РПН и резерв умерших
		ТабФиксации.Свернуть("ТипСуммы", "Сумма");
		Для Каждого СтрокаТабФиксации из ТабФиксации Цикл
			Движение = Движения.уп_РазмерЗафиксированныхОбязательств.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипСуммы = СтрокаТабФиксации.ТипСуммы;
			Движение.Сумма = СтрокаТабФиксации.Сумма;
		КонецЦикла;	
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаВступления) И Дата>=ДатаВступления И НЕ ДополнительнаяВыплата Тогда
		//еще дата фиксации
		Если  уп_СистемаГарантирования.ПроверитьНеобходимостьФиксации(Ссылка, ДоговорОПС) Тогда
			Движение = Движения.уп_ДатаФиксацииОбязательств.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ДатаФиксации = Дата;
		КонецЕсли;
	КонецЕсли;
	
	СуммаИзРСВОсталось = СуммаИзРСВ;
	Для Каждого ТекСтрокаЗаявления Из Заявления Цикл
		// регистр ПрочиеНачисленияОПС Приход
		Если (ТекСтрокаЗаявления.Сумма<>0) и (ТекСтрокаЗаявления.Разрешить) Тогда
			//определим получателя
			СведенияОПолучателе = РегистрыСведений.уп_ЛицевыеСчетаЗастрахованныхЛиц.ПолучитьПоследнее(Дата, Новый Структура("Организация,ДоговорОПС,ЗастрахованноеЛицо",Организация, ДоговорОПС, ТекСтрокаЗаявления.Правопреемник));
			Если СтарыйАлгоритм Тогда
				Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = ДатаВыплаты;
				Движение.Организация = Организация;
				Движение.Участник = ТекСтрокаЗаявления.Правопреемник;
				Движение.ДоговорОПС = ДоговорОПС;
				Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС;
				Если ИспользоватьАналитикуРешение Тогда
					Движение.Решение = Ссылка;
				КонецЕсли;	
				Движение.Сумма = ТекСтрокаЗаявления.Сумма;
				Если ЗначениеЗаполнено(КодДохода) и СчитаемНДФЛ Тогда
					Движение.НалоговаяБазаПоНДФЛ = ТекСтрокаЗаявления.Сумма;
				КонецЕсли;
				ДвиженияПоНДФЛ(ДатаВыплаты,ТекСтрокаЗаявления.Правопреемник,ТекСтрокаЗаявления.Сумма,ДоговорОПС);	
				Если ОтражатьВБухгалтерскомУчете и ПроводкиПоНачислению Тогда
					ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамОПС, ДоговорОПС.Участник, ДоговорОПС.ДоговорКонтрагента, 
					Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, СведенияОПолучателе.Банк, ?(СведенияОПолучателе.Банк=NULL,Справочники.ДоговорыКонтрагентов.ПустаяСсылка(),
					СведенияОПолучателе.Банк.ОсновнойДоговорКонтрагента), Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ТекСтрокаЗаявления.Сумма);
				КонецЕсли;
			Иначе
				// перебираем таблицу остатков
				СуммаНаследнику = ТекСтрокаЗаявления.Сумма; 
				СуммаНаследникуИзРСВ = Мин(СуммаИзРСВОсталось, Окр(СуммаИзРСВ*ТекСтрокаЗаявления.Процент/100,2));
				СуммаНаследникуИзРПН = СуммаНаследнику-СуммаНаследникуИзРСВ;
				СуммаИзРСВОсталось = СуммаИзРСВОсталось-СуммаНаследникуИзРСВ;
				
				Для Каждого ТекСтрОстатков из ТОстатков Цикл
					//СуммаКСписанию = Мин(СуммаНаследнику, ТекСтрОстатков.Сумма);
					Если ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты
						ИЛИ ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
						СуммаКСписанию = Мин(СуммаНаследникуИзРСВ, ТекСтрОстатков.Сумма);
					Иначе
						СуммаКСписанию = Мин(СуммаНаследникуИзРПН, ТекСтрОстатков.Сумма);
					КонецЕсли;	
					Если СуммаКСписанию<>0 Тогда
						ДвижениеПН = Движения.уп_ПрочиеНачисленияОПС.Добавить();
						ДвижениеПН.ВидДвижения = ВидДвиженияНакопления.Приход;
						ДвижениеПН.Период = ДатаВыплаты;
						ДвижениеПН.Организация = Организация;
						ДвижениеПН.Участник = ТекСтрокаЗаявления.Правопреемник;
						ДвижениеПН.ДоговорОПС = ДоговорОПС;
						ДвижениеПН.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС;
						ДвижениеПН.ТипРезерва = ТекСтрОстатков.ТипРезерва;
						Если ИспользоватьАналитикуРешение Тогда
							ДвижениеПН.Решение = Ссылка;
						КонецЕсли;	
						Если ЗначениеЗаполнено(ДатаНачалаУчетаПППоТипамСумм) И Дата>=ДатаНачалаУчетаПППоТипамСумм Тогда
							ДвижениеПН.ТипСуммы   = ТекСтрОстатков.ТипСуммы;
						Конецесли;
						ДвижениеПН.Сумма = СуммаКСписанию;
						Если ЗначениеЗаполнено(КодДохода) и СчитаемНДФЛ Тогда
							ДвижениеПН.НалоговаяБазаПоНДФЛ = СуммаКСписанию;
						КонецЕсли;
						ДвиженияПоНДФЛ(ДатаВыплаты,ТекСтрокаЗаявления.Правопреемник,СуммаКСписанию,ДоговорОПС);	
						
						ДвижениеРД = Движения.уп_РезервыОПС.ДобавитьРасход();
						ДвижениеРД.Организация = Организация;
						Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И Дата>=ДатаНачалаУчетаРезервовНачисления Тогда
							ДвижениеРД.Период = Дата;
						Иначе
							ДвижениеРД.Период = ДатаВыплаты;
						КонецЕсли;
						ДвижениеРД.ДоговорОПС = ДоговорОПС;
						ДвижениеРД.ТипРезерва = ТекСтрОстатков.ТипРезерва;
						ДвижениеРД.ТипСуммы = ТекСтрОстатков.ТипСуммы;
						ДвижениеРД.Сумма = СуммаКСписанию;
						ДвижениеРД.Движение = Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамОПС;
						
						Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И Дата>=ДатаНачалаУчетаРезервовНачисления Тогда
							//резерв начислений
							ДвижениеРН = Движения.уп_РезервыОПС.ДобавитьПриход();
							ДвижениеРН.Организация = Организация;
							ДвижениеРН.Период = Дата;
							ДвижениеРН.ДоговорОПС = ДоговорОПС;
							Если ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений
								ИЛИ ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервЕВ
								ИЛИ ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН Тогда
								ДвижениеРН.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРПН;
							ИначеЕсли ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты 
								ИЛИ ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
								ДвижениеРН.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРСВ;
							КонецЕсли;	
							ДвижениеРН.ТипСуммы = ТекСтрОстатков.ТипСуммы;
							ДвижениеРН.Сумма = СуммаКСписанию;
							//Движение.Движение = Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамОПС;
						КонецЕсли;
						
						Если ОтражатьВБухгалтерскомУчете и ПроводкиПоНачислению Тогда
							ВидДвижения = ?(ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты, Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамРСВОПС, Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамОПС);
							ДвиженияПоБухУчету(Дата, ВидДвижения, ДоговорОПС.Участник, ДоговорОПС.ДоговорКонтрагента, 
							Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, СведенияОПолучателе.Банк, ?(СведенияОПолучателе.Банк=NULL,Справочники.ДоговорыКонтрагентов.ПустаяСсылка(),
							СведенияОПолучателе.Банк.ОсновнойДоговорКонтрагента), Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, СуммаКСписанию);
						КонецЕсли;
						//сначала списываем суммы, которые идут свыше суммы компенсаций
						Если СуммаКСписанию>ТекСтрОстатков.Сумма-ТекСтрОстатков.СуммаКомпенсации-ТекСтрОстатков.СуммаВосполнения-ТекСтрОстатков.СуммаВозмещения Тогда
							СуммаКСписаниюБезКомпенсаций = ТекСтрОстатков.Сумма-ТекСтрОстатков.СуммаКомпенсации-ТекСтрОстатков.СуммаВосполнения-ТекСтрОстатков.СуммаВозмещения;
							СуммаОстаткаКСписанию = СуммаКСписанию-СуммаКСписаниюБезКомпенсаций;
							
							СуммаКомпенсацииКСписанию = Мин(СуммаОстаткаКСписанию, ТекСтрОстатков.СуммаКомпенсации);
							Если СуммаКомпенсацииКСписанию>0 Тогда
								
								Движение = Движения.уп_СуммыГарантийногоВосполнения.Добавить();
								Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
								Движение.Период = ДатаВыплаты;
								Движение.ДоговорОПС = ДоговорОПС;
								Движение.Организация = Организация;
								Движение.ТипСуммы = ТекСтрОстатков.ТипСуммы;
								Движение.Вариант = Перечисления.уп_ВариантВосполнения.Компенсация;
								Движение.Сумма = СуммаКомпенсацииКСписанию;
								
								ДвижениеПН.СуммаКомпенсации = СуммаКомпенсацииКСписанию;
								ДвижениеРД.СуммаКомпенсации = СуммаКомпенсацииКСписанию;
								Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И ДатаВыплаты>=ДатаНачалаУчетаРезервовНачисления Тогда
									ДвижениеРН.СуммаКомпенсации = СуммаКомпенсацииКСписанию;
								КонецЕсли;
								СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
								ТекСтрОстатков.СуммаКомпенсации = ТекСтрОстатков.СуммаКомпенсации-СуммаКомпенсацииКСписанию;
							КонецЕсли;
							
							СуммаВосполненияКСписанию = Мин(СуммаОстаткаКСписанию, ТекСтрОстатков.СуммаВосполнения);
							Если СуммаВосполненияКСписанию>0 Тогда
								
								Движение = Движения.уп_СуммыГарантийногоВосполнения.Добавить();
								Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
								Движение.Период = ДатаВыплаты;
								Движение.ДоговорОПС = ДоговорОПС;
								Движение.Организация = Организация;
								Движение.ТипСуммы = ТекСтрОстатков.ТипСуммы;
								Движение.Вариант = Перечисления.уп_ВариантВосполнения.Восполнение;
								Движение.Сумма = СуммаВосполненияКСписанию;
								
								ДвижениеПН.СуммаВосполнения = СуммаВосполненияКСписанию;
								ДвижениеРД.СуммаВосполнения = СуммаВосполненияКСписанию;
								Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И ДатаВыплаты>=ДатаНачалаУчетаРезервовНачисления Тогда
									ДвижениеРН.СуммаВосполнения = СуммаВосполненияКСписанию;
								КонецЕсли;
								СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВосполненияКСписанию;
								ТекСтрОстатков.СуммаВосполнения = ТекСтрОстатков.СуммаВосполнения-СуммаВосполненияКСписанию;
							КонецЕсли;
							
							СуммаВозмещенияКСписанию = Мин(СуммаОстаткаКСписанию, ТекСтрОстатков.СуммаВозмещения);
							Если СуммаВозмещенияКСписанию>0 Тогда
								
								Движение = Движения.уп_СуммыГарантийногоВосполнения.Добавить();
								Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
								Движение.Период = ДатаВыплаты;
								Движение.ДоговорОПС = ДоговорОПС;
								Движение.Организация = Организация;
								Движение.ТипСуммы = ТекСтрОстатков.ТипСуммы;
								Движение.Вариант = Перечисления.уп_ВариантВосполнения.Возмещение;
								Движение.Сумма = СуммаВозмещенияКСписанию;
								
								ДвижениеПН.СуммаВозмещения = СуммаВозмещенияКСписанию;
								ДвижениеРД.СуммаВозмещения = СуммаВозмещенияКСписанию;
								Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И ДатаВыплаты>=ДатаНачалаУчетаРезервовНачисления Тогда
									ДвижениеРН.СуммаВозмещения = СуммаВозмещенияКСписанию;
								КонецЕсли;
								СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
								ТекСтрОстатков.СуммаВозмещения = ТекСтрОстатков.СуммаВозмещения-СуммаВозмещенияКСписанию;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					СуммаНаследнику = СуммаНаследнику-СуммаКСписанию;
					Если ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты
						ИЛИ ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
						СуммаНаследникуИзРСВ = СуммаНаследникуИзРСВ-СуммаКСписанию;
					Иначе
						СуммаНаследникуИзРПН = СуммаНаследникуИзРПН-СуммаКСписанию;
					КонецЕсли;	
					ТекСтрОстатков.Сумма = ТекСтрОстатков.Сумма-СуммаКСписанию;
					Если СуммаНаследнику = 0 Тогда
						Прервать;
					КонецЕсли;	
				КонецЦикла;	
				Если СуммаНаследнику>0 Тогда
					Сообщить("Не удалось начислить сумму правопреемнику "+ТекСтрокаЗаявления.Правопреемник);
					Отказ = Истина;
				КонецЕсли;	
			КонецЕсли;
			
			//bardoshina+
			Движение = Движения.уп_ДолиПравопреемников.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.Заявление = ТекСтрокаЗаявления.Заявление;
			Движение.Правопреемник = ТекСтрокаЗаявления.Правопреемник;
			Движение.Доля = ТекСтрокаЗаявления.Процент;
			//bardoshina-
			
		ИначеЕсли ТекСтрокаЗаявления.Разрешить Тогда
			Движение = Движения.уп_ДолиПравопреемников.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.Заявление = ТекСтрокаЗаявления.Заявление;
			Движение.Правопреемник = ТекСтрокаЗаявления.Правопреемник;
			Движение.Доля = ТекСтрокаЗаявления.Процент;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекСтрокаЗаявления Из Правопреемники31 Цикл
		//определим получателя
		СведенияОПолучателе = РегистрыСведений.уп_ЛицевыеСчетаЗастрахованныхЛиц.ПолучитьПоследнее(Дата, Новый Структура("Организация,ДоговорОПС,ЗастрахованноеЛицо",Организация, ДоговорОПС, ТекСтрокаЗаявления.Правопреемник));
		// регистр ПрочиеНачисленияОПС Приход
		Если (ТекСтрокаЗаявления.СуммаМК<>0) и (ТекСтрокаЗаявления.Разрешить) Тогда
			СуммаМКНаследнику = ТекСтрокаЗаявления.СуммаМК;
			Для Каждого ТекСтрОстатков из ТОстатковМК Цикл
				СуммаКСписанию = Мин(СуммаМКНаследнику, ТекСтрОстатков.Сумма);
				Если СуммаКСписанию<>0 Тогда
					ДвижениеПН = Движения.уп_ПрочиеНачисленияОПС.Добавить();
					ДвижениеПН.ВидДвижения = ВидДвиженияНакопления.Приход;
					ДвижениеПН.Период = ДатаВыплаты;
					ДвижениеПН.Организация = Организация;
					ДвижениеПН.Участник = ТекСтрокаЗаявления.Правопреемник;
					ДвижениеПН.ДоговорОПС = ДоговорОПС;
					ДвижениеПН.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС;
					//Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.МатКапитал;
					ДвижениеПН.ТипСуммы = ТекСтрОстатков.ТипСуммы;
					ДвижениеПН.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты;
					Если ИспользоватьАналитикуРешение Тогда
						ДвижениеПН.Решение = Ссылка;
					КонецЕсли;	
					ДвижениеПН.Сумма = СуммаКСписанию;
					Если ЗначениеЗаполнено(КодДохода) и СчитаемНДФЛ Тогда
						ДвижениеПН.НалоговаяБазаПоНДФЛ = СуммаКСписанию;
					КонецЕсли;
					ДвиженияПоНДФЛ(ДатаВыплаты,ТекСтрокаЗаявления.Правопреемник,СуммаКСписанию,ДоговорОПС);	
					
					ДвижениеРД = Движения.уп_РезервыОПС.ДобавитьРасход();
					ДвижениеРД.Организация = Организация;
					Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И Дата>=ДатаНачалаУчетаРезервовНачисления Тогда
						ДвижениеРД.Период = Дата;
					Иначе
						ДвижениеРД.Период = ДатаВыплаты;
					КонецЕсли;
					ДвижениеРД.ДоговорОПС = ДоговорОПС;
					ДвижениеРД.ТипРезерва = ТекСтрОстатков.ТипРезерва;
					ДвижениеРД.ТипСуммы = ТекСтрОстатков.ТипСуммы;
					ДвижениеРД.Сумма = СуммаКСписанию;
					ДвижениеРД.Движение = Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамОПС;
					
					Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И ДатаВыплаты>=ДатаНачалаУчетаРезервовНачисления Тогда
						//резерв начислений
						ДвижениеРН = Движения.уп_РезервыОПС.ДобавитьПриход();
						ДвижениеРН.Организация = Организация;
						ДвижениеРН.Период = Дата;
						ДвижениеРН.ДоговорОПС = ДоговорОПС;
						Если ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений 
							ИЛИ ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН Тогда
							ДвижениеРН.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРПН;
						ИначеЕсли ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты 
							ИЛИ ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
							ДвижениеРН.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРСВ;
						КонецЕсли;	
						ДвижениеРН.ТипСуммы = ТекСтрОстатков.ТипСуммы;
						ДвижениеРН.Сумма = СуммаКСписанию;
						//Движение.Движение = Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамОПС;
					КонецЕсли;
					
					Если ОтражатьВБухгалтерскомУчете и ПроводкиПоНачислению Тогда
						ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамРСВОПС, ДоговорОПС.Участник, ДоговорОПС.ДоговорКонтрагента, 
						Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, СведенияОПолучателе.Банк, ?(СведенияОПолучателе.Банк=NULL,Справочники.ДоговорыКонтрагентов.ПустаяСсылка(),
						СведенияОПолучателе.Банк.ОсновнойДоговорКонтрагента), Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, СуммаКСписанию);
					КонецЕсли;
						
					//сначала списываем суммы, которые идут свыше суммы компенсаций
					Если СуммаКСписанию>ТекСтрОстатков.Сумма-ТекСтрОстатков.СуммаКомпенсации-ТекСтрОстатков.СуммаВосполнения-ТекСтрОстатков.СуммаВозмещения Тогда
						СуммаКСписаниюБезКомпенсаций = ТекСтрОстатков.Сумма-ТекСтрОстатков.СуммаКомпенсации-ТекСтрОстатков.СуммаВосполнения-ТекСтрОстатков.СуммаВозмещения;
						СуммаОстаткаКСписанию = СуммаКСписанию-СуммаКСписаниюБезКомпенсаций;
						
						СуммаКомпенсацииКСписанию = Мин(СуммаОстаткаКСписанию, ТекСтрОстатков.СуммаКомпенсации);
						Если СуммаКомпенсацииКСписанию>0 Тогда
							
							Движение = Движения.уп_СуммыГарантийногоВосполнения.Добавить();
							Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
							Движение.Период = ДатаВыплаты;
							Движение.ДоговорОПС = ДоговорОПС;
							Движение.Организация = Организация;
							Движение.ТипСуммы = ТекСтрОстатков.ТипСуммы;
							Движение.Вариант = Перечисления.уп_ВариантВосполнения.Компенсация;
							Движение.Сумма = СуммаКомпенсацииКСписанию;
							
							ДвижениеПН.СуммаКомпенсации = СуммаКомпенсацииКСписанию;
							ДвижениеРД.СуммаКомпенсации = СуммаКомпенсацииКСписанию;
							Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И ДатаВыплаты>=ДатаНачалаУчетаРезервовНачисления Тогда
								ДвижениеРН.СуммаКомпенсации = СуммаКомпенсацииКСписанию;
							КонецЕсли;
							СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
							ТекСтрОстатков.СуммаКомпенсации = ТекСтрОстатков.СуммаКомпенсации-СуммаКомпенсацииКСписанию;
						КонецЕсли;
						
						СуммаВосполненияКСписанию = Мин(СуммаОстаткаКСписанию, ТекСтрОстатков.СуммаВосполнения);
						Если СуммаВосполненияКСписанию>0 Тогда
							
							Движение = Движения.уп_СуммыГарантийногоВосполнения.Добавить();
							Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
							Движение.Период = ДатаВыплаты;
							Движение.ДоговорОПС = ДоговорОПС;
							Движение.Организация = Организация;
							Движение.ТипСуммы = ТекСтрОстатков.ТипСуммы;
							Движение.Вариант = Перечисления.уп_ВариантВосполнения.Восполнение;
							Движение.Сумма = СуммаВосполненияКСписанию;
							
							ДвижениеПН.СуммаВосполнения = СуммаВосполненияКСписанию;
							ДвижениеРД.СуммаВосполнения = СуммаВосполненияКСписанию;
							Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И ДатаВыплаты>=ДатаНачалаУчетаРезервовНачисления Тогда
								ДвижениеРН.СуммаВосполнения = СуммаВосполненияКСписанию;
							КонецЕсли;
							СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВосполненияКСписанию;
							ТекСтрОстатков.СуммаВосполнения = ТекСтрОстатков.СуммаВосполнения-СуммаВосполненияКСписанию;
						КонецЕсли;
						
						СуммаВозмещенияКСписанию = Мин(СуммаОстаткаКСписанию, ТекСтрОстатков.СуммаВозмещения);
						Если СуммаВозмещенияКСписанию>0 Тогда
							
							Движение = Движения.уп_СуммыГарантийногоВосполнения.Добавить();
							Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
							Движение.Период = ДатаВыплаты;
							Движение.ДоговорОПС = ДоговорОПС;
							Движение.Организация = Организация;
							Движение.ТипСуммы = ТекСтрОстатков.ТипСуммы;
							Движение.Вариант = Перечисления.уп_ВариантВосполнения.Возмещение;
							Движение.Сумма = СуммаВозмещенияКСписанию;
							
							ДвижениеПН.СуммаВозмещения = СуммаВозмещенияКСписанию;
							ДвижениеРД.СуммаВозмещения = СуммаВозмещенияКСписанию;
							Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И ДатаВыплаты>=ДатаНачалаУчетаРезервовНачисления Тогда
								ДвижениеРН.СуммаВозмещения = СуммаВозмещенияКСписанию;
							КонецЕсли;
							СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
							ТекСтрОстатков.СуммаВозмещения = ТекСтрОстатков.СуммаВозмещения-СуммаВозмещенияКСписанию;
						КонецЕсли;
					КонецЕсли;
					
					СуммаМКНаследнику = СуммаМКНаследнику-СуммаКСписанию;
					ТекСтрОстатков.Сумма = ТекСтрОстатков.Сумма-СуммаКСписанию;
					Если СуммаМКНаследнику = 0 Тогда
						Прервать;
					КонецЕсли;	
				Конецесли;	
			КонецЦикла;
			Если СуммаМКНаследнику>0 Тогда
				Сообщить("Не удалось начислить сумму материнского капитала правопреемнику "+ТекСтрокаЗаявления.Правопреемник);
				Отказ = Истина;
			КонецЕсли;
			
			//bardoshina+
			Если Заявления.Найти(ТекСтрокаЗаявления.Правопреемник,"Правопреемник") = Неопределено Тогда
				Движение = Движения.уп_ДолиПравопреемников.Добавить();
				Движение.Период = Дата;
				Движение.ДоговорОПС = ДоговорОПС;
				Движение.Заявление = ТекСтрокаЗаявления.Заявление;
				Движение.Правопреемник = ТекСтрокаЗаявления.Правопреемник;
				Движение.Доля = ТекСтрокаЗаявления.Процент;
			КонецЕсли;
			//bardoshina-
		КонецЕсли;
	КонецЦикла; 
	
	Если  СуммаВПФР>0 Тогда
		Если СтарыйАлгоритм Тогда
			Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ДатаВыплаты;
			Движение.Организация = Организация;
			Движение.Участник = ПенсионныйФондРФ;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС;
			Если ИспользоватьАналитикуРешение Тогда
				Движение.Решение = Ссылка;
			КонецЕсли;	
			Движение.Сумма = СуммаВПФР;
			Если ОтражатьВБухгалтерскомУчете и ПроводкиПоНачислению Тогда
				ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамОПС, ДоговорОПС.Участник, ДоговорОПС.ДоговорКонтрагента, 
				Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ПенсионныйФондРФ, ПенсионныйФондРФ.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, СуммаВПФР);
			КонецЕсли;
		Иначе
			// перебираем таблицу остатков
			СуммаНаследнику = СуммаВПФР; 
			Для Каждого ТекСтрОстатков из ТОстатков Цикл
				СуммаКСписанию = Мин(СуммаНаследнику, ТекСтрОстатков.Сумма);
				Если СуммаКСписанию<>0 Тогда
					Если Дата>='20120701' Тогда
						//это только если нет настройки делать это отдельным документом
						Если НЕ ПереводВРезервОПСОтдельнымДокументом Тогда
							Движение = Движения.уп_РезервыОПС.Добавить();
							Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
							Если  ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
								Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Перевод_Из_РПН_в_РОПС;
							Иначе
								Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Перевод_Из_РСВ_в_РОПС;
							КонецЕсли;
							Движение.Период = Дата;
							Движение.Организация = Организация;
							//Движение.ДоговорОПС = ДоговорОПС;
							Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС;
							//Если  ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
							//	Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.РезервОПС_НЧТП;
							//Иначе
							//	Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.РезервОПС_СрочныхВыплат;
							//КонецЕсли;
							Движение.Сумма = СуммаКСписанию;
							Движение.Движение = Перечисления.уп_ВидыДвижений.ПереводВРОПССредствПоУмершимЗЛ;
							
							ДвижениеРД = Движения.уп_РезервыОПС.ДобавитьРасход();
							ДвижениеРД.Организация = Организация;
							ДвижениеРД.Период = Дата;
							ДвижениеРД.ДоговорОПС = ДоговорОПС;
							ДвижениеРД.ТипРезерва = ТекСтрОстатков.ТипРезерва;
							ДвижениеРД.ТипСуммы = ТекСтрОстатков.ТипСуммы;
							ДвижениеРД.Сумма = СуммаКСписанию;
							ДвижениеРД.Движение = Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамОПС;
							Если  ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
								Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Перевод_Из_РПН_в_РОПС;
							Иначе
								Движение.ВидДвиженияЕПС = Перечисления.епс_ВидыДвиженияПенсионныхНакоплений.Перевод_Из_РСВ_в_РОПС;
							КонецЕсли;
							Если ОтражатьВБухгалтерскомУчете Тогда
								ВидДвижения = ?(ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты, Перечисления.уп_ВидыДвижений.ПереводВРезервОПССрочныеВыплаты, Перечисления.уп_ВидыДвижений.ПереводВРезервОПСНакопления);
								ДвиженияПоБухУчету(Дата, ВидДвижения, ДоговорОПС.Участник, ДоговорОПС.ДоговорКонтрагента, 
								Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Справочники.Контрагенты.ПустаяСсылка(), Справочники.ДоговорыКонтрагентов.ПустаяСсылка(), Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, СуммаКСписанию);
							Конецесли;
							
							Движение = Движения.уп_АналитикаРезерваОПС.Добавить();
							Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
							Движение.Период = Дата;
							Движение.Организация = Организация;
							Движение.ДоговорОПС = ДоговорОПС;
							Движение.ТипРезерва = ТекСтрОстатков.ТипРезерва;
							Если ЗначениеЗаполнено(ДатаНачалаУчетаПППоТипамСумм) И Дата>=ДатаНачалаУчетаПППоТипамСумм Тогда
								Движение.ТипСуммы   = ТекСтрОстатков.ТипСуммы;
							Иначе
								Если  ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
									Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.РезервОПС_НЧТП;
								Иначе
									Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.РезервОПС_СрочныхВыплат;
								КонецЕсли;
							КонецЕсли;
							Движение.Сумма = СуммаКСписанию;
							
							//здесь еще списания сумм восптолнения
							//сначала списываем суммы, которые идут свыше суммы компенсаций
							Если СуммаКСписанию>ТекСтрОстатков.Сумма-ТекСтрОстатков.СуммаКомпенсации-ТекСтрОстатков.СуммаВосполнения-ТекСтрОстатков.СуммаВозмещения Тогда
								СуммаКСписаниюБезКомпенсаций = ТекСтрОстатков.Сумма-ТекСтрОстатков.СуммаКомпенсации-ТекСтрОстатков.СуммаВосполнения-ТекСтрОстатков.СуммаВозмещения;
								СуммаОстаткаКСписанию = СуммаКСписанию-СуммаКСписаниюБезКомпенсаций;
								
								СуммаКомпенсацииКСписанию = Мин(СуммаОстаткаКСписанию, ТекСтрОстатков.СуммаКомпенсации);
								Если СуммаКомпенсацииКСписанию>0 Тогда
									
									ДвижениеК = Движения.уп_СуммыГарантийногоВосполнения.Добавить();
									ДвижениеК.ВидДвижения = ВидДвиженияНакопления.Расход;
									ДвижениеК.Период = Дата;
									ДвижениеК.ДоговорОПС = ДоговорОПС;
									ДвижениеК.Организация = Организация;
									ДвижениеК.ТипСуммы = ТекСтрОстатков.ТипСуммы;
									ДвижениеК.Вариант = Перечисления.уп_ВариантВосполнения.Компенсация;
									ДвижениеК.Сумма = СуммаКомпенсацииКСписанию;
									
									Движение.СуммаКомпенсации = СуммаКомпенсацииКСписанию; //это аналитика резерва ОПС
									ДвижениеРД.СуммаКомпенсации = СуммаКомпенсацииКСписанию; //это с резерва ОПС списание
									
									СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
									ТекСтрОстатков.СуммаКомпенсации = ТекСтрОстатков.СуммаКомпенсации-СуммаКомпенсацииКСписанию;
								КонецЕсли;
								
								СуммаВосполненияКСписанию = Мин(СуммаОстаткаКСписанию, ТекСтрОстатков.СуммаВосполнения);
								Если СуммаВосполненияКСписанию>0 Тогда
									
									ДвижениеК = Движения.уп_СуммыГарантийногоВосполнения.Добавить();
									ДвижениеК.ВидДвижения = ВидДвиженияНакопления.Расход;
									ДвижениеК.Период = Дата;
									ДвижениеК.ДоговорОПС = ДоговорОПС;
									ДвижениеК.Организация = Организация;
									ДвижениеК.ТипСуммы = ТекСтрОстатков.ТипСуммы;
									ДвижениеК.Вариант = Перечисления.уп_ВариантВосполнения.Восполнение;
									ДвижениеК.Сумма = СуммаВосполненияКСписанию;
									
									Движение.СуммаВосполнения = СуммаВосполненияКСписанию; //это аналитика резерва ОПС
									ДвижениеРД.СуммаВосполнения = СуммаВосполненияКСписанию; //это с резерва ОПС списание
									
									СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВосполненияКСписанию;
									ТекСтрОстатков.СуммаВосполнения = ТекСтрОстатков.СуммаВосполнения-СуммаВосполненияКСписанию;
								КонецЕсли;
								
								СуммаВозмещенияКСписанию = Мин(СуммаОстаткаКСписанию, ТекСтрОстатков.СуммаВозмещения);
								Если СуммаВозмещенияКСписанию>0 Тогда
									
									ДвижениеК = Движения.уп_СуммыГарантийногоВосполнения.Добавить();
									ДвижениеК.ВидДвижения = ВидДвиженияНакопления.Расход;
									ДвижениеК.Период = Дата;
									ДвижениеК.ДоговорОПС = ДоговорОПС;
									ДвижениеК.Организация = Организация;
									ДвижениеК.ТипСуммы = ТекСтрОстатков.ТипСуммы;
									ДвижениеК.Вариант = Перечисления.уп_ВариантВосполнения.Возмещение;
									ДвижениеК.Сумма = СуммаВозмещенияКСписанию;
									
									Движение.СуммаВозмещения = СуммаВозмещенияКСписанию; //это аналитика резерва ОПС
									ДвижениеРД.СуммаВозмещения = СуммаВозмещенияКСписанию; //это с резерва ОПС списание
									
									СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
									ТекСтрОстатков.СуммаВозмещения = ТекСтрОстатков.СуммаВозмещения-СуммаВозмещенияКСписанию;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;

					Иначе  // передача в ПФР
						ДвижениеПН = Движения.уп_ПрочиеНачисленияОПС.Добавить();
						ДвижениеПН.ВидДвижения = ВидДвиженияНакопления.Приход;
						ДвижениеПН.Период = ДатаВыплаты;
						ДвижениеПН.Организация = Организация;
						ДвижениеПН.Участник = ПенсионныйФондРФ;
						ДвижениеПН.ДоговорОПС = ДоговорОПС;
						ДвижениеПН.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС;
						ДвижениеПН.ТипРезерва = ТекСтрОстатков.ТипРезерва; 
						#Вставка
						// +ХМНПФ 26.11.2015 ШадринАВ // ОбработкаПроведения() // №53
						ДвижениеПН.ТипСуммы = ТекСтрОстатков.ТипСуммы;
						// -ХМНПФ 26.11.2015 ШадринАВ // ОбработкаПроведения() // №53
						#КонецВставки
						Если ИспользоватьАналитикуРешение Тогда
							ДвижениеПН.Решение = Ссылка;
						КонецЕсли;	
						ДвижениеПН.Сумма = СуммаКСписанию;
						
						ДвижениеРД = Движения.уп_РезервыОПС.ДобавитьРасход();
						ДвижениеРД.Организация = Организация;
						ДвижениеРД.Период = ДатаВыплаты;
						ДвижениеРД.ДоговорОПС = ДоговорОПС;
						ДвижениеРД.ТипРезерва = ТекСтрОстатков.ТипРезерва;
						ДвижениеРД.ТипСуммы = ТекСтрОстатков.ТипСуммы;
						ДвижениеРД.Сумма = СуммаКСписанию;
						ДвижениеРД.Движение = Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамОПС;
						
						Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И ДатаВыплаты>=ДатаНачалаУчетаРезервовНачисления Тогда
							//резерв начислений
							ДвижениеРН = Движения.уп_РезервыОПС.ДобавитьПриход();
							ДвижениеРН.Организация = Организация;
							ДвижениеРН.Период = ДатаВыплаты;
							ДвижениеРН.ДоговорОПС = ДоговорОПС;
							Если ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений 
								ИЛИ ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН Тогда
								ДвижениеРН.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРПН;
							ИначеЕсли ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты 
								ИЛИ ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
								ДвижениеРН.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРСВ;
							КонецЕсли;	
							ДвижениеРН.ТипСуммы = ТекСтрОстатков.ТипСуммы;
							ДвижениеРН.Сумма = СуммаКСписанию;
							//Движение.Движение = Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамОПС;
						КонецЕсли;
						
						Если ОтражатьВБухгалтерскомУчете и ПроводкиПоНачислению Тогда
							ВидДвижения = ?(ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты, Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамРСВОПС, Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамОПС);
							ДвиженияПоБухУчету(ДатаВыплаты, ВидДвижения, ДоговорОПС.Участник, ДоговорОПС.ДоговорКонтрагента, 
							Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ПенсионныйФондРФ, ПенсионныйФондРФ.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, СуммаКСписанию);
						КонецЕсли;
						
						//сначала списываем суммы, которые идут свыше суммы компенсаций
						Если СуммаКСписанию>ТекСтрОстатков.Сумма-ТекСтрОстатков.СуммаКомпенсации-ТекСтрОстатков.СуммаВосполнения-ТекСтрОстатков.СуммаВозмещения Тогда
							СуммаКСписаниюБезКомпенсаций = ТекСтрОстатков.Сумма-ТекСтрОстатков.СуммаКомпенсации-ТекСтрОстатков.СуммаВосполнения-ТекСтрОстатков.СуммаВозмещения;
							СуммаОстаткаКСписанию = СуммаКСписанию-СуммаКСписаниюБезКомпенсаций;
							
							СуммаКомпенсацииКСписанию = Мин(СуммаОстаткаКСписанию, ТекСтрОстатков.СуммаКомпенсации);
							Если СуммаКомпенсацииКСписанию>0 Тогда
								
								Движение = Движения.уп_СуммыГарантийногоВосполнения.Добавить();
								Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
								Движение.Период = ДатаВыплаты;
								Движение.ДоговорОПС = ДоговорОПС;
								Движение.Организация = Организация;
								Движение.ТипСуммы = ТекСтрОстатков.ТипСуммы;
								Движение.Вариант = Перечисления.уп_ВариантВосполнения.Компенсация;
								Движение.Сумма = СуммаКомпенсацииКСписанию;
								
								ДвижениеПН.СуммаКомпенсации = СуммаКомпенсацииКСписанию;
								ДвижениеРД.СуммаКомпенсации = СуммаКомпенсацииКСписанию;
								Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И ДатаВыплаты>=ДатаНачалаУчетаРезервовНачисления Тогда
									ДвижениеРН.СуммаКомпенсации = СуммаКомпенсацииКСписанию;
								КонецЕсли;
								СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
								ТекСтрОстатков.СуммаКомпенсации = ТекСтрОстатков.СуммаКомпенсации-СуммаКомпенсацииКСписанию;
							КонецЕсли;
							
							СуммаВосполненияКСписанию = Мин(СуммаОстаткаКСписанию, ТекСтрОстатков.СуммаВосполнения);
							Если СуммаВосполненияКСписанию>0 Тогда
								
								Движение = Движения.уп_СуммыГарантийногоВосполнения.Добавить();
								Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
								Движение.Период = ДатаВыплаты;
								Движение.ДоговорОПС = ДоговорОПС;
								Движение.Организация = Организация;
								Движение.ТипСуммы = ТекСтрОстатков.ТипСуммы;
								Движение.Вариант = Перечисления.уп_ВариантВосполнения.Восполнение;
								Движение.Сумма = СуммаВосполненияКСписанию;
								
								ДвижениеПН.СуммаВосполнения = СуммаВосполненияКСписанию;
								ДвижениеРД.СуммаВосполнения = СуммаВосполненияКСписанию;
								Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И ДатаВыплаты>=ДатаНачалаУчетаРезервовНачисления Тогда
									ДвижениеРН.СуммаВосполнения = СуммаВосполненияКСписанию;
								КонецЕсли;
								СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВосполненияКСписанию;
								ТекСтрОстатков.СуммаВосполнения = ТекСтрОстатков.СуммаВосполнения-СуммаВосполненияКСписанию;
							КонецЕсли;
							
							СуммаВозмещенияКСписанию = Мин(СуммаОстаткаКСписанию, ТекСтрОстатков.СуммаВозмещения);
							Если СуммаВозмещенияКСписанию>0 Тогда
								
								Движение = Движения.уп_СуммыГарантийногоВосполнения.Добавить();
								Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
								Движение.Период = ДатаВыплаты;
								Движение.ДоговорОПС = ДоговорОПС;
								Движение.Организация = Организация;
								Движение.ТипСуммы = ТекСтрОстатков.ТипСуммы;
								Движение.Вариант = Перечисления.уп_ВариантВосполнения.Возмещение;
								Движение.Сумма = СуммаВозмещенияКСписанию;
								
								ДвижениеПН.СуммаВозмещения = СуммаВозмещенияКСписанию;
								ДвижениеРД.СуммаВозмещения = СуммаВозмещенияКСписанию;
								Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И ДатаВыплаты>=ДатаНачалаУчетаРезервовНачисления Тогда
									ДвижениеРН.СуммаВозмещения = СуммаВозмещенияКСписанию;
								КонецЕсли;
								СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
								ТекСтрОстатков.СуммаВозмещения = ТекСтрОстатков.СуммаВозмещения-СуммаВозмещенияКСписанию;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				СуммаНаследнику = СуммаНаследнику-СуммаКСписанию;
				ТекСтрОстатков.Сумма = ТекСтрОстатков.Сумма-СуммаКСписанию;
				Если СуммаНаследнику = 0 Тогда
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
			#Удаление
			Если СуммаНаследнику>0 Тогда
			#КонецУдаления
			#Вставка
			Если СуммаНаследнику>0 и ХМ_НеПроверять=Ложь Тогда
			#КонецВставки
				Сообщить("Не удалось начислить сумму в резерв "+СуммаНаследнику);
				Отказ = Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	Если СуммаМКВПФР>0 Тогда
		СуммаНаследнику = СуммаМКВПФР; 
		Для Каждого ТекСтрОстатков из ТОстатковМК Цикл
			СуммаКСписанию = Мин(СуммаНаследнику, ТекСтрОстатков.Сумма);
			Если СуммаКСписанию<>0 Тогда
				Движение = Движения.уп_РезервыОПС.ДобавитьРасход();
				Движение.Организация = Организация;
				Движение.Период = ДатаВыплаты;
				Движение.ДоговорОПС = ДоговорОПС;
				Движение.ТипРезерва = ТекСтрОстатков.ТипРезерва;
				Движение.ТипСуммы = ТекСтрОстатков.ТипСуммы;
				Движение.Сумма = СуммаКСписанию;
				Движение.Движение = Перечисления.уп_ВидыДвижений.ВозвратМатеринскогоКапиталаРСВ;
				
				Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И ДатаВыплаты>=ДатаНачалаУчетаРезервовНачисления Тогда
					//резерв начислений
					Движение = Движения.уп_РезервыОПС.ДобавитьПриход();
					Движение.Организация = Организация;
					Движение.Период = ДатаВыплаты;
					Движение.ДоговорОПС = ДоговорОПС;
					Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийВозвратМСКРСВ;
					Движение.ТипСуммы = ТекСтрОстатков.ТипСуммы;
					Движение.Сумма = СуммаКСписанию;
					Движение.Движение = Перечисления.уп_ВидыДвижений.ВозвратМатеринскогоКапиталаРСВ;
				КонецЕсли;
				
				Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = ДатаВыплаты;
				Движение.Организация = Организация;
				Движение.Участник = ПенсионныйФондРФ;
				Движение.ДоговорОПС = ДоговорОПС;
				Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапитала;
				Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты; 
				#Вставка
				// +ХМНПФ 26.11.2015 ШадринАВ // ОбработкаПроведения() // №53
				Движение.ТипСуммы = ТекСтрОстатков.ТипСуммы;
				// -ХМНПФ 26.11.2015 ШадринАВ // ОбработкаПроведения() // №53
				#КонецВставки
				Если ИспользоватьАналитикуРешение Тогда
					Движение.Решение = Ссылка;
				КонецЕсли;	
				Движение.Сумма = СуммаКСписанию;
				Если ОтражатьВБухгалтерскомУчете и ПроводкиПоНачислению Тогда
					ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.ВозвратМатеринскогоКапиталаРСВ, ДоговорОПС.Участник, ДоговорОПС.ДоговорКонтрагента, 
					Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ПенсионныйФондРФ, ПенсионныйФондРФ.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, СуммаКСписанию);
				КонецЕсли;
			КонецЕсли;
			СуммаНаследнику = СуммаНаследнику-СуммаКСписанию;
			ТекСтрОстатков.Сумма = ТекСтрОстатков.Сумма-СуммаКСписанию;
			Если СуммаНаследнику = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если СуммаНаследнику>0 Тогда
			Сообщить("Не удалось начислить сумму материнского капитала в ПФР "+СуммаНаследнику);
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
	//состояние
	Движение = Движения.уп_СостоянияДоговораОПС.Добавить();
	Движение.ДоговорОПС = ДоговорОПС;
	Движение.Период = ДатаВыплаты;
	Если ДополнительнаяВыплата = Истина Тогда
		Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.Закрыт;
	Иначе
		Движение.Состояние = Перечисления.уп_СостоянияДоговоровОПС.ПодготовкаКЗакрытию;
	КонецЕсли;
	
	Если НачалоДня(ДатаВыплаты)>НачалоДня(Дата) Тогда 
		СформироватьДвиженияЗадолженностиАСВ();
	КонецЕсли;	
	
	//Добавим движения по бухгалтерии
	Если ОтражатьВБухгалтерскомУчете Тогда
		уп_ОбщегоНазначенияУчетРезервов.ДополнитьТаблицуБухУчета(Дата, ТабБухУчет, Ссылка, Отказ);
		уп_ОбщегоНазначенияУчетРезервов.СделатьДвиженияПоБухУчету(ЭтотОбъект, ТабБухУчет);
	КонецЕсли;	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&После("ПриУстановкеНовогоНомера")
Процедура ХМ_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	ХМ_ПодпискиНаСобытия.ХМ_НомераРешенийПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);	
КонецПроцедуры

#Если Клиент Тогда

&ИзменениеИКонтроль("Печать")
Процедура РасшОбщ_Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	#Вставка
	// +ХМНПФ 07.10.2016 ШадринАВ // Печать() // №568
	Если НЕ Проведен Тогда   
		Сообщить("Перед печатью документ необходимо провести.");
		//Вопрос("Перед печатью документ необходимо провести.",РежимДиалогаВопрос.ОК, , 
		//               КодВозвратаДиалога.ОК,
		//               "Документ не проведен");
		Возврат;
	КонецЕсли;
	// -ХМНПФ 07.10.2016 ШадринАВ // Печать() // №568
	#КонецВставки
	// Получить экземпляр документа на печать
	Если ИмяМакета = "Приложение1" и ДополнительнаяВыплата = Ложь тогда
		
		ПечатьПриложения1();
	ИначеЕсли  ИмяМакета = "Приложение1" и ДополнительнаяВыплата = Истина тогда
		ПечатьПриложения2();
		//ТабДокумент = ПечатьПоступлениеТоваров();		
	ИначеЕсли ИмяМакета = "Приложение2" и ДополнительнаяВыплата = Истина тогда
		
		ПечатьПриложения2();
		//ТабДокумент = ПечатьТОРГ12ЗаПоставщика();	
	ИначеЕсли ИмяМакета = "Приложение2" и ДополнительнаяВыплата = Ложь тогда
		
		ПечатьПриложения1();
	ИначеЕсли ИмяМакета = "Приложение3" тогда
		
		ПечатьПриложения3();
		//ТабДокумент = ПечатьТОРГ4();
	ИначеЕсли ИмяМакета = "Приложение4" тогда
		
		ПечатьПриложения4();
		//ТабДокумент = ПечатьМ4();
	КонецЕсли;
	
	//НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, Строка(ВидОперации)), НепосредственнаяПечать);
	
КонецПроцедуры // Печать

&ИзменениеИКонтроль("ПечатьПриложения1")
Процедура РасшОбщ_ПечатьПриложения1()

	ТабДок = Новый ТабличныйДокумент;
	Если Дата<'20150101' Тогда
		Макет = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("Приложение1");
	Иначе
		Макет = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("Приложение1_2015");
	КонецЕсли;	
	// Заголовок

	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, Дата);
	ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");

	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Число = Формат(Дата, "ДФ=дд");
	Область.Параметры.Месяц = Сред(Формат(Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Дата, "ДЛФ=дд")))-10);
	Область.Параметры.Год = Формат(Дата, "ДФ=гггг");
	Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;
	Область.Параметры.НомерРешения = Номер;
	
	ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ДоговорОПС.Участник.уп_ФизЛицо));
	Фамилия = ФИОФизЛица.Фамилия;
	Имя = ФИОФизЛица.Имя;                
	Отчество = ФИОФизЛица.Отчество;
	#Удаление
	Область.Параметры.ФИОЗастрахованного = Фамилия+" "+Имя+" "+Отчество;
	#КонецУдаления
	#Вставка
	// +ХМНПФ 26.01.2016 ШадринАВ // ПечатьПриложения1() // №149
	Область.Параметры.ФИОЗастрахованного = уп_ОбщегоНазначенияУчетРезервов.СклонятьФИО(Фамилия+" "+Имя+" "+Отчество,Лев(Строка(ДоговорОПС.Участник.уп_ФизЛицо.Пол),1),"Р");
	// -ХМНПФ 26.01.2016 ШадринАВ // ПечатьПриложения1() // №149
	#КонецВставки
	Область.Параметры.СтраховойНомер = уп_ОПС.ПреобразоватьНомерПФР(ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
	Область.Параметры.Картинка1 = "V";
	ТабДок.Вывести(Область);
	#Удаление
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	#КонецУдаления
	#Вставка
	// +ХМНПФ 18.12.2015 ШадринАВ // ПечатьПриложения1() // №108
	#КонецВставки
	
	//посмотрим по проводкам, если там по типам резерва начислено, то печатную форму оттуда формируем
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_ПрочиеНачисленияОПСОбороты.Участник,
		|	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
		|	СУММА(уп_ПрочиеНачисленияОПСОбороты.СуммаПриход) КАК СуммаПриход,
		|	ВЫБОР
		|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРПН)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)
		|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРСВ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервСрочнойВыплаты)
		|		ИНАЧЕ уп_ПрочиеНачисленияОПСОбороты.ТипРезерва
		|	КОНЕЦ КАК ТипРезерва
		|ПОМЕСТИТЬ Начисления
		|ИЗ
		|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			ДоговорОПС = &ДоговорОПС
		|				И ТипВыплаты = &ВыплатаПравопреемникам) КАК уп_ПрочиеНачисленияОПСОбороты
		|ГДЕ
		|	уп_ПрочиеНачисленияОПСОбороты.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_ПрочиеНачисленияОПСОбороты.Участник,
		|	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
		|	ВЫБОР
		|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРПН)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)
		|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРСВ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервСрочнойВыплаты)
		|		ИНАЧЕ уп_ПрочиеНачисленияОПСОбороты.ТипРезерва
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Процент,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Сумма
		|ПОМЕСТИТЬ ДанныеЗаявлений
		|ИЗ
		|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления
		|ГДЕ
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Процент,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.СуммаМК
		|ПОМЕСТИТЬ ДанныеЗаявлений31
		|ИЗ
		|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Правопреемники31 КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31
		|ГДЕ
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ДанныеЗаявлений.Заявление, ДанныеЗаявлений31.Заявление) КАК Заявление,
		|	ЕСТЬNULL(ДанныеЗаявлений.Правопреемник, ДанныеЗаявлений31.Правопреемник) КАК Правопреемник,
		|	ЕСТЬNULL(ДанныеЗаявлений.Процент, ДанныеЗаявлений31.Процент) КАК Процент,
		|	ЕСТЬNULL(ДанныеЗаявлений.Сумма, ДанныеЗаявлений31.СуммаМК) КАК Сумма
		|ПОМЕСТИТЬ Заявления
		|ИЗ
		|	ДанныеЗаявлений КАК ДанныеЗаявлений
		|		ПОЛНОЕ СОЕДИНЕНИЕ ДанныеЗаявлений31 КАК ДанныеЗаявлений31
		|		ПО ДанныеЗаявлений.Правопреемник = ДанныеЗаявлений31.Правопреемник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.Участник КАК Правопреемник,
		|	Начисления.ТипСуммы,
		|	Начисления.СуммаПриход КАК Сумма,
		|	Начисления.ТипРезерва КАК ТипРезерва,
		|	Заявления.Заявление,
		|	Заявления.Процент,
		|	Заявления.Сумма КАК СуммаТЧ
		|ИЗ
		|	Начисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Заявления КАК Заявления
		|		ПО Начисления.Участник = Заявления.Правопреемник
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТипРезерва";
	
	Запрос.УстановитьПараметр("ВыплатаПравопреемникам", Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС);
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ФормируемПоПроводкам = Ложь;
	Если Выборка.Следующий() Тогда //проверим как формировать печатную форму
		Если ЗначениеЗаполнено(Выборка.ТипРезерва) Тогда
			ФормируемПоПроводкам = Истина;
		КонецЕсли;	
	КонецЕсли;
	Если ФормируемПоПроводкам Тогда
		Выборка.Сбросить();
		ТаблицаРПН = Новый ТаблицаЗначений;
		ТаблицаРПН.Колонки.Добавить("Правопреемник");
		ТаблицаРПН.Колонки.Добавить("Заявление");
		ТаблицаРПН.Колонки.Добавить("Процент");
		ТаблицаРПН.Колонки.Добавить("Сумма");
		
		ТаблицаРСВ = Новый ТаблицаЗначений;
		ТаблицаРСВ = ТаблицаРПН.Скопировать();
		
		ТаблицаМСК = Новый ТаблицаЗначений;
		ТаблицаМСК = ТаблицаРПН.Скопировать();

		Пока Выборка.Следующий() Цикл
			Если Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений 
				или Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН Тогда
				НовСтр =  ТаблицаРПН.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
			ИначеЕсли Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты 
				или Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
				Если Выборка.ТипСуммы<>Справочники.уп_ТипыСуммОПС.МатКапитал И Выборка.ТипСуммы<>Справочники.уп_ТипыСуммОПС.ИДМатКапитал Тогда
					НовСтр =  ТаблицаРСВ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
				Иначе
					НовСтр =  ТаблицаМСК.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ТаблицаРПН.Свернуть("Правопреемник, Заявление, Процент", "Сумма");
		ТаблицаРСВ.Свернуть("Правопреемник, Заявление, Процент", "Сумма");
		ТаблицаМСК.Свернуть("Правопреемник, Заявление, Процент", "Сумма");
		
		ОбластьТаблица1 = Макет.ПолучитьОбласть("Таблица1");
		ОбластьТаблица1.Параметры.СуммаНакоплений = ТаблицаРПН.Итог("Сумма");

		#Вставка
		// +ХМНПФ 26.01.2016 ШадринАВ // ПечатьПриложения1() // №149
		ОбластьТаблица1.Параметры.СуммаНакопленийПрописью = ЧислоПрописью(ОбластьТаблица1.Параметры.СуммаНакоплений,"Л=ru_RU","рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		// -ХМНПФ 26.01.2016 ШадринАВ // ПечатьПриложения1() // №149
		#КонецВставки
		ТабДок.Вывести(ОбластьТаблица1);
		ОбластьСтрока1 = Макет.ПолучитьОбласть("Строка1");
		НомерПП = 0;
		Для Каждого стр из ТаблицаРПН Цикл
			НомерПП = НомерПП+1;
			//ОбластьСтрока1.Параметры.Заполнить(стр);
			ОбластьСтрока1.Параметры.НомерПП = НомерПП;
			ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
			ОбластьСтрока1.Параметры.ФамилияП = ФИОПП.Фамилия;
			ОбластьСтрока1.Параметры.ИмяП = ФИОПП.Имя;
			ОбластьСтрока1.Параметры.ОтчествоП = ФИОПП.Отчество;
			ОбластьСтрока1.Параметры.ДатаЗаявления = стр.Заявление.ДатаРегистрации;
			ОбластьСтрока1.Параметры.НомерЗаявления = стр.Заявление.Номер;
			ОбластьСтрока1.Параметры.РазмерДоли = стр.Процент;
			ОбластьСтрока1.Параметры.Сумма1 = стр.Сумма;
			ТабДок.Вывести(ОбластьСтрока1);
		КонецЦикла;
		
		ОбластьТаблица2 = Макет.ПолучитьОбласть("Таблица2");
		ОбластьТаблица2.Параметры.СуммаНаСчетеСрочныхВыплат = ТаблицаРСВ.Итог("Сумма");
		ТабДок.Вывести(ОбластьТаблица2);
		ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка2");
		НомерПП = 0;
		Для каждого стр из ТаблицаРСВ Цикл
			НомерПП = НомерПП+1;
			//ОбластьСтрока2.Параметры.Заполнить(стр);
			ОбластьСтрока2.Параметры.НомерПП = НомерПП;
			ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
			ОбластьСтрока2.Параметры.ФамилияП = ФИОПП.Фамилия;
			ОбластьСтрока2.Параметры.ИмяП = ФИОПП.Имя;
			ОбластьСтрока2.Параметры.ОтчествоП = ФИОПП.Отчество;
			ОбластьСтрока2.Параметры.ДатаЗаявления = стр.Заявление.ДатаРегистрации;
			ОбластьСтрока2.Параметры.НомерЗаявления = стр.Заявление.Номер;
			ОбластьСтрока2.Параметры.РазмерДоли = стр.Процент;
			ОбластьСтрока2.Параметры.Сумма2 = стр.Сумма;
			ТабДок.Вывести(ОбластьСтрока2);
		КонецЦикла;	
		
		#Вставка
		// +ХМНПФ 18.12.2015 ШадринАВ // ПечатьПриложения1() // №108
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		// +ХМНПФ 18.12.2015 ШадринАВ // ПечатьПриложения1() // №108
		#КонецВставки
		Если Дата>='20150101' Тогда
			//суммы МК в резерве быть не должно - он передается в ПФР при передаче средств в резерв
			ОбластьТаблица3 = Макет.ПолучитьОбласть("Таблица3");
			ОбластьТаблица3.Параметры.СуммаМатеринскогоКапитала = ТаблицаМСК.Итог("Сумма");
			ТабДок.Вывести(ОбластьТаблица3);
			ОбластьСтрока3 = Макет.ПолучитьОбласть("Строка3");
			НомерПП = 0;
			Для каждого стр из ТаблицаМСК Цикл
				НомерПП = НомерПП+1;
				//ОбластьСтрока3.Параметры.Заполнить(стр);
				ОбластьСтрока3.Параметры.НомерПП = НомерПП;
				ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
				ОбластьСтрока3.Параметры.ФамилияП = ФИОПП.Фамилия;
				ОбластьСтрока3.Параметры.ИмяП = ФИОПП.Имя;
				ОбластьСтрока3.Параметры.ОтчествоП = ФИОПП.Отчество;
				ОбластьСтрока2.Параметры.ДатаЗаявления = стр.Заявление.ДатаРегистрации;
				ОбластьСтрока2.Параметры.НомерЗаявления = стр.Заявление.Номер;
				ОбластьСтрока2.Параметры.РазмерДоли = стр.Процент;
				ОбластьСтрока2.Параметры.СуммаМК = стр.Сумма;
				ТабДок.Вывести(ОбластьСтрока3);
			КонецЦикла;
		КонецЕсли;	
	
	Иначе //как обычно
		
		
		//получим списки
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник) КАК Правопреемник,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление.Номер, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление.Номер) КАК НомерЗаявления,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление.ДатаРегистрации, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление.ДатаРегистрации) КАК ДатаЗаявления,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Разрешить, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Разрешить) КАК Разрешить,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Процент, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Процент) КАК РазмерДоли,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Сумма, 0) КАК Сумма,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.СуммаМК, 0) КАК СуммаМК,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка) КАК ТекДок
		|ИЗ
		|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Правопреемники31 КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31
		|		ПО уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник = уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник
		|			И уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка = уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка
		|ГДЕ
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка) = &Ссылка
		|	И ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Разрешить, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Разрешить) = ИСТИНА";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		ТаблицаПравопреемников = Запрос.Выполнить().Выгрузить();
		ТаблицаПравопреемников.Колонки.Добавить("Сумма1", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 2));
		ТаблицаПравопреемников.Колонки.Добавить("Сумма2", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 2));
		
		СуммаНакоплений = 0;
		СуммаСрочныхВыплат = 0;
		
		Для Каждого стр из РасшифровкаСуммы Цикл
			Если стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений 
				или стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН Тогда
				СуммаНакоплений = СуммаНакоплений+стр.Сумма;
			ИначеЕсли стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты 
				или стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
				Если стр.ТипСуммы<>Справочники.уп_ТипыСуммОПС.МатКапитал И стр.ТипСуммы<>Справочники.уп_ТипыСуммОПС.ИДМатКапитал Тогда
					СуммаСрочныхВыплат = СуммаСрочныхВыплат+стр.Сумма;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		
		ОбластьТаблица1 = Макет.ПолучитьОбласть("Таблица1");
		ОбластьТаблица1.Параметры.СуммаНакоплений = СуммаНакоплений;
		ТабДок.Вывести(ОбластьТаблица1);
		ОбластьСтрока1 = Макет.ПолучитьОбласть("Строка1");
		Остаток1 = СуммаНакоплений;
		Остаток2 = СуммаСрочныхВыплат;
		НомерПП = 0;
		Для Каждого стр из ТаблицаПравопреемников Цикл
			Если стр.Разрешить Тогда
				//распределим ее между резервом накопления и срочной выплаты
				Если СуммаНакоплений>0 И СуммаСрочныхВыплат>0 Тогда
					//распределяем
					сумма1Пред = Окр(стр.Сумма*СуммаНакоплений/(СуммаНакоплений+СуммаСрочныхВыплат),2);
					сумма1 = Мин(сумма1Пред,Остаток1);
					сумма2 = стр.Сумма-сумма1;
					Остаток1 = Остаток1-Сумма1;
					Остаток2 = Остаток2-Сумма2;
					стр.Сумма1 = Сумма1;
					стр.Сумма2 = Сумма2;
				ИначеЕсли СуммаНакоплений>0 Тогда
					//записываем все на сумму1
					стр.Сумма1 = стр.Сумма;
					стр.Сумма2 = 0;
				ИначеЕсли СуммаСрочныхВыплат>0 Тогда
					//записываем все на сумму2
					стр.Сумма1 = 0;
					стр.Сумма2 = стр.Сумма;
				КонецЕсли;
				Если стр.Сумма1>0 или стр.Сумма = 0 Тогда
					НомерПП = НомерПП+1;
					ОбластьСтрока1.Параметры.Заполнить(стр);
					ОбластьСтрока1.Параметры.НомерПП = НомерПП;
					ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
					ОбластьСтрока1.Параметры.ФамилияП = ФИОПП.Фамилия;
					ОбластьСтрока1.Параметры.ИмяП = ФИОПП.Имя;
					ОбластьСтрока1.Параметры.ОтчествоП = ФИОПП.Отчество;
					ТабДок.Вывести(ОбластьСтрока1);
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		
		ОбластьТаблица2 = Макет.ПолучитьОбласть("Таблица2");
		ОбластьТаблица2.Параметры.СуммаНаСчетеСрочныхВыплат = СуммаСрочныхВыплат;
		ТабДок.Вывести(ОбластьТаблица2);
		ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка2");
		НомерПП = 0;
		Для каждого стр из ТаблицаПравопреемников Цикл
			Если Дата<'20150101' Тогда
				Если стр.Сумма2>0 или стр.СуммаМК>0 Тогда
					НомерПП = НомерПП+1;
					ОбластьСтрока2.Параметры.Заполнить(стр);
					ОбластьСтрока2.Параметры.НомерПП = НомерПП;
					ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
					ОбластьСтрока2.Параметры.ФамилияП = ФИОПП.Фамилия;
					ОбластьСтрока2.Параметры.ИмяП = ФИОПП.Имя;
					ОбластьСтрока2.Параметры.ОтчествоП = ФИОПП.Отчество;
					ТабДок.Вывести(ОбластьСтрока2);
				Конецесли;
			Иначе
				Если стр.Сумма2>0 Тогда
					НомерПП = НомерПП+1;
					ОбластьСтрока2.Параметры.Заполнить(стр);
					ОбластьСтрока2.Параметры.НомерПП = НомерПП;
					ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
					ОбластьСтрока2.Параметры.ФамилияП = ФИОПП.Фамилия;
					ОбластьСтрока2.Параметры.ИмяП = ФИОПП.Имя;
					ОбластьСтрока2.Параметры.ОтчествоП = ФИОПП.Отчество;
					ТабДок.Вывести(ОбластьСтрока2);
				Конецесли;
			КонецЕсли;
		КонецЦикла;	
		
		Если Дата>='20150101' Тогда
			//суммы МК в резерве быть не должно - он передается в ПФР при передаче средств в резерв
			ОбластьТаблица3 = Макет.ПолучитьОбласть("Таблица3");
			ОбластьТаблица3.Параметры.СуммаМатеринскогоКапитала = 0;
			ТабДок.Вывести(ОбластьТаблица3);
			ОбластьСтрока3 = Макет.ПолучитьОбласть("Строка3");
			НомерПП = 0;
			Для каждого стр из ТаблицаПравопреемников Цикл
				Если стр.СуммаМК>0 Тогда
					НомерПП = НомерПП+1;
					ОбластьСтрока3.Параметры.Заполнить(стр);
					ОбластьСтрока3.Параметры.НомерПП = НомерПП;
					ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
					ОбластьСтрока3.Параметры.ФамилияП = ФИОПП.Фамилия;
					ОбластьСтрока3.Параметры.ИмяП = ФИОПП.Имя;
					ОбластьСтрока3.Параметры.ОтчествоП = ФИОПП.Отчество;
					ТабДок.Вывести(ОбластьСтрока3);
				Конецесли;	
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;

	Область = Макет.ПолучитьОбласть("Подвал"); 
	
	СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПустаяСсылка(),Организация,ДоговорОПС.Филиал,Пользователи.ТекущийПользователь(),"Приложение1",Дата);
	Область.Параметры.ДолжностьОтветственного = СведенияОбОтветственном.Должность;
	Область.Параметры.ФИООтветственного = СведенияОбОтветственном.Фамилия+" "+Лев(СведенияОбОтветственном.Имя,1)+"."+" "+Лев(СведенияОбОтветственном.Отчество,1)+".";
	
	ТабДок.Вывести(Область); 
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	#Вставка
	// +ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложения1() // №114
	ХМ_ВывестиИсполнителя(ТабДок);
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет; // ХМНПФ 18.12.2015 ШадринАВ // ПечатьПриложения1() // №108
	// -ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложения1() // №114
	#КонецВставки
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();


КонецПроцедуры // ПечатьПриложения1()

// +ХМНПФ 12.04.2017 ШадринАВ // ПечатьПриложения2() // №931
//Процедура ПечатьПриложения2()
//Процедура ПечатьПриложения2(ХМ_Рассылка = Ложь, ХМ_ТабДокРассылка = Неопределено) Экспорт
// -ХМНПФ 12.04.2017 ШадринАВ // ПечатьПриложения2() // №931
&ИзменениеИКонтроль("ПечатьПриложения2")
Процедура РасшОбщ_ПечатьПриложения2(ХМ_Рассылка = Ложь, ХМ_ТабДокРассылка = Неопределено) Экспорт
// -ХМНПФ 12.04.2017 ШадринАВ // ПечатьПриложения2() // №931

	ТабДок = Новый ТабличныйДокумент;
	Если Дата<'20150101' Тогда
		Макет = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("Приложение2");
	Иначе
		Макет = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("Приложение2_2015");
	КонецЕсли;
	// Заголовок

	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, Дата);
	ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,"); 	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Число = Формат(Дата, "ДФ=дд");
	Область.Параметры.Месяц = Сред(Формат(Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Дата, "ДЛФ=дд")))-10);
	Область.Параметры.Год = Формат(Дата, "ДФ=гггг");
	Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;
	Область.Параметры.НомерРешения = Номер;
	
	ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ДоговорОПС.Участник.уп_ФизЛицо));
	Фамилия = ФИОФизЛица.Фамилия;
	Имя = ФИОФизЛица.Имя;                
	Отчество = ФИОФизЛица.Отчество;
	Область.Параметры.ФИОЗастрахованного = Фамилия+" "+Имя+" "+Отчество;
	Область.Параметры.СтраховойНомер = уп_ОПС.ПреобразоватьНомерПФР(ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
	ТабДок.Вывести(Область);
	
	//посмотрим по проводкам, если там по типам резерва начислено, то печатную форму оттуда формируем
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_ПрочиеНачисленияОПСОбороты.Участник,
		|	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
		|	СУММА(уп_ПрочиеНачисленияОПСОбороты.СуммаПриход) КАК СуммаПриход,
		|	ВЫБОР
		|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРПН)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)
		|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРСВ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервСрочнойВыплаты)
		|		ИНАЧЕ уп_ПрочиеНачисленияОПСОбороты.ТипРезерва
		|	КОНЕЦ КАК ТипРезерва
		|ПОМЕСТИТЬ Начисления
		|ИЗ
		|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			ДоговорОПС = &ДоговорОПС
		|				И ТипВыплаты = &ВыплатаПравопреемникам) КАК уп_ПрочиеНачисленияОПСОбороты
		|ГДЕ
		|	уп_ПрочиеНачисленияОПСОбороты.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_ПрочиеНачисленияОПСОбороты.Участник,
		|	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
		|	ВЫБОР
		|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРПН)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)
		|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРСВ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервСрочнойВыплаты)
		|		ИНАЧЕ уп_ПрочиеНачисленияОПСОбороты.ТипРезерва
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ПрочиеНачисленияОПСОбороты.Участник,
		|	МАКСИМУМ(уп_ПрочиеНачисленияОПСОбороты.Период) КАК ДатаВыплаты,
		|	СУММА(ВЫБОР
		|			КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипСуммы В (&МСК)
		|				ТОГДА уп_ПрочиеНачисленияОПСОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаМСКДо,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ уп_ПрочиеНачисленияОПСОбороты.ТипСуммы В (&МСК)
		|					И уп_ПрочиеНачисленияОПСОбороты.ТипРезерва В (&РПН)
		|				ТОГДА уп_ПрочиеНачисленияОПСОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаРПНДо,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ уп_ПрочиеНачисленияОПСОбороты.ТипСуммы В (&МСК)
		|					И уп_ПрочиеНачисленияОПСОбороты.ТипРезерва В (&РСВ)
		|				ТОГДА уп_ПрочиеНачисленияОПСОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаРСВДо
		|ПОМЕСТИТЬ НачисленияДо
		|ИЗ
		|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
		|			,
		|			&ДатаДоДокумента,
		|			Регистратор,
		|			ДоговорОПС = &ДоговорОПС
		|				И ТипВыплаты = &ВыплатаПравопреемникам
		|				И ТипРезерва <> ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервОПС)) КАК уп_ПрочиеНачисленияОПСОбороты
		|ГДЕ
		|	уп_ПрочиеНачисленияОПСОбороты.Регистратор ССЫЛКА Документ.уп_ВыплатныеРеестры
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_ПрочиеНачисленияОПСОбороты.Участник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Процент,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Сумма
		|ПОМЕСТИТЬ ДанныеЗаявлений
		|ИЗ
		|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления
		|ГДЕ
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Процент,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.СуммаМК
		|ПОМЕСТИТЬ ДанныеЗаявлений31
		|ИЗ
		|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Правопреемники31 КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31
		|ГДЕ
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ДанныеЗаявлений.Заявление, ДанныеЗаявлений31.Заявление) КАК Заявление,
		|	ЕСТЬNULL(ДанныеЗаявлений.Правопреемник, ДанныеЗаявлений31.Правопреемник) КАК Правопреемник,
		|	ЕСТЬNULL(ДанныеЗаявлений.Процент, ДанныеЗаявлений31.Процент) КАК Процент,
		|	ЕСТЬNULL(ДанныеЗаявлений.Сумма, ДанныеЗаявлений31.СуммаМК) КАК Сумма
		|ПОМЕСТИТЬ Заявления
		|ИЗ
		|	ДанныеЗаявлений КАК ДанныеЗаявлений
		|		ПОЛНОЕ СОЕДИНЕНИЕ ДанныеЗаявлений31 КАК ДанныеЗаявлений31
		|		ПО ДанныеЗаявлений.Правопреемник = ДанныеЗаявлений31.Правопреемник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.Участник КАК Правопреемник,
		|	Начисления.ТипСуммы,
		|	Начисления.СуммаПриход КАК Сумма,
		|	Начисления.ТипРезерва КАК ТипРезерва,
		|	Заявления.Заявление,
		|	Заявления.Процент,
		|	Заявления.Сумма КАК СуммаТЧ,
		|	НачисленияДо.ДатаВыплаты,
		|	ЕСТЬNULL(НачисленияДо.СуммаМСКДо, 0) КАК СуммаМСКДо,
		|	ЕСТЬNULL(НачисленияДо.СуммаРПНДо, 0) КАК СуммаРПНДо,
		|	ЕСТЬNULL(НачисленияДо.СуммаРСВДо, 0) КАК СуммаРСВДо
		|ИЗ
		|	Начисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Заявления КАК Заявления
		|		ПО Начисления.Участник = Заявления.Правопреемник
		|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияДо КАК НачисленияДо
		|		ПО Начисления.Участник = НачисленияДо.Участник
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТипРезерва";
	
	Запрос.УстановитьПараметр("ВыплатаПравопреемникам", Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС);
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаДоДокумента", Дата-1);
	РПН = Новый СписокЗначений();
	РПН.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	РПН.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН);
	РСВ = Новый СписокЗначений();
	РСВ.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты);
	РСВ.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ);
	МСК = Новый СписокЗначений();
	МСК.Добавить(Справочники.уп_ТипыСуммОПС.МатКапитал);
	МСК.Добавить(Справочники.уп_ТипыСуммОПС.ИДМатКапитал);
	Запрос.УстановитьПараметр("РПН", РПН);
	Запрос.УстановитьПараметр("РСВ", РСВ);
	Запрос.УстановитьПараметр("МСК", МСК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ФормируемПоПроводкам = Ложь;
	Если Выборка.Следующий() Тогда //проверим как формировать печатную форму
		Если ЗначениеЗаполнено(Выборка.ТипРезерва) Тогда
			ФормируемПоПроводкам = Истина;
		КонецЕсли;	
	КонецЕсли;
	Если ФормируемПоПроводкам Тогда
		Выборка.Сбросить();
		ТаблицаРПН = Новый ТаблицаЗначений;
		ТаблицаРПН.Колонки.Добавить("Правопреемник");
		ТаблицаРПН.Колонки.Добавить("Заявление");
		ТаблицаРПН.Колонки.Добавить("Процент");
		ТаблицаРПН.Колонки.Добавить("Сумма");
		ТаблицаРПН.Колонки.Добавить("ДатаВыплаты");
		ТаблицаРПН.Колонки.Добавить("СуммаДо");
		
		ТаблицаРСВ = Новый ТаблицаЗначений;
		ТаблицаРСВ = ТаблицаРПН.Скопировать();
		
		ТаблицаМСК = Новый ТаблицаЗначений;
		ТаблицаМСК = ТаблицаРПН.Скопировать();

		Пока Выборка.Следующий() Цикл
			Если Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений 
				или Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН Тогда
				НовСтр =  ТаблицаРПН.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
				Если Выборка.СуммаРПНДо>0 Тогда
					НовСтр.СуммаДо = Выборка.СуммаРПНДо;
					НовСтр.ДатаВыплаты = Выборка.ДатаВыплаты;
				Иначе
					НовСтр.СуммаДо = 0;
					НовСтр.ДатаВыплаты = "";
				КонецЕсли;
			ИначеЕсли Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты 
				или Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
				Если Выборка.ТипСуммы<>Справочники.уп_ТипыСуммОПС.МатКапитал И Выборка.ТипСуммы<>Справочники.уп_ТипыСуммОПС.ИДМатКапитал Тогда
					НовСтр =  ТаблицаРСВ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
					Если Выборка.СуммаРСВДо>0 Тогда
						НовСтр.СуммаДо = Выборка.СуммаРСВДо;
						НовСтр.ДатаВыплаты = Выборка.ДатаВыплаты;
					Иначе
						НовСтр.СуммаДо = 0;
						НовСтр.ДатаВыплаты = "";
					КонецЕсли;
				Иначе
					НовСтр =  ТаблицаМСК.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
					Если Выборка.СуммаМСКДо>0 Тогда
						НовСтр.СуммаДо = Выборка.СуммаМСКДо;
						НовСтр.ДатаВыплаты = Выборка.ДатаВыплаты;
					Иначе
						НовСтр.СуммаДо = 0;
						НовСтр.ДатаВыплаты = "";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ТаблицаРПН.Свернуть("Правопреемник, Заявление, Процент, ДатаВыплаты, СуммаДо", "Сумма");
		ТаблицаРСВ.Свернуть("Правопреемник, Заявление, Процент, ДатаВыплаты, СуммаДо", "Сумма");
		ТаблицаМСК.Свернуть("Правопреемник, Заявление, Процент, ДатаВыплаты, СуммаДо", "Сумма");
		
		ОбластьТаблица1 = Макет.ПолучитьОбласть("Таблица1");
		ОбластьТаблица1.Параметры.СуммаНакоплений = ТаблицаРПН.Итог("Сумма");
		ТабДок.Вывести(ОбластьТаблица1);
		ОбластьСтрока1 = Макет.ПолучитьОбласть("Строка1");
		НомерПП = 0;
		Для Каждого стр из ТаблицаРПН Цикл
			НомерПП = НомерПП+1;
			//ОбластьСтрока1.Параметры.Заполнить(стр);
			ОбластьСтрока1.Параметры.НомерПП = НомерПП;
			ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
			ОбластьСтрока1.Параметры.ФамилияП = ФИОПП.Фамилия;
			ОбластьСтрока1.Параметры.ИмяП = ФИОПП.Имя;
			ОбластьСтрока1.Параметры.ОтчествоП = ФИОПП.Отчество;
			ОбластьСтрока1.Параметры.ДатаЗаявления = стр.Заявление.ДатаРегистрации;
			ОбластьСтрока1.Параметры.НомерЗаявления = стр.Заявление.Номер;
			ОбластьСтрока1.Параметры.РазмерДоли = стр.Процент;
			ОбластьСтрока1.Параметры.Сумма1 = стр.Сумма;
			ОбластьСтрока1.Параметры.ДатаВыплаты = стр.ДатаВыплаты;
			ОбластьСтрока1.Параметры.СуммаДо = стр.СуммаДо;
			
			ТабДок.Вывести(ОбластьСтрока1);
		КонецЦикла;
		
		ОбластьТаблица2 = Макет.ПолучитьОбласть("Таблица2");
		ОбластьТаблица2.Параметры.СуммаНаСчетеСрочныхВыплат = ТаблицаРСВ.Итог("Сумма");
		ТабДок.Вывести(ОбластьТаблица2);
		ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка2");
		НомерПП = 0;
		Для каждого стр из ТаблицаРСВ Цикл
			НомерПП = НомерПП+1;
			//ОбластьСтрока2.Параметры.Заполнить(стр);
			ОбластьСтрока2.Параметры.НомерПП = НомерПП;
			ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
			ОбластьСтрока2.Параметры.ФамилияП = ФИОПП.Фамилия;
			ОбластьСтрока2.Параметры.ИмяП = ФИОПП.Имя;
			ОбластьСтрока2.Параметры.ОтчествоП = ФИОПП.Отчество;
			ОбластьСтрока2.Параметры.ДатаЗаявления = стр.Заявление.ДатаРегистрации;
			ОбластьСтрока2.Параметры.НомерЗаявления = стр.Заявление.Номер;
			ОбластьСтрока2.Параметры.РазмерДоли = стр.Процент;
			ОбластьСтрока2.Параметры.Сумма2 = стр.Сумма;
			ОбластьСтрока2.Параметры.ДатаВыплаты = стр.ДатаВыплаты;
			ОбластьСтрока2.Параметры.СуммаДо = стр.СуммаДо;
			
			ТабДок.Вывести(ОбластьСтрока2);
		КонецЦикла;	
		
		Если Дата>='20150101' Тогда
			//суммы МК в резерве быть не должно - он передается в ПФР при передаче средств в резерв
			ОбластьТаблица3 = Макет.ПолучитьОбласть("Таблица3");
			ОбластьТаблица3.Параметры.СуммаМатеринскогоКапитала = ТаблицаМСК.Итог("Сумма");
			ТабДок.Вывести(ОбластьТаблица3);
			ОбластьСтрока3 = Макет.ПолучитьОбласть("Строка3");
			НомерПП = 0;
			Для каждого стр из ТаблицаМСК Цикл
				НомерПП = НомерПП+1;
				//ОбластьСтрока3.Параметры.Заполнить(стр);
				ОбластьСтрока3.Параметры.НомерПП = НомерПП;
				ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
				ОбластьСтрока3.Параметры.ФамилияП = ФИОПП.Фамилия;
				ОбластьСтрока3.Параметры.ИмяП = ФИОПП.Имя;
				ОбластьСтрока3.Параметры.ОтчествоП = ФИОПП.Отчество;
				ОбластьСтрока3.Параметры.ДатаЗаявления = стр.Заявление.ДатаРегистрации;
				ОбластьСтрока3.Параметры.НомерЗаявления = стр.Заявление.Номер;
				ОбластьСтрока3.Параметры.РазмерДоли = стр.Процент;
				ОбластьСтрока3.Параметры.СуммаМК = стр.Сумма;
				ОбластьСтрока3.Параметры.ДатаВыплаты = стр.ДатаВыплаты;
				ОбластьСтрока3.Параметры.СуммаДо = стр.СуммаДо;
				
				ТабДок.Вывести(ОбластьСтрока3);
			КонецЦикла;
		КонецЕсли;	
	Иначе
		//получим списки
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник) КАК Правопреемник,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление.Номер, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление.Номер) КАК НомерЗаявления,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление.ДатаРегистрации, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление.ДатаРегистрации) КАК ДатаЗаявления,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Разрешить, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Разрешить) КАК Разрешить,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Процент, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Процент) КАК РазмерДоли,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Сумма, 0) КАК Сумма,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.СуммаМК, 0) КАК СуммаМК,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка) КАК ТекДок
		|ИЗ
		|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Правопреемники31 КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31
		|		ПО уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник = уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник
		|			И уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка = уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка
		|ГДЕ
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка) = &Ссылка
		|	И ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Разрешить, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Разрешить) = ИСТИНА";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		ТаблицаПравопреемников = Запрос.Выполнить().Выгрузить();
		ТаблицаПравопреемников.Колонки.Добавить("Сумма1", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 2));
		ТаблицаПравопреемников.Колонки.Добавить("Сумма2", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 2));
		
		СуммаНакоплений = 0;
		СуммаСрочныхВыплат = 0;
		
		Для Каждого стр из РасшифровкаСуммы Цикл
			Если стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений 
				ИЛИ стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН Тогда
				СуммаНакоплений = СуммаНакоплений+стр.Сумма;
			ИначеЕсли стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты 
				ИЛИ стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
				Если стр.ТипСуммы<>Справочники.уп_ТипыСуммОПС.МатКапитал И стр.ТипСуммы<>Справочники.уп_ТипыСуммОПС.ИДМатКапитал Тогда
					СуммаСрочныхВыплат = СуммаСрочныхВыплат+стр.Сумма;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		
		ОбластьТаблица1 = Макет.ПолучитьОбласть("Таблица1");
		ОбластьТаблица1.Параметры.СуммаНакоплений = СуммаНакоплений;
		ТабДок.Вывести(ОбластьТаблица1);
		ОбластьСтрока1 = Макет.ПолучитьОбласть("Строка1");
		Остаток1 = СуммаНакоплений;
		Остаток2 = СуммаСрочныхВыплат;
		НомерПП = 0;
		Для Каждого стр из ТаблицаПравопреемников Цикл
			Если стр.Разрешить Тогда
				//распределим ее между резервом накопления и срочной выплаты
				Если СуммаНакоплений>0 И СуммаСрочныхВыплат>0 Тогда
					//распределяем
					сумма1Пред = Окр(стр.Сумма*СуммаНакоплений/(СуммаНакоплений+СуммаСрочныхВыплат),2);
					сумма1 = Мин(сумма1Пред,Остаток1);
					сумма2 = стр.Сумма-сумма1;
					Остаток1 = Остаток1-Сумма1;
					Остаток2 = Остаток2-Сумма2;
					стр.Сумма1 = Сумма1;
					стр.Сумма2 = Сумма2;
				ИначеЕсли СуммаНакоплений>0 Тогда
					//записываем все на сумму1
					стр.Сумма1 = стр.Сумма;
					стр.Сумма2 = 0;
				ИначеЕсли СуммаСрочныхВыплат>0 Тогда
					//записываем все на сумму2
					стр.Сумма1 = 0;
					стр.Сумма2 = стр.Сумма;
				КонецЕсли;
				Если стр.Сумма1>0 или стр.Сумма = 0 Тогда
					НомерПП = НомерПП+1;
					ОбластьСтрока1.Параметры.Заполнить(стр);
					ОбластьСтрока1.Параметры.НомерПП = НомерПП;
					ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
					ОбластьСтрока1.Параметры.ФамилияП = ФИОПП.Фамилия;
					ОбластьСтрока1.Параметры.ИмяП = ФИОПП.Имя;
					ОбластьСтрока1.Параметры.ОтчествоП = ФИОПП.Отчество;
					ТабДок.Вывести(ОбластьСтрока1);
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		
		//Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
		//Ном = 1;
		//Для Каждого ТекСтрока Из Заявления Цикл
		//	Если ТекСтрока.Разрешить Тогда
		//		ФИО = СокрЛП(ТекСтрока.Правопреемник.Наименование);
		//		Фам = Лев(ФИО, Найти(ФИО, " ")-1);
		//		ИО = Прав(ФИО, СтрДлина(ФИО)-Найти(ФИО, " "));
		//		Имя = Лев(ИО, Найти(ИО, " ")-1);
		//		Отчество = Прав(ИО, СтрДлина(ИО)-Найти(ИО, " "));
		//		Область.Параметры.НомерСтроки = Ном;
		//		Область.Параметры.ФамилияСтр = Фам;
		//		Область.Параметры.ИмяСтр = Имя;
		//		Область.Параметры.ОтчествоСтр = Отчество;
		//		Область.Параметры.ДатаРегистрСтр = ТекСтрока.Заявление.ДатаРегистрации;
		//		Область.Параметры.РегистрНомерСтр = ТекСтрока.Заявление.Номер;
		//		Область.Параметры.РазмерДолиСтр = ТекСтрока.Процент;
		//		Область.Параметры.СуммаНакоплСтр = ТекСтрока.Сумма;
		//		ТабДок.Вывести(Область);
		//		Ном = Ном + 1;
		//	КонецЕсли;
		//КонецЦикла;
		
		ОбластьТаблица2 = Макет.ПолучитьОбласть("Таблица2");
		ОбластьТаблица2.Параметры.СуммаНаСчетеСрочныхВыплат = СуммаСрочныхВыплат;
		ТабДок.Вывести(ОбластьТаблица2);
		ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка2");
		НомерПП = 0;
		Для каждого стр из ТаблицаПравопреемников Цикл
			Если Дата<'20150101' Тогда
				Если стр.Сумма2>0 или стр.СуммаМК>0 Тогда
					НомерПП = НомерПП+1;
					ОбластьСтрока2.Параметры.Заполнить(стр);
					ОбластьСтрока2.Параметры.НомерПП = НомерПП;
					ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
					ОбластьСтрока2.Параметры.ФамилияП = ФИОПП.Фамилия;
					ОбластьСтрока2.Параметры.ИмяП = ФИОПП.Имя;
					ОбластьСтрока2.Параметры.ОтчествоП = ФИОПП.Отчество;
					ТабДок.Вывести(ОбластьСтрока2);
				Конецесли;
			Иначе
				Если стр.Сумма2>0 Тогда
					НомерПП = НомерПП+1;
					ОбластьСтрока2.Параметры.Заполнить(стр);
					ОбластьСтрока2.Параметры.НомерПП = НомерПП;
					ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
					ОбластьСтрока2.Параметры.ФамилияП = ФИОПП.Фамилия;
					ОбластьСтрока2.Параметры.ИмяП = ФИОПП.Имя;
					ОбластьСтрока2.Параметры.ОтчествоП = ФИОПП.Отчество;
					ТабДок.Вывести(ОбластьСтрока2);
				Конецесли;
			КонецЕсли;
		КонецЦикла;	
		
		Если Дата>='20150101' Тогда
			//суммы МК в резерве быть не должно - он передается в ПФР при передаче средств в резерв
			ОбластьТаблица3 = Макет.ПолучитьОбласть("Таблица3");
			ОбластьТаблица3.Параметры.СуммаМатеринскогоКапитала = 0;
			ТабДок.Вывести(ОбластьТаблица3);
			ОбластьСтрока3 = Макет.ПолучитьОбласть("Строка3");
			НомерПП = 0;
			Для каждого стр из ТаблицаПравопреемников Цикл
				Если стр.СуммаМК>0 Тогда
					НомерПП = НомерПП+1;
					ОбластьСтрока3.Параметры.Заполнить(стр);
					ОбластьСтрока3.Параметры.НомерПП = НомерПП;
					ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
					ОбластьСтрока3.Параметры.ФамилияП = ФИОПП.Фамилия;
					ОбластьСтрока3.Параметры.ИмяП = ФИОПП.Имя;
					ОбластьСтрока3.Параметры.ОтчествоП = ФИОПП.Отчество;
					ТабДок.Вывести(ОбластьСтрока3);
				Конецесли;	
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
	Область = Макет.ПолучитьОбласть("Подвал");	
	
	СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПустаяСсылка(),Организация,ДоговорОПС.Филиал,Пользователи.ТекущийПользователь(),"Приложение1",Дата);
	Область.Параметры.ДолжностьОтветственного = СведенияОбОтветственном.Должность;
	Область.Параметры.ФИООтветственного = Лев(СведенияОбОтветственном.Имя,1)+"."+Лев(СведенияОбОтветственном.Отчество,1)+"."+СведенияОбОтветственном.Фамилия;
	
	#Вставка
	// +ХМНПФ 12.04.2017 ШадринАВ // ПечатьПриложения2() // №931
	Если ХМ_Рассылка Тогда
		ХМ_МакетРассылка = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("ХМ_ПодвалПриложение2_2015дляРассылки");
		Область = ХМ_МакетРассылка.ПолучитьОбласть("Подвал");
	КонецЕсли;
	// -ХМНПФ 12.04.2017 ШадринАВ // ПечатьПриложения2() // №931
	#КонецВставки
	ТабДок.Вывести(Область); 
	#Вставка
	// +ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложения2() // №114
	ХМ_ВывестиИсполнителя(ТабДок);
	// -ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложения2() // №114
	#КонецВставки
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();

КонецПроцедуры // ПечатьПриложения2()

&ИзменениеИКонтроль("ПечатьПриложения3")
Процедура РасшОбщ_ПечатьПриложения3()
	
	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, Дата);
	ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
	СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПустаяСсылка(),Организация,ДоговорОПС.Филиал,Пользователи.ТекущийПользователь(),"Приложение3",Дата);
	
	ТабДок = Новый ТабличныйДокумент;
	Если Дата<'20150101' Тогда
		Макет = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("Приложение3");
	Иначе
		Макет = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("Приложение3_2015");
	КонецЕсли;
	
	//получим списки
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник) КАК Правопреемник,
	               |	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление.Номер, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление.Номер) КАК НомерЗаявления,
	               |	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление.ДатаРегистрации, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление.ДатаРегистрации) КАК ДатаЗаявления,
	               |	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Разрешить, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Разрешить) КАК Разрешить,
	               |	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.СуммаМК, 0) КАК СуммаМК,
	               |	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка) КАК ТекДок,
	               |	ЕстьNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.ПричинаОтказа,0) КАК ПричинаОтказа1,
	               |	ЕстьNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.ПричинаОтказа,0) КАК ПричинаОтказа2
	               |ИЗ
	               |	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Правопреемники31 КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31
	               |		ПО уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник = уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник
	               |			И уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка = уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка
	               |ГДЕ
	               |	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка) = &Ссылка
	               |	И ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Разрешить, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Разрешить) = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	НомерПП = 0;
	Пока Выборка.Следующий() Цикл
		НомерПП = НомерПП+1;
		
		// Заголовок
		Область = Макет.ПолучитьОбласть("Отчет");
		Область.Параметры.Число = Формат(Дата, "ДФ=дд");
		Область.Параметры.Месяц = Сред(Формат(Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Дата, "ДЛФ=дд")))-10);
		Область.Параметры.Год = Формат(Дата, "ДФ=гггг");
		Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;
		Область.Параметры.НомерРешения = Номер+"/"+НомерПП;
		НомерПП = НомерПП+1;
		
		ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", Выборка.Правопреемник.уп_ФизЛицо));
		Фамилия = ФИОФизЛица.Фамилия;
		Имя = ФИОФизЛица.Имя;                
		Отчество = ФИОФизЛица.Отчество;
		Область.Параметры.ФИОДатаРождения = Фамилия+" "+Имя+" "+Отчество+", "+Формат(Выборка.Правопреемник.уп_ФизЛицо.ДатаРождения,"ДЛФ=DD");
		Область.Параметры.ЧислоЗ = Формат(Выборка.ДатаЗаявления, "ДФ=дд");
		Область.Параметры.МесяцЗ = Сред(Формат(Выборка.ДатаЗаявления, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Выборка.ДатаЗаявления, "ДЛФ=дд")))-10);
		Область.Параметры.ГодЗ = Формат(Выборка.ДатаЗаявления, "ДФ=гггг");
		Область.Параметры.НомерЗаявления = Выборка.НомерЗаявления;
		ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ДоговорОПС.Участник.уп_ФизЛицо));
		Фамилия = ФИОФизЛица.Фамилия;
		Имя = ФИОФизЛица.Имя;                
		Отчество = ФИОФизЛица.Отчество;
		Область.Параметры.ФИОЗастрахованного = Фамилия+" "+Имя+" "+Отчество;
		Область.Параметры.СтраховойНомер = ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР;
		
		Картинка1 = "";
		Картинка2 = "";
		Картинка3 = "";
		Картинка4 = "";
		Картинка5 = "";
		Картинка6 = "";
		Картинка7 = "";
		Картинка8 = "";
		Если Выборка.ПричинаОтказа1 = 1 или Выборка.ПричинаОтказа2 = 1 Тогда
			Картинка1 = "V";
		ИначеЕсли Выборка.ПричинаОтказа1 = 2 или Выборка.ПричинаОтказа2 = 2 Тогда
			Картинка2 = "V";
		ИначеЕсли Выборка.ПричинаОтказа1 = 3 или Выборка.ПричинаОтказа2 = 3 Тогда
			Картинка3 = "V";
		ИначеЕсли Выборка.ПричинаОтказа1 = 4 или Выборка.ПричинаОтказа2 = 4 Тогда
			Картинка4 = "V";
		ИначеЕсли Выборка.ПричинаОтказа1 = 5 или Выборка.ПричинаОтказа2 = 5 Тогда
			Картинка5 = "V";
		ИначеЕсли Выборка.ПричинаОтказа1 = 6 или Выборка.ПричинаОтказа2 = 6 Тогда
			Картинка6 = "V";
		ИначеЕсли Выборка.ПричинаОтказа1 = 7 или Выборка.ПричинаОтказа2 = 7 Тогда
			Картинка7 = "V";
		ИначеЕсли Выборка.ПричинаОтказа1 = 8 или Выборка.ПричинаОтказа2 = 8 Тогда
			Картинка8 = "V";
		КонецЕсли;	
		Область.Параметры.Картинка1 = Картинка1;
		Область.Параметры.Картинка2 = Картинка2;
		Область.Параметры.Картинка3 = Картинка3;
		Область.Параметры.Картинка4 = Картинка4;
		Область.Параметры.Картинка5 = Картинка5;
		Область.Параметры.Картинка6 = Картинка6;
		Область.Параметры.Картинка7 = Картинка7;
		Если Дата>='20150101' Тогда
			Область.Параметры.Картинка8 = Картинка8;
		КонецЕсли;
		
		Область.Параметры.ДолжностьОтветственного = СведенияОбОтветственном.Должность;
		Область.Параметры.ФИООтветственного = Лев(СведенияОбОтветственном.Имя,1)+"."+Лев(СведенияОбОтветственном.Отчество,1)+"."+СведенияОбОтветственном.Фамилия;
		
		ТабДок.Вывести(Область);
		#Вставка
		// +ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложения3() // №114
		ХМ_ВывестиИсполнителя(ТабДок);
		// -ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложения3() // №114
		#КонецВставки
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.Показать();
КонецПроцедуры // ПечатьПриложения3()

&ИзменениеИКонтроль("ПечатьПриложения4")
Процедура РасшОбщ_ПечатьПриложения4()
	Если ДополнительнаяВыплата Тогда
		//найти предыдущее решение
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник,
		|	РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка.Номер,
		|	РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка.Дата
		|ИЗ
		|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК РешениеОВыплатеСредствПенсионныхНакопленийЗаявления
		|ГДЕ
		|	РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка.Проведен = ИСТИНА
		|	И РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка.ДоговорОПС = &ДоговорОПС
		|	И РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка.ДополнительнаяВыплата = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, Дата);
		ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
		
		Если ТЗ.Количество()>0 Тогда
			Для каждого стр из Заявления Цикл
				ТекСтрока = ТЗ.Найти(стр.Правопреемник, "Правопреемник");
				Если ТекСтрока = Неопределено Тогда
					ТабДок = Новый ТабличныйДокумент;
					Если Дата<'20150101' Тогда
						Макет = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("Приложение4");
					Иначе
						Макет = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("Приложение4_2015");
					КонецЕсли;
					// Заголовок
					Область = Макет.ПолучитьОбласть("Шапка");
					Область.Параметры.Число = Формат(Дата, "ДФ=дд");
					Область.Параметры.Месяц = Сред(Формат(Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Дата, "ДЛФ=дд")))-10);
					Область.Параметры.Год = Формат(Дата, "ДФ=гггг");
					Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;
					Область.Параметры.НомерРешения = Номер;
					
					ТабДок.Вывести(Область);
					
					Область = Макет.ПолучитьОбласть("ТекстоваяЧасть");
					ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ДоговорОПС.Участник.уп_ФизЛицо));
					Фамилия = ФИОФизЛица.Фамилия;
					Имя = ФИОФизЛица.Имя;                
					Отчество = ФИОФизЛица.Отчество;
					Область.Параметры.ФИОЗастрахованного = Фамилия+" "+Имя+" "+Отчество;
					Область.Параметры.СтраховойНомер = ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР;
					Область.Параметры.ДоговорОПС = "договор №"+ДоговорОПС.Код+" от "+Формат(ДоговорОПС.ДатаЗаключения, "ДЛФ=DD");
					
					//информация о правопреемнике
					ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", Стр.Правопреемник.уп_ФизЛицо));
					Область.Параметры.Фамилия = ФИОФизЛица.Фамилия;
					Область.Параметры.Имя = ФИОФизЛица.Имя;                
					Область.Параметры.Отчество = ФИОФизЛица.Отчество;
					Область.Параметры.ДатаРождения = стр.Правопреемник.уп_ФизЛицо.ДатаРождения;
					ПаспортныеДанные = уп_ОсновнаяПоставкаСервер.ПолучитьДанныеДокументаУдостоверяющегоЛичность(Стр.Правопреемник.уп_ФизЛицо, Дата);
					Область.Параметры.ДокументВид = ПаспортныеДанные.ВидДокумента.Наименование;
					Область.Параметры.СерияНомер =  "серия "+ПаспортныеДанные.Серия+" №"+ПаспортныеДанные.Номер;
					Область.Параметры.Число = Формат(стр.Заявление.ДатаРегистрации, "ДФ=дд");
					Область.Параметры.Месяц = Сред(Формат(стр.Заявление.ДатаРегистрации, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(стр.Заявление.ДатаРегистрации, "ДЛФ=дд")))-10);
					Область.Параметры.Год = Формат(стр.Заявление.ДатаРегистрации, "ДФ=гггг");
					Область.Параметры.Номер = стр.Заявление.Номер;
					
					ТекСтрТЗ = ТЗ.Получить(0);
					Область.Параметры.Число1 = Формат(ТекСтрТЗ.Дата, "ДФ=дд");
					Область.Параметры.Месяц1 = Сред(Формат(ТекСтрТЗ.Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(ТекСтрТЗ.Дата, "ДЛФ=дд")))-10);
					Область.Параметры.Год1 = Формат(ТекСтрТЗ.Дата, "ДФ=гггг");
					Область.Параметры.ФИОПравопреемника = ФИОФизЛица.Фамилия+" "+ФИОФизЛица.Имя+" "+ФИОФизЛица.Отчество;
					
					ТабДок.Вывести(Область);
					
					Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
					ТабДок.Вывести(Область);
					
					Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
					Область.Параметры.СуммаНаСчете = СуммаНаСчете;
					Область.Параметры.Доля = стр.Процент;
					Область.Параметры.Сумма = стр.Сумма;
					ТабДок.Вывести(Область);
					
					Область = Макет.ПолучитьОбласть("Подвал");
					
					//Запрос = Новый Запрос;
					//Запрос.Текст = "ВЫБРАТЬ
					//|	РаботникиОрганизацийСрезПоследних.Должность
					//|ИЗ
					//|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
					//|			&Период,
					//|			Сотрудник.Физлицо = &ОтветственныйФизЛицо
					//|				И Организация = &Организация) КАК РаботникиОрганизацийСрезПоследних";		
					//Запрос.УстановитьПараметр("Период", Дата);
					//Запрос.УстановитьПараметр("ОтветственныйФизЛицо", Ответственный.ФизЛицо);
					//Запрос.УстановитьПараметр("Организация", Организация);
					//
					//ТЗДолжностьОтветственного = Запрос.Выполнить().Выгрузить();
					//
					////ТЗДолжностьОтветственного = РегистрыСведений.РаботникиОрганизаций.СрезПоследних(Дата, Новый Структура("ФизЛицо, Организация",Ответственный.ФизЛицо,Организация));
					//Если ТЗДолжностьОтветственного.Количество()>0 Тогда
					//	Область.Параметры.ДолжностьОтветственного = ТЗДолжностьОтветственного.Получить(0).Должность;
					//Иначе
					//	Область.Параметры.ДолжностьОтветственного = "";
					//КонецЕсли;
					//Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
					//	ФИООтветственного = "";
					//	Область.Параметры.ФИООтветственного = "";
					//Иначе
					//	ФИООтветственного = РегистрыСведений.ФИОФизЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизЛицо", Ответственный.ФизЛицо));
					//	Область.Параметры.ФИООтветственного = Лев(ФИООтветственного.Имя,1)+"."+Лев(ФИООтветственного.Отчество,1)+"."+ФИООтветственного.Фамилия;
					//КонецЕсли;
					
					СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПустаяСсылка(),Организация,ДоговорОПС.Филиал,Пользователи.ТекущийПользователь(),"Приложение4",Дата);
					Область.Параметры.ДолжностьОтветственного = СведенияОбОтветственном.Должность;
					Область.Параметры.ФИООтветственного = Лев(СведенияОбОтветственном.Имя,1)+"."+Лев(СведенияОбОтветственном.Отчество,1)+"."+СведенияОбОтветственном.Фамилия;
					
					ТабДок.Вывести(Область); 
					
					ТабДок.ОтображатьСетку = Ложь;
					#Вставка
					// +ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложения3() // №114
					ХМ_ВывестиИсполнителя(ТабДок);
					// -ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложения3() // №114
					#КонецВставки
					ТабДок.Защита = Ложь;
					ТабДок.ТолькоПросмотр = Ложь;
					ТабДок.ОтображатьЗаголовки = Ложь;
					ТабДок.Показать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ПечатьПриложения4()

#КонецЕсли

&ИзменениеИКонтроль("ПроверкаКорректности")
Процедура РасшОбщ_ПроверкаКорректности(Отказ, Заголовок)
	
	ОбщаяСуммаНаСчете = СуммаНаСчете+СуммаМатКапитала+СуммаМатКапиталаНаСчетеСрочныхВыплат;
	#Удаление
	Если ОбщаяСуммаНаСчете<>РасшифровкаСуммы.Итог("Сумма") Тогда
	#КонецУдаления
	#Вставка
	Если ОбщаяСуммаНаСчете<>РасшифровкаСуммы.Итог("Сумма") И ХМ_НеПроверять = Ложь Тогда
	#КонецВставки
		Отказ = Истина;
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору №"+ДоговорОПС.Код+" не соответствуют сумма остатка и сумма расшифровки.",,Заголовок);
	КонецЕсли;	
	
	//еще надо проверить, чтобы тип суммы и тип резерва были заполнены
	Для каждого стр из РасшифровкаСуммы Цикл
		Если НЕ ЗначениеЗаполнено(стр.ТипСуммы) Тогда
			Отказ = Истина;
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору №"+стр.ДоговорОПС+" не указан тип суммы.",,Заголовок);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(стр.ТипРезерва) Тогда
			Отказ = Истина;
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору №"+стр.ДоговорОПС+" не указан тип резерва.",,Заголовок);
		КонецЕсли;
	КонецЦикла;
	
	//еще проверка остатков в регистре
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уп_РешениеОВыплатеСредствПенсионныхНакопленийРасшифровкаСуммы.ДоговорОПС,
	               |	уп_РешениеОВыплатеСредствПенсионныхНакопленийРасшифровкаСуммы.ТипСуммы,
	               |	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийРасшифровкаСуммы.Сумма, 0) КАК Сумма,
	               |	ЕСТЬNULL(уп_РезервыОПСОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	               |	уп_РезервыОПСОстатки.ТипРезерва,
	               |	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийРасшифровкаСуммы.СуммаГарантированная, 0) КАК СуммаГарантированная
	               |ИЗ
	               |	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.РасшифровкаСуммы КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийРасшифровкаСуммы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_РезервыОПС.Остатки(
	               |				&ДатаДок,
	               |				ДоговорОПС = &ДоговорОПС
	               |					И Организация = &Организация) КАК уп_РезервыОПСОстатки
	               |		ПО уп_РешениеОВыплатеСредствПенсионныхНакопленийРасшифровкаСуммы.ДоговорОПС = уп_РезервыОПСОстатки.ДоговорОПС
	               |			И уп_РешениеОВыплатеСредствПенсионныхНакопленийРасшифровкаСуммы.ТипСуммы = уп_РезервыОПСОстатки.ТипСуммы
	               |			И уп_РешениеОВыплатеСредствПенсионныхНакопленийРасшифровкаСуммы.ТипРезерва = уп_РезервыОПСОстатки.ТипРезерва
	               |ГДЕ
	               |	уп_РешениеОВыплатеСредствПенсионныхНакопленийРасшифровкаСуммы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаДок", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ДатаВступления = Константы.уп_ДатаВступленияВСистемуГарантирования.Получить();
	Пока Выборка.Следующий() Цикл
	    Если Выборка.Сумма>Выборка.СуммаОстаток Тогда
			Отказ = Истина;
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору №"+Выборка.ДоговорОПС+" по типу суммы "+Выборка.ТипСуммы+" не достаточно средств",,Заголовок);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДатаВступления) И Дата>=ДатаВступления И НЕ ДополнительнаяВыплата Тогда
			Если Выборка.Сумма<Выборка.СуммаГарантированная Тогда
				#Удаление
				Отказ = Истина;
				#КонецУдаления
				#Вставка
				// ХМНПФ 10.09.2016 Лыткин А.М. //ПроверкаКорректности
				#КонецВставки
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору №"+Выборка.ДоговорОПС+" по типу суммы "+Выборка.ТипСуммы+" остаток на счете меньше гарантированной суммы. Необходимо оформить документ ""Перевод средств из резерва ОПС"".",,Заголовок);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//если есть суммы в резерве ОПС, то надо известить
	Если СуммаВРезервеОПС<>0 Тогда
		Сообщить("На договоре есть суммы, находящиеся в резерве ОПС. Выплата таких сумм осуществляется документом ""Решение о выплате средств ПН из резерва фонда по ОПС"".",СтатусСообщения.Важное); 
	КонецЕсли;	
	
КонецПроцедуры	

&ИзменениеИКонтроль("СоответствиеПравопреемникуПоЗаявлению")
Процедура РасшОбщ_СоответствиеПравопреемникуПоЗаявлению(ПравопреемникиПоЗаявлению, ПравопреемникиВБазе, ПоляПоиска, ВсегоПоЗаявлению, Распределено, ВыплаченныеСуммы)

	#Удаление
	СуммаИтого = СуммаНаСчете + ВыплаченныеСуммы.Итог("Сумма");     	
	#КонецУдаления
	#Вставка
	// +ХМНПФ 21.04.2016 ШадринАВ // СоответствиеПравопреемникуПоЗаявлению() // №325
	ХМ_ПеречисленоВРОПС = ХМ_ПолучитьСуммуПеречисленийВРОПС();
	СуммаИтого = СуммаНаСчете + ВыплаченныеСуммы.Итог("Сумма") + ХМ_ПеречисленоВРОПС;
	// -ХМНПФ 21.04.2016 ШадринАВ // СоответствиеПравопреемникуПоЗаявлению() // №325
	#КонецВставки
    	
	Запрос = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "Выбрать * Поместить ПравопреемникиПоЗаявлению ИЗ &ПравопреемникиПоЗаявлению КАК ПравопреемникиПоЗаявлению";
	Запрос.УстановитьПараметр("ПравопреемникиПоЗаявлению", ПравопреемникиПоЗаявлению);
	Запрос.Выполнить();
	
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	Контрагенты.уп_ФизЛицо.ДатаРождения КАК ДатаРождения,
	|	Контрагенты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Правопреемник
	|ИЗ
	|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаДок, ) КАК ФИОФизЛицСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ФИОФизЛицСрезПоследних.ФизическоеЛицо = Контрагенты.уп_ФизЛицо
	|ГДЕ
	|	Контрагенты.Ссылка В(&ПравопреемникиВБазе)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Правопреемник.Фамилия,
	|	Правопреемник.Имя,
	|	Правопреемник.Отчество,
	|	Правопреемник.ДатаРождения,
	|	ПравопреемникиПоЗаявлению.Фамилия КАК ФамилияЗаяв,
	|	ПравопреемникиПоЗаявлению.Имя КАК ИмяЗаяв,
	|	ПравопреемникиПоЗаявлению.Отчество КАК ОтчествоЗаяв,
	|	ПравопреемникиПоЗаявлению.ДатаРождения КАК ДатаРожденияЗаяв,
	|	ПравопреемникиПоЗаявлению.Доля,
	|	Правопреемник.Ссылка КАК Правопреемник
	|ИЗ
	|	Правопреемник КАК Правопреемник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПравопреемникиПоЗаявлению КАК ПравопреемникиПоЗаявлению
	#Удаление
	|		ПО Правопреемник.Фамилия = ПравопреемникиПоЗаявлению.Фамилия
	|			И Правопреемник.Имя = ПравопреемникиПоЗаявлению.Имя
	|			И Правопреемник.Отчество = ПравопреемникиПоЗаявлению.Отчество
	|			И Правопреемник.ДатаРождения = ПравопреемникиПоЗаявлению.ДатаРождения";
	#КонецУдаления
	#Вставка
	// +ХМНПФ 16.11.2015 ШадринАВ // СоответствиеПравопреемникуПоЗаявлению() // №41
	|		ПО ( Правопреемник.Фамилия = ПравопреемникиПоЗаявлению.Фамилия
	|			И Правопреемник.Имя = ПравопреемникиПоЗаявлению.Имя
	|			И Правопреемник.Отчество = ПравопреемникиПоЗаявлению.Отчество
	|			И Правопреемник.ДатаРождения = ПравопреемникиПоЗаявлению.ДатаРождения )
	|			ИЛИ Правопреемник.Ссылка = ПравопреемникиПоЗаявлению.ХМ_Правоприемник";
	// -ХМНПФ 16.11.2015 ШадринАВ // СоответствиеПравопреемникуПоЗаявлению() // №41
	#КонецВставки
	
	Запрос.УстановитьПараметр("ДатаДок", КонецДня(Дата));
	Запрос.УстановитьПараметр("ПравопреемникиВБазе", ПравопреемникиВБазе);
	
	Если ПоляПоиска = 3 ИЛИ ПоляПоиска = 2 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Правопреемник.Фамилия = ПравопреемникиПоЗаявлению.Фамилия", ""); 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Правопреемник.Имя", "Правопреемник.Имя"); 
	КонецЕсли;
	Если ПоляПоиска = 2 ИЛИ ПоляПоиска = 3.5 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Правопреемник.ДатаРождения = ПравопреемникиПоЗаявлению.ДатаРождения", ""); 
	КонецЕсли;
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		текСтр = ЭтотОбъект.Заявления.Найти(Выборка.Правопреемник,"Правопреемник");
		Если ВыплаченныеСуммы.Количество() > 0 И ВыплаченныеСуммы.Найти(Выборка.Правопреемник, "Правопреемник") <> Неопределено Тогда
			СуммаВыплачено = ВыплаченныеСуммы.Найти(Выборка.Правопреемник, "Правопреемник").Сумма; 
		Иначе
			СуммаВыплачено = 0;
		КонецЕсли;
		Если Выборка.Доля = 0 Тогда  //поровну
//{{MRG[ <-> ]
			Если ВсегоПоЗаявлению<>0 Тогда
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//			текСтр.Процент = 100/ВсегоПоЗаявлению;
//}}MRG[ <-> ]
				текСтр.Процент = 100/ВсегоПоЗаявлению;
			КонецЕсли;
		Иначе
			текСтр.Процент = Выборка.Доля;
		КонецЕсли;
		текСтр.СуммаВыплачено = СуммаВыплачено;
		#Удаление
		СуммаВыплатыИтого = Окр(текСтр.Процент/100*СуммаИтого,2,РежимОкругления.Окр15как10);
		#КонецУдаления
		#Вставка
		// +ХМНПФ 21.04.2016 ШадринАВ // СоответствиеПравопреемникуПоЗаявлению() // №325
		ХМ_ДоляОтказавшихся = ХМ_ПолучитьДолюОтказавшихся(ПравопреемникиПоЗаявлению);
		СуммаВыплатыИтого = Цел(текСтр.Процент / (100 - ХМ_ДоляОтказавшихся) * 100 * СуммаИтого) / 100;
		текСтр.Процент = текСтр.Процент / (100 - ХМ_ДоляОтказавшихся) * 100; // ХМНПФ 25.03.2016 ШадринАВ // №2125
		// -ХМНПФ 21.04.2016 ШадринАВ // СоответствиеПравопреемникуПоЗаявлению() // №325
		#КонецВставки
		текСтр.СуммаВыплатыИтого = СуммаВыплатыИтого;
		СуммаКВыплате = СуммаВыплатыИтого-СуммаВыплачено;
		Если СуммаКВыплате < 0 Тогда 
			текСтр.Сумма = 0;
			СообщениеОбОшибке = "Отрицательная сумма к выплате по правопреемнику " + Выборка.Правопреемник.Наименование + " (договор "+СокрЛП(ДоговорОПС.Наименование)+").";
			Сообщить(СообщениеОбОшибке, СтатусСообщения.Важное);
		Иначе
			текСтр.Сумма = СуммаКВыплате;
		КонецЕсли;	 
		Если (Распределено+текСтр.Сумма)>СуммаНаСчете Тогда
			текСтр.Сумма = СуммаНаСчете - Распределено;
		КонецЕсли;	
		Распределено = Распределено+текСтр.Сумма;
		ПравопреемникиВБазе.Удалить(ПравопреемникиВБазе.Найти(Выборка.Правопреемник));
		Если ПоляПоиска = 4 Тогда
			ОтборПоЗаявлению = Новый Структура("Фамилия, Имя, Отчество, ДатаРождения", Выборка.ФамилияЗаяв, Выборка.ИмяЗаяв, Выборка.ОтчествоЗаяв, Выборка.ДатаРожденияЗаяв);
		ИначеЕсли ПоляПоиска = 3 Тогда
			ОтборПоЗаявлению = Новый Структура("Имя, Отчество, ДатаРождения", Выборка.ИмяЗаяв, Выборка.ОтчествоЗаяв, Выборка.ДатаРожденияЗаяв);
			Сообщить("Фамилия правопреемника " + Выборка.Правопреемник+ " не совпадает с данными в заявлении о наличии правопреемников"+ " (договор "+СокрЛП(ДоговорОПС.Наименование)+").");
		ИначеЕсли ПоляПоиска = 3.5 Тогда
			ОтборПоЗаявлению = Новый Структура("Фамилия, Имя, Отчество", Выборка.ФамилияЗаяв, Выборка.ИмяЗаяв, Выборка.ОтчествоЗаяв);
			Сообщить("Дата рождения правопреемника " + Выборка.Правопреемник+ " не совпадает с данными в заявлении о наличии правопреемников"+ " (договор "+СокрЛП(ДоговорОПС.Наименование)+").");
		ИначеЕсли ПоляПоиска = 2 Тогда
			ОтборПоЗаявлению = Новый Структура("Имя, Отчество", Выборка.ИмяЗаяв, Выборка.ОтчествоЗаяв);
			Сообщить("Дата рождения и фамилия правопреемника " + Выборка.Правопреемник+ " не совпадает с данными в заявлении о наличии правопреемников"+ " (договор "+СокрЛП(ДоговорОПС.Наименование)+").");
		КонецЕсли;	
			ПравопреемникиПоЗаявлению.Удалить(ПравопреемникиПоЗаявлению.НайтиСтроки(ОтборПоЗаявлению)[0]);
	КонецЦикла;
	
КонецПроцедуры

// ХМНПФ 31.03.2021 ШадринАВ // Новая ХМ_ПечатьПриложения2Сервер() // №3152
Функция ХМ_ПечатьПриложения2Сервер(ТабДок, ХМ_Рассылка = Ложь) Экспорт
	Если ТабДок=Неопределено Тогда
		ТабДок = Новый ТабличныйДокумент;
	Иначе
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	Если Дата<'20150101' Тогда
		Макет = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("Приложение2");
	Иначе
		Макет = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("ПФ_MXL_Приложение2_2015");
	КонецЕсли;
	// Заголовок

	СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация, Дата);
	ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");

	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Число = Формат(Дата, "ДФ=дд");
	Область.Параметры.Месяц = Сред(Формат(Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Дата, "ДЛФ=дд")))-10);
	Область.Параметры.Год = Формат(Дата, "ДФ=гггг");
	Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;
	Область.Параметры.НомерРешения = Номер;
	
	ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ДоговорОПС.Участник.уп_ФизЛицо));
	Фамилия = ФИОФизЛица.Фамилия;
	Имя = ФИОФизЛица.Имя;                
	Отчество = ФИОФизЛица.Отчество;
	Область.Параметры.ФИОЗастрахованного = Фамилия+" "+Имя+" "+Отчество;
	Область.Параметры.СтраховойНомер = уп_ОПС.ПреобразоватьНомерПФР(ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
	ТабДок.Вывести(Область);
	
	//посмотрим по проводкам, если там по типам резерва начислено, то печатную форму оттуда формируем
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_ПрочиеНачисленияОПСОбороты.Участник,
		|	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
		|	СУММА(уп_ПрочиеНачисленияОПСОбороты.СуммаПриход) КАК СуммаПриход,
		|	ВЫБОР
		|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРПН)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)
		|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРСВ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервСрочнойВыплаты)
		|		ИНАЧЕ уп_ПрочиеНачисленияОПСОбороты.ТипРезерва
		|	КОНЕЦ КАК ТипРезерва
		|ПОМЕСТИТЬ Начисления
		|ИЗ
		|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			ДоговорОПС = &ДоговорОПС
		|				И ТипВыплаты = &ВыплатаПравопреемникам) КАК уп_ПрочиеНачисленияОПСОбороты
		|ГДЕ
		|	уп_ПрочиеНачисленияОПСОбороты.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_ПрочиеНачисленияОПСОбороты.Участник,
		|	уп_ПрочиеНачисленияОПСОбороты.ТипСуммы,
		|	ВЫБОР
		|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРПН)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)
		|		КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервНаследниковРСВ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервСрочнойВыплаты)
		|		ИНАЧЕ уп_ПрочиеНачисленияОПСОбороты.ТипРезерва
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ПрочиеНачисленияОПСОбороты.Участник,
		|	МАКСИМУМ(уп_ПрочиеНачисленияОПСОбороты.Период) КАК ДатаВыплаты,
		|	СУММА(ВЫБОР
		|			КОГДА уп_ПрочиеНачисленияОПСОбороты.ТипСуммы В (&МСК)
		|				ТОГДА уп_ПрочиеНачисленияОПСОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаМСКДо,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ уп_ПрочиеНачисленияОПСОбороты.ТипСуммы В (&МСК)
		|					И уп_ПрочиеНачисленияОПСОбороты.ТипРезерва В (&РПН)
		|				ТОГДА уп_ПрочиеНачисленияОПСОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаРПНДо,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ уп_ПрочиеНачисленияОПСОбороты.ТипСуммы В (&МСК)
		|					И уп_ПрочиеНачисленияОПСОбороты.ТипРезерва В (&РСВ)
		|				ТОГДА уп_ПрочиеНачисленияОПСОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаРСВДо
		|ПОМЕСТИТЬ НачисленияДо
		|ИЗ
		|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
		|			,
		|			&ДатаДоДокумента,
		|			Регистратор,
		|			ДоговорОПС = &ДоговорОПС
		// +ХМНПФ 17.04.2020 ШадринАВ // ПечатьПриложения2Сервер() // №2796
		|				И НЕ ХМ_Возврат
		// -ХМНПФ 17.04.2020 ШадринАВ // ПечатьПриложения2Сервер() // №2796
		|				И ТипВыплаты = &ВыплатаПравопреемникам
		|				И ТипРезерва <> ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервОПС)) КАК уп_ПрочиеНачисленияОПСОбороты
		|ГДЕ
		|	уп_ПрочиеНачисленияОПСОбороты.Регистратор ССЫЛКА Документ.уп_ВыплатныеРеестры
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_ПрочиеНачисленияОПСОбороты.Участник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Процент,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Сумма
		|ПОМЕСТИТЬ ДанныеЗаявлений
		|ИЗ
		|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления
		|ГДЕ
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Процент,
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.СуммаМК
		|ПОМЕСТИТЬ ДанныеЗаявлений31
		|ИЗ
		|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Правопреемники31 КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31
		|ГДЕ
		|	уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ДанныеЗаявлений.Заявление, ДанныеЗаявлений31.Заявление) КАК Заявление,
		|	ЕСТЬNULL(ДанныеЗаявлений.Правопреемник, ДанныеЗаявлений31.Правопреемник) КАК Правопреемник,
		|	ЕСТЬNULL(ДанныеЗаявлений.Процент, ДанныеЗаявлений31.Процент) КАК Процент,
		|	ЕСТЬNULL(ДанныеЗаявлений.Сумма, ДанныеЗаявлений31.СуммаМК) КАК Сумма
		|ПОМЕСТИТЬ Заявления
		|ИЗ
		|	ДанныеЗаявлений КАК ДанныеЗаявлений
		|		ПОЛНОЕ СОЕДИНЕНИЕ ДанныеЗаявлений31 КАК ДанныеЗаявлений31
		|		ПО ДанныеЗаявлений.Правопреемник = ДанныеЗаявлений31.Правопреемник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Начисления.Участник КАК Правопреемник,
		|	Начисления.ТипСуммы,
		|	Начисления.СуммаПриход КАК Сумма,
		|	Начисления.ТипРезерва КАК ТипРезерва,
		|	Заявления.Заявление,
		|	Заявления.Процент,
		|	Заявления.Сумма КАК СуммаТЧ,
		|	НачисленияДо.ДатаВыплаты,
		|	ЕСТЬNULL(НачисленияДо.СуммаМСКДо, 0) КАК СуммаМСКДо,
		|	ЕСТЬNULL(НачисленияДо.СуммаРПНДо, 0) КАК СуммаРПНДо,
		|	ЕСТЬNULL(НачисленияДо.СуммаРСВДо, 0) КАК СуммаРСВДо
		|ИЗ
		|	Начисления КАК Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Заявления КАК Заявления
		|		ПО Начисления.Участник = Заявления.Правопреемник
		|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияДо КАК НачисленияДо
		|		ПО Начисления.Участник = НачисленияДо.Участник
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТипРезерва";
	
	Запрос.УстановитьПараметр("ВыплатаПравопреемникам", Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС);
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаДоДокумента", Дата-1);
	РПН = Новый СписокЗначений();
	РПН.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	РПН.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН);
	РПН.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервЕВ);
	РСВ = Новый СписокЗначений();
	РСВ.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты);
	РСВ.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ);
	МСК = Новый СписокЗначений();
	МСК.Добавить(Справочники.уп_ТипыСуммОПС.МатКапитал);
	МСК.Добавить(Справочники.уп_ТипыСуммОПС.ИДМатКапитал);
	Запрос.УстановитьПараметр("РПН", РПН);
	Запрос.УстановитьПараметр("РСВ", РСВ);
	Запрос.УстановитьПараметр("МСК", МСК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ФормируемПоПроводкам = Ложь;
	Если Выборка.Следующий() Тогда //проверим как формировать печатную форму
		Если ЗначениеЗаполнено(Выборка.ТипРезерва) Тогда
			ФормируемПоПроводкам = Истина;
		КонецЕсли;	
	КонецЕсли;
	Если ФормируемПоПроводкам Тогда
		Выборка.Сбросить();
		ТаблицаРПН = Новый ТаблицаЗначений;
		ТаблицаРПН.Колонки.Добавить("Правопреемник");
		ТаблицаРПН.Колонки.Добавить("Заявление");
		ТаблицаРПН.Колонки.Добавить("Процент");
		ТаблицаРПН.Колонки.Добавить("Сумма");
		ТаблицаРПН.Колонки.Добавить("ДатаВыплаты");
		ТаблицаРПН.Колонки.Добавить("СуммаДо");
		
		ТаблицаРСВ = Новый ТаблицаЗначений;
		ТаблицаРСВ = ТаблицаРПН.Скопировать();
		
		ТаблицаМСК = Новый ТаблицаЗначений;
		ТаблицаМСК = ТаблицаРПН.Скопировать();

		Пока Выборка.Следующий() Цикл
			Если Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений 
				или Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН Тогда
				НовСтр =  ТаблицаРПН.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
				Если Выборка.СуммаРПНДо>0 Тогда
					НовСтр.СуммаДо = Выборка.СуммаРПНДо;
					НовСтр.ДатаВыплаты = Выборка.ДатаВыплаты;
				Иначе
					НовСтр.СуммаДо = 0;
					НовСтр.ДатаВыплаты = "";
				КонецЕсли;
			ИначеЕсли Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты 
				или Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
				Если Выборка.ТипСуммы<>Справочники.уп_ТипыСуммОПС.МатКапитал И Выборка.ТипСуммы<>Справочники.уп_ТипыСуммОПС.ИДМатКапитал Тогда
					НовСтр =  ТаблицаРСВ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
					Если Выборка.СуммаРСВДо>0 Тогда
						НовСтр.СуммаДо = Выборка.СуммаРСВДо;
						НовСтр.ДатаВыплаты = Выборка.ДатаВыплаты;
					Иначе
						НовСтр.СуммаДо = 0;
						НовСтр.ДатаВыплаты = "";
					КонецЕсли;
				Иначе
					НовСтр =  ТаблицаМСК.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
					Если Выборка.СуммаМСКДо>0 Тогда
						НовСтр.СуммаДо = Выборка.СуммаМСКДо;
						НовСтр.ДатаВыплаты = Выборка.ДатаВыплаты;
					Иначе
						НовСтр.СуммаДо = 0;
						НовСтр.ДатаВыплаты = "";
					КонецЕсли;
				КонецЕсли;
			Иначе
				НовСтр =  ТаблицаРПН.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
				Если Выборка.СуммаРПНДо>0 Тогда
					НовСтр.СуммаДо = Выборка.СуммаРПНДо;
					НовСтр.ДатаВыплаты = Выборка.ДатаВыплаты;
				Иначе
					НовСтр.СуммаДо = 0;
					НовСтр.ДатаВыплаты = "";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ТаблицаРПН.Свернуть("Правопреемник, Заявление, Процент, ДатаВыплаты, СуммаДо", "Сумма");
		ТаблицаРСВ.Свернуть("Правопреемник, Заявление, Процент, ДатаВыплаты, СуммаДо", "Сумма");
		ТаблицаМСК.Свернуть("Правопреемник, Заявление, Процент, ДатаВыплаты, СуммаДо", "Сумма");
		
		ОбластьТаблица1 = Макет.ПолучитьОбласть("Таблица1");
		ОбластьТаблица1.Параметры.СуммаНакоплений = ТаблицаРПН.Итог("Сумма");
		ТабДок.Вывести(ОбластьТаблица1);
		ОбластьСтрока1 = Макет.ПолучитьОбласть("Строка1");
		НомерПП = 0;
		Для Каждого стр из ТаблицаРПН Цикл
			НомерПП = НомерПП+1;
			//ОбластьСтрока1.Параметры.Заполнить(стр);
			ОбластьСтрока1.Параметры.НомерПП = НомерПП;
			ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
			ОбластьСтрока1.Параметры.ФамилияП = ФИОПП.Фамилия;
			ОбластьСтрока1.Параметры.ИмяП = ФИОПП.Имя;
			ОбластьСтрока1.Параметры.ОтчествоП = ФИОПП.Отчество;
			ОбластьСтрока1.Параметры.ДатаЗаявления = стр.Заявление.ДатаРегистрации;
			ОбластьСтрока1.Параметры.НомерЗаявления = стр.Заявление.Номер;
			ОбластьСтрока1.Параметры.РазмерДоли = стр.Процент;
			ОбластьСтрока1.Параметры.Сумма1 = стр.Сумма;
			ОбластьСтрока1.Параметры.ДатаВыплаты = стр.ДатаВыплаты;
			ОбластьСтрока1.Параметры.СуммаДо = стр.СуммаДо;
			
			ТабДок.Вывести(ОбластьСтрока1);
		КонецЦикла;
		
		ОбластьТаблица2 = Макет.ПолучитьОбласть("Таблица2");
		ОбластьТаблица2.Параметры.СуммаНаСчетеСрочныхВыплат = ТаблицаРСВ.Итог("Сумма");
		ТабДок.Вывести(ОбластьТаблица2);
		ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка2");
		НомерПП = 0;
		Для каждого стр из ТаблицаРСВ Цикл
			НомерПП = НомерПП+1;
			//ОбластьСтрока2.Параметры.Заполнить(стр);
			ОбластьСтрока2.Параметры.НомерПП = НомерПП;
			ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
			ОбластьСтрока2.Параметры.ФамилияП = ФИОПП.Фамилия;
			ОбластьСтрока2.Параметры.ИмяП = ФИОПП.Имя;
			ОбластьСтрока2.Параметры.ОтчествоП = ФИОПП.Отчество;
			ОбластьСтрока2.Параметры.ДатаЗаявления = стр.Заявление.ДатаРегистрации;
			ОбластьСтрока2.Параметры.НомерЗаявления = стр.Заявление.Номер;
			ОбластьСтрока2.Параметры.РазмерДоли = стр.Процент;
			ОбластьСтрока2.Параметры.Сумма2 = стр.Сумма;
			ОбластьСтрока2.Параметры.ДатаВыплаты = стр.ДатаВыплаты;
			ОбластьСтрока2.Параметры.СуммаДо = стр.СуммаДо;
			
			ТабДок.Вывести(ОбластьСтрока2);
		КонецЦикла;	
		
		Если Дата>='20150101' Тогда
			//суммы МК в резерве быть не должно - он передается в ПФР при передаче средств в резерв
			ОбластьТаблица3 = Макет.ПолучитьОбласть("Таблица3");
			ОбластьТаблица3.Параметры.СуммаМатеринскогоКапитала = ТаблицаМСК.Итог("Сумма");
			ТабДок.Вывести(ОбластьТаблица3);
			ОбластьСтрока3 = Макет.ПолучитьОбласть("Строка3");
			НомерПП = 0;
			Для каждого стр из ТаблицаМСК Цикл
				НомерПП = НомерПП+1;
				//ОбластьСтрока3.Параметры.Заполнить(стр);
				ОбластьСтрока3.Параметры.НомерПП = НомерПП;
				ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
				ОбластьСтрока3.Параметры.ФамилияП = ФИОПП.Фамилия;
				ОбластьСтрока3.Параметры.ИмяП = ФИОПП.Имя;
				ОбластьСтрока3.Параметры.ОтчествоП = ФИОПП.Отчество;
				ОбластьСтрока3.Параметры.ДатаЗаявления = стр.Заявление.ДатаРегистрации;
				ОбластьСтрока3.Параметры.НомерЗаявления = стр.Заявление.Номер;
				ОбластьСтрока3.Параметры.РазмерДоли = стр.Процент;
				ОбластьСтрока3.Параметры.СуммаМК = стр.Сумма;
				ОбластьСтрока3.Параметры.ДатаВыплаты = стр.ДатаВыплаты;
				ОбластьСтрока3.Параметры.СуммаДо = стр.СуммаДо;
				
				ТабДок.Вывести(ОбластьСтрока3);
			КонецЦикла;
		КонецЕсли;	
	Иначе
		//получим списки
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник) КАК Правопреемник,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление.Номер, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление.Номер) КАК НомерЗаявления,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Заявление.ДатаРегистрации, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Заявление.ДатаРегистрации) КАК ДатаЗаявления,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Разрешить, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Разрешить) КАК Разрешить,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Процент, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Процент) КАК РазмерДоли,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Сумма, 0) КАК Сумма,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.СуммаМК, 0) КАК СуммаМК,
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка) КАК ТекДок
		|ИЗ
		|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления
		|		ПОЛНОЕ СОЕДИНЕНИЕ Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Правопреемники31 КАК уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31
		|		ПО уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Правопреемник = уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Правопреемник
		|			И уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка = уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка
		|ГДЕ
		|	ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Ссылка, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Ссылка) = &Ссылка
		|	И ЕСТЬNULL(уп_РешениеОВыплатеСредствПенсионныхНакопленийЗаявления.Разрешить, уп_РешениеОВыплатеСредствПенсионныхНакопленийПравопреемники31.Разрешить) = ИСТИНА";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		ТаблицаПравопреемников = Запрос.Выполнить().Выгрузить();
		ТаблицаПравопреемников.Колонки.Добавить("Сумма1", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 2));
		ТаблицаПравопреемников.Колонки.Добавить("Сумма2", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(15, 2));
		
		СуммаНакоплений = 0;
		СуммаСрочныхВыплат = 0;
		
		Для Каждого стр из РасшифровкаСуммы Цикл
			Если стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений 
				ИЛИ стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН Тогда
				СуммаНакоплений = СуммаНакоплений+стр.Сумма;
			ИначеЕсли стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты 
				ИЛИ стр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
				Если стр.ТипСуммы<>Справочники.уп_ТипыСуммОПС.МатКапитал И стр.ТипСуммы<>Справочники.уп_ТипыСуммОПС.ИДМатКапитал Тогда
					СуммаСрочныхВыплат = СуммаСрочныхВыплат+стр.Сумма;
				КонецЕсли;	
			Иначе
				СуммаНакоплений = СуммаНакоплений+стр.Сумма;
			КонецЕсли;	
		КонецЦикла;
		
		ОбластьТаблица1 = Макет.ПолучитьОбласть("Таблица1");
		ОбластьТаблица1.Параметры.СуммаНакоплений = СуммаНакоплений;
		ТабДок.Вывести(ОбластьТаблица1);
		ОбластьСтрока1 = Макет.ПолучитьОбласть("Строка1");
		Остаток1 = СуммаНакоплений;
		Остаток2 = СуммаСрочныхВыплат;
		НомерПП = 0;
		Для Каждого стр из ТаблицаПравопреемников Цикл
			Если стр.Разрешить Тогда
				//распределим ее между резервом накопления и срочной выплаты
				Если СуммаНакоплений>0 И СуммаСрочныхВыплат>0 Тогда
					//распределяем
					сумма1Пред = Окр(стр.Сумма*СуммаНакоплений/(СуммаНакоплений+СуммаСрочныхВыплат),2);
					сумма1 = Мин(сумма1Пред,Остаток1);
					сумма2 = стр.Сумма-сумма1;
					Остаток1 = Остаток1-Сумма1;
					Остаток2 = Остаток2-Сумма2;
					стр.Сумма1 = Сумма1;
					стр.Сумма2 = Сумма2;
				ИначеЕсли СуммаНакоплений>0 Тогда
					//записываем все на сумму1
					стр.Сумма1 = стр.Сумма;
					стр.Сумма2 = 0;
				ИначеЕсли СуммаСрочныхВыплат>0 Тогда
					//записываем все на сумму2
					стр.Сумма1 = 0;
					стр.Сумма2 = стр.Сумма;
				КонецЕсли;
				Если стр.Сумма1>0 или стр.Сумма = 0 Тогда
					НомерПП = НомерПП+1;
					ОбластьСтрока1.Параметры.Заполнить(стр);
					ОбластьСтрока1.Параметры.НомерПП = НомерПП;
					ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
					ОбластьСтрока1.Параметры.ФамилияП = ФИОПП.Фамилия;
					ОбластьСтрока1.Параметры.ИмяП = ФИОПП.Имя;
					ОбластьСтрока1.Параметры.ОтчествоП = ФИОПП.Отчество;
					ТабДок.Вывести(ОбластьСтрока1);
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
		
		ОбластьТаблица2 = Макет.ПолучитьОбласть("Таблица2");
		ОбластьТаблица2.Параметры.СуммаНаСчетеСрочныхВыплат = СуммаСрочныхВыплат;
		ТабДок.Вывести(ОбластьТаблица2);
		ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка2");
		НомерПП = 0;
		Для каждого стр из ТаблицаПравопреемников Цикл
			Если Дата<'20150101' Тогда
				Если стр.Сумма2>0 или стр.СуммаМК>0 Тогда
					НомерПП = НомерПП+1;
					ОбластьСтрока2.Параметры.Заполнить(стр);
					ОбластьСтрока2.Параметры.НомерПП = НомерПП;
					ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
					ОбластьСтрока2.Параметры.ФамилияП = ФИОПП.Фамилия;
					ОбластьСтрока2.Параметры.ИмяП = ФИОПП.Имя;
					ОбластьСтрока2.Параметры.ОтчествоП = ФИОПП.Отчество;
					ТабДок.Вывести(ОбластьСтрока2);
				Конецесли;
			Иначе
				Если стр.Сумма2>0 Тогда
					НомерПП = НомерПП+1;
					ОбластьСтрока2.Параметры.Заполнить(стр);
					ОбластьСтрока2.Параметры.НомерПП = НомерПП;
					ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
					ОбластьСтрока2.Параметры.ФамилияП = ФИОПП.Фамилия;
					ОбластьСтрока2.Параметры.ИмяП = ФИОПП.Имя;
					ОбластьСтрока2.Параметры.ОтчествоП = ФИОПП.Отчество;
					ТабДок.Вывести(ОбластьСтрока2);
				Конецесли;
			КонецЕсли;
		КонецЦикла;	
		
		Если Дата>='20150101' Тогда
			//суммы МК в резерве быть не должно - он передается в ПФР при передаче средств в резерв
			ОбластьТаблица3 = Макет.ПолучитьОбласть("Таблица3");
			ОбластьТаблица3.Параметры.СуммаМатеринскогоКапитала = 0;
			ТабДок.Вывести(ОбластьТаблица3);
			ОбластьСтрока3 = Макет.ПолучитьОбласть("Строка3");
			НомерПП = 0;
			Для каждого стр из ТаблицаПравопреемников Цикл
				Если стр.СуммаМК>0 Тогда
					НомерПП = НомерПП+1;
					ОбластьСтрока3.Параметры.Заполнить(стр);
					ОбластьСтрока3.Параметры.НомерПП = НомерПП;
					ФИОПП = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", стр.Правопреемник.уп_ФизЛицо));
					ОбластьСтрока3.Параметры.ФамилияП = ФИОПП.Фамилия;
					ОбластьСтрока3.Параметры.ИмяП = ФИОПП.Имя;
					ОбластьСтрока3.Параметры.ОтчествоП = ФИОПП.Отчество;
					ТабДок.Вывести(ОбластьСтрока3);
				Конецесли;	
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
	Область = Макет.ПолучитьОбласть("Подвал");
	
	
	СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПустаяСсылка(),Организация,ДоговорОПС.Филиал,Пользователи.ТекущийПользователь(),"Приложение1",Дата);
	Область.Параметры.ДолжностьОтветственного = СведенияОбОтветственном.Должность;
	Область.Параметры.ФИООтветственного = Лев(СведенияОбОтветственном.Имя,1)+"."+Лев(СведенияОбОтветственном.Отчество,1)+"."+СведенияОбОтветственном.Фамилия;
	
	// +ХМНПФ 12.04.2017 ШадринАВ // ПечатьПриложения2Сервер() // №931
	Если ХМ_Рассылка Тогда
		ХМ_МакетРассылка = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("ХМ_ПодвалДляРассылкиПФ_MXL_Приложение2_2015");
		Область = ХМ_МакетРассылка.ПолучитьОбласть("Подвал");
	КонецЕсли;
	// -ХМНПФ 12.04.2017 ШадринАВ // ПечатьПриложения2Сервер() // №931

	ТабДок.Вывести(Область); 
	
	// +ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложения2Сервер() // №114
	ХМ_ВывестиИсполнителя(ТабДок);
	// -ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложения2Сервер() // №114	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	// +ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложения2Сервер() // №114
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	// -ХМНПФ 21.12.2015 ШадринАВ // ПечатьПриложения2Сервер() // №114
	ТабДок.АвтоМасштаб = Истина;
	Возврат ТабДок;
КонецФункции // ХМ_ПечатьПриложения2Сервер()

// ХМНПФ 22.04.2016 ШадринАВ // Новая ХМ_ПолучитьДолюОтказавшихся() // №325
Функция ХМ_ПолучитьДолюОтказавшихся(ПравопреемникиПоЗаявлению)
	Запрос = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "Выбрать * Поместить ПравопреемникиПоЗаявлению ИЗ &ПравопреемникиПоЗаявлению КАК ПравопреемникиПоЗаявлению";
	Запрос.УстановитьПараметр("ПравопреемникиПоЗаявлению", ПравопреемникиПоЗаявлению);
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗаявлениеПравопреемникаОбОтказеОПС.Правопреемник,
				   |	ПравопреемникиПоЗаявлению.Доля
	               |ИЗ
	               |	Документ.уп_ЗаявлениеПравопреемникаОбОтказеОПС КАК ЗаявлениеПравопреемникаОбОтказеОПС
	               |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПравопреемникиПоЗаявлению КАК ПравопреемникиПоЗаявлению
	               |		ПО ЗаявлениеПравопреемникаОбОтказеОПС.Правопреемник = ПравопреемникиПоЗаявлению.ХМ_Правоприемник
	               |ГДЕ
	               |	ЗаявлениеПравопреемникаОбОтказеОПС.ДоговорОПС = &ДоговорОПС
	               |	И ЗаявлениеПравопреемникаОбОтказеОПС.Проведен = ИСТИНА";
				   
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	Результат = Запрос.Выполнить().Выгрузить();
	ДоляОтказавшихся = Результат.Итог("Доля");
	ДоляОтказавшихся = ?(ДоляОтказавшихся<100,ДоляОтказавшихся,0);
	Возврат ДоляОтказавшихся;
КонецФункции

// ХМНПФ 22.04.2016 ШадринАВ // Новая ХМ_ПолучитьСуммуПеречисленийВРОПС() // №325
Функция ХМ_ПолучитьСуммуПеречисленийВРОПС()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АналитикаРезерваОПС.ДоговорОПС,
		|	АналитикаРезерваОПС.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.уп_АналитикаРезерваОПС.Остатки(&ДатаДок, ДоговорОПС = &ДоговорОПС) КАК АналитикаРезерваОПС";
	
	Запрос.УстановитьПараметр("ДатаДок", Дата-1);
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	
	Результат = Запрос.Выполнить().Выгрузить();
	СуммаВРОПС = Результат.Итог("Сумма");
	Возврат СуммаВРОПС;
КонецФункции

// +ХМНПФ 12.11.2015 ШадринАВ // ЗаполнитьТЧОтказы() // №37
Процедура ЗаполнитьТЧОтказы()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявлениеПравопреемникаОбОтказеОПС.ДоговорОПС,
	               |	ЗаявлениеПравопреемникаОбОтказеОПС.Правопреемник,
	               |	ЗаявлениеПравопреемникаОбОтказеОПС.Ссылка,
	               |	ЗаявлениеПравопреемникаОбОтказеОПС.Дата
	               |ИЗ
	               |	Документ.уп_ЗаявлениеПравопреемникаОбОтказеОПС КАК ЗаявлениеПравопреемникаОбОтказеОПС
	               |ГДЕ
	               |	ЗаявлениеПравопреемникаОбОтказеОПС.ДоговорОПС = &ДоговорОПС
	               |	И ЗаявлениеПравопреемникаОбОтказеОПС.Проведен = ИСТИНА
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ
	               |ИТОГИ
	               |	КОЛИЧЕСТВО(ДоговорОПС),
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ссылка),
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Дата)
	               |ПО
	               |	Правопреемник";
				   
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
	    ВыборкаЗаявлений = Выборка.Выбрать();
		Если ВыборкаЗаявлений.Следующий() Тогда
			СтрОтказы = ХМ_Отказы.Добавить();
			СтрОтказы.Заявление = ВыборкаЗаявлений.Ссылка;
			СтрОтказы.Правопреемник = ВыборкаЗаявлений.Правопреемник;
	    КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// +ХМНПФ 21.12.2015 ШадринАВ // Новая ХМ_ВывестиИсполнителя() // №114
Процедура ХМ_ВывестиИсполнителя(ТабДок)
	ХМ_Отчет = Новый ТабличныйДокумент;
	ХМ_Макет = ПолучитьОбщийМакет("ХМ_Разное");
	ХМ_ОблИсполнитель = ХМ_Макет.ПолучитьОбласть("Исполнитель");
	ХМ_ОблИсполнитель.Параметры.ФИОИсполн = ПараметрыСеанса.ТекущийПользователь.Наименование;
	ТелефонИсполн = ХМ_ФункцииОтчетов.ПолучитьТелефонПользователя();
	ХМ_ОблИсполнитель.Параметры.ТелефонИсполн = ТелефонИсполн.Представление;
	ХМ_Отчет.Вывести(ХМ_ОблИсполнитель);
	ХМ_ФункцииОтчетов.ДобавитьОтчет(ТабДок,ХМ_Отчет);
КонецПроцедуры

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, РежимПроведения, СтрокаТЗ, СтруктураТЧ) Экспорт
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПрочиеНачисленияОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ДолиПравопреемников);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_АналитикаРезерваОПС);
		#КонецЕсли
		ХМ_ЗАГРУЗКА_ОбработкаПроведения_уп_ВыплатныеРеестры();
		Возврат;	
	КонецЕсли;
	
	//Правоприемник
	//ТипРезерва
	//СуммаКСписанию
	//ТипСуммы
	Структура_ТЗ = СтруктураТЧ.ТЗНачислений;	
	СтрокиНаДобавление = Структура_ТЗ.ТЗ.НайтиСтроки(Новый Структура(Структура_ТЗ.Узел.Каспер_поле,СтрокаТЗ[Структура_ТЗ.Узел.Каспер_поле]));
	Для Каждого ТекСтрокаЗаявления Из СтрокиНаДобавление Цикл
		СуммаКСписанию = ТекСтрокаЗаявления.СуммаКСписанию;	
		ТекСтрОстатков = ТекСтрокаЗаявления;
		
		Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ТекСтрОстатков.ХМ_ДатаВыплаты;
		Движение.Организация = Организация;
		Движение.Участник = ТекСтрокаЗаявления.Правопреемник;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС;
		Движение.ТипРезерва = ТекСтрокаЗаявления.ТипРезерва;//!!!
		Движение.ТипСуммы = ТекСтрОстатков.ТипСуммы;
		Движение.Сумма = СуммаКСписанию;
		
		Если ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС Тогда
			Движение = Движения.уп_РезервыОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ТекСтрОстатков.ХМ_ДатаВыплаты;
			Движение.Организация = Организация;
			//Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС;
			//Движение.ТипСуммы = ТекСтрокаРасшифровкаСуммы.ТипСуммы;
			Движение.Сумма = СуммаКСписанию;
			Движение.Движение = Перечисления.уп_ВидыДвижений.ВыплатаИзРезерваОПС;
			
			Движение = Движения.уп_АналитикаРезерваОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = ТекСтрОстатков.ХМ_ДатаВыплаты;
			Движение.Организация = Организация;
			Движение.ДоговорОПС = ДоговорОПС;
			//Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС;
			Движение.ТипСуммы = ТекСтрОстатков.ТипСуммы;
			Движение.Сумма = СуммаКСписанию;
			//Движение.Движение = Перечисления.уп_ВидыДвижений.ВыплатаИзРезерваОПС;
		Иначе
			Движение = Движения.уп_РезервыОПС.ДобавитьРасход();
			Движение.Организация = Организация;
			Движение.Период = ТекСтрОстатков.ХМ_ДатаВыплаты;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.ТипРезерва = ТекСтрОстатков.ТипРезерва;
			Движение.ТипСуммы = ТекСтрОстатков.ТипСуммы;
			Движение.Сумма = СуммаКСписанию;
			Движение.Движение = Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамОПС;
		КонецЕсли;
		
		ТекСтрОстатков = Неопределено;
	КонецЦикла;	
	
	Для Каждого ТекСтрокаЗаявления Из Заявления Цикл
		Если ЗначениеЗаполнено(ТекСтрокаЗаявления.Заявление) Тогда 
			Движение = Движения.уп_ДолиПравопреемников.Добавить();
			Движение.Период = Дата;
			Движение.ДоговорОПС = ДоговорОПС;
			Движение.Заявление = ТекСтрокаЗаявления.Заявление;
			Движение.Правопреемник = ТекСтрокаЗаявления.Правопреемник;
			Движение.Доля = ТекСтрокаЗаявления.Процент;
		КонецЕсли;
	КонецЦикла;
	
	#Если Сервер Тогда
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПрочиеНачисленияОПС);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ДолиПравопреемников);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_АналитикаРезерваОПС);
	#КонецЕсли
	ХМ_ЗАГРУЗКА_ОбработкаПроведения_уп_ВыплатныеРеестры();
КонецПроцедуры

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения_уп_ВыплатныеРеестры(ЭтоПФР = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_ВыплатныеРеестры.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.уп_ВыплатныеРеестры КАК уп_ВыплатныеРеестры
		|ГДЕ
		|	уп_ВыплатныеРеестры.ХМ_РешениеОВыплатеСПН = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Реестр = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		Реестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
		Реестр.ХМ_РешениеОВыплатеСПН = Ссылка;
	КонецЕсли;
	Реестр.Дата = ЭтотОбъект.Дата;
	Реестр.Номер = ЭтотОбъект.Номер;
	Реестр.Проведен = ЭтотОбъект.Проведен;
	Реестр.ПометкаУдаления = ЭтотОбъект.ПометкаУдаления;
	Реестр.Организация = ЭтотОбъект.Организация;
//https://redmine.npf.com/issues/4711 ЛыткинАМ
	Реестр.ТипВыплаты = ?(ЭтоПФР = Ложь, Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС, Перечисления.уп_ТипыВыплат.ПереводВДругойПФ);
	Реестр.Оплачено = Истина;
	Реестр.Ответственный = ЭтотОбъект.Ответственный;
	Реестр.РучнаяКорректировка = Истина;
	Реестр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет;
	Реестр.Комментарий = "Выплата по "+Ссылка;
	
	Реестр.ДоговорыОПС.Очистить();
	Если ЭтоПФР Тогда	
		СтрокаДоговора = Реестр.ДоговорыОПС.Добавить();
		СтрокаДоговора.ДоговорОПС = ДоговорОПС;
		СтрокаДоговора.Участник = ПенсионныйФондРФ;
		СтрокаДоговора.Сумма = РасшифровкаСуммы.Итог("Сумма");
	Иначе
		Для каждого СтрокаЗаявление ИЗ Заявления Цикл
			СтрокаДоговора = Реестр.ДоговорыОПС.Добавить();
			СтрокаДоговора.ДоговорОПС = ЭтотОбъект.ДоговорОПС;
			СтрокаДоговора.Участник = СтрокаЗаявление.Правопреемник;
			СтрокаДоговора.Сумма = СтрокаЗаявление.Сумма;
			СтрокаДоговора.НомерЛицевогоСчета = СтрокаЗаявление.Заявление.НомерЛицевогоСчета;
		КонецЦикла;
	КонецЕсли;

	Реестр.РасшифровкаСуммы.Очистить();
	Для каждого Расшифровка ИЗ РасшифровкаСуммы Цикл
		СтрокаРасшифровка = Реестр.РасшифровкаСуммы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРасшифровка,Расшифровка);
	КонецЦикла;
	
	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Реестр);
	
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Реестр.Движения.уп_ПрочиеНачисленияОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Реестр.Движения.уп_ВыплатыОПС);
		#КонецЕсли
		Возврат;	
	КонецЕсли;
	                  
	Для Каждого ТекСтрока Из Движения.уп_ПрочиеНачисленияОПС Цикл
		Движение = Реестр.Движения.уп_ПрочиеНачисленияОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = ТекСтрока.Период;
		Движение.Организация = ТекСтрока.Организация;
		Движение.Участник = ТекСтрока.Участник;
		Движение.ДоговорОПС = ДоговорОПС;
//https://redmine.npf.com/issues/4711 ЛыткинАМ
		Движение.ТипВыплаты = ?(ЭтоПФР = Ложь, Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС, Перечисления.уп_ТипыВыплат.ПереводВДругойПФ);
		Движение.ТипРезерва = ТекСтрока.ТипРезерва;//!!!
		Движение.ТипСуммы = ТекСтрока.ТипСуммы;
		Движение.Сумма = ТекСтрока.Сумма;
		
		Движение = Реестр.Движения.уп_ВыплатыОПС.Добавить();
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.Организация = ТекСтрока.Организация;
		Движение.Период = ТекСтрока.Период;
		Движение.Участник = ТекСтрока.Участник;
//https://redmine.npf.com/issues/4711 ЛыткинАМ
		Движение.ТипВыплаты = ?(ЭтоПФР = Ложь, Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС, Перечисления.уп_ТипыВыплат.ПереводВДругойПФ);
		Движение.Сумма = ТекСтрока.Сумма;
		Движение.Выплата = ТекСтрока.Сумма;
	КонецЦикла;	
	
	#Если Сервер Тогда
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Реестр.Движения.уп_ПрочиеНачисленияОПС);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Реестр.Движения.уп_ВыплатыОПС);
	#КонецЕсли
	
КонецПроцедуры	

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения_ХМ_pf_fond_npf_pfr(Отказ, РежимПроведения) Экспорт
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПрочиеНачисленияОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
		#КонецЕсли
		Возврат;	
	КонецЕсли;
	
	Для Каждого СтрокаСуммы Из РасшифровкаСуммы Цикл
		Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = СтрокаСуммы.ХМ_ДатаВыплаты;
		Движение.Организация = Организация;
		Движение.Участник = ПенсионныйФондРФ;
		Движение.ДоговорОПС = ДоговорОПС;
//https://redmine.npf.com/issues/4711 ЛыткинАМ
		Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойПФ;
		Движение.ТипРезерва = СтрокаСуммы.ТипРезерва;
		Движение.ТипСуммы = СтрокаСуммы.ТипСуммы;
		Движение.Сумма = СтрокаСуммы.Сумма;
		
		
		Движение = Движения.уп_РезервыОПС.ДобавитьРасход();
		Движение.Организация = Организация;
		Движение.Период = СтрокаСуммы.ХМ_ДатаВыплаты;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.ТипРезерва = СтрокаСуммы.ТипРезерва;
		Движение.ТипСуммы = СтрокаСуммы.ТипСуммы;
		Движение.Сумма = СтрокаСуммы.Сумма;
//https://redmine.npf.com/issues/4711 ЛыткинАМ
		Движение.Движение = Перечисления.уп_ВидыДвижений.ПереводВДругойПФ;
		
	КонецЦикла;	
	#Если Сервер Тогда
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПрочиеНачисленияОПС);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
	#КонецЕсли
	ХМ_ЗАГРУЗКА_ОбработкаПроведения_уп_ВыплатныеРеестры(Истина);	
КонецПроцедуры

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения_ХМ_pf_ops_reserv(Отказ, РежимПроведения) Экспорт
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_АналитикаРезерваОПС);
		#КонецЕсли
		Возврат;	
	КонецЕсли;
	
	Для Каждого СтрокаСуммы Из РасшифровкаСуммы Цикл
		Движение = Движения.уп_РезервыОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = СтрокаСуммы.ХМ_ДатаВыплаты;
		Движение.Организация = Организация;
		//Движение.ДоговорОПС = ДоговорОПС;
		Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС;
		//Если  ТекСтрОстатков.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений Тогда
		//	Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.РезервОПС_НЧТП;
		//Иначе
		//	Движение.ТипСуммы = Справочники.уп_ТипыСуммОПС.РезервОПС_СрочныхВыплат;
		//КонецЕсли;
		Движение.Сумма = СтрокаСуммы.Сумма;
		
		Движение = Движения.уп_РезервыОПС.ДобавитьРасход();
		Движение.Организация = Организация;
		Движение.Период = СтрокаСуммы.ХМ_ДатаВыплаты;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.ТипРезерва = СтрокаСуммы.ТипРезерва;
		Движение.ТипСуммы = СтрокаСуммы.ТипСуммы;
		Движение.Сумма = СтрокаСуммы.Сумма;
		Движение.Движение = Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамОПС;
		
		Движение = Движения.уп_АналитикаРезерваОПС.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = СтрокаСуммы.ХМ_ДатаВыплаты;
		Движение.Организация = Организация;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.ТипСуммы = СтрокаСуммы.ТипСуммы;
		Движение.Сумма = СтрокаСуммы.Сумма;
	КонецЦикла;	
	#Если Сервер Тогда
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_РезервыОПС);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_АналитикаРезерваОПС);
	#КонецЕсли
	
КонецПроцедуры

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения_ХМ_УдалитьВыплату() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_ВыплатныеРеестры.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.уп_ВыплатныеРеестры КАК уп_ВыплатныеРеестры
		|ГДЕ
		|	уп_ВыплатныеРеестры.ХМ_РешениеОВыплатеСПН = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбъектНаУдаление = Выборка.Ссылка.ПолучитьОбъект();
		Для каждого Движение Из ОбъектНаУдаление.Движения Цикл
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движение);	
		КонецЦикла;
		ОбъектНаУдаление.Удалить();
	КонецЕсли;		
КонецПроцедуры

// ХМНПФ 20.11.2015 ШадринАВ // Новая ХМ_КорректироватьРаспределение() // №45
Процедура ХМ_КорректироватьРаспределение(Распределено)
	ТЗЗаявленияПП = ЭтотОбъект.Заявления.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ТЗ.Заявление,
		|	ТЗ.Процент,
		|	ТЗ.Разрешить,
		|	ТЗ.Сумма
		|ПОМЕСТИТЬ втЗаявленияПП
		|ИЗ &ТЗЗаявленияПП КАК ТЗ
		|;
		|ВЫБРАТЬ
		|	ЗаявленияПП.Заявление,
		|	ЗаявленияПП.Процент,
		|	ЗаявленияПП.Сумма
		|ИЗ
		|	втЗаявленияПП КАК ЗаявленияПП
		|ГДЕ
		|	ЗаявленияПП.Разрешить
		|УПОРЯДОЧИТЬ ПО
		|	ЗаявленияПП.Сумма
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявленияПП.Сумма)
		|ПО
		|	ЗаявленияПП.Процент";
	
	Запрос.УстановитьПараметр("ТЗЗаявленияПП", ТЗЗаявленияПП);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	БылаКорректировка = Ложь;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Сумма > 1 Тогда
			БылаКорректировка = Истина;
			н = 0;
			ВыборкаДетали = Выборка.Выбрать();
			Пока ВыборкаДетали.Следующий() Цикл
				н = н + 1;
				текСтр = ЭтотОбъект.Заявления.Найти(ВыборкаДетали.Заявление,"Заявление");
				Если н = 1 Тогда
					МеньшаяСумма = текСтр.Сумма;
				Иначе
					текСтр.Сумма = МеньшаяСумма;
					текСтр.СуммаВыплатыИтого = текСтр.СуммаВыплачено + МеньшаяСумма;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Если БылаКорректировка Тогда
		Распределено = ЭтотОбъект.Заявления.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры // ХМ_КорректироватьРаспределение()
