
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 25.10.2019 ШадринАВ // ПроверитьВыполнениеЗадания() // №2534
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПроверитьВыполнениеЗадания")
Процедура ХМПроверитьВыполнениеЗадания()

	Сообщения = ПолучитьСообщения();

	Если Сообщения = "Завершено" Тогда

		ОтключитьОбработчикОжидания("ПроверитьВыполнениеЗадания");
		Закрывать = Истина;
		Закрыть();

	ИначеЕсли Сообщения = "ЗавершеноАварийно" Тогда

		ОтключитьОбработчикОжидания("ПроверитьВыполнениеЗадания");
		Закрывать = Истина;
		Закрыть("ПоОшибке");

	Иначе

		Для Каждого ЭлементСообщение Из Сообщения Цикл

			Если Лев(ЭлементСообщение.Текст, 28) = "КомментарийОбработкиДанных: " Тогда
				КомментарийОбработкиДанных = Сред(ЭлементСообщение.Текст, 29);
			ИначеЕсли Лев(ЭлементСообщение.Текст, 21) = "КомментарийЗначения: " Тогда
				КомментарийЗначения = Сред(ЭлементСообщение.Текст, 21);
			#Вставка
				// +ХМНПФ 25.10.2019 ШадринАВ // ПроверитьВыполнениеЗадания() // №2534
			ИначеЕсли Лев(ЭлементСообщение.Текст, 28) = "Модуль ""НФО.МодульТрансляции" Тогда
				КомментарийОбработкиДанных = ЭлементСообщение.Текст;
			ИначеЕсли СтрНайти(ЭлементСообщение.Текст, "Ошибка") > 0 Тогда
				КомментарийОбработкиДанных = ЭлементСообщение.Текст;
				// -ХМНПФ 25.10.2019 ШадринАВ // ПроверитьВыполнениеЗадания() // №2534 
			#КонецВставки
			Иначе
				Попытка 
					Значение = Число(ЭлементСообщение.Текст);
				Исключение
					//не изменяем значение
				КонецПопытки;	
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
