#Область ХМНПФ
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 04.04.2016 Шадрин А.В. // новые колонки "Договор ОПС" и "Застрахованное лицо" // №266
	// ХМНПФ 18.01.2019 ГригорьевМА  // Новая ХМ_ПриСозданииНаСервере() // №1996
	// ХМНПФ 18.01.2019 ГригорьевМА  // Модуль // №1996
КонецПроцедуры

// +ХМНПФ 18.01.2019 ГригорьевМА  // Модуль // №1996
&НаСервере
Процедура ХМПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	ХМ_РаботаСФормами.уп_ИндексацияНЧТПФормаСпискаПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);	
КонецПроцедуры
// -ХМНПФ 18.01.2019 ГригорьевМА  // Модуль // №1996
#КонецОбласти 
