
////////////////////////////////////////////////////////////////////////////////
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 22.08.2017 ШадринАВ // новый флаг на форме ХМ_Оплачено // №1134
КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму();
КонецПроцедуры  


Процедура ХМДополнитьФорму() 
	
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("Вид", ВидПоляФормы.ПолеФлажка); 
	СвойстваПоля.Вставить("ВставитьПередЭлементом", Элементы.ГруппаСостояниеДокументСписания);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_Оплачено",Элементы.ГруппаПодвал,"Объект.ХМ_Оплачено",СвойстваПоля);
		
КонецПроцедуры