
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 26.10.2015 Шадрин А.В. // Новая ОбработкаЗаполнения() // ОПС_заяв_на_основ_дгвр
	// +ХМНПФ 28.02.2017 Кучеров // Новая Функция ХМ_ПечатьWeb()
	// -ХМНПФ 28.02.2017 Кучеров // убрал директиву на клиенте
КонецПроцедуры

// +ХМНПФ 28.0217 Кучеров// Новая Функция ХМ_ПечатьWeb()
// для получения печатных форм со стороны Web сервисов
// аналог процедуры печать типового варианта пользовательского интерфейса
Функция ХМ_ПечатьWeb(ИмяМакета) Экспорт
	ТабДокумент = Новый ТабличныйДокумент; // заглушка на случай если не сформируется ни чего 
		Если ИмяМакета = "ЗаявНакоп" Тогда
			Если Пожизненная Тогда
				ТабДокумент = ПечатьПоМакету(ИмяМакета);
			КонецЕсли;
		ИначеЕсли ИмяМакета = "ЗаявСрочВыплата" Тогда
			Если Срочная Тогда
				ТабДокумент = ПечатьПоМакету(ИмяМакета);
			КонецЕсли;
		ИначеЕсли ИмяМакета = "ЗаявСрочВыплата_2016Блок1" Тогда
			Если Срочная Тогда
				ТабДокумент = ПечатьПоМакету("ЗаявСрочВыплата_2016", "Блок1");
			КонецЕсли;
			
		ИначеЕсли ИмяМакета = "ЗаявСрочВыплата_2016Блок2" Тогда
			Если Срочная Тогда
				ТабДокумент = ПечатьПоМакету("ЗаявСрочВыплата_2016", "Блок2");
			КонецЕсли;
			
   		КонецЕсли;
	Возврат ТабДокумент;
КонецФункции 

// +ХМНПФ 26.10.2015 Шадрин А.В. // Новая ОбработкаЗаполнения() // ОПС_заяв_на_основ_дгвр
&После("ОбработкаЗаполнения")
Процедура ХМ_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.уп_ДоговорыОПС") Тогда
		Организация = ДанныеЗаполнения.Организация;
		ДоговорОПС = ДанныеЗаполнения.Ссылка;
		ЗастрахованноеЛицо = ДанныеЗаполнения.Участник;
		ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет;
		// +ХМНПФ 30.10.2015 Шадрин А.В. // ОбработкаЗаполнения() // №24
		#Если Клиент Тогда
		Дата = РабочаяДата;
		#ИначеЕсли Сервер Тогда
		Дата = ТекущаяДата();
		#КонецЕсли
		// -ХМНПФ 30.10.2015 Шадрин А.В. // ОбработкаЗаполнения() // №24
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ОПС_заяв_на_основ_дгвр",Истина);
	КонецЕсли;
КонецПроцедуры

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ = Неопределено, СтруктураТЧ = Неопределено) Экспорт
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц);
		#КонецЕсли
		Возврат;	
	КонецЕсли;
	Если ЗначениеЗаполнено(НомерЛицевогоСчета) Тогда
		Движение = Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.ЗастрахованноеЛицо = ЗастрахованноеЛицо;
		Движение.ФормаВыплаты = ФормаВыплаты;
		Движение.Банк = Получатель;
		Движение.РасчетныйСчет = РасчетныйСчет;
		Движение.ТипЛицевогоСчета = ТипЛицевогоСчета;
		Движение.НомерЛицевогоСчета = НомерЛицевогоСчета;
	КонецЕсли;
	
#Если Сервер Тогда
	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц);
#КонецЕсли
КонецПроцедуры

&После("ПриУстановкеНовогоНомера")
Процедура ХМ_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	ХМ_ПодпискиНаСобытия.ХМ_НомераРешенийПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);		
КонецПроцедуры

