// +ХМНПФ 02.10.2017 ХлопцевБА // уп_ЗакрытиеСчетов() // №1167
Процедура уп_ЗакрытиеСчетов(Источник, Отказ, РежимПроведения) Экспорт
	
	уп_Резервы = Источник.Движения.уп_Резервы;	
	тз_Резервы = Источник.Движения.уп_Резервы.Выгрузить();	
	
	Для Каждого Стр Из тз_Резервы Цикл
		
		Если Стр.ТипРезерва  = Перечисления.уп_ТипыРезерва.ИПС И 
			(Стр.ТипСуммы  = Справочники.уп_ТипыСумм.ВзносыЮр ИЛИ Стр.ТипСуммы  = Справочники.уп_ТипыСумм.ИДЮр) И
			Стр.Движение = Перечисления.уп_ВидыДвижений.ВозвратВкладчикуПриЗакрытии Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	уп_ПенсионныеСчета.Ссылка,
			|	уп_ПенсионныеСчета.Владелец
			|ПОМЕСТИТЬ втВыборка
			|ИЗ
			|	Справочник.уп_ПенсионныеСчета КАК уп_ПенсионныеСчета
			|ГДЕ
			|	уп_ПенсионныеСчета.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втВыборка.Ссылка,
			|	втВыборка.Владелец,
			|	втВыборка.Владелец.ПаритетныйДоговор КАК ПаритетныйДоговор,
			|	втВыборка.Владелец.Паритетный КАК Паритетный
			|ПОМЕСТИТЬ вт_Паритет
			|ИЗ
			|	втВыборка КАК втВыборка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_ПенсионныеСчета.Ссылка,
			|	уп_ПенсионныеСчета.Владелец
			|ПОМЕСТИТЬ вт_СПС
			|ИЗ
			|	Справочник.уп_ПенсионныеСчета КАК уп_ПенсионныеСчета
			|ГДЕ
			|	уп_ПенсионныеСчета.Владелец В
			|			(ВЫБРАТЬ
			|				вт_Паритет.ПаритетныйДоговор
			|			ИЗ
			|				вт_Паритет КАК вт_Паритет)
			|	И уп_ПенсионныеСчета.ТипПенсионногоСчета = &ТипПенсионногоСчета
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	вт_Паритет.Паритетный,
			|	вт_Паритет.ПаритетныйДоговор,
			|	вт_СПС.Ссылка КАК СчетСПС
			|ИЗ
			|	вт_Паритет КАК вт_Паритет
			|		ЛЕВОЕ СОЕДИНЕНИЕ вт_СПС КАК вт_СПС
			|		ПО вт_Паритет.ПаритетныйДоговор = вт_СПС.Владелец";
			
			Запрос.УстановитьПараметр("Ссылка", Стр.НомерСчета);
			Запрос.УстановитьПараметр("ТипПенсионногоСчета", Перечисления.уп_ТипыПенсионныхСчетов.СолидарныйПенсионныйСчет);
			РезультатЗапроса = Запрос.Выполнить();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Если  Выборка.Следующий() Тогда
				Если Выборка.Паритетный Тогда
					
					нСтр = уп_Резервы.Добавить();
					
					ЗаполнитьЗначенияСвойств(нСтр,Стр);
					
					нСтр.ВидДвижения  = ВидДвиженияНакопления.Приход;
					нСтр.НомерСчета   = Выборка.СчетСПС;
					нСтр.ТипРезерва   = Перечисления.уп_ТипыРезерва.СПС;
					нСтр.Движение     = Перечисления.уп_ВидыДвижений.ВозвратВкладчикуПриЗакрытии;
					
				КонецЕсли;	
			КонецЕсли;
			
			уп_Резервы.Записать();
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры // уп_ЗакрытиеСчетов(Источник, Отказ, РежимПроведения)

