
&НаКлиенте
&ИзменениеИКонтроль("ПриОткрытии")
Процедура ХМПриОткрытии(Отказ)
	Если Объект.СтепеньРодства=0 Тогда
		ПредставлениеСтепеньРодства="";
	Иначе
		#Удаление			
		Если Объект.СтепеньРодства=3 Тогда  //такого быть не должно - ошибка перевода на управляемые формы
			ПредставлениеСтепеньРодства="";
		Иначе
			ПредставлениеСтепеньРодства=Элементы.ПредставлениеСтепеньРодства.СписокВыбора.Получить(Объект.СтепеньРодства-1);
		КонецЕсли;
		#КонецУдаления
		#Вставка 
		//+ХМНПФ 06.02.2018 КлименкоМИ // ПриОткрытии() // №1354
		ПредставлениеСтепеньРодства=Элементы.ПредставлениеСтепеньРодства.СписокВыбора.Получить(Объект.СтепеньРодства-1);	
		//-ХМНПФ 06.02.2018 КлименкоМИ // ПриОткрытии() // №1354	
		#КонецВставки	
	КонецЕсли;
	Если Объект.Основание=0 Тогда
		ПредставлениеОснования="";
	Иначе
		Если Объект.Основание=3 Тогда  //такого быть не должно - ошибка перевода на управляемые формы
			ПредставлениеОснования="";
		Иначе
			ПредставлениеОснования=Элементы.ПредставлениеОснования.СписокВыбора.Получить(Объект.Основание-1);
		КонецЕсли;
	КонецЕсли;
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 06.02.2018 КлименкоМИ // ПриОткрытии() // №1354
КонецПроцедуры