
//ЛыткинАМ https://redmine.npf.com/issues/4739
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		ХМ_ЗагрузкаТЗ_V02_Клиент.ИнтерактивнаяЗагрузкаДокументаПоСсылке(ПараметрКоманды,Новый Структура("ОбновитьЗагрузку,ПотоковаяЗагрузка"),Новый Структура("Статус","ЕДВ"));
		Сигнал();
	КонецЕсли;
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
