
&НаСервере
Процедура ВыполнитьСторнированиеНаСервере(ЗаменитьНалоговыйПериод = Ложь)
	Для каждого СтрокаТЧ Из ТаблицаДат Цикл	
		ДокументыНаДату = СтрокаТЧ.ДокументыНаДату;
		СторноНаДату = СтрокаТЧ.СторноНаДату;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	уп_НачислениеНДФЛ.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.уп_НачислениеНДФЛ КАК уп_НачислениеНДФЛ
			|ГДЕ
			|	уп_НачислениеНДФЛ.Проведен = &Проведен
			|	И уп_НачислениеНДФЛ.Дата = &Дата
			|	И уп_НачислениеНДФЛ.Ответственный = &Ответственный";
		
		Запрос.УстановитьПараметр("Дата", ДокументыНаДату);
		Запрос.УстановитьПараметр("Ответственный", Ответственный);
		Запрос.УстановитьПараметр("Проведен", Истина);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			уп_НачислениеНДФЛ_Основание = ВыборкаДетальныеЗаписи.Ссылка;
			Если Ложь Тогда уп_НачислениеНДФЛ_Основание = Документы.уп_НачислениеНДФЛ.ПустаяСсылка(); КонецЕсли;
			Если ЗаменитьНалоговыйПериод = Ложь Тогда
				уп_НачислениеНДФЛ = уп_НачислениеНДФЛ_Основание.Скопировать();
			Иначе
				уп_НачислениеНДФЛ = уп_НачислениеНДФЛ_Основание.ПолучитьОбъект();
			КонецЕсли;
			уп_НачислениеНДФЛ.Дата = СторноНаДату;
			Для каждого СтрокаНДФЛ Из уп_НачислениеНДФЛ.НДФЛ Цикл
				Если ПериодНачалоГода Тогда
					СтрокаНДФЛ.МесяцНалоговогоПериода = НачалоГода(СторноНаДату);
				Иначе
					СтрокаНДФЛ.МесяцНалоговогоПериода = НачалоМесяца(СторноНаДату);
				КонецЕсли;
				СтрокаНДФЛ.ПримененныйВычетЛичный = "";
				СтрокаНДФЛ.ПримененныйВычетЛичныйКодВычета = "";
				СтрокаНДФЛ.УдалитьПримененныйВычетЛичныйКодВычета = "";
				СтрокаНДФЛ.ПримененныйВычетЛичныйКЗачетуВозврату = "";
				СтрокаНДФЛ.ПримененныйВычетЛичныйКЗачетуВозвратуКодВычета = "";
				СтрокаНДФЛ.УдалитьПримененныйВычетЛичныйКЗачетуВозвратуКодВычета = "";
				Если ЗаменитьНалоговыйПериод = Ложь Тогда
					СтрокаНДФЛ.Налог =  -1 * СтрокаНДФЛ.Налог;
				КонецЕсли;
			КонецЦикла;
			уп_НачислениеНДФЛ.ПримененныеВычетыНаДетейИИмущественные.Очистить();
			уп_НачислениеНДФЛ.Записать();                               
			Попытка
				уп_НачислениеНДФЛ.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьНалоговыйПериод(Команда)
	ВыполнитьСторнированиеНаСервере(Истина);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Сторнирование завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПериодНачалоГода = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСторнирование(Команда)
	ВыполнитьСторнированиеНаСервере(Ложь);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Сторнирование завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры
