&НаСервере
Функция ПолучитьРегистрациюВНалоговомОргане();
	Возврат уп_ОбщегоНазначенияСервер.ХМ_ПолучитьРегистрациюВНалоговомОргане(Объект.Организация, Объект.Дата); 
КонецФункции

&НаКлиенте
Процедура ХМПодписантСозданиеВместо(Элемент, СтандартнаяОбработка)  
	РегистрацияВНалоговомОргане =  ПолучитьРегистрациюВНалоговомОргане(); 
	Если ЗначениеЗаполнено(РегистрацияВНалоговомОргане) Тогда
		ПоказатьЗначение(Новый ОписаниеОповещения("ХМОбновитьСписокПользователей", ЭтотОбъект),РегистрацияВНалоговомОргане);
	Иначе
		Сообщить("Не удалось обнаружить регистрацию в налоговом органе");	
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ХМОбновитьСписокПользователей(Результат, ДополнительныеПараметры) Экспорт
    ПодгрузитьСписокПодписантов();
КонецПроцедуры

&НаКлиенте
Процедура ХМОбновитьПодписантовПосле(Команда)
	ХМОбновитьСписокПользователей("", "");
КонецПроцедуры
