
&ИзменениеИКонтроль("ФоноваяЗагрузкаБанковскойВыпискиИзЖурнала")
Процедура ХМФоноваяЗагрузкаБанковскойВыпискиИзЖурнала(СтруктураПараметров, АдресХранилища, ИспользоватьПредупрежденияПриЗагрузкеВыписки = Ложь)

	НастройкиЗагрузки = Обработки.КлиентБанк.НастройкиЗагрузки();
	НастройкиЗагрузки.Кодировка = СтруктураПараметров.Кодировка;
	//УНПФ
#Удаление
	НастройкиЗагрузки.Вставить("СписокМодулей",СтруктураПараметров.СписокМодулей);
#КонецУдаления
#Вставка
    // +ХМНПФ 23.11.2022 МилевскийАЮ // ФоноваяЗагрузкаБанковскойВыпискиИзЖурнала() // №3514
	//НастройкиЗагрузки.Вставить("СписокМодулей",СтруктураПараметров.СписокМодулей);
	// -ХМНПФ 23.11.2022 МилевскийАЮ // ФоноваяЗагрузкаБанковскойВыпискиИзЖурнала() // №3514
#КонецВставки
	//~УНПФ
	ЭтоЦифровойСчет = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураПараметров, "ЭтоЦифровойСчет", Ложь);

	Если СтруктураПараметров.Свойство("ВыпискаБанка") Тогда
		РаспознанныеДанныеИзБанка = ЗагрузкаВыпискиПоБанковскомуСчету.РаспознанныеДанныеИзБанкаДБ(
			СтруктураПараметров.ВыпискаБанка,
			НастройкиЗагрузки,
			СтруктураПараметров.СведенияОВладельцеБанковскогоСчетаИзКонтекста);
	Иначе
	РаспознанныеДанныеИзБанка = РаспознанныеДанныеБанковскойВыпискиИзФайла(СтруктураПараметров, НастройкиЗагрузки);
	КонецЕсли;

	СоздаватьНенайденныеЭлементы = СоздаватьНенайденныеЭлементы(РаспознанныеДанныеИзБанка.РаспознанныеВыписки);
	Если ПередЗагрузкойПоказыватьФормуОбменаСБанком(РаспознанныеДанныеИзБанка.РаспознанныеВыписки) Тогда
		РезультатЗагрузки = НовыйРезультатЗагрузки();
		РезультатЗагрузки.РезультатВыполнения = "ПередЗагрузкойПоказыватьФормуОбменаСБанком";
	Иначе
		РежимИнтеграцииОграничиватьПериодВыписки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		СтруктураПараметров,
		"РежимИнтеграцииОграничиватьПериодВыписки",
		Ложь);

		ИгнорироватьПредупрежденияРаспознавания = Ложь;
		РезультатЗагрузки = ЗагрузитьБанковскиеВыписки(
		РаспознанныеДанныеИзБанка,
		СоздаватьНенайденныеЭлементы,
		ИгнорироватьПредупрежденияРаспознавания,
			РежимИнтеграцииОграничиватьПериодВыписки,
			ЭтоЦифровойСчет);
	КонецЕсли;

	Если ИспользоватьПредупрежденияПриЗагрузкеВыписки Тогда
		ПредупрежденияПриЗагрузкеВыписки = ПредупрежденияПриЗагрузкеВыписки(РаспознанныеДанныеИзБанка);
		Если ПредупрежденияПриЗагрузкеВыписки.Количество() > 0 Тогда
			СохранитьПредупрежденияПриЗагрузкеВыписки(ПредупрежденияПриЗагрузкеВыписки);
		КонецЕсли;
	КонецЕсли;
	
	РезультатЗагрузкиИзЖурнала = ПодготовитьРезультатЗагрузкиИзЖурнала(
	РезультатЗагрузки, РаспознанныеДанныеИзБанка, СтруктураПараметров, АдресХранилища);
	ПоместитьВоВременноеХранилище(РезультатЗагрузкиИзЖурнала, АдресХранилища);

КонецПроцедуры