
&После("ПриУстановкеНовогоНомераДокумента")
Процедура НПФ_ПриУстановкеНовогоНомераДокумента(Источник, СтандартнаяОбработка, Префикс)
	
	НачатьТранзакцию();
	
	пМетаданные = Источник.Метаданные(); 
	
	пДлинаНомера = пМетаданные.ДлинаНомера;
	пИмя = пМетаданные.Имя;
	
	
	НаборЗаписей = РегистрыСведений.хм_Нумерация.СоздатьНаборЗаписей(); 	
	НаборЗаписей.Отбор.типДокумента.Установить(пИмя);
	НаборЗаписей.Отбор.Организация.Установить(Источник.Организация);
	НаборЗаписей.Прочитать(); 
	
	Для Каждого  ВыборкаДетальныеЗаписи Из НаборЗаписей Цикл
		
		ФорматНомера = ВыборкаДетальныеЗаписи.Нумератор.ФорматНомера;
		
		нНомер = ВыборкаДетальныеЗаписи.ТекущийНомер + 1;
		
		Если СокрЛП(ФорматНомера) = "" Тогда
			нНомерО = Прав("000000000000000000"+ хм_ПрочиеПроцедуры.УбратьПробелыВСтроке(Строка(нНомер)),пДлинаНомера);
			Источник.Номер = нНомерО;
		Иначе
			Если СтрНайти(ФорматНомера,"[КП]") <> 0 Тогда   //код подразделения
				//Если пМетаданные.Реквизиты.Найти("Участник") <> Неопределено Тогда
					нКП = хм_ПрочиеПроцедуры.ПолучитьКодПодразделения(Источник.ССылка);
					Если СтрДлина(нКП)< 2 Тогда
						нКП = "0" + Строка(нКП);
					КонецЕсли;	
					ФорматНомера = СтрЗаменить(ФорматНомера,"[КП]", нКП);
				//КонецЕсли;
			Иначе
				нКП = "";
			КонецЕсли;	
			
			Если СтрНайти(ФорматНомера,"[ГГ]") <> 0 Тогда  //год
				нГГ = Прав(Формат(Источник.Дата,"ДФ=dd.MM.yyyy"),2);
				ФорматНомера = СтрЗаменить(ФорматНомера,"[ГГ]", нГГ);
			Иначе
				нКП = "";
			КонецЕсли;	
			
			ФорматНомераИспДлина = ФорматНомера;
			ФорматНомераИспДлина = СтрЗаменить(ФорматНомераИспДлина,"[Номер]","");
			ИспДлина = СтрДлина(ФорматНомераИспДлина);
			
			Если СтрНайти(ФорматНомера,"[Номер]") <> 0 Тогда  //сам номер
				нНомерО = Прав("000000000000000"+ хм_ПрочиеПроцедуры.УбратьПробелыВСтроке(Строка(нНомер)),пДлинаНомера-ИспДлина);
				ФорматНомера = СтрЗаменить(ФорматНомера,"[Номер]", нНомерО);
			Иначе
				нНомерО = "";
			КонецЕсли;	
			
			Источник.Номер = ФорматНомера;
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;	
		
		ВыборкаДетальныеЗаписи.ТекущийНомер = нНомер;
		НаборЗаписей.Записать(); 
		
		Прервать;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры
