Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 22.08.2016 ШадринАВ // длина номера изменена с 8 до 18 // №459
	// ХМНПФ 16.02.2017 ШадринАВ // Новая ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №779
КонецПроцедуры

// ХМНПФ 16.02.2017 ШадринАВ // Новая ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №779
Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ, СтруктураТЧ) Экспорт
	ЭтотОбъект.ОбменДанными.Загрузка = Ложь;
	ЭтотОбъект.Записать(?(ПРОВЕДЕН,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.ОтменаПроведения));
	ЭтотОбъект.ОбменДанными.Загрузка = Истина;
КонецПроцедуры
