
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура ХМПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	#Область ЕслиОбъектНовый
	Если Объект.Ссылка.Пустая() Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
			Объект.ТипПенсии = Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат;
		КонецЕсли;

		Объект.НомерОчереди = 1;
		Объект.ДатаНачалаВыплат = ТекущаяДата();
		Объект.ДатаРегистрации = ТекущаяДата();
#Вставка
	//ЛыткинАМ //https://redmine.npf.com/issues/4270
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			Объект.ДатаНачалаВыплат = Объект.ДокументОснование.Дата; //БортникВЕ 29.04
			Объект.ДатаРегистрации = Объект.ДокументОснование.ДатаРегистрации; //БортникВЕ 29.04
		КонецЕсли;
#КонецВставки
		Объект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователи.ТекущийПользователь(), "ОсновнойОтветственный");
	КонецЕсли;
	#КонецОбласти

	ВывестиВозрастУчастника();
	ВывестиВозрастДоговора();
	УстановитьВидимость();
	#Область БСППечать

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	#КонецОбласти

КонецПроцедуры
