
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 18.02.2020 МилевскийАЮ // ПоместитьВАрхив() // №2689
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПоместитьВАрхив")
Процедура ХМПоместитьВАрхив(ПутьКАрхиватору, ИмяФайла)
	WScript = Новый COMОбъект("WScript.Shell");
	#Удаление 
	СтрокаЗапуска = """" + ПутьКАрхиватору + ?(Прав(ПутьКАрхиватору, 1) = "\", "", "\") + "7z.exe"" a -y -tgzip -mx5 """ + ИмяФайла + ".gz" + """ """ + ИмяФайла +  """";
	#КонецУдаления   
	#Вставка 
	// +ХМНПФ 18.02.2020 МилевскийАЮ // ПоместитьВАрхив() // №2689
	СтрокаЗапуска = """" + ПутьКАрхиватору + ?(Прав(ПутьКАрхиватору, 1) = "\", "", "\") + "7z.exe"" a -y -tgzip -mx5 """ + Лев(ИмяФайла, СтрДлина(ИмяФайла)-4) + ".gz" + """ """ + ИмяФайла +  """";
	// -ХМНПФ 18.02.2020 МилевскийАЮ // ПоместитьВАрхив() // №2689
	#КонецВставки
	Попытка
		WScript.Run(СтрокаЗапуска, 0, Истина);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать файл в архив. Возможно указан неправильный каталог 7-Zip: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

// не используется
//&НаСервере
//Функция СоздатьФайлXML(ВходящиеПараметры)
//	
//	ОбъектВыгрузка = РеквизитФормыВЗначение("Объект");
//	Данные = ОбъектВыгрузка.СформироватьФайлыXML(ВходящиеПараметры);
//	ЗначениеВРеквизитФормы(ОбъектВыгрузка, "Объект");
//	
//	Возврат Данные;
//	
//КонецФункции

// не используется
//&НаКлиенте
//Процедура СохранитьФайлXML(ДанныеФайла) Экспорт
//	
//	СписокФайлов = Новый Массив;
//	Если ТипЗнч(ДанныеФайла) = Тип("Массив") Тогда
//		СписокФайлов = ДанныеФайла;
//	ИначеЕсли ТипЗнч(ДанныеФайла) = Тип("Структура") Тогда
//		СписокФайлов.Добавить(ДанныеФайла);
//	Иначе
//		ВызватьИсключение "Входящий параметр ""Данные файла"" должен быть структурой или массивом";
//	КонецЕсли;
//	
//	ЕстьОшибки = Ложь;
//	Для Каждого Строка Из СписокФайлов Цикл
//		
//		Если Строка.Свойство("ОписаниеОшибки") Тогда
//			ЕстьОшибки = Истина;
//			Если Строка.Свойство("IDСтроки") Тогда
//				СписокПакетов.НайтиПоИдентификатору(Строка.IDСтроки).Картинка = 2;
//			КонецЕсли;
//			
//			Оповестить("ВыгрузкаПакетаЭД_XML", Новый Структура("Успех, ПакетЭД, ОписаниеОшибки", Ложь, Строка.ПакетЭД, "Не удалось выгрузить " + Строка(Строка.ПакетЭД) + Символы.ПС + Строка.ОписаниеОшибки), Строка.Источник);
//			Продолжить;
//		КонецЕсли;
//		
//		ПолноеИмяФайла = Строка.Каталог + ?(Прав(Строка.Каталог, 1) = "\", "", "\") + Строка.ИмяФайла;
//		
//		Строка.ДвоичныеДанные.Записать(ПолноеИмяФайла);
//		Попытка
//			ПоместитьВАрхив(?(НЕ ПустаяСтрока(ПутьКАрхиватору), ПутьКАрхиватору, ПолучитьПутьКАрхиватору()), ПолноеИмяФайла);
//		Исключение
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось поместить в архив 7-Zip. Файл: " + Строка.ИмяФайла + Символы.ПС + ОписаниеОшибки());
//		КонецПопытки;
//		
//		Если Строка.НастройкиЭДО.ТолькоФайлыGZ Тогда
//			Попытка УдалитьФайлы(ПолноеИмяФайла); Исключение КонецПопытки;
//		КонецЕсли;
//		
//		Если Строка.Свойство("IDСтроки") И НЕ СписокПакетов.НайтиПоИдентификатору(Строка.IDСтроки).Картинка = 2 Тогда
//			СписокПакетов.НайтиПоИдентификатору(Строка.IDСтроки).Картинка = 0;
//		КонецЕсли;
//		
//		Если  НЕ уп_ПакетЭД_v2.ПолучитьСостояниеПакетаЭД(Строка.ПакетЭД) = ПредопределенноеЗначение("Перечисление.уп_СостоянияПакетаЭД.Отклонен") 
//			И НЕ уп_ПакетЭД_v2.ПолучитьСостояниеПакетаЭД(Строка.ПакетЭД) = ПредопределенноеЗначение("Перечисление.уп_СостоянияПакетаЭД.Принят")
//			И НЕ уп_ПакетЭД_v2.ПолучитьСостояниеПакетаЭД(Строка.ПакетЭД) = ПредопределенноеЗначение("Перечисление.уп_СостоянияПакетаЭД.СозданНовыйПакетЭД") 
//		Тогда	
//			уп_ПакетЭД_v2.ЗаписатьИнформациюВыгрузки(Новый Структура("ПакетЭД, НомерДокумента, Состояние, ИмяФайла, UUID, СостояниеОтправки", 
//					Строка.ПакетЭД, Строка.НомерДокумента, ПредопределенноеЗначение("Перечисление.уп_СостоянияПакетаЭД.ВыгруженВФайл"), Строка.ИмяФайла, Строка.UUID, 
//					ПредопределенноеЗначение("Перечисление.уп_СостоянияПакетаЭД.ВыгруженВФайл")));		
//		КонецЕсли;	
//				
//	КонецЦикла;

//	СтруктураВозврата = Новый Структура("Успех, ПакетЭД", НЕ ЕстьОшибки, Строка.ПакетЭД);
//	
//	ВидЭД = ПолучитьВидЭД(Строка.ПакетЭД);
//	Если НЕ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма20") 
//		И НЕ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма24")
//		И НЕ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма32") Тогда
//		
//		СтруктураВозврата.Вставить("НомерДокумента", Строка.НомерДокумента);
//		
//		Если НЕ ЕстьОшибки Тогда
//			ЗаписатьНомерДокументаВПакетЭД(Строка.ПакетЭД, Строка.НомерДокумента);
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Оповестить("ВыгрузкаПакетаЭД_XML", СтруктураВозврата, Строка.Источник);
//	
//	Если Объект.СписокОшибок.Количество() > 0 Тогда
//		ПараметрыОбработки = Новый Структура;
//		ПараметрыОбработки.Вставить("СписокОшибок", Объект.СписокОшибок);
//		ОткрытьФорму("Обработка.уп_ВыгрузкаПакетовЭД_v2.Форма.Ошибки", ПараметрыОбработки, ЭтаФорма,, ВариантОткрытияОкна.ОтдельноеОкно,,, РежимОткрытияОкнаФормы.Независимый);		
//	КонецЕсли;
//	
//КонецПроцедуры 

// не используется
//&НаСервере
//Функция СформироватьФайлыНаСервере(ПакетЭД, ПутьВыгрузки, Протокол)
//	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
//	
//	Если ВидВыгрузки = "1" Тогда
//		Возврат ОбработкаОбъект.СформироватьФайлыXML(ПакетЭД, ПутьВыгрузки, Объект.СписокОшибок, Протокол);
//	ИначеЕсли ВидВыгрузки = "2" Тогда
//		Возврат ОбработкаОбъект.СформироватьФайлыExcel(ПакетЭД, ПутьВыгрузки, Объект.СписокОшибок, Протокол);
//	Иначе
//		Сообщить("Не выбран Вид выгрузки");
//	КонецЕсли;	
//КонецФункции

// не используется
//&НаСервере
//Процедура СформироватьФайлыXMLНаСервере(ПараметрыВыгрузки, Протокол = Неопределено)
//	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
//	ОбработкаОбъект.СформироватьФайлыXML(ПараметрыВыгрузки, Протокол);
//КонецПроцедуры

// не используется
//&НаКлиенте
//Процедура ВыгрузитьБезМногопоточности()
//	ШагИндикатора = ПолучитьШагИндикатора();
//	
//	Для Каждого ОписаниеВыгрузки Из ПараметрыВыгрузки Цикл
//		ОчиститьФайлы(ОписаниеВыгрузки.ПакетЭД);
//		
//		Для Каждого ПачкаЭД Из ОписаниеВыгрузки.СписокПачекЭД Цикл
//			ОписаниеВыгрузки.Вставить("ПачкаЭД", ПачкаЭД);
//			
//			Если ОписаниеВыгрузки.ВидВыгрузки = 1 Тогда
//				СформироватьФайлыXMLНаСервере(ОписаниеВыгрузки, Новый ТекстовыйДокумент);	 
//			ИначеЕсли ОписаниеВыгрузки.ВидВыгрузки = 2 Тогда
//				СформироватьФайлыExcelНаСервере(ОписаниеВыгрузки, Новый ТекстовыйДокумент);	 
//			КонецЕсли;
//			
//			ИндикаторВыгрузки = ?(ИндикаторВыгрузки + ШагИндикатора >= 100, 99, ИндикаторВыгрузки + ШагИндикатора);
//			Если ОписаниеВыгрузки.Свойство("ЕстьОшибки") Тогда
//				ЗаполнитьОшибкиВТаблице(ОписаниеВыгрузки["АдресТаблицы"]);
//				Прервать;
//			КонецЕсли;
//				
//			Для Каждого ИмяФайла Из ОписаниеВыгрузки.СозданныеФайлы Цикл
//				Файл = Новый Файл(ИмяФайла);
//				НовоеИмяФайла = ОписаниеВыгрузки.ПутьВыгрузки + ?(Прав(ОписаниеВыгрузки.ПутьВыгрузки, 1) = "\", "", "\") + Файл.Имя + ".gz";
//				
//				ПоместитьВАрхив(ПутьКАрхиватору, ИмяФайла);
//				ПереместитьФайл(ИмяФайла + ".gz", НовоеИмяФайла);
//				
//				Если ОписаниеВыгрузки["ОбновлятьДанные"] Тогда
//					ЗаполнитьФайлВПакете(ОписаниеВыгрузки.ПакетЭД, НовоеИмяФайла);
//				КонецЕсли;
//				
//				УдалитьФайлы(ИмяФайла + ".gz");
//				Если ОписаниеВыгрузки.ТолькоФайлыGZ Тогда
//					УдалитьФайлы(ИмяФайла);
//				Иначе
//					ПереместитьФайл(ИмяФайла, ОписаниеВыгрузки.ПутьВыгрузки + ?(Прав(ОписаниеВыгрузки.ПутьВыгрузки, 1) = "\", "", "\") + Файл.Имя);
//					УдалитьФайлы(ИмяФайла);
//				КонецЕсли;
//			КонецЦикла;
//			ОписаниеВыгрузки.СозданныеФайлы.Очистить();
//		КонецЦикла;
//		
//		Если ОписаниеВыгрузки["ОбновлятьДанные"] И НЕ ОписаниеВыгрузки.Свойство("ЕстьОшибки") Тогда
//			уп_ПакетЭД_v2.УстановитьСостояниеПакетуЭД(ОписаниеВыгрузки.ПакетЭД, ОписаниеВыгрузки.ПакетЭД, ПредопределенноеЗначение("Перечисление.уп_СостоянияПакетаЭД.Отправлен"));
//			Оповестить("ВыгргуженПакетЭД_v2", ОписаниеВыгрузки.ПакетЭД);
//		КонецЕсли;
//	КонецЦикла;
//	
//	Если Объект.СписокОшибок.Количество() > 0 Тогда
//		ПараметрыОбработки = Новый Структура;
//		ПараметрыОбработки.Вставить("СписокОшибок", Объект.СписокОшибок);
//		ОткрытьФорму("Обработка.уп_ВыгрузкаПакетовЭД_v2.Форма.Ошибки", ПараметрыОбработки, ЭтаФорма,, ВариантОткрытияОкна.ОтдельноеОкно,,, РежимОткрытияОкнаФормы.Независимый);		
//	КонецЕсли;
//	
//	УстановитьДоступность();
//	ОтобразитьГруппуВыгрузки(,, Ложь);
//			
//	ПоказатьОповещениеПользователя("Общая выгрузка Пакетов ЭД",, "Выгрузка завершена", БиблиотекаКартинок.ЗеленаяГалка, СтатусОповещенияПользователя.Информация);
//	
//	Возврат;
//	Для Каждого Строка Из ПараметрыВыгрузки["СписокСтрок"] Цикл
//		СтрокаПакета = СписокПакетов.НайтиПоИдентификатору(Строка.Ключ);
//		
//		Для Каждого Пачка Из Строка.Значение Цикл
//			АдресХранилища = ПоместитьВоВременноеХранилище("", Новый УникальныйИдентификатор);
//			
//			ПараметрыПачки = Пачка;
//			ПараметрыПачки.Вставить("АдресХранилища", АдресХранилища);
//			ПараметрыПачки.Вставить("АдресТаблицы", ПоместитьВоВременноеХранилище("", Новый УникальныйИдентификатор));

//			ПараметрыПачки.Вставить("ИДСтроки", Строка.Ключ);
//			
//			Если ПараметрыПачки["ВариантВыгрузки"] = 1 Тогда
//				СформироватьФайлыXMLНаСервере(ПараметрыПачки, Новый ТекстовыйДокумент);	 
//			ИначеЕсли ПараметрыПачки["ВариантВыгрузки"] = 2 Тогда
//				СформироватьФайлыExcelНаСервере(ПараметрыПачки, Новый ТекстовыйДокумент);	 
//			КонецЕсли;
//			
//			ОписаниеФайла = ПолучитьИзВременногоХранилища(ПараметрыПачки["АдресХранилища"]);
//			Если ОписаниеФайла["ТаблицаОшибок"] = Неопределено Тогда
//				ОписаниеФайла["Файл"].Записать(ОписаниеФайла["ПолноеИмяФайла"]);
//			
//				Если НЕ ПараметрыПачки["ОбновлятьДанные"] Тогда
//					Продолжить;		
//				КонецЕсли;
//				
//				ЗафиксироватьВыгрузкуВПакете(ПараметрыПачки["ПакетЭД"], ПараметрыПачки["ПачкаЭД"], ОписаниеФайла["ПолноеИмяФайла"]);
//			Иначе
//				ЗаполнитьОшибкиВТаблице(ОписаниеФайла["ТаблицаОшибок"]);
//				СтрокаПакета.ЕстьОшибки = Истина;
//			КонецЕсли;
//			ИндикаторВыгрузки = ?(ИндикаторВыгрузки + ПараметрыВыгрузки["ШагИндикатора"] >= 100, 99, ИндикаторВыгрузки + ПараметрыВыгрузки["ШагИндикатора"]);
//		КонецЦикла;
//		
//		Если НЕ СтрокаПакета.ЕстьОшибки И Пачка["ОбновлятьДанные"] Тогда			
//			Для Каждого ИмяФайла Из ПолучитьСписокФайловПакета(Пачка["ПакетЭД"]) Цикл 
//				ПоместитьВАрхив(ПараметрыВыгрузки["ПутьКАрхиватору"], ИмяФайла); 
//			КонецЦикла;
//				
//			ЗафиксироватьВыгрузкуАрхиваВПакете(Пачка["ПакетЭД"], ПараметрыВыгрузки["ПутьВыгрузки"]);
//		КонецЕсли;
//		
//		СтрокаПакета.Выгружен = НЕ СтрокаПакета.ЕстьОшибки;
//		СтрокаПакета.Завершено = Истина;
//	КонецЦикла;
//	
//	Если Объект.СписокОшибок.Количество() > 0 Тогда
//		ПараметрыОбработки = Новый Структура;
//		ПараметрыОбработки.Вставить("СписокОшибок", Объект.СписокОшибок);
//		ОткрытьФорму("Обработка.уп_ВыгрузкаПакетовЭД_v2.Форма.Ошибки", ПараметрыОбработки, ЭтаФорма,, ВариантОткрытияОкна.ОтдельноеОкно,,, РежимОткрытияОкнаФормы.Независимый);		
//	КонецЕсли;
//	
//	УстановитьДоступность();
//	ОтобразитьГруппуВыгрузки(,, Ложь);
//			
//	ПоказатьОповещениеПользователя("Общая выгрузка Пакетов ЭД",, "Выгрузка завершена", БиблиотекаКартинок.ЗеленаяГалка, СтатусОповещенияПользователя.Информация);
//КонецПроцедуры

