
&НаКлиенте
Процедура ПодтвердитьПараметрыЗаполнения(Команда)   
	ПараметрыВозврата = Новый Структура();
	
	ПараметрыВозврата.Вставить("ЗаполнятьАдресРайонаРегионом",ЗаполнятьАдресРайонаРегионом);
	ПараметрыВозврата.Вставить("ЗаполнятьНаселенныйПунктГородом",ЗаполнятьНаселенныйПунктГородом);
	ПараметрыВозврата.Вставить("НеВыводитьКППОрганизации",НеВыводитьКППОрганизации);

	ЭтаФорма.Закрыть(ПараметрыВозврата);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнятьАдресРайонаРегионом = Истина;
	ЗаполнятьНаселенныйПунктГородом = Истина;
	НеВыводитьКППОрганизации = Истина;
КонецПроцедуры
