
&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// ХМНПФ+ 26.02.2024 ЛыткинАМ // НПО Доработка возвратов // №3797
	НовыйЭлементФормы = ЭтаФорма.Элементы.Добавить("хм_ВозвратСПлатежногоПоручения",Тип("ПолеФормы"),ЭтаФорма.Элементы.хм_ГруппаВозвратСПлатежногоПоручения);
	НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлементФормы.ПутьКДанным = "Объект.хм_ВозвратСПлатежногоПоручения";
	НовыйЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлементФормы.АвтоотметкаНезаполненного = Ложь;

	НовыйЭлементФормы = ЭтаФорма.Элементы.Добавить("хм_ПричинаВозврата",Тип("ПолеФормы"),ЭтаФорма.Элементы.хм_ГруппаВозвратСПлатежногоПоручения);
	НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлементФормы.ПутьКДанным = "Объект.хм_ПричинаВозврата";
	НовыйЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовыйЭлементФормы.АвтоотметкаНезаполненного = Ложь;

	// абонд, заполнение документа при создании из документа ПоступлениеНаРасчетныйСчет 
	Если Параметры.Свойство("СозданиеИзПоступления") Тогда
		ЗаполнитьДокументИзПоступления(Параметры.ДокументПоступление,
									   Параметры.ПричинаВозврата,
									   Параметры.Участник,
									   Параметры.ДокументВыплаты);	
	КонецЕсли; 

КонецПроцедуры

// ХМНПФ+ 26.02.2024 ЛыткинАМ // НПО Доработка возвратов // №3797
&НаСервере
Процедура ЗаполнитьДокументИзПоступления(ПоступлениеСсылка, ПричинаВозвратаСсылка, УчастникСсылка, ДокументОснованиеСсылка)
	
	Если ЗначениеЗаполнено(ПричинаВозвратаСсылка) Тогда
		РеквизитыПричиныВозврата = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПричинаВозвратаСсылка,
		"СтавитьНеверныеРеквизиты,ВидОперацииВозврата,ПриостановкаВыплат,ДействиеССостояниемСчета,ПричинаПриостановки");
	КонецЕсли;
	
	РеквизитыПоступления 	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПоступлениеСсылка,
	"Дата,Организация");
	
	Объект.Дата 						  = РеквизитыПоступления.Дата;
	Объект.Организация  				  = РеквизитыПоступления.Организация;
	Если ЗначениеЗаполнено(ПричинаВозвратаСсылка) Тогда
		Объект.ВидОперации 				  	  = РеквизитыПричиныВозврата.ВидОперацииВозврата;
		Объект.НекорректныеРеквизиты 		  = РеквизитыПричиныВозврата.СтавитьНеверныеРеквизиты;
	КонецЕсли;
	Объект.Участник 					  = УчастникСсылка;
	Объект.ДокументВыплаты 			      = ДокументОснованиеСсылка;
	Объект.хм_ВозвратСПлатежногоПоручения = ПоступлениеСсылка;
	Объект.хм_ПричинаВозврата 			  = ПричинаВозвратаСсылка;
	Объект.Комментарий 				      = СтрШаблон("Создан автоматически по документу: %1",ПоступлениеСсылка);
	Объект.Ответственный 				  = Пользователи.ТекущийПользователь();
	
	Если ЗначениеЗаполнено(ДокументОснованиеСсылка) Тогда
		Документы.уп_ВозвратПенсий.РасчетПоДокументуВыплатыОбщий(Объект);
		РассчитатьДокументНаСервере();
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
&После("УстановитьВидимость")
Процедура ХМУстановитьВидимость()
	Если Элементы.Найти("хм_НДФЛНеУдержанВБюджет") = Неопределено Тогда
		НовыйЭлементФормы = ЭтаФорма.Элементы.Добавить("хм_НДФЛНеУдержанВБюджет",Тип("ПолеФормы"),ЭтаФорма.Элементы.ГруппаУчастникЛевая);
		НовыйЭлементФормы.Заголовок = "НДФЛ не удержан в бюджет";
		НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлементФормы.ПутьКДанным = "Объект.НДФЛНеУдержанВБюджет";
		НовыйЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	КонецЕсли;
	Элементы.хм_НДФЛНеУдержанВБюджет.Видимость = Элементы.ВозвращатьНДФЛ.Видимость; 
	// Вставить содержимое метода.
КонецПроцедуры
