&НаКлиенте
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 15.11.2015 ШадринАВ // На форме добавлен реквизит ХМ_НомерКаспер // №66
	// ХМНПФ+ 15.11.2015 ЛыткинАМ // На форме добавлен реквизит Родитель_Элемент //	
КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму();
КонецПроцедуры

Процедура ХМДополнитьФорму() 
	
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"Родитель_Элемент",Элементы.Главное,"Объект.Родитель_Элемент");	
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_НомерКаспер",Элементы.Главное,"Объект.ХМ_НомерКаспер");	
		
КонецПроцедуры
