// +ХМНПФ 27.08.2025 КопыткоАА // http://redmine.npf.com/issues/4568
Функция ПолучитьТекстЗапросаИзРегистраЗагрузки(ИмяРегистра, PF_ID, ЭтоМаппинг) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВЫБОР
	               |		КОГДА ХМ_ЗагрузкаКасперV4.ЗапросИзИсточника
	               |			ТОГДА ХМ_ЗагрузкаКасперV4.ИсточникЗапроса.ЗначениеТекстового
	               |		ИНАЧЕ ХМ_ЗагрузкаКасперV4.Запрос
	               |	КОНЕЦ КАК Запрос
	               |ИЗ
	               |	РегистрСведений.ХМ_ЗагрузкаКасперV4 КАК ХМ_ЗагрузкаКасперV4
	               |ГДЕ
	               |	ХМ_ЗагрузкаКасперV4.ИмяРегистра = &ИмяРегистра
	               |	И (ХМ_ЗагрузкаКасперV4.pf_id = &pf_id
	               |			ИЛИ ХМ_ЗагрузкаКасперV4.pf_id = 0)
	               |	И ХМ_ЗагрузкаКасперV4.ЭтоМаппинг = &ЭтоМаппинг
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ХМ_ЗагрузкаКасперV4.pf_id УБЫВ";
	Запрос.УстановитьПараметр("ИмяРегистра", ИмяРегистра);
	Запрос.УстановитьПараметр("PF_ID", PF_ID);
	Запрос.УстановитьПараметр("ЭтоМаппинг", ЭтоМаппинг);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Запрос;		
		КонецЕсли;		
	КонецЕсли;               
	Возврат Неопределено;

КонецФункции
// -ХМНПФ 27.08.2025 КопыткоАА // http://redmine.npf.com/issues/4568

// +ХМНПФ 24.09.2025 КопыткоАА // http://redmine.npf.com/issues/4646
Процедура ЗаписатьВРегистрЗагрузкиПоПараметрам(локИмяРегистра, локЭтоМаппинг, локТекстЗапроса, локpf_id) Экспорт
	
	НЗ = РегистрыСведений.ХМ_ЗагрузкаКасперV4.СоздатьНаборЗаписей();
	
	НЗ.Отбор.ИмяРегистра.Установить(локИмяРегистра); 
	НЗ.Отбор.pf_id.Установить(локpf_id); 
	НЗ.Отбор.ЭтоМаппинг.Установить(локЭтоМаппинг); 
	
	НоваяЗапись = НЗ.Добавить();
	НоваяЗапись.ИмяРегистра = локИмяРегистра;
	НоваяЗапись.pf_id = локpf_id;   
	НоваяЗапись.ЭтоМаппинг = локЭтоМаппинг; 		
	НоваяЗапись.Запрос = локТекстЗапроса;
		
	НЗ.Записать();
	
КонецПроцедуры
// -ХМНПФ 24.09.2025 КопыткоАА // http://redmine.npf.com/issues/4646
