
&ИзменениеИКонтроль("ПолучитьСписокВидовЭД_Исходящие")
Функция ХМПолучитьСписокВидовЭД_Исходящие()
	Список = Новый Соответствие;
#Область ЗаполнениеСписка
	Список.Вставить("РНПФ", 	 Перечисления.уп_ВидыЭД_v2.Форма1);
	Список.Вставить("РНПФ-А", 	 Перечисления.уп_ВидыЭД_v2.Форма2);
	Список.Вставить("РНПФ-У", 	 Перечисления.уп_ВидыЭД_v2.Форма3);
	Список.Вставить("РНПФ-С", 	 Перечисления.уп_ВидыЭД_v2.Форма4);
	Список.Вставить("РНПФ-М", 	 Перечисления.уп_ВидыЭД_v2.Форма5);
	Список.Вставить("РНПФ-УМ", 	 Перечисления.уп_ВидыЭД_v2.Форма6);
	Список.Вставить("УОПС-П", 	 Перечисления.уп_ВидыЭД_v2.Форма10);
	Список.Вставить("УОПС-ПИ", 	 Перечисления.уп_ВидыЭД_v2.Форма11);
	Список.Вставить("УСПН-З", 	 Перечисления.уп_ВидыЭД_v2.Форма12);
	Список.Вставить("ЗСПННПФ", 	 Перечисления.уп_ВидыЭД_v2.Форма14);
	Список.Вставить("УОПС-С", 	 Перечисления.уп_ВидыЭД_v2.Форма15);
	Список.Вставить("АНПФ", 	 Перечисления.уп_ВидыЭД_v2.Форма16);
	Список.Вставить("ССПН-НПФ",  Перечисления.уп_ВидыЭД_v2.Форма17);
	Список.Вставить("ЗННЧ", 	 Перечисления.уп_ВидыЭД_v2.Форма18);
	Список.Вставить("ИДСПН", 	 Перечисления.уп_ВидыЭД_v2.Форма19);
	Список.Вставить("РСПННПФ", 	 Перечисления.уп_ВидыЭД_v2.Форма20);
	Список.Вставить("АСЛС", 	 Перечисления.уп_ВидыЭД_v2.Форма21);
	Список.Вставить("ПСПН-НПФ",  Перечисления.уп_ВидыЭД_v2.Форма22);
	Список.Вставить("ИПСПН-НПФ", Перечисления.уп_ВидыЭД_v2.Форма23);
	Список.Вставить("СФВ", 		 Перечисления.уп_ВидыЭД_v2.Форма24);
	Список.Вставить("ВСПН-П", 	 Перечисления.уп_ВидыЭД_v2.Форма25);
	Список.Вставить("ИНСПН-В", 	 Перечисления.уп_ВидыЭД_v2.Форма27);
	Список.Вставить("ИНСПН", 	 Перечисления.уп_ВидыЭД_v2.Форма28);
	Список.Вставить("СФС-НПФ", 	 Перечисления.уп_ВидыЭД_v2.Форма29);
	Список.Вставить("ЗГС", 		 Перечисления.уп_ВидыЭД_v2.Форма30);
	Список.Вставить("СИЗЛП", 	 Перечисления.уп_ВидыЭД_v2.Форма31);
	Список.Вставить("УНПФ", 	 Перечисления.уп_ВидыЭД_v2.Форма32); 
	Список.Вставить("ЗРСПН-НПФ", Перечисления.уп_ВидыЭД_v2.Форма33);
	Список.Вставить("РНПФ-НЕПР", Перечисления.уп_ВидыЭД_v2.Форма34);
	Список.Вставить("УОВМ", 	 Перечисления.уп_ВидыЭД_v2.Форма35);	
	Список.Вставить("СМСК", 	 Перечисления.уп_ВидыЭД_v2.Форма36);
	Список.Вставить("УЗР", 	 	 Перечисления.уп_ВидыЭД_v2.Форма37);
	Список.Вставить("УЗЕВ-ДДС-НПФ", 		Перечисления.уп_ВидыЭД_v2.Форма38);
	Список.Вставить("УЗЕВ-ДДС-НПФ-ЕПГУ", 	Перечисления.уп_ВидыЭД_v2.Форма39);
	Список.Вставить("УЗЕВО-ДДС-НПФ", 	 	Перечисления.уп_ВидыЭД_v2.Форма40);
	Список.Вставить("УЗЕВО-ДДС-НПФ-ЕПГУ", 	Перечисления.уп_ВидыЭД_v2.Форма41);	
#КонецОбласти
	#Вставка
	// ХМНПФ +24.03.23 ПоповСО // Ошибка при загрузке ответа из ПФР УППО // №5426
	Список.Вставить("ЗРСПН-НПФ", 	 Перечисления.уп_ВидыЭД_v2.Форма33);
	// ХМНПФ -24.03.23 ПоповСО // Ошибка при загрузке ответа из ПФР УППО // №5426	
	// ХМНПФ +25.10.24 ЛыткинАМ // https://redmine.npf.com/issues/3943
	Список.Вставить("УОПЕВДДС-НПФ", Перечисления.уп_ВидыЭД_v2.Форма43);
	Список.Вставить("УПЕВДДС-НПФ",  Перечисления.уп_ВидыЭД_v2.Форма42);
	// ХМНПФ -25.10.24 ЛыткинАМ // https://redmine.npf.com/issues/3943
	#КонецВставки
	Возврат Список;
КонецФункции

&ИзменениеИКонтроль("ПолучитьНовыйНомерДокумента")
Функция ХМПолучитьНовыйНомерДокумента(Организация, Знач НаДату)
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДата();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(НаДату));
	Запрос.УстановитьПараметр("КонецПериода", КонецГода(НаДату));
	Запрос.УстановитьПараметр("Организация", Организация);
	#Область ТекстЗапроса
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_ПакетЭД_v2.Ссылка КАК ПакетЭД
	|ПОМЕСТИТЬ ВТ_СписокПакетов
	|ИЗ
	|	Документ.уп_ПакетЭД_v2 КАК уп_ПакетЭД_v2
	|ГДЕ
	|	уп_ПакетЭД_v2.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И уп_ПакетЭД_v2.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ЕСТЬNULL(уп_ФайлыЭДО.НомерДокумента, 0)) КАК НомерДокумента
	|ИЗ
	|	ВТ_СписокПакетов КАК ВТ_СписокПакетов  
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уп_ФайлыЭДО КАК уп_ФайлыЭДО 
	|		ПО ВТ_СписокПакетов.ПакетЭД = уп_ФайлыЭДО.ПакетЭД";
	#КонецОбласти

	Результат = Запрос.Выполнить().Выгрузить();
	Если НЕ Результат.Количество() Тогда
		Возврат 1;
	КонецЕсли;
    #Вставка
	// +ХМНПФ КопыткоАА 04.01.2026 //https://redmine.npf.com/issues/4744
	Если Результат[0].НомерДокумента = NULL Тогда
		Возврат 1;
	КонецЕсли;
	// -ХМНПФ КопыткоАА 04.01.2026 //https://redmine.npf.com/issues/4744	
	#КонецВставки	
	
	Возврат Результат[0].НомерДокумента + 1;
КонецФункции
