Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ, СтруктураТЧ) Экспорт
	Если Проведен Тогда
	#Если Сервер Тогда
		Если ЗначениеЗаполнено(ПенсионныйДоговор) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ХМ_КасперДокументы.DOC_ID
				|ИЗ
				|	РегистрСведений.ХМ_КасперДокументы КАК ХМ_КасперДокументы
				|ГДЕ
				|	ХМ_КасперДокументы.Документ = &Документ";
			
			Запрос.УстановитьПараметр("Документ", ЭтотОбъект.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				DOC_ID = Выборка.DOC_ID;
			Иначе
				ВызватьИсключение "Для документа " + ЭтотОбъект.Ссылка + " не найден DOC_ID в РегистрСведений.ХМ_КасперДокументы";
			КонецЕсли;
			
			НЗ = РегистрыСведений.ХМ_КасперДокументыНПО.СоздатьНаборЗаписей();
			НЗ.ОбменДанными.Загрузка = Истина;
			НЗ.Отбор.DOC_ID.Установить(DOC_ID);
			НЗ.Прочитать();
			Если НЗ.Количество()=0 Тогда
				НовЗапись = НЗ.Добавить();
				НовЗапись.DOC_ID = DOC_ID;
			ИначеЕсли НЗ.Количество()=1 Тогда
				НовЗапись = НЗ[0];
			КонецЕсли;
			НовЗапись.Документ = ПенсионныйДоговор;
			НЗ.Записать();
		КонецЕсли;
	#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

