
&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму();
КонецПроцедуры 

Процедура ХМДополнитьФорму()	
	
	СвойстваГруппы = Новый Структура();
	СвойстваГруппы.Вставить("ВставитьПередЭлементом", Элементы.ГруппаПодвал);
	СвойстваГруппы.Вставить("ОтображатьЗаголовок", Ложь);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьОбычнуюГруппу(ЭтаФорма,"ХМ_Госпенсия",ЭтаФорма,СвойстваГруппы);

	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_СрокПП",Элементы["ХМ_Госпенсия"],"Объект.ХМ_СрокПП");
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_РазмерГП",Элементы["ХМ_Госпенсия"],"Объект.ХМ_РазмерГП");
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ДатаГосПенсии",Элементы["ХМ_Госпенсия"],"Объект.ХМ_ДатаГосПенсии");
		
КонецПроцедуры  

// ХМНПФ 28.03.2017 ШадринАВ // Новая ХМ_ПриОткрытии() // №868
&НаКлиенте
Процедура ХМ_ПриОткрытии(Отказ)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ХМ_ДатаСозданияДокумента = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

// ХМНПФ 03.05.2017 ШадринАВ // Новая ХМ_ПослеЗаписи() // №920
&НаКлиенте
Процедура ХМ_ПослеЗаписи(ПараметрыЗаписи)
	ХМ_ПослеЗаписиСервер();
КонецПроцедуры

// ХМНПФ 04.05.2018 КлименкоМИ // Новая ХМ_ПослеЗаписиСервер() // №1555
&НаСервере
Процедура ХМ_ПослеЗаписиСервер()
	//ПослеЗаписи(ПараметрыЗаписи);
	Если Объект.Проведен Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РешениеЕДВ.ДоговорОПС,
			|	МАКСИМУМ(РешениеЕДВ.Дата) КАК Дата
			|ИЗ
			|	Документ.уп_РешениеОЕдиновременнойВыплате КАК РешениеЕДВ
			|ГДЕ
			|	РешениеЕДВ.ДоговорОПС = &ДоговорОПС
			|	И НЕ РешениеЕДВ.Ссылка = &Ссылка
			|	И РешениеЕДВ.Проведен
			|	И РешениеЕДВ.Дата >= &ДатаДок
			|
			|СГРУППИРОВАТЬ ПО
			|	РешениеЕДВ.ДоговорОПС";
		
		Запрос.УстановитьПараметр("ДоговорОПС", Объект.ДоговорОПС);
		Запрос.УстановитьПараметр("ДатаДок", Объект.Дата);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		ВыборкаРешения = Запрос.Выполнить().Выбрать();
		Если ВыборкаРешения.Следующий() Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	РезервыОПС.ДоговорОПС,
				|	РезервыОПС.СуммаОстаток
				|ИЗ
				|	РегистрНакопления.уп_РезервыОПС.Остатки(
				|			&ДатаОстатков,
				|			ДоговорОПС = &ДоговорОПС
				|				И ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений)) КАК РезервыОПС";
			
			Запрос.УстановитьПараметр("ДатаОстатков", ВыборкаРешения.Дата+1);
			Запрос.УстановитьПараметр("ДоговорОПС", Объект.ДоговорОПС);
			
			ВыборкаОстатки = Запрос.Выполнить().Выбрать();
			Если ВыборкаОстатки.Следующий() Тогда
				Если ВыборкаОстатки.СуммаОстаток < 0 Тогда
					Сообщить("Внимание! Отрицательный остаток " + Строка(ВыборкаОстатки.СуммаОстаток) + " по договору " + Объект.ДоговорОПС + " в результате проведения задним числом " + Строка(Объект.Ссылка), СтатусСообщения.ОченьВажное);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 15.12.2015 ШадринАВ // Новая ХМ_УстановитьДействияФормы()
	// ХМНПФ 15.12.2015 ШадринАВ // ПриСозданииНаСервере()
	// ХМНПФ 28.03.2017 ШадринАВ // Новая ХМ_ПриОткрытии() // №868
	// ХМНПФ 03.05.2017 ШадринАВ // Новая ХМ_ПослеЗаписи() // №920
	// ХМНПФ 04.05.2018 КлименкоМИ // Новая ХМ_ПослеЗаписиСервер() // №1555
	
	// ХМНПФ+ 15.01.2016 ШадринАВ // Новый реквизит ХМ_РазмерГП // №133
	// ХМНПФ+ 15.01.2016 ШадринАВ // Новый реквизит ХМ_СрокПП // №133
	// ХМНПФ+ 20.01.2016 ШадринАВ // Новый реквизит ХМ_ДатаГосПенсии // №138
КонецПроцедуры

// ХМНПФ 15.12.2015 ШадринАВ // Новая ХМ_УстановитьДействияФормы()
&НаКлиенте
Процедура ХМПриОткрытииПосле(Отказ)
	ХМ_ПриОткрытии(Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ХМПослеЗаписиПосле(ПараметрыЗаписи)
	ХМ_ПослеЗаписи(ПараметрыЗаписи);
КонецПроцедуры
