#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//&После("ДобавитьКомандыПечати")
//Процедура хмПДС_ДобавитьКомандыПечати(КомандыПечати)
//Процедура хмПДС_ДобавитьКомандыПечати(КомандыПечати)	
//	КомандаПечати = КомандыПечати.Добавить();
//	КомандаПечати.Идентификатор = "Приложение2";
//	КомандаПечати.Представление = НСтр("ru = 'Приложение №2'");
//	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
//	КомандаПечати.Порядок = 20; 
//	
//	КомандаПечати = КомандыПечати.Добавить();
//	КомандаПечати.Идентификатор = "Приложение5";
//	КомандаПечати.Представление = НСтр("ru = 'Приложение №5'");
//	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
//	КомандаПечати.Порядок = 20;	
//	
//КонецПроцедуры

//&После("Печать")
//Процедура хмПДС_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
////Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)	
//	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение2") Тогда
//		ИмяФайлаПечатнойФормы = Новый Соответствие;
//		ИмяФайлаПечатнойФормы.Вставить(МассивОбъектов[0].Ссылка, "Приложение 2");
//		
//		
//		ПараметрыПечати.Вставить("ВидДокументаПечати",  "пдс_РешениеОбОтказеВВыплатеВыкупнойСуммы");
//		ПараметрыПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_пдс_РешениеОбОтказеВВыплатеВыкупнойСуммы_Приложение2");
//		ПараметрыПечати.Вставить("ИмяМакетаПечати",     "Документ.пдс_РешениеОбОтказеВВыплатеВыкупнойСуммы.хмПДС_Приложение2");
//		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение2", "Приложение 2", 
//		Документы.пдс_РешениеОбОтказеВВыплатеВыкупнойСуммы.ПечатьПриложение2(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,,ИмяФайлаПечатнойФормы);
//		
////		ПараметрыВывода.Вставить("ФормироватьЭД", Истина);
//	КонецЕсли; 
//	
//	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Приложение5") Тогда
//		ИмяФайлаПечатнойФормы = Новый Соответствие;
//		ИмяФайлаПечатнойФормы.Вставить(МассивОбъектов[0].Ссылка, "Приложение 5");
//		
//		
//		ПараметрыПечати.Вставить("ВидДокументаПечати",  "пдс_РешениеОбОтказеВВыплатеВыкупнойСуммы");
//		ПараметрыПечати.Вставить("ИмяПараметровПечати", "ПАРАМЕТРЫ_ПЕЧАТИ_пдс_РешениеОбОтказеВВыплатеВыкупнойСуммы_Приложение5");
//		ПараметрыПечати.Вставить("ИмяМакетаПечати",     "Документ.пдс_РешениеОбОтказеВВыплатеВыкупнойСуммы.хмПДС_Приложение5");
//		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Приложение5", "Приложение 5", 
//		Документы.пдс_РешениеОбОтказеВВыплатеВыкупнойСуммы.ПечатьПриложение5(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),,,ИмяФайлаПечатнойФормы);
//		
////		ПараметрыВывода.Вставить("ФормироватьЭД", Истина);
//	КонецЕсли;
//	
//	
//	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов,КоллекцияПечатныхФорм,ОбъектыПечати,ПараметрыВывода);
//КонецПроцедуры

#КонецОбласти   


Функция ПечатьПриложение2(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
	ИмяПараметровПечати = ПараметрыПечати.ИмяПараметровПечати;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	
	
	ТабличныйДокумент.КлючПараметровПечати = ИмяПараметровПечати;
	
	//УстановитьМинимальныеПоляПечати(ТабличныйДокумент);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ОбъектПечати Из МассивОбъектов Цикл
		
		Если ОбъектПечати.ПометкаУдаления Тогда
			Продолжить;	
		КонецЕсли;
		
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		
		Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(ОбъектПечати.Организация, ОбъектПечати.Дата);
		
		Дата = ОбъектПечати.Дата;
		
		//Если Дата<'20150101' Тогда
		//	Макет = Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПолучитьМакет("Приложение3");
		//Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.пдс_РешениеОбОтказеВВыплатеВыкупнойСуммы.хмПДС_Приложение2");
		//КонецЕсли;
		
		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ОбъектПечати.Организация, Дата);
		ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
		
		
		ТаблицаДокумента = Новый ТаблицаЗначений;
		ТаблицаДокумента.Колонки.Добавить("Документ");
		//ТаблицаДокумента.Колонки.Добавить("Ссылка");
		ТаблицаДокумента.Колонки.Добавить("Организация");
		ТаблицаДокумента.Колонки.Добавить("Руководитель");
		ТаблицаДокумента.Колонки.Добавить("ГлавныйБухгалтер");
		
		СведенияОДокументе = ТаблицаДокумента.Добавить();
		СведенияОДокументе.Документ = ОбъектПечати.Ссылка;
		//СведенияОДокументе.Ссылка = ОбъектПечати.Ссылка;
		СведенияОДокументе.Организация = ОбъектПечати.Организация;
		СведенияОДокументе.Руководитель = Руководители.Руководитель;
		СведенияОДокументе.ГлавныйБухгалтер = Руководители.Руководитель;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Заголовок
		//Область = Макет.ПолучитьОбласть("Страница1");
		//Область2 = Макет.ПолучитьОбласть("Страница2");
		//Область.Параметры.Число = Формат(Дата, "ДФ=дд");
		//Область.Параметры.Месяц = Сред(Формат(Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(Дата, "ДЛФ=дд")))-10);
		//Область.Параметры.Год = Формат(Дата, "ДФ=гггг");
		//Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;
		//Область.Параметры.НомерРешения = ОбъектПечати.Номер;
		//
		//ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ОбъектПечати.Заявление.Правопреемник.уп_ФизЛицо));
		//Фамилия = ФИОФизЛица.Фамилия;
		//Имя = ФИОФизЛица.Имя;                
		//Отчество = ФИОФизЛица.Отчество;
		//Область.Параметры.ФИОДатаРождения = Фамилия+" "+Имя+" "+Отчество+", "+Формат(ОбъектПечати.Заявление.Правопреемник.уп_ФизЛицо.ДатаРождения,"ДЛФ=DD");
		//Область.Параметры.ЧислоЗ = Формат(ОбъектПечати.Заявление.ДатаРегистрации, "ДФ=дд");
		//Область.Параметры.МесяцЗ = Сред(Формат(ОбъектПечати.Заявление.ДатаРегистрации, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(ОбъектПечати.Заявление.ДатаРегистрации, "ДЛФ=дд")))-10);
		//Область.Параметры.ГодЗ = Формат(ОбъектПечати.Заявление.ДатаРегистрации, "ДФ=гггг");
		//Область.Параметры.НомерЗаявления = ОбъектПечати.Заявление.Номер;
		//ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Дата, Новый Структура("ФизическоеЛицо", ОбъектПечати.Заявление.ДоговорОПС.Участник.уп_ФизЛицо));
		//Фамилия = ФИОФизЛица.Фамилия;
		//Имя = ФИОФизЛица.Имя;                
		//Отчество = ФИОФизЛица.Отчество;
		//Область.Параметры.ФИОЗастрахованного = Фамилия+" "+Имя+" "+Отчество;
		//Область.Параметры.СтраховойНомер = ОбъектПечати.Заявление.ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР;
		//
		//Картинка1 = "";
		//Картинка2 = "";
		//Картинка3 = "";
		//Картинка4 = "";
		//Картинка5 = "";
		//Картинка6 = "";
		//Картинка7 = "";
		//Картинка8 = "";
		//Область.Параметры.Картинка1 = Картинка1;
		//Область.Параметры.Картинка2 = Картинка2;
		//Область.Параметры.Картинка3 = Картинка3;
		//Область.Параметры.Картинка4 = Картинка4;
		//Область.Параметры.Картинка5 = Картинка5;
		//Область2.Параметры.Картинка6 = Картинка6;
		//Область2.Параметры.Картинка7 = Картинка7;
		////Если Дата>='20150101' Тогда
		//Область2.Параметры.Картинка8 = Картинка8;
		////КонецЕсли;
		//Область.Параметры["Картинка" + ОбъектПечати.ПричинаОтказа]  =  "V";	
		//
		//СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОВыплатеСредствПенсионныхНакоплений.ПустаяСсылка(),ОбъектПечати.Организация,ОбъектПечати.Заявление.ДоговорОПС.Филиал,Пользователи.ТекущийПользователь(),"Приложение1",Дата);
		//Область2.Параметры.ДолжностьОтветственного = СведенияОбОтветственном.Должность;
		//Область2.Параметры.ФИООтветственного = Лев(СведенияОбОтветственном.Имя,1)+"."+Лев(СведенияОбОтветственном.Отчество,1)+"."+СведенияОбОтветственном.Фамилия;
		//
		//ТабличныйДокумент.Вывести(Область);
		//ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		//ТабличныйДокумент.Вывести(Область2);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, СведенияОДокументе.Документ);
		
		
	КонецЦикла;	
	Возврат ТабличныйДокумент;
	
КонецФункции 

//Функция ПечатьПриложение5(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт

//КонецФункции 

#КонецЕсли



