
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		ХМ_ЗагрузкаТЗ_V02_Клиент.ИнтерактивнаяЗагрузкаДокументаПоСсылке(ПараметрКоманды,Новый Структура("ТолькоОбработкаПроведения"),Новый Структура("Статус","НП"));
		ХМ_ЗагрузкаТЗ_V02_Клиент.ИнтерактивнаяЗагрузкаДокументаПоСсылке(ПараметрКоманды,Новый Структура("ТолькоОбработкаПроведения"),Новый Структура("Статус","НЕ"));
		ХМ_ЗагрузкаТЗ_V02_Клиент.ИнтерактивнаяЗагрузкаДокументаПоСсылке(ПараметрКоманды,Новый Структура("ТолькоОбработкаПроведения"),Новый Структура("Статус","ЕЖ"));
		Сигнал();
	КонецЕсли;
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
