
&НаСервере
Функция ПечатьПриложение3() 

	СведенияОбОрг = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата);	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
    ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = Документы.пдс_РешениеОВыплатеВыкупнойСуммы.ПолучитьМакет("хмПДС_Приложение3");
	ОбластьМакета = Макет.ПолучитьОбласть("Отчет");
	ОбластьМакета.Параметры.ДатаРешения = Объект.Дата;
    //ОбластьМакета.Параметры.Число =  Формат(Объект.Дата, "ДФ=dd");
	//ОбластьМакета.Параметры.Месяц = Формат(Объект.Дата, "ДФ=MMMM");
	//ОбластьМакета.Параметры.Год = Формат(Объект.Дата, "ДФ=yyyy");
	ОбластьМакета.Параметры.НомерРешения = Объект.Номер;
	ОбластьМакета.Параметры.НаименованиеФонда = СведенияОбОрг.ПолноеНаименование;
	ОбластьМакета.Параметры.ФИОУчастника = Объект.Участник.Наименование;
	ОбластьМакета.Параметры.НомерСчета = Объект.РегистрирующийДокумент.НомерСчета;
	ОбластьМакета.Параметры.ДатаЗаявления = Формат(Объект.РегистрирующийДокумент.ДатаРегистрации, "ДФ=dd.MM.yyyy") ;
	ОбластьМакета.Параметры.НомерЗаявления = Объект.РегистрирующийДокумент.Номер;
	
	//Сформировать Основание
	//ОбластьМакета.Параметры.Основание = Объект.ДокументРегистрации;
	
	ОбластьМакета.Параметры.СуммаВыплаты = Формат(Объект.СуммаДокумента, "ЧЦ=10; ЧДЦ=2");
	
	ОбластьМакета.Параметры.СуммаВыплатыПрописью = ЧислоПрописью(Объект.СуммаДокумента,,"Рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2");
	
	//Пока делаем статичными
	ОбластьМакета.Параметры.ДолжностьОтветственного = "Начальник отдела пенсионного учета";
	ОбластьМакета.Параметры.ФИООтветственного = "Знаменщикова Н.Н.";
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

&НаСервере
Функция ПечатьПриложение4() 

	СведенияОбОрг = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата);	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет; 
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
    ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = Документы.пдс_РешениеОВыплатеВыкупнойСуммы.ПолучитьМакет("хмПДС_Приложение4");
	ОбластьМакета = Макет.ПолучитьОбласть("Отчет");
    ОбластьМакета.Параметры.ДатаРешения = Объект.Дата;
	ОбластьМакета.Параметры.НомерРешения = Объект.Номер;
	ОбластьМакета.Параметры.НаименованиеФонда = СведенияОбОрг.ПолноеНаименование;
	
	ИмяУчастника = Объект.Участник.уп_ФизЛицо.Имя;
	ОтчУчастника = Объект.Участник.уп_ФизЛицо.Отчество;	
	ОбластьМакета.Параметры.ФИОУчастника = ИмяУчастника + " " + ОтчУчастника;


	ОбластьМакета.Параметры.НомерДоговора = Объект.РегистрирующийДокумент.НомерСчета.Владелец; 
	ОбластьМакета.Параметры.ДатаДоговора = Формат(Объект.РегистрирующийДокумент.НомерСчета.Владелец.ДатаЗаключенияДоговора, "ДФ=dd.MM.yyyy");
	ОбластьМакета.Параметры.ДатаЗаявления = Формат(Объект.РегистрирующийДокумент.ДатаРегистрации, "ДФ=dd.MM.yyyy");
	ОбластьМакета.Параметры.НомерЗаявления = Объект.РегистрирующийДокумент.Номер;
	ОбластьМакета.Параметры.СуммаВыплаты = Формат(Объект.СуммаДокумента, "ЧЦ=10; ЧДЦ=2");
	
	Получатель = Объект.РегистрирующийДокумент.Получатель;
	Если Получатель.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		ОбластьМакета.Параметры.Картинка2 = "V"; 
	Иначе
		ОбластьМакета.Параметры.Картинка1 = "V";
		ОбластьМакета.Параметры.НаименованиеМедОрг = Получатель.НаименованиеПолное;
	КонецЕсли;
	
	РасчетныйСчет = Объект.РегистрирующийДокумент.РасчетныйСчет;
	ОбластьМакета.Параметры.Банк = РасчетныйСчет.Банк.Наименование;
	ОбластьМакета.Параметры.БИК = РасчетныйСчет.Банк.Код;
	ОбластьМакета.Параметры.РасчСчет = РасчетныйСчет.НомерСчета;
	
	НаСчете = 0; 
	НаВыплату = 0;
	Для Каждого стр Из Объект.Ссылка.Распределение Цикл
		НаСчете = НаСчете + стр.СуммаНаСчете;
		НаВыплату = НаВыплату + стр.СуммаВыкупная;
	КонецЦикла;
	
	ОбластьМакета.Параметры.ОстатокСчета = Формат(НаСчете - НаВыплату, "ЧЦ=10; ЧДЦ=2");

	//Пока делаем статичными
	ОбластьМакета.Параметры.ДолжностьОтветственного = "Начальник отдела пенсионного учета";
	ОбластьМакета.Параметры.ФИООтветственного = "Знаменщикова Н.Н.";
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

&НаСервере
Функция хмПДС_ОпределитьФормы()
	// ++ Ортикон Плыгун 08.06.2025
	РазрешенныеФормы = Новый Структура;
	Если Объект.ТипРешения = Перечисления.пдс_ТипыЗаявленияНаВыкупнуюСумму.ПоОсобымОбстоятельствам Тогда
    	РазрешенныеФормы.Вставить("Приложение3", Истина);
		РазрешенныеФормы.Вставить("Приложение4", Истина); 
	Иначе
		РазрешенныеФормы.Вставить("Приложение3", Ложь);
		РазрешенныеФормы.Вставить("Приложение4", Ложь);
	КонецЕсли;
	Возврат РазрешенныеФормы
	// -- Ортикон
КонецФункции

#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура хмПДС_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ++ Ортикон Плыгун 08.06.2025
	хмПДС_ВывестиКомандыПечати();
	// -- Ортикон
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура хмПДС_ПечатьПриложения3(Команда)
// ++ Ортикон Плыгун 08.06.2025
//	ПараметрыОткрытия = Новый Структура();
//	ПараметрыОткрытия.Вставить("Организация", Объект.Владелец);
//	ПараметрыОткрытия.Вставить("НомерСчета", Объект.Ссылка);
//	ПараметрыОткрытия.Вставить("ФормироватьФайлыДляПечати", Ложь);
//	ПараметрыОткрытия.Вставить("Дата1", Объект.Дата);
	//ОткрытьФорму("Отчет.хмПДС_.Форма.ФормаОтчета", ПараметрыОткрытия, ЭтотОбъект);
	РазрешенныеФормы = хмПДС_ОпределитьФормы();
	Если РазрешенныеФормы.Приложение3 Тогда		
		ТабДок = ПечатьПриложение3();
		ТабДок.Показать("Решение о выплате");
	Иначе
		Сообщить("Для решения выбрана не верная форма")
	КонецЕсли;	
// -- Ортикон
КонецПроцедуры

&НаКлиенте
Процедура хмПДС_ПечатьПриложения4(Команда)
// ++ Ортикон Плыгун 08.06.2025
//	ПараметрыОткрытия = Новый Структура();
//	ПараметрыОткрытия.Вставить("Организация", Объект.Владелец);
//	ПараметрыОткрытия.Вставить("НомерСчета", Объект.Ссылка);
//	ПараметрыОткрытия.Вставить("ФормироватьФайлыДляПечати", Ложь);
//	ПараметрыОткрытия.Вставить("Дата1", Объект.Дата);
	//ОткрытьФорму("Отчет.хмПДС_.Форма.ФормаОтчета", ПараметрыОткрытия, ЭтотОбъект);
	РазрешенныеФормы = хмПДС_ОпределитьФормы();
	Если РазрешенныеФормы.Приложение4 Тогда	
		ТабДок = ПечатьПриложение4();
		ТабДок.Показать("Уведомление о выплате");
	Иначе
		Сообщить("Для решения выбрана не верная форма")
	КонецЕсли;
// -- Ортикон
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вывести команду печать Решение об отказе. Ортикон Плыгун 08.06.2025
//
&НаСервере
Процедура хмПДС_ВывестиКомандыПечати()
		//Печать для решения ОЖС 
	    //Приложение 3
		КомандаПриложение3 = Команды.Добавить("хмПДС_ПечатьПриложения3");
		КомандаПриложение3.Заголовок = НСтр("ru = 'Решение о выплате-ОЖС (Приложение 3)'");
		КомандаПриложение3.Подсказка = НСтр("ru = 'Решение о выплате-ОЖС (Приложение 3)'");
		КомандаПриложение3.Действие = "хмПДС_ПечатьПриложения3";

		ЭлементПриложение3 = Элементы.Вставить("хмПДС_ПечатьПриложения3",
			Тип("КнопкаФормы"), Элементы.ФормаГруппаПечать);
		ЭлементПриложение3.ИмяКоманды = КомандаПриложение3.Имя;      
	    //Приложение 4
		КомандаПриложение4 = Команды.Добавить("хмПДС_ПечатьПриложения4");
		КомандаПриложение4.Заголовок = НСтр("ru = 'Уведомление о выплате-ОЖС (Приложение 4)'");
		КомандаПриложение4.Подсказка = НСтр("ru = 'Уведомление о выплате-ОЖС (Приложение 4)'");
		КомандаПриложение4.Действие = "хмПДС_ПечатьПриложения4";

		ЭлементПриложение4 = Элементы.Вставить("хмПДС_ПечатьПриложения4",
			Тип("КнопкаФормы"), Элементы.ФормаГруппаПечать);
		ЭлементПриложение4.ИмяКоманды = КомандаПриложение4.Имя; 

КонецПроцедуры
#КонецОбласти