&НаСервере
Функция СформироватьДеревоНаСервере(ПараметрыДанных = Неопределено, ПараметрыОтбора = Неопределено, ПользовательскиеПоля = Неопределено)

	ОбработкаОтчет = РеквизитФормыВЗначение("Отчет");  // мы получаем именно объект
	СхемаКомпоновкиДанных = ОбработкаОтчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); // где "макет" - название вашего макета
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
	НастройкиОтчета = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	Если Не ПараметрыДанных = Неопределено Тогда
		Для каждого Параметр Из НастройкиОтчета.ПараметрыДанных.Элементы Цикл
			Если Параметр.Использование = Истина Тогда
				ПараметрыДанных.Вставить(""+Параметр.Параметр,Параметр.Значение);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Не ПараметрыОтбора = Неопределено Тогда
		Для каждого Параметр Из НастройкиОтчета.Отбор.Элементы Цикл
			Если ТипЗнч(Параметр) = Тип("ЭлементОтбораКомпоновкиДанных") И Параметр.Использование = Истина Тогда
				ПараметрыОтбора.Вставить(""+Параметр.ЛевоеЗначение,Параметр.ПравоеЗначение);	
			КонецЕсли;     
		КонецЦикла;
	КонецЕсли;
	Если Не ПользовательскиеПоля = Неопределено Тогда
		Для каждого Параметр Из НастройкиОтчета.ПользовательскиеПоля.Элементы Цикл
			ПользовательскиеПоля.Вставить(Параметр.Заголовок,Параметр.ПутьКДанным);
		КонецЦикла;
	КонецЕсли;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,НастройкиОтчета
		,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ПроцессорКомпоновкиДанных= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	Дерево  = Новый ДеревоЗначений;
	ПроцессорВывода = Новый    ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Дерево);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	Возврат Дерево;   

КонецФункции

&НаКлиенте
Процедура УстановитьСостояниеПСнаВчерашнийДень(Команда)
	ВыполнитьЗагрузкуСКД(Команда.Имя);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Обработка завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки
КонецПроцедуры

&НаСервере
Функция ПолучитьПользовательскиеНастройкиОтчета(ПараметрыДанных = Неопределено, ПараметрыОтбора = Неопределено, ПользовательскиеПоля = Неопределено)

	НастройкиОтчета = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	Если Не ПараметрыДанных = Неопределено Тогда
		Для каждого Параметр Из НастройкиОтчета.ПараметрыДанных.Элементы Цикл
			Если Параметр.Использование = Истина Тогда
				ПараметрыДанных.Вставить(""+Параметр.Параметр,Параметр.Значение);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Не ПараметрыОтбора = Неопределено Тогда
		Для каждого Параметр Из НастройкиОтчета.Отбор.Элементы Цикл
			Если ТипЗнч(Параметр) = Тип("ЭлементОтбораКомпоновкиДанных") И Параметр.Использование = Истина Тогда
				ПараметрыОтбора.Вставить(""+Параметр.ЛевоеЗначение,Параметр.ПравоеЗначение);	
			КонецЕсли;     
		КонецЦикла;
	КонецЕсли;
	Если Не ПользовательскиеПоля = Неопределено Тогда
		Для каждого Параметр Из НастройкиОтчета.ПользовательскиеПоля.Элементы Цикл
			ПользовательскиеПоля.Вставить(Параметр.Заголовок,Параметр.ПутьКДанным);
		КонецЦикла;
	КонецЕсли;
	
	Возврат НастройкиОтчета;

КонецФункции

&НаСервере
Процедура ВыполнитьЗагрузкуСКД(ИмяКоманды)    
	
	СтрокаПравилСервер = Новый Структура();
	СтрокаПравилСервер.Вставить("ДополнитьДвижения",ДополнитьДвижения);
	СтрокаПравилСервер.Вставить("ОчиститьДвижения",ОчиститьДвижения);
	
	
	Если Не ДобавитьВЕЖ И Не ОбновитьВЕЖ И Не СоздатьМЗ Тогда
		Если Не ОчиститьДвижения Тогда	
			ДеревоНаСервере = СформироватьДеревоНаСервере();
		Иначе
			ДеревоНаСервере = Неопределено;
		КонецЕсли;
		ОтчетОбъект = РеквизитФормыВЗначение("Отчет"); 
		Выполнить("ОтчетОбъект."+ ИмяКоманды +"(ДеревоНаСервере,Отчет.выбОперацияНПО,СтрокаПравилСервер)");
	Иначе
		хм_МеханизмыСверкиСервер.СКД_ВыполнитьПоМеханизмуЗагрузкиV4(ЭтаФорма,Отчет,ИмяКоманды,"Отчеты.ХМ_СверкаНеФинансовыхПоказателей.Создать()." + ИмяКоманды);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРазмерПенсии(Команда)
	ВыполнитьЗагрузкуСКД(Команда.Имя);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Обработка завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодичность(Команда)
	ВыполнитьЗагрузкуСКД(Команда.Имя);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Обработка завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСхемуВыплат(Команда)
	ВыполнитьЗагрузкуСКД(Команда.Имя);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Обработка завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция ОпределитьДатуСледующейВыплаты(Дата, Периодичность, НомерМесяцаВПериоде)
	Если Периодичность = Перечисления.уп_ПериодичностьВыплат.Ежемесячно Тогда
		Возврат Дата;
	Иначе
		текНомерМесяцаВПериоде = уп_НПОСервер.ОпределитьНомерМесяцаВПериоде(Периодичность, Дата);
		Если НомерМесяцаВПериоде = текНомерМесяцаВПериоде Тогда
			Возврат Дата;			
		Иначе
			Если НомерМесяцаВПериоде > текНомерМесяцаВПериоде Тогда
            	ДатаНачалаПериода = уп_НПФ.ОпределитьДатуНачалаПериода(Дата,Периодичность);
			Иначе
	            ДатаНачалаПериода = уп_НПФ.ОпределитьДатуКонцаПериода(Дата,Периодичность)+1;
			КонецЕсли;
			
			Возврат ДобавитьМесяц(ДатаНачалаПериода,НомерМесяцаВПериоде);	
		КонецЕсли;
	КонецЕсли;
КонецФункции	

&НаСервере
Функция ОпределитьДатуПрошлойВыплаты(Дата, Периодичность, НомерМесяцаВПериоде)
	Если Периодичность = Перечисления.уп_ПериодичностьВыплат.Ежемесячно Тогда
		Возврат НачалоМесяца(Дата);
	Иначе
		текНомерМесяцаВПериоде = уп_НПОСервер.ОпределитьНомерМесяцаВПериоде(Периодичность, Дата);
		Если НомерМесяцаВПериоде = текНомерМесяцаВПериоде Тогда
			Возврат НачалоМесяца(Дата);			
		Иначе
           	ДатаНачалаПериода = уп_НПФ.ОпределитьДатуНачалаПериода(Дата,Периодичность);
			Если НомерМесяцаВПериоде > текНомерМесяцаВПериоде Тогда
	            ДатаНачалаПериода = уп_НПФ.ОпределитьДатуНачалаПериода(ДатаНачалаПериода - 1,Периодичность);
			КонецЕсли;
			
			Возврат ДобавитьМесяц(ДатаНачалаПериода,НомерМесяцаВПериоде);	
		КонецЕсли;
	КонецЕсли;
КонецФункции	

&НаКлиенте
Процедура УстановитьСрочныеВыплаты(Команда)
	ВыполнитьЗагрузкуСКД(Команда.Имя);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Обработка завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПервуюВыплату(Команда)
	ВыполнитьЗагрузкуСКД(Команда.Имя);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Обработка завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуПеререгистрации(Команда)
	ВыполнитьЗагрузкуСКД(Команда.Имя);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Обработка завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЛицевыеСчета(Команда)
	ВыполнитьЗагрузкуСКД(Команда.Имя);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Обработка завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Функция ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(ПолеТабличногоДокумента, average = 0, count = 0) Экспорт

Сумма = 0;
count = 0;
Для Каждого Область Из ПолеТабличногоДокумента.ВыделенныеОбласти Цикл
   Если ТипЗнч(Область) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
     Для ИндексСтрока = Область.Верх По Область.Низ Цикл
        Для ИндексКолонка = Область.Лево По Область.Право Цикл
          Попытка
               vNumber = Число(СтрЗаменить(ПолеТабличногоДокумента.Область("R" + Формат(ИндексСтрока, "ЧГ=0") + "C" + Формат(ИндексКолонка, "ЧГ=0")) .Текст, " ", ""));
				Сумма = Сумма + vNumber;
				count = count + 1;
          Исключение
          КонецПопытки;
        КонецЦикла;
     КонецЦикла;
  КонецЕсли;
КонецЦикла;

Если count <> 0 Тогда
   average = Сумма / count;
Иначе
average = 0;
КонецЕсли;
Возврат Сумма;
КонецФункции

&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	Сумма = ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(Результат, Среднее, Количество);
КонецПроцедуры

&НаСервере
Процедура СообщитьКоличествоНаСервере()

	ДеревоНаСервере = СформироватьДеревоНаСервере();
	
	КоличествоСтрок = 0;
	
	Для каждого СтрокаСостояний Из ДеревоНаСервере.Строки Цикл
		Если СтрокаСостояний.Строки.Количество() > 0 Тогда
			Для каждого Строка Из СтрокаСостояний.Строки Цикл
				КоличествоСтрок = КоличествоСтрок + 1;
			КонецЦикла;
		Иначе
			КоличествоСтрок = КоличествоСтрок + 1;
		КонецЕсли;
	КонецЦикла;

	Сообщить(КоличествоСтрок);
КонецПроцедуры

&НаКлиенте
Процедура СообщитьКоличество(Команда)
	СообщитьКоличествоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСостоянияКаспер(Команда)
	ПерейтиПоНавигационнойСсылке("e1cib/list/РегистрСведений.K_V_HM_PF_GET_ALL");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСостояния1С(Команда)
	ПерейтиПоНавигационнойСсылке("e1cib/list/РегистрСведений.уп_СостоянияПС");
КонецПроцедуры

&НаСервере
Функция ОбработатьВыделенноеНаСервере(СтрокаКоманда,Верх,Низ,Лево,Право, ДополнительныеПараметры)
	ДанныеВозврата = Новый Массив; 
	ВозвращатьСтроками = Ложь;
	Если ДополнительныеПараметры.Свойство("ВозвращатьСтроками") Тогда
		ВозвращатьСтроками = Истина;
	КонецЕсли;
	
	МассивРассшифровки = Новый Массив();
	ДанныеОтчета = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Для ИндексСтрока = Верх По Низ Цикл
		Если ВозвращатьСтроками = Истина Тогда
			ДанныеВозвратаСтроки = Новый Соответствие();
		КонецЕсли;
		Для ИндексКолонка = Лево По Право Цикл
			Попытка
				Ячейка = Результат.Область("R" + Формат(ИндексСтрока, "ЧГ=0") + "C" + Формат(ИндексКолонка, "ЧГ=0"));
				Если Ячейка.Расшифровка = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ПолеРасшифровки = ДанныеОтчета.Элементы.Получить(Ячейка.Расшифровка).ПолучитьПоля()[0];
				Если Не ПолеРасшифровки = Неопределено 
					И (ДополнительныеПараметры.Свойство("ИмяПоля") = ЛОЖЬ ИЛИ ПолеРасшифровки.Поле = ДополнительныеПараметры.ИмяПоля)
					И (ДополнительныеПараметры.Свойство("ПоляДляУточнения") = ЛОЖЬ ИЛИ ДополнительныеПараметры.ПоляДляУточнения.Свойство(ПолеРасшифровки.Поле) = Истина)Тогда //и ПолеРасшифровки.Поле = "ТекСостояние.Регистратор" Тогда
					ЗначенниеРасшифровки = ПолеРасшифровки.Значение;
					Если ЗначениеЗаполнено(ЗначенниеРасшифровки) Тогда
						Если ВозвращатьСтроками = Ложь Тогда
							ДанныеВозврата.Добавить(ЗначенниеРасшифровки);	
						КонецЕсли;
						Если СтрокаКоманда = "ПровестиВыделенные" Тогда
							ЗначенниеРасшифровки.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
						КонецЕсли;
					КонецЕсли;
					Если ВозвращатьСтроками = Истина Тогда
						ДанныеВозвратаСтроки.Вставить(ПолеРасшифровки.Поле,ПолеРасшифровки.Значение);	
					КонецЕсли;
				КонецЕсли; 
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
		Если ВозвращатьСтроками = Истина Тогда
			ДанныеВозврата.Добавить(ДанныеВозвратаСтроки);	
		КонецЕсли;
	КонецЦикла;
	Если СтрокаКоманда = "ПерегрузитьИзКаспер" Тогда
		ХМ_ЗагрузкаТЗ_V02_ВызовСервера.ИнтерактивнаяЗагрузкаДокументов(ДанныеВозврата,Новый Структура("ОбновитьЗагрузку,ПотоковаяЗагрузка,ЗагрузкаСписком"),Новый Структура("Статус","НП"));
		ХМ_ЗагрузкаТЗ_V02_ВызовСервера.ИнтерактивнаяЗагрузкаДокументов(ДанныеВозврата,Новый Структура("ОбновитьЗагрузку,ПотоковаяЗагрузка,ЗагрузкаСписком"),Новый Структура("Статус","НЕ"));
	КонецЕсли;
	Возврат ДанныеВозврата;
КонецФункции

&НаКлиенте
Процедура ОбработатьВыделенное(СтрокаКоманда,ДополнительныеПараметры = Неопределено)
 	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура();
	КонецЕсли;

	МассивРассшифровки = Новый Массив();
    ПоляДляУточнения = Новый Структура();
	Для Каждого Область Из Результат.ВыделенныеОбласти Цикл
		Если ТипЗнч(Область) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Верх = Область.Верх;
			Низ = Область.Низ;
			Лево = Область.Лево;
			Право = Область.Право;
			
			Если СтрокаКоманда = "ОповеститьОВыборе" ИЛИ СтрокаКоманда = "ДобавитьСчетаВИсключение" Тогда
				Лево = 1;
				Право = Результат.ШиринаТаблицы;
			КонецЕсли;
			
			НовыйМассивРассшифровки = ОбработатьВыделенноеНаСервере(СтрокаКоманда,Верх,Низ,Лево,Право,ДополнительныеПараметры);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивРассшифровки,НовыйМассивРассшифровки);
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаКоманда = "ОповеститьОВыборе" Тогда 
		ДополнительныеПараметры.Вставить("МассивСверки",МассивРассшифровки);
		Оповестить(ДополнительныеПараметры.ИмяСобытия, ДополнительныеПараметры, ЭтаФорма);
	КонецЕсли;
	Если СтрокаКоманда = "ДобавитьСчетаВИсключение" Тогда 
		ДобавитьСчетаВИсключение_ОткрытьФорму(МассивРассшифровки, ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСчетаВИсключение_ОткрытьФорму(МассивРассшифровки, ДополнительныеПараметры)
	ПараметрыОткрытияФормы = Новый Структура();
	ПараметрыОткрытияФормы.Вставить("РежимУточнения",МассивРассшифровки);  
	
	ПараметрыОткрытияФормы.Вставить("ДополнительныеПараметры",ДополнительныеПараметры);
	ДополнительныеПараметры.Вставить("МассивРассшифровки",МассивРассшифровки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьСчетаВИсключениеНаКлиенте",ЭтаФорма,ДополнительныеПараметры);

 	ОткрытьФорму("ВнешнийОтчет.ХМ_СверкаНеФинансовыхПоказателей_v3.Форма.ФормаУстановкиКейсов",ПараметрыОткрытияФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСчетаВИсключениеНаКлиенте(ТребуемоеУтонение,МассивРассшифровки) Экспорт
	Если ЗначениеЗаполнено(ТребуемоеУтонение) Тогда 
		ДобавитьСчетаВИсключениеНаСервере(ТребуемоеУтонение,МассивРассшифровки);
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Процедура ДобавитьСчетаВИсключениеНаСервере(ТребуемоеУтонение,ДополнительныеПараметры) Экспорт
	Для каждого СтруктураРасшифровки Из ДополнительныеПараметры.МассивРассшифровки Цикл
      	Попытка
			МенеджерЗаписи = РегистрыСведений.ХМ_Кейсы.СоздатьМенеджерЗаписи();	
			МенеджерЗаписи.НомерСчета = СтруктураРасшифровки.Получить("НомерСчета");
			МенеджерЗаписи.RM_Задача = ТребуемоеУтонение.RM_Задача;

			МенеджерЗаписи.Прочитать();
			Если Не МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.НомерСчета = СтруктураРасшифровки.Получить("НомерСчета");
				МенеджерЗаписи.RM_Задача = ТребуемоеУтонение.RM_Задача;
			КонецЕсли;	

			МенеджерЗаписи.Описание = ТребуемоеУтонение.Описание;
			МенеджерЗаписи.Документ = ТребуемоеУтонение.Документ;
			// записываем менеджер записи
			МенеджерЗаписи.Записать();			
		Исключение
			Сообщить("Что то пошло не так");
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры  

&НаКлиенте
Процедура ПровестиВыделенные(Команда)
	ОбработатьВыделенное("ПровестиВыделенные")
КонецПроцедуры

&НаКлиенте
Процедура ПерегрузитьИзКаспер(Команда)
	ОбработатьВыделенное("ПерегрузитьИзКаспер")
КонецПроцедуры

&НаКлиенте
Процедура ПередатьСчетаНаСверку(Команда)
	ОбработатьВыделенное("ОповеститьОВыборе", Новый Структура("ИмяСобытия, ИмяПоля","ПередатьНаСверку","НомерСчета"));
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПередатьНаСверку" Тогда //И Не Источник.ИмяФормы = ЭтаФорма.ИмяФормы Тогда
		Если Источник.УникальныйИдентификатор = ЭтаФорма.УникальныйИдентификатор Тогда
			Возврат;	
		КонецЕсли;
		Если ЭтаФорма.ГлавнаяФорма Тогда
			Возврат;
		КонецЕсли;
		
		Если Параметр.ИмяПоля = "НомерСчета" Тогда
			сз = Новый СписокЗначений;  
			сз.ЗагрузитьЗначения(Параметр.МассивСверки);  
			ДобавитьПользовательскийОтбор(
				Новый ПолеКомпоновкиДанных("НомерСчета"),
				сз,
				ВидСравненияКомпоновкиДанных.ВСписке,
				Истина,
				Новый Структура("ВПользовательскиеНастройки, ЗаменятьСуществующий", Истина, Истина));
		КонецЕсли;     
		ЭтаФорма.Активизировать();
//		ЭтаФорма.СкомпоноватьРезультат(РежимКомпоновкиРезультата.Фоновый);	
	КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры         

&НаКлиенте
Процедура ДобавитьПользовательскийОтбор(ПолеКомпоновки, ЗначениеОтбора, ВидСравнения, Использование, ДополнительныеПараметры)     
	ОтборНастройки = Отчет.КомпоновщикНастроек.Настройки.Отбор;
	ЭлементыПользовательскиеНастройки = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;

	ЭлементОтбора = ПолучитьЭлементОтбора(ПолеКомпоновки, ОтборНастройки);
	
	Если ЭлементОтбора = Неопределено Тогда
	   ЭлементОтбора = ОтборНастройки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	   ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки;
	   ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	   
	   //Создаем идентификатор пользовательской настройки, чтобы отбор добавился в пользовательские настройки
	   ЭлементОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
	   СоздатьЭлементыФормыПользовательскихНастроекНаСервере();
	КонецЕсли;
		
	//Находим отбор в пользовательских настройках по идентификатору
	ОтборПоСкладуПользовательскиеНастройки = ЭлементыПользовательскиеНастройки.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
	ОтборПоСкладуПользовательскиеНастройки.Использование = Использование;
	ОтборПоСкладуПользовательскиеНастройки.ВидСравнения = ВидСравнения;
	ОтборПоСкладуПользовательскиеНастройки.ПравоеЗначение = ЗначениеОтбора;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЭлементОтбора(ПолеКомпоновки, ГруппаОтбора)
	Для каждого ТекЭлементОтбора Из ГруппаОтбора.Элементы Цикл
	   Если ТипЗнч(ТекЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
	             и ТекЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
	      Возврат ТекЭлементОтбора;
	   ИначеЕсли НЕ ТипЗнч(ТекЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")	Тогда   
		  	ЭлементОтбора  = ПолучитьЭлементОтбора(ПолеКомпоновки, ТекЭлементОтбора);
		  	Если Не ЭлементОтбора = Неопределено Тогда
				Возврат ЭлементОтбора;	
			КонецЕсли;
	   КонецЕсли;	
   КонецЦикла;
   Возврат Неопределено;
КонецФункции

&НаСервере
Процедура СоздатьЭлементыФормыПользовательскихНастроекНаСервере()
	   СоздатьЭлементыФормыПользовательскихНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСчетаВИсключение(Команда)
	ОбработатьВыделенное("ДобавитьСчетаВИсключение", Новый Структура("ВозвращатьСтроками"));
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеПСнаВчерашнийДеньПользНастройкиНаСервере()
	ПараметрыДанных = Новый Соответствие();
    ПараметрыОтбора = Новый Соответствие();

	ПолучитьПользовательскиеНастройкиОтчета(ПараметрыДанных = Неопределено, ПараметрыОтбора = Неопределено);
	
	Настройка_ПараметрыДанных = Новый Структура("ДатаНачала, ДатаНачисления",ПараметрыДанных.ДатаНачала,ПараметрыДанных.ДатаНачисления);
	
	
	ПараметрыЗаполнения = ЭтаФорма;
	ОбработкаОтчет = РеквизитФормыВЗначение("Отчет");  // мы получаем именно объект
    ОбработкаОтчет.УстановитьСрез("УстановитьСостояниеПСнаВчерашнийДень",Отчет.выбОперацияНПО, ПараметрыЗаполнения, Настройка_ПараметрыДанных);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеПСнаВчерашнийДеньПользНастройки(Команда)
	УстановитьСостояниеПСнаВчерашнийДеньПользНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьПользователскиеНастройкиНаСервере()
	
	//ВТОРИЧНО - попробовать ОБОЙТИСЬ ДАТАМИ.
	//Сохраняем_ХМ_ЗагрузкаКасперV4	// Вставить содержимое обработчика.     
	//ИмяРегистр = ИмяВариант + ИмяКоманды(УстановитьСостояниеПСнаВчерашнийДень)  
	//Запрос = ЗначениеВСтрокуВнутр();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПользователскиеНастройки(Команда)
	СохранитьПользователскиеНастройкиНаСервере();
КонецПроцедуры

