Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 18.01.2016 ЛыткинАМ // ЗаполнитьДокументПоРеестру()
	// ХМНПФ 18.02.2016 ШадринАВ // ЗаполнитьДокументПоРеестру() // №220
	// ХМНПФ 18.02.2016 ШадринАВ // Новая ХМ_ЗаполнитьНазначениеПлатежаДляОдного() // №220
	// +ХМНПФ 09.04.2020 ШадринАВ // у реквизита СуммаДокумента убран флаг "Неотрицательное" // №2773
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьДокументПоРеестру")
Процедура РасшОбщ_ЗаполнитьДокументПоРеестру(Основание)
	Организация = Основание.Организация;
	ВалютаДокумента    = Константы.ВалютаРегламентированногоУчета.Получить();   
	
	//Если Основание.Модуль = Перечисления.уп_ВидыДеятельности.ПДС Тогда
		ПроверкаНаДубль = ПроверитьДокНаДубль(Основание);
		Если не ПроверкаНаДубль = Неопределено Тогда
			ВызватьИсключение ("На основании этого документа уже есть созданное "+ ПроверкаНаДубль);
		КонецЕсли;
	//КонецЕсли;

	СчетОрганизации = Основание.РасчетныйСчетОрганизации;
	Если НЕ ЗначениеЗаполнено(СчетОрганизации) Тогда

		Если Организация.ОсновнойБанковскийСчет.ВалютаДенежныхСредств=ВалютаДокумента Тогда
			СчетОрганизации = Организация.ОсновнойБанковскийСчет;
		КонецЕсли;
	КонецЕсли;
		
	Контрагент = Основание.Получатель;
	Дата = Основание.Дата;
	
	НеСклонять = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация)).НеСклонятьФИОВДокументах;
	
	Если ЗначениеЗаполнено(Основание.РасчетныйСчет) Тогда
		СчетКонтрагента = Основание.РасчетныйСчет;
	Иначе
		СчетКонтрагента = Контрагент.ОсновнойБанковскийСчет;
	КонецЕсли;
	СуммаДокумента = Основание.СуммаДокумента;
	ДокументОснование = Основание;
	
	//еще вид платежа, очередность, валюта документа, назначение, текст плательщика, текст получателя, ИННы, КПП, Статья движения ден средств.
	ИННПлательщика = Организация.ИНН;
	КПППлательщика = ?(СчетОрганизации.ВсегдаУказыватьКПП, Организация.КПП, "");
	//#Если Клиент Тогда
	ТекстПлательщика = ФормированиеПечатныхФорм.СформироватьТекстНаименованияПлательщикаПолучателя("",Организация,СчетОрганизации);
	//#КонецЕсли
	ИННПолучателя = Контрагент.ИНН;
	Если НЕ ЗначениеЗаполнено(ИННПолучателя) Тогда
		Если Контрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда 
			ИННПолучателя = "000000000000"; 
		Иначе
			ИННПолучателя = "0000000000"; 
		КонецЕсли;	
	КонецЕсли;	
	Если НЕ СчетКонтрагента.Пустая() Тогда
		Если СчетКонтрагента.ВсегдаУказыватьКПП Тогда
			КПППолучателя = Контрагент.КПП;
		КонецЕсли;
		//#Если Клиент Тогда
		ТекстПолучателя = ФормированиеПечатныхФорм.СформироватьТекстНаименованияПлательщикаПолучателя("",Контрагент,СчетКонтрагента);
		//#КонецЕсли
	КонецЕсли;
	
	#Вставка
	// +ХМНПФ 18.01.2016 ЛыткинАМ // ЗаполнитьДокументПоРеестру()
	//	#Если Сервер Тогда
		// При отсутствии данных заполнения реквизиты заполняются по данным основной регистрации в налоговом органе
		АвтоЗначенияРеквизитов = УчетДенежныхСредствБП.СформироватьАвтоЗначенияРеквизитовПлательщикаПолучателя(
			Организация, СчетОрганизации, Контрагент, СчетКонтрагента, ПеречислениеВБюджет, Дата);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, АвтоЗначенияРеквизитов);
	//	#КонецЕсли
	// -ХМНПФ 18.01.2016 ЛыткинАМ // ЗаполнитьДокументПоРеестру()
	#КонецВставки
	
	ВидПлатежа = "электронно";
	ОчередностьПлатежа = 5;
	КодВидаДохода = "1";
	ТекстНазначение = "";
	
	#Удаление
	Если Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий 
	#КонецУдаления
	#Вставка
	//https://redmine.npf.com/issues/4368
	Если ДополнительныеСвойства.Свойство("НеПерезаполнятьНазначениеПлатежа") Тогда
	ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий 
	#КонецВставки
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияНПО
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратПенсииНПО Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ВыплатыПенсийНПО;
		Если Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий и Основание.ПоИсполнительномуЛисту Тогда
			ТекстНазначение = Основание.ИсполнительныйЛист.НазначениеПлатежа;
		Иначе
			ТабУч = Основание.СписокПенсионеров.Выгрузить();
			Если ТабУч.Количество()>0 Тогда
				Строка1 = Основание.СписокПенсионеров.Получить(0);
				ТабУч.Сортировать("НачалоПериодаНачисления Возр");
				ДатаНачПериода = ТабУч.Получить(0).НачалоПериодаНачисления;
				ТабУч.Сортировать("КонецПериодаНачисления Убыв");
				ДатаКонПериода = ТабУч.Получить(0).КонецПериодаНачисления;
				ТабУч.Свернуть("Участник");
				Если ТабУч.Количество() = 1 Тогда
					//ТекстНазначение = "Выплата негосударственной пенсии "+уп_ОбщегоНазначенияУчетРезервов.СклонятьФИО(СокрЛП(Строка1.Участник.НаименованиеПолное),Лев(Строка(Строка1.Участник.уп_ФизЛицо.Пол),1),"Д", НеСклонять)+", лицевой счет N "+Строка1.НомерЛицевогоСчета+" за  "+ПредставлениеПериода(НачалоДня(Строка1.НачалоПериодаНачисления),КонецДня(Строка1.КонецПериодаНачисления), "ФП = Истина");
					РезультатСклонения = "";
					Если НеСклонять Тогда
						РезультатСклонения =  СокрЛП(Строка1.Участник.НаименованиеПолное);
					Иначе
						ФизическиеЛицаЗарплатаКадры.Просклонять(СокрЛП(Строка1.Участник.НаименованиеПолное),3,РезультатСклонения,Строка1.Участник.уп_ФизЛицо.Пол);
					КонецЕсли;	
					ТекстНазначение = "Выплата негосударственной пенсии "+РезультатСклонения+", лицевой счет N "+Строка1.НомерЛицевогоСчета+" за  "+ПредставлениеПериода(НачалоДня(ДатаНачПериода),КонецДня(ДатаКонПериода), "ФП = Истина");
				Иначе
					ТекстНазначение = "Выплата негосударственной пенсии "+?(НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговорКонтрагента),""," по договору N "+СокрЛП(Контрагент.ОсновнойДоговорКонтрагента.Наименование))+" за  "+ПредставлениеПериода(НачалоДня(ДатаНачПериода),КонецДня(ДатаКонПериода), "ФП = Истина")+" Участникам Фонда согласно ведомости.";
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам 
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиНПО
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатНаследникамНПО Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ВыкупныеСуммыПравопреемникамНПО;
		ТабУч = Основание.СписокПенсионеров.Выгрузить();
		ТабУч.Свернуть("Участник");
		Если ТабУч.Количество()>0 Тогда
			Строка1 = Основание.СписокПенсионеров.Получить(0);
			Если ТабУч.Количество() = 1 Тогда
				//ТекстНазначение = "Выплата выкупной суммы наследнику "+уп_ОбщегоНазначенияУчетРезервов.СклонятьФИО(СокрЛП(Строка1.Участник.НаименованиеПолное),Лев(Строка(Строка1.Участник.уп_ФизЛицо.Пол),1),"Д", НеСклонять)+", лицевой счет N "+Строка1.НомерЛицевогоСчета;
				РезультатСклонения = "";
				Если НеСклонять Тогда
					РезультатСклонения =  СокрЛП(Строка1.Участник.НаименованиеПолное);
				Иначе
					ФизическиеЛицаЗарплатаКадры.Просклонять(СокрЛП(Строка1.Участник.НаименованиеПолное),3,РезультатСклонения,Строка1.Участник.уп_ФизЛицо.Пол);
				КонецЕсли;
				ТекстНазначение = "Выплата выкупной суммы наследнику "+РезультатСклонения+", лицевой счет N "+Строка1.НомерЛицевогоСчета;
			Иначе
				ТекстНазначение = "Выплата выкупной суммы наследникам "+?(НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговорКонтрагента),""," по договору N "+СокрЛП(Контрагент.ОсновнойДоговорКонтрагента.Наименование))+" согласно ведомости.";
			КонецЕсли;
		КонецЕсли;	
	ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежРасторжениеНПО
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатРасторженцамНПО Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ВыкупныеСуммыРасторженцамНПО;
		ТабУч = Основание.СписокПенсионеров.Выгрузить();
		ТабУч.Свернуть("Участник");
		Если ТабУч.Количество()>0 Тогда
			Строка1 = Основание.СписокПенсионеров.Получить(0);
			Если ТабУч.Количество() = 1 Тогда
				//ТекстНазначение = "Выплата выкупной суммы "+уп_ОбщегоНазначенияУчетРезервов.СклонятьФИО(СокрЛП(Строка1.Участник.НаименованиеПолное),Лев(Строка(Строка1.Участник.уп_ФизЛицо.Пол),1),"Д", НеСклонять)+", лицевой счет N "+Строка1.НомерЛицевогоСчета;
				РезультатСклонения = "";
				Если НеСклонять Тогда
					РезультатСклонения =  СокрЛП(Строка1.Участник.НаименованиеПолное);
				Иначе
					ФизическиеЛицаЗарплатаКадры.Просклонять(СокрЛП(Строка1.Участник.НаименованиеПолное),3,РезультатСклонения,Строка1.Участник.уп_ФизЛицо.Пол);
				КонецЕсли;
				ТекстНазначение = "Выплата выкупной суммы "+РезультатСклонения+", лицевой счет N "+Строка1.НомерЛицевогоСчета;
			Иначе
				ТекстНазначение = "Выплата выкупной суммы "+?(НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговорКонтрагента),""," по договору N "+СокрЛП(Контрагент.ОсновнойДоговорКонтрагента.Наименование))+" согласно ведомости.";
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_НПО Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ВыкупныеСуммыРасторженцамНПО;
		ТекстНазначение = "Перевод в НПФ средств НПО согласно ведомости";
	ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиОПС
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатПравопреемникамОПС Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ВыкупныеСуммыПравопреемникамОПС;
		Если Основание.ДоговорыОПС.Количество()>0 Тогда
			Строка1 = Основание.ДоговорыОПС.Получить(0);
			Если Основание.ДоговорыОПС.Количество()>1 Тогда
				ТекстНазначение = "Выплата СПН правопреемникам умерших ЗЛ "+?(НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговорКонтрагента),""," по договору N "+СокрЛП(Контрагент.ОсновнойДоговорКонтрагента.Наименование))+" согласно ведомости.";
			Иначе
				//ТекстНазначение = "Выплата СПН правопреемникам умерших ЗЛ ("+Строка1.ДоговорОПС.Участник.НаименованиеПолное+", "+Строка1.ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР+") л/с "+Строка1.Участник.ОсновнойБанковскийСчет.НомерСчета+" "+уп_ОбщегоНазначенияУчетРезервов.СклонятьФИО(СокрЛП(Строка1.Участник.НаименованиеПолное),Лев(Строка(Строка1.Участник.уп_ФизЛицо.Пол),1),"Д", НеСклонять);
				РезультатСклонения = "";
				Если НеСклонять Тогда
					РезультатСклонения =  СокрЛП(Строка1.Участник.НаименованиеПолное);
				Иначе
					ФизическиеЛицаЗарплатаКадры.Просклонять(СокрЛП(Строка1.Участник.НаименованиеПолное),3,РезультатСклонения,Строка1.Участник.уп_ФизЛицо.Пол);
				КонецЕсли;
				ТекстНазначение = "Выплата СПН правопреемникам умерших ЗЛ ("+Строка1.ДоговорОПС.Участник.НаименованиеПолное+", "+Строка1.ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР+") л/с "+Строка1.Участник.ОсновнойБанковскийСчет.НомерСчета+" "+РезультатСклонения;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежЕВОПС
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратЕдиновременнойВыплатыОПС Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ЕдиновременныеВыплаты;
		Если Основание.ДоговорыОПС.Количество()>0 Тогда
			Строка1 = Основание.ДоговорыОПС.Получить(0);
			Если Основание.ДоговорыОПС.Количество()>1 Тогда
				ТекстНазначение = "Единовременная выплата средств ОПС "+?(НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговорКонтрагента),""," по договору N "+СокрЛП(Контрагент.ОсновнойДоговорКонтрагента.Наименование))+" согласно ведомости.";
			Иначе
				//ТекстНазначение = "Единовременная выплата средств ОПС на лицевой счет N "+Строка1.Участник.ОсновнойБанковскийСчет.НомерСчета+" "+уп_ОбщегоНазначенияУчетРезервов.СклонятьФИО(СокрЛП(Строка1.Участник.НаименованиеПолное),Лев(Строка(Строка1.Участник.уп_ФизЛицо.Пол),1),"Р", НеСклонять);
				РезультатСклонения = "";
				Если НеСклонять Тогда
					РезультатСклонения =  СокрЛП(Строка1.Участник.НаименованиеПолное);
				Иначе
					ФизическиеЛицаЗарплатаКадры.Просклонять(СокрЛП(Строка1.Участник.НаименованиеПолное),2,РезультатСклонения,Строка1.Участник.уп_ФизЛицо.Пол);
				КонецЕсли;
				ТекстНазначение = "Единовременная выплата средств ОПС на лицевой счет N "+Строка1.Участник.ОсновнойБанковскийСчет.НомерСчета+" "+РезультатСклонения;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС 
		ИЛИ Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежНПОПС
		ИЛИ Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратНакопительнойПенсииОПС Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_РасчетыПоНакопительнойЧастиТрудовойПенсии;
		ТабУч = Основание.ДоговорыОПС.Выгрузить();
		Если ТабУч.Количество()>0 Тогда
			Строка1 = Основание.ДоговорыОПС.Получить(0);
			ТабУч.Сортировать("НачалоПериодаНачисления Возр");
			ДатаНачПериода = ТабУч.Получить(0).НачалоПериодаНачисления;
			ДатаКонПериода = ТабУч.Получить(ТабУч.Количество()-1).НачалоПериодаНачисления;
			ТабУч.Свернуть("Участник");
			Если ТабУч.Количество() = 1 Тогда
				//ТекстНазначение = "Выплата накопительной пенсии "+уп_ОбщегоНазначенияУчетРезервов.СклонятьФИО(СокрЛП(Строка1.Участник.НаименованиеПолное),Лев(Строка(Строка1.Участник.уп_ФизЛицо.Пол),1),"Д", НеСклонять)+", лицевой счет N "+Строка1.НомерЛицевогоСчета+" за  "+ПредставлениеПериода(НачалоДня(Строка1.НачалоПериодаНачисления),КонецМесяца(Строка1.НачалоПериодаНачисления), "ФП = Истина");
				РезультатСклонения = "";
				Если НеСклонять Тогда
					РезультатСклонения =  СокрЛП(Строка1.Участник.НаименованиеПолное);
				Иначе
					ФизическиеЛицаЗарплатаКадры.Просклонять(СокрЛП(Строка1.Участник.НаименованиеПолное),3,РезультатСклонения,Строка1.Участник.уп_ФизЛицо.Пол);
				КонецЕсли;
				ТекстНазначение = "Выплата накопительной пенсии "+РезультатСклонения+", лицевой счет N "+Строка1.НомерЛицевогоСчета+" за  "+ПредставлениеПериода(НачалоДня(ДатаНачПериода),КонецМесяца(ДатаКонПериода), "ФП = Истина");
			Иначе
				ТекстНазначение = "Выплата накопительной пенсии "+?(НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговорКонтрагента),""," по договору N "+СокрЛП(Контрагент.ОсновнойДоговорКонтрагента.Наименование))+" за  "+ПредставлениеПериода(НачалоДня(ДатаНачПериода),КонецМесяца(ДатаКонПериода), "ФП = Истина")+" застрахованным лицам согласно ведомости.";
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.СрочнаяПенсияОПС
		ИЛИ Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежСВОПС
		ИЛИ Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратСрочнойПенсииОПС Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_РасчетыПоСрочнойВыплатеОПС;
		ТабУч = Основание.ДоговорыОПС.Выгрузить();
		Если ТабУч.Количество()>0 Тогда
			Строка1 = Основание.ДоговорыОПС.Получить(0);
			ТабУч.Сортировать("НачалоПериодаНачисления Возр");
			ДатаНачПериода = ТабУч.Получить(0).НачалоПериодаНачисления;
			ДатаКонПериода = ТабУч.Получить(ТабУч.Количество()-1).НачалоПериодаНачисления;
			ТабУч.Свернуть("Участник");
			Если ТабУч.Количество() = 1 Тогда
				//ТекстНазначение = "Выплата накопительной пенсии "+уп_ОбщегоНазначенияУчетРезервов.СклонятьФИО(СокрЛП(Строка1.Участник.НаименованиеПолное),Лев(Строка(Строка1.Участник.уп_ФизЛицо.Пол),1),"Д", НеСклонять)+", лицевой счет N "+Строка1.НомерЛицевогоСчета+" за  "+ПредставлениеПериода(НачалоДня(Строка1.НачалоПериодаНачисления),КонецМесяца(Строка1.НачалоПериодаНачисления), "ФП = Истина");
				РезультатСклонения = "";
				Если НеСклонять Тогда
					РезультатСклонения =  СокрЛП(Строка1.Участник.НаименованиеПолное);
				Иначе
					ФизическиеЛицаЗарплатаКадры.Просклонять(СокрЛП(Строка1.Участник.НаименованиеПолное),3,РезультатСклонения,Строка1.Участник.уп_ФизЛицо.Пол);
				КонецЕсли;
				ТекстНазначение = "Выплата срочной пенсии "+РезультатСклонения+", лицевой счет N "+Строка1.НомерЛицевогоСчета+" за  "+ПредставлениеПериода(НачалоДня(ДатаНачПериода),КонецМесяца(ДатаКонПериода), "ФП = Истина");
			Иначе
				ТекстНазначение = "Выплата срочной пенсии "+?(НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговорКонтрагента),""," по договору N "+СокрЛП(Контрагент.ОсновнойДоговорКонтрагента.Наименование))+" за  "+ПредставлениеПериода(НачалоДня(ДатаНачПериода),КонецМесяца(ДатаКонПериода), "ФП = Истина")+" застрахованным лицам согласно ведомости.";
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойПФ Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_РасчетыПоВыкупнымСуммамОПС;
		ТекстНазначение = "Перевод в пенсионный фонд средств ОПС согласно ведомости";
	ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапитала
		ИЛИ Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапиталаПДС Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_РасчетыПоВыкупнымСуммамОПС;
		ТекстНазначение = "Перевод средств материнского капитала согласно ведомости";
	ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийПДС 
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияПДС
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратПенсииПДС Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ВыплатыПенсийПДС;
		Если Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийПДС и Основание.ПоИсполнительномуЛисту Тогда
			ТекстНазначение = Основание.ИсполнительныйЛист.НазначениеПлатежа;
		Иначе
			ТабУч = Основание.СписокПенсионеровПДС.Выгрузить();
			Если ТабУч.Количество()>0 Тогда
				Строка1 = Основание.СписокПенсионеровПДС.Получить(0);
				ТабУч.Сортировать("НачалоПериодаНачисления Возр");
				ДатаНачПериода = ТабУч.Получить(0).НачалоПериодаНачисления;
				ДатаКонПериода = КонецМесяца(ДатаНачПериода);
				ТабУч.Свернуть("Участник");
				Если ТабУч.Количество() = 1 Тогда
					РезультатСклонения = "";
					Если НеСклонять Тогда
						РезультатСклонения =  СокрЛП(Строка1.Участник.НаименованиеПолное);
					Иначе
						ФизическиеЛицаЗарплатаКадры.Просклонять(СокрЛП(Строка1.Участник.НаименованиеПолное),3,РезультатСклонения,Строка1.Участник.уп_ФизЛицо.Пол);
					КонецЕсли;	
					ТекстНазначение = "Выплата негосударственной пенсии "+РезультатСклонения+", лицевой счет N "+Строка1.НомерЛицевогоСчета+" за  "+ПредставлениеПериода(НачалоДня(ДатаНачПериода),КонецДня(ДатаКонПериода), "ФП = Истина");
				Иначе
					ТекстНазначение = "Выплата негосударственной пенсии "+?(НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговорКонтрагента),""," по договору N "+СокрЛП(Контрагент.ОсновнойДоговорКонтрагента.Наименование))+" за  "+ПредставлениеПериода(НачалоДня(ДатаНачПериода),КонецДня(ДатаКонПериода), "ФП = Истина")+" Участникам Фонда согласно ведомости.";
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаПДС
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежЕВПДС
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратЕдиновременнаяВыплатаПДС Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ЕдиновременныеВыплатыПДС;
		Если Основание.СписокПенсионеровПДС.Количество()>0 Тогда
			Строка1 = Основание.СписокПенсионеровПДС.Получить(0);
			Если Основание.СписокПенсионеровПДС.Количество()>1 Тогда
				ТекстНазначение = "Единовременная выплата средств ПДС "+?(НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговорКонтрагента),""," по договору N "+СокрЛП(Контрагент.ОсновнойДоговорКонтрагента.Наименование))+" согласно ведомости.";
			Иначе
				РезультатСклонения = "";
				Если НеСклонять Тогда
					РезультатСклонения =  СокрЛП(Строка1.Участник.НаименованиеПолное);
				Иначе
					ФизическиеЛицаЗарплатаКадры.Просклонять(СокрЛП(Строка1.Участник.НаименованиеПолное),2,РезультатСклонения,Строка1.Участник.уп_ФизЛицо.Пол);
				КонецЕсли;
#Вставка
//https://redmine.npf.com/issues/4704
				Если ЗначениеЗаполнено(Строка1.НомерЛицевогоСчета) Тогда
					ТекстНазначение = "Единовременная выплата средств ПДС на лицевой счет N "+Строка1.НомерЛицевогоСчета+" "+РезультатСклонения;
				Иначе
#КонецВставки
				Если Основание.Реестр Тогда
					ТекстНазначение = "Единовременная выплата средств ПДС на лицевой счет N "+Строка1.РасчетныйСчет.НомерСчета+" "+РезультатСклонения;
				Иначе
					ТекстНазначение = "Единовременная выплата средств ПДС на лицевой счет N "+Строка1.Участник.ОсновнойБанковскийСчет.НомерСчета+" "+РезультатСклонения;
				КонецЕсли;
#Вставка
//https://redmine.npf.com/issues/4704
				КонецЕсли;
#КонецВставки
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыкупнаяСуммаПДС
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежВыкупнаяСуммаПДС
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыкупнаяСуммаПДС Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ВыкупныеСуммыРасторженцамПДС;
		Если Основание.СписокПенсионеровПДС.Количество()>0 Тогда
			Строка1 = Основание.СписокПенсионеровПДС.Получить(0);
			Если Основание.СписокПенсионеровПДС.Количество()>1 Тогда
				ТекстНазначение = "Выплата выкупной суммы "+?(НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговорКонтрагента),""," по договору N "+СокрЛП(Контрагент.ОсновнойДоговорКонтрагента.Наименование))+" согласно ведомости.";
			Иначе
				РезультатСклонения = "";
				Если НеСклонять Тогда
					РезультатСклонения =  СокрЛП(Строка1.Участник.НаименованиеПолное);
				Иначе
					ФизическиеЛицаЗарплатаКадры.Просклонять(СокрЛП(Строка1.Участник.НаименованиеПолное),2,РезультатСклонения,Строка1.Участник.уп_ФизЛицо.Пол);
				КонецЕсли;
				Если Основание.Реестр Тогда
					ТекстНазначение = "Выплата выкупной суммы на лицевой счет N "+Строка1.РасчетныйСчет.НомерСчета+" "+РезультатСклонения;
				Иначе
					ТекстНазначение = "Выплата выкупной суммы на лицевой счет N "+Строка1.Участник.ОсновнойБанковскийСчет.НомерСчета+" "+РезультатСклонения;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПравопреемникамПДС
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиПДС
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатыПравопреемникамПДС Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ВыкупныеСуммыПравопреемникамПДС;
		Если Основание.СписокПенсионеровПДС.Количество()>0 Тогда
			Строка1 = Основание.СписокПенсионеровПДС.Получить(0);
			Если Основание.СписокПенсионеровПДС.Количество()>1 Тогда
				ТекстНазначение = "Выплата выкупной суммы наследникам "+?(НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговорКонтрагента),""," по договору N "+СокрЛП(Контрагент.ОсновнойДоговорКонтрагента.Наименование))+" согласно ведомости.";
			Иначе
				РезультатСклонения = "";
				Если НеСклонять Тогда
					РезультатСклонения =  СокрЛП(Строка1.Участник.НаименованиеПолное);
				Иначе
					ФизическиеЛицаЗарплатаКадры.Просклонять(СокрЛП(Строка1.Участник.НаименованиеПолное),2,РезультатСклонения,Строка1.Участник.уп_ФизЛицо.Пол);
				КонецЕсли;
				Если Основание.Реестр Тогда
					ТекстНазначение = "Выплата выкупной суммы наследнику на лицевой счет N "+Строка1.РасчетныйСчет.НомерСчета+" "+РезультатСклонения;
				Иначе
					ТекстНазначение = "Выплата выкупной суммы наследнику на лицевой счет N "+Строка1.Участник.ОсновнойБанковскийСчет.НомерСчета+" "+РезультатСклонения;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПоОсобымОбстоятельствамПДС
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежВыплатыПоОсобымОбстоятельствамПДС
		или Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатыПоОсобымОбстоятельствамПДС Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ВыплатыПоОсобымОбстоятельствамПДС;
		Если Основание.СписокПенсионеровПДС.Количество()>0 Тогда
			Строка1 = Основание.СписокПенсионеровПДС.Получить(0);
			Если Основание.СписокПенсионеровПДС.Количество()>1 Тогда
				ТекстНазначение = "Выплата выкупной суммы по особым обстоятельствам "+?(НЕ ЗначениеЗаполнено(Контрагент.ОсновнойДоговорКонтрагента),""," по договору N "+СокрЛП(Контрагент.ОсновнойДоговорКонтрагента.Наименование))+" согласно ведомости.";
			Иначе
				РезультатСклонения = "";
				Если НеСклонять Тогда
					РезультатСклонения =  СокрЛП(Строка1.Участник.НаименованиеПолное);
				Иначе
					ФизическиеЛицаЗарплатаКадры.Просклонять(СокрЛП(Строка1.Участник.НаименованиеПолное),2,РезультатСклонения,Строка1.Участник.уп_ФизЛицо.Пол);
				КонецЕсли;
				Если Основание.Реестр Тогда
					ТекстНазначение = "Выплата выкупной суммы по особым обстоятельствам на лицевой счет N "+Строка1.РасчетныйСчет.НомерСчета+" "+РезультатСклонения;
				Иначе
					ТекстНазначение = "Выплата выкупной суммы по особым обстоятельствам на лицевой счет N "+Строка1.Участник.ОсновнойБанковскийСчет.НомерСчета+" "+РезультатСклонения;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_ПДС Тогда
		ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ПереводВДругойПФсредствПДС;
		ТекстНазначение = "Перевод в пенсионный фонд средств ПДС согласно ведомости";
	Иначе
		ТекстНазначение = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетКонтрагента.ТекстНазначения) Тогда
		ТекстНазначение = СчетКонтрагента.ТекстНазначения;
	КонецЕсли;
	
	#Вставка
	// +ХМНПФ 18.02.2016 ШадринАВ // ЗаполнитьДокументПоРеестру() // №220
	ХМ_ЗаполнитьНазначениеПлатежаДляОдного(ТекстНазначение,Основание,НеСклонять);
	// -ХМНПФ 18.02.2016 ШадринАВ // ЗаполнитьДокументПоРеестру() // №220
	#КонецВставки
	СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
	ТекстСумма="Сумма " + Формат(Основание.СуммаДокумента, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=") + Символы.ПС;
	ТекстСумма = ТекстСумма + "Без налога (НДС) " + Формат(0, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=")+Символы.ПС;
	#Вставка
	//https://redmine.npf.com/issues/4368
	Если НЕ ДополнительныеСвойства.Свойство("НеПерезаполнятьНазначениеПлатежа") Тогда
	#КонецВставки
		НазначениеПлатежа = ТекстНазначение+Символы.ПС+ТекстСумма;
	#Вставка
	КонецЕсли;
	#КонецВставки
	Ответственный = Основание.Ответственный;
	Комментарий = "Создан на основании "+Основание;
	
КонецПроцедуры

Процедура ПроверитьОбновитьОКТМО()
	
	Если НЕ ПустаяСтрока(КодОКАТО) И ПлатежиВБюджетКлиентСервер.ПрименяетсяОКТМО8Символов(Дата) Тогда
		КодОКАТО = Лев(КодОКАТО, 8);
	КонецЕсли;
	
КонецПроцедуры

// ХМНПФ 18.02.2016 ШадринАВ // Новая ХМ_ЗаполнитьНазначениеПлатежаДляОдного() // №220
Процедура ХМ_ЗаполнитьНазначениеПлатежаДляОдного(ТекстНазначение,Основание,НеСклонять)
//	если человек один и (человек равен получателю), то назначение платежа по одному человеку 
//	иначе если человек один и по банку нет договора (банк по расчетному счету (РС Договора с банком)), то назначение платежа по одному человеку
//!!!!	иначе если по банку есть договор: РегистрыСведений.ХМ_НазначениеПлатежа.ЗаполнитьНазначениеПлатежа(ТекстНазначение,Основание);
//	иначе вызватьисключение "по банку нет договора";
	ТЗДоговорыОПС = Основание.ДоговорыОПС.Выгрузить();
	ТЗДоговорыОПС.Свернуть("ДоговорОПС");
	Если Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС
			ИЛИ Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС 
			ИЛИ Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.СрочнаяПенсияОПС 
			ИЛИ Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС Тогда
		Попытка
			БанкКонтрагента = СчетКонтрагента.Банк;
		Исключение
			БанкКонтрагента = Справочники.Банки.ПустаяСсылка();
		КонецПопытки;
		ЕстьДоговорСБанком = РегистрыСведений.уп_ДоговорыСБанками.Получить(Новый Структура("Организация,Банк",Организация,БанкКонтрагента)).ДоговорЗаключен;
		Если ТЗДоговорыОПС.Количество()=1 Тогда  //	если человек один
			Строка1 = Основание.ДоговорыОПС.Получить(0);
			Если Строка1.Участник = Контрагент ИЛИ НЕ ЕстьДоговорСБанком Тогда  //	человек равен получателю  и по банку нет договора
				// +ХМНПФ 14.06.2017 ШадринАВ // ХМ_ЗаполнитьНазначениеПлатежаДляОдного() // №1036
				Если Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС Тогда
					ТекстНазначение = "Единовременная выплата "+СокрЛП(Строка1.Участник.НаименованиеПолное)+" на л/с "+Строка1.НомерЛицевогоСчета;
				ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС Тогда
					//Если Строка1.ТипПенсииОПС = Перечисления.уп_ТипыПенсийОПС.Пожизненная Тогда
						ТекстНазначение = "Выплата накопительной пенсии "+СокрЛП(Строка1.Участник.НаименованиеПолное)+" на л/с "+Строка1.НомерЛицевогоСчета;
					//ИначеЕсли Строка1.ТипПенсииОПС = Перечисления.уп_ТипыПенсийОПС.Срочная Тогда
					//	ТекстНазначение = "Срочная пенсионная выплата "+СокрЛП(Строка1.Участник.НаименованиеПолное)+" на л/с "+Строка1.НомерЛицевогоСчета;
					//Иначе
					//	ВызватьИсключение "Не указан тип пенсии: срочная или НЧТП?";
					//КонецЕсли;
				ИначеЕсли Основание.ТипВыплаты = Перечисления.уп_ТипыВыплат.СрочнаяПенсияОПС Тогда
					ТекстНазначение = "Срочная пенсионная выплата "+СокрЛП(Строка1.Участник.НаименованиеПолное)+" на л/с "+Строка1.НомерЛицевогоСчета;
				// -ХМНПФ 14.06.2017 ШадринАВ // ХМ_ЗаполнитьНазначениеПлатежаДляОдного() // №1036
				Иначе
					ТекстНазначение = "Выплата средств пенсионных накоплений "+СокрЛП(Строка1.Участник.НаименованиеПолное)+" на л/с "+Строка1.НомерЛицевогоСчета;
				КонецЕсли;
			Иначе //по банку есть договор и человек не равен получателю 
				РегистрыСведений.ХМ_НазначениеПлатежа.ЗаполнитьНазначениеПлатежа(ТекстНазначение,Основание);
			КонецЕсли;
		//Если Основание.ДоговорыОПС.Количество()>1	
		ИначеЕсли ЕстьДоговорСБанком Тогда
			РегистрыСведений.ХМ_НазначениеПлатежа.ЗаполнитьНазначениеПлатежа(ТекстНазначение,Основание);
		Иначе
		// +ХМНПФ 03.10.2024 ЛыткинАМ // ХМ_ЗаполнитьНазначениеПлатежаДляОдного() // №0
			Попытка
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Выплата по реестру - в одной регистрации обнаруженно несколько пенсионеров.
				|Для банка " + БанкКонтрагента +" по документу "+ Основание + " не удалось определить назначение платежа, 
				|необходимо установить договор в регистре ""Договоры с банками"" и заполнить назначение в регистре ""Назначение платежа""";
				Сообщение.Поле = "РасчетныйСчет";
				Сообщение.КлючДанных = Основание;
				Сообщение.ПутьКДанным = "Объект";
				Сообщение.Сообщить();
			Исключение
				Сообщить("Для документа "+ Основание + " не удалось определить назначение платежа, необходимо установить договор в регистре ""Договоры с банками"" и заполнить назначение в регистре ""Назначение платежа"" " );
			КонецПопытки;
			
			ВызватьИсключение "По банку нет договора";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&После("ОбработкаПроведения") 
Процедура ХМОбработкаПроведения(Отказ, Режим)
	
	Если ХМ_Оплачено Тогда
		Если ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_РасчетыПоВыкупнымСуммамОПС Тогда 
			Идентификатор =  "Форма22%";
			ФормаОтчета = "ПСПН-НПФ (Форма 22)";
			НазваниеОтчета = "Информация о сумме средств пенсионных накоплений, переданных при переходе застрахованного лица из фонда в фонд";
			Дата = Дата;
			ХМ_ПодпискиНаСобытия_Сервер.ДобавитьОповещениеВРегистр(ЭтотОбъект, Дата, Идентификатор, НазваниеОтчета, ФормаОтчета);
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ВыкупныеСуммыПравопреемникамОПС Тогда 
			Идентификатор =  "Форма25%";
			ФормаОтчета = "ВСПН-П (форма 25)";
			НазваниеОтчета = "Информация  о сумме средств пенсионных накоплений, выплаченных правопреемникам умершего застрахованного лица";
			Дата = Дата;
			ХМ_ПодпискиНаСобытия_Сервер.ДобавитьОповещениеВРегистр(ЭтотОбъект, Дата, Идентификатор, НазваниеОтчета, ФормаОтчета);
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_РасчетыПоНакопительнойЧастиТрудовойПенсии
			Или ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_РасчетыПоСрочнойВыплатеОПС
			Или ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.уп_ЕдиновременныеВыплаты Тогда 
			Идентификатор =  "Форма24%";
			ФормаОтчета = "СФВ (форма 24)";
			НазваниеОтчета = "Информация о размере осуществленных выплат";
			Дата = Дата;
			ХМ_ПодпискиНаСобытия_Сервер.ДобавитьОповещениеВРегистр(ЭтотОбъект, Дата, Идентификатор, НазваниеОтчета, ФормаОтчета);
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&После("ПередЗаписью")
Процедура ХМПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// +ХМНПФ 10.11.2015 ШадринАВ // ХМ_ПередЗаписьюПлатежноеПоручениеПередЗаписью // №25
	Если НЕ ОбменДанными.Загрузка Тогда
		Если Ссылка.Проведен И Ссылка.ХМ_Оплачено И НЕ РольДоступна("ХМ_СуперАдмин") Тогда
			Сообщить("Перепроведение оплаченных платежных поручений запрещено");
			Отказ = Истина;
		КонецЕсли;
		Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.уп_ВыплатныеРеестры")
			И НЕ Ссылка.ХМ_Оплачено И ХМ_Оплачено Тогда
			Если НЕ НачалоДня(ДокументОснование.Дата) = НачалоДня(Дата) Тогда
				Сообщить("Дата платежного поручения должна быть равна дате документа основания: "+ДокументОснование);
				Отказ = Истина;
			КонецЕсли;
			Если НЕ ДокументОснование.СуммаДокумента = СуммаДокумента Тогда
				Сообщить("Сумма платежного поручения должна быть равна сумме документа основания: "+ДокументОснование);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры