
// ХМНПФ 29.11.2022 МилевскийАЮ // ХМПриСозданииНаСервереПосле() // №3515
&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)  
	
	ХМ_РаботаСФормами.ПлатежноеПоручениеПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

// ХМНПФ 29.11.2022 МилевскийАЮ // ХМ_УстановитьОтметкуОплаченоВВыделенныхДокументах() // №3515
&НаКлиенте
Процедура ХМ_УстановитьОтметкуОплаченоВВыделенныхДокументах()
	
	КоличествоВыделенныхСтрок = Элементы.Список.ВыделенныеСтроки.Количество();
	
	Если КоличествоВыделенныхСтрок > 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбУстановкеОтметок", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Количество выбранных строк: " + Формат(КоличествоВыделенныхСтрок, "ЧГ=") + Символы.ПС + " Продолжить выполнение операции?", Режим, 0);
	
	КонецЕсли;
	
КонецПроцедуры

// ХМНПФ 29.11.2022 МилевскийАЮ // ПослеЗакрытияВопросаОбУстановкеОтметок() // №3515
&НаКлиенте
Процедура ПослеЗакрытияВопросаОбУстановкеОтметок(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;  
	
	УстановитьОтметкиНаСервере();    
	
	ПоказатьПредупреждение(, "Готово");

КонецПроцедуры   

// ХМНПФ 29.11.2022 МилевскийАЮ // УстановитьОтметкиНаСервере() // №3515
&НаСервере
Процедура УстановитьОтметкиНаСервере()
	
    Для каждого Стр Из Элементы.Список.ВыделенныеСтроки Цикл
		Ссылка = Стр.Ссылка;
		Если Ссылка.ХМ_Оплачено Тогда
			ОбщегоНазначения.СообщитьПользователю("Отметка уже установлена. Документ пропущен.", Ссылка);   
		Иначе 
			ДокОбъект = Ссылка.ПолучитьОбъект();
			ДокОбъект.ХМ_Оплачено = Истина;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
