// +ХМНПФ 01.12.2016 ШадринАВ // уп_РаспоряжениеОбработкаПроведения() // №693
Процедура уп_РаспоряжениеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	// +ХМНПФ 08.04.2021 ХлопцевБА // хм_ПерваяВыплатаНПО // №3086
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_РаспоряжениеСписокСчетов.НачальнаяДата КАК НачальнаяДата,
		|	уп_РаспоряжениеСписокСчетов.НомерСчета КАК НомерСчета,
		|	уп_РаспоряжениеСписокСчетов.Участник КАК Участник,
		|	уп_РаспоряжениеСписокСчетов.НомерСчета.Владелец КАК ПенсионныйДоговор,
		|	СУММА(уп_РаспоряжениеСписокСчетов.РазмерПервойВыплаты) КАК РазмерПервойВыплаты,
		|	уп_РаспоряжениеСписокСчетов.ПерваяВылата КАК ПерваяВылата,
		|	уп_ДатыСледующихВыплат.ДатаСледующейВыплаты КАК ДатаСледующейВыплаты
		|ИЗ
		|	Документ.уп_Распоряжение.СписокСчетов КАК уп_РаспоряжениеСписокСчетов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уп_ДатыСледующихВыплат КАК уп_ДатыСледующихВыплат
		|		ПО уп_РаспоряжениеСписокСчетов.Ссылка = уп_ДатыСледующихВыплат.Регистратор
		|			И уп_РаспоряжениеСписокСчетов.НомерСчета = уп_ДатыСледующихВыплат.НомерСчета
		|ГДЕ
		|	уп_РаспоряжениеСписокСчетов.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_РаспоряжениеСписокСчетов.Участник,
		|	уп_РаспоряжениеСписокСчетов.НомерСчета,
		|	уп_РаспоряжениеСписокСчетов.НачальнаяДата,
		|	уп_РаспоряжениеСписокСчетов.ПерваяВылата,
		|	уп_РаспоряжениеСписокСчетов.НомерСчета.Владелец,
		|	уп_ДатыСледующихВыплат.ДатаСледующейВыплаты";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Источник.Движения.ХМ_ПеререгистрацияУчастников.Добавить();
		Движение.Период = Выборка.НачальнаяДата;
		Движение.НомерСчета = Выборка.НомерСчета;
		Движение.Участник = Выборка.Участник;
		Движение.ДатаПеререгистрации = ДобавитьМесяц(Выборка.НачальнаяДата,12);
		
		Если Выборка.ПерваяВылата Тогда
			
			Движение = Источник.Движения.хм_ПерваяВыплатаНПО.Добавить();
			Движение.Участник = Выборка.Участник;
			Движение.ПенсионныйДоговор = Выборка.ПенсионныйДоговор;
			Движение.НомерСчета = Выборка.НомерСчета;
			Движение.Начислено = Выборка.РазмерПервойВыплаты;
			Движение.ПериодНачисленияПервойВыплаты = Выборка.ДатаСледующейВыплаты; 
		КонецЕсли;	
	
	КонецЦикла;
	
	Источник.Движения.ХМ_ПеререгистрацияУчастников.Записать();
	Источник.Движения.хм_ПерваяВыплатаНПО.Записать();
	//Для Каждого ТекСтрокаСписокСчетов Из Источник.СписокСчетов Цикл
	//	Движение = Источник.Движения.ХМ_ПеререгистрацияУчастников.Добавить();
	//	Движение.Период = ТекСтрокаСписокСчетов.НачальнаяДата;
	//	Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета.Ссылка;
	//	Движение.Участник = ТекСтрокаСписокСчетов.НомерСчета.Участник;
	//	Движение.ДатаПеререгистрации = ДобавитьМесяц(ТекСтрокаСписокСчетов.НачальнаяДата,12);
	//КонецЦикла;
	
КонецПроцедуры // уп_РаспоряжениеОбработкаПроведения(Источник, Отказ, РежимПроведения)()
