
&НаСервере
&ИзменениеИКонтроль("ПоДаннымСистемыЗакрытиеСчетовНаСервере")
Функция ХМПоДаннымСистемыЗакрытиеСчетовНаСервере()

	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
	|	СостоянияПССрезПоследних.НомерСчета КАК НомерСчета,
	|	СостоянияПССрезПоследних.Состояние КАК Состояние,
	|	СхемаСчетаСрезПоследних.Схема КАК Схема,
	|	ВЫБОР 
	|		КОГДА СхемаСчетаСрезПоследних.ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.ПустаяСсылка) 
	|			ТОГДА СхемаСчетаСрезПоследних.Схема.ТипПенсионнойСхемы
	|		ИНАЧЕ СхемаСчетаСрезПоследних.ТипПенсии 
	|	КОНЕЦ КАК ТипПенсионнойСхемы,
	|	ЕСТЬNULL(КоличествоНазначенныхВыплатСрезПоследних.КоличествоВыплат, 0) КАК КоличествоНазначенныхВыплат,
	|	ПериодичностьВыплатСрезПоследних.ПериодичностьВыплат КАК ПериодичностьВыплат,
	|	СостоянияПССрезПоследних.Период КАК ДатаНачалаВыплат,
	|	ЕСТЬNULL(РезервыОстатки.СуммаОстаток, 0) КАК Сумма,
	|	СостоянияПССрезПоследних.НомерСчета.Владелец КАК Договор,
	|	ЕСТЬNULL(уп_СчетчикНачисленийОбороты.КоличествоОборот, 0) КАК КоличествоСделанныхВыплат,
	|	СостоянияПССрезПоследних.НомерСчета.Участник КАК Участник
	|ИЗ
	|	РегистрСведений.уп_СостоянияПС.СрезПоследних(&ДатаДок, НомерСчета.Владелец.Организация = &Организация) КАК СостоянияПССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СхемаСчета.СрезПоследних(&ДатаДок, НомерСчета.Владелец.Организация = &Организация) КАК СхемаСчетаСрезПоследних
	|		ПО СостоянияПССрезПоследних.НомерСчета = СхемаСчетаСрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_КоличествоНазначенныхВыплат.СрезПоследних(&ДатаДок, НомерСчета.Владелец.Организация = &Организация) КАК КоличествоНазначенныхВыплатСрезПоследних
	|		ПО СостоянияПССрезПоследних.НомерСчета = КоличествоНазначенныхВыплатСрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПериодичностьВыплат.СрезПоследних(&ДатаДок, НомерСчета.Владелец.Организация = &Организация) КАК ПериодичностьВыплатСрезПоследних
	|		ПО СостоянияПССрезПоследних.НомерСчета = ПериодичностьВыплатСрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_Резервы.Остатки(&ДатаДок, НомерСчета.Владелец.Организация = &Организация) КАК РезервыОстатки
	|		ПО СостоянияПССрезПоследних.НомерСчета = РезервыОстатки.НомерСчета
#Вставка
//++https://redmine.npf.com/issues/4274
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ уп_СчетчикНачислений.НомерСчета, Максимум(естьNUll(хм_СрезСчетчик.Количество,0)) + СУММА(ВЫБОР КОГДА хм_СрезСчетчик.ДатаУстановкиСостояния есть NUll Тогда естьNUll(уп_СчетчикНачислений.Количество,0) ИНАЧЕ 0 КОНЕЦ) КАК КоличествоОборот
	|		ИЗ РегистрНакопления.уп_СчетчикНачислений КАК уп_СчетчикНачислений
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.хм_СрезСчетчикНачисленийНПО.СрезПоследних(&ДатаДок,НомерСчета.Владелец.Организация = &Организация) КАК хм_СрезСчетчик
	|		ПО (уп_СчетчикНачислений.НомерСчета = хм_СрезСчетчик.НомерСчета)
	|			И уп_СчетчикНачислений.Период < хм_СрезСчетчик.ДатаУстановкиСостояния 
	|			И хм_СрезСчетчик.ДатаУстановкиСостояния  >= &ДатаНач	
	|		ГДЕ уп_СчетчикНачислений.Период <= &ДатаДок 
	|			И уп_СчетчикНачислений.Период >= &ДатаНач
	|			И уп_СчетчикНачислений.НомерСчета.Владелец.Организация = &Организация
	|		СГРУППИРОВАТЬ ПО уп_СчетчикНачислений.НомерСчета
	|		) КАК уп_СчетчикНачисленийОбороты
//--https://redmine.npf.com/issues/4274
#КонецВставки
#Удаление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_СчетчикНачислений.Обороты(&ДатаНач, &ДатаДок, Период, НомерСчета.Владелец.Организация = &Организация) КАК уп_СчетчикНачисленийОбороты
#КонецУдаления
	|		ПО СостоянияПССрезПоследних.НомерСчета = уп_СчетчикНачисленийОбороты.НомерСчета
	|ГДЕ
	|	ВЫБОР 
	|		КОГДА СхемаСчетаСрезПоследних.ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.ПустаяСсылка) 
	|			ТОГДА СхемаСчетаСрезПоследних.Схема.ТипПенсионнойСхемы
	|		ИНАЧЕ СхемаСчетаСрезПоследних.ТипПенсии 
	|	КОНЕЦ В(&СписокТипов)
	|	И ПериодичностьВыплатСрезПоследних.ПериодичностьВыплат В(&ПериодичностьВыплат)
	|	И СостоянияПССрезПоследних.Состояние = &Выплатное
	|
	|УПОРЯДОЧИТЬ ПО
	|	Договор,
	|	НомерСчета";

	Запрос.УстановитьПараметр("ДатаДок", Объект.Дата-1);
	Запрос.УстановитьПараметр("ДатаНач", '19900101');
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Выплатное", Перечисления.уп_СостоянияПС.ВыплатнойПериод);
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(Перечисления.уп_ТипыПенсионныхСхем.ДоИсчерпанияСредствНаСчете);
	СписокТипов.Добавить(Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат);
	Запрос.УстановитьПараметр("СписокТипов", СписокТипов);
	ПериодичностьВыплат = Новый СписокЗначений;
	ПериодичностьВыплат.Добавить(Перечисления.уп_ПериодичностьВыплат.Ежемесячно);
	Если КонецМесяца(Объект.Дата) = КонецКвартала(Объект.Дата) Тогда
		ПериодичностьВыплат.Добавить(Перечисления.уп_ПериодичностьВыплат.Ежеквартально);
	КонецЕсли;	
	Если КонецМесяца(Объект.Дата) = КонецГода(Объект.Дата) Тогда
		ПериодичностьВыплат.Добавить(Перечисления.уп_ПериодичностьВыплат.Ежегодно);
	КонецЕсли;
	Если Месяц(Объект.Дата)=6 или Месяц(Объект.Дата)=12 Тогда
		ПериодичностьВыплат.Добавить(Перечисления.уп_ПериодичностьВыплат.Полугодие);
	КонецЕсли;
	Запрос.УстановитьПараметр("ПериодичностьВыплат", ПериодичностьВыплат);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Данные = Новый Массив;

	Пока Выборка.Следующий() Цикл
		Если Выборка.Сумма = 0 Тогда  //возможно обязательства выполнены
			Если Выборка.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ДоИсчерпанияСредствНаСчете Тогда
				//Данные.Добавить(Выборка.НомерСчета);
				СтруктураДанных = Новый Структура();
				СтруктураДанных.Вставить("НомерСчета", Выборка.НомерСчета);
				СтруктураДанных.Вставить("Договор", Выборка.Договор);
				СтруктураДанных.Вставить("Участник", Выборка.Участник);
				Данные.Добавить(СтруктураДанных);
			Иначе // значит схема срочная и надо проверить сколько периодов прошло с начала выплат
				КолОстВыплат = Выборка.КоличествоНазначенныхВыплат - Выборка.КоличествоСделанныхВыплат;
				Если КолОстВыплат<=0 Тогда
					//Данные.Добавить(Выборка.НомерСчета);
					СтруктураДанных = Новый Структура();
					СтруктураДанных.Вставить("НомерСчета", Выборка.НомерСчета);
					СтруктураДанных.Вставить("Договор", Выборка.Договор);
					СтруктураДанных.Вставить("Участник", Выборка.Участник);
					Данные.Добавить(СтруктураДанных);
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;

	Возврат Данные;

КонецФункции
