
&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ХМДополнитьФорму();
	
КонецПроцедуры

Процедура ХМДополнитьФорму() 
	
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("Вид", ВидПоляФормы.ПолеФлажка);  
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_УчитыватьОстатки",Элементы.ГруппаНастроекРасчета,"Объект.ХМ_УчитыватьОстатки",СвойстваПоля);
	
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьКомандуСКнопкой(ЭтаФорма,"ОставитьПоЗаявленияПрошлогоГода","Оставить по заявления прошлого года",Элементы.ДоговорыОПСКоманднаяПанель);
	//уп_ДинамическиеЭлементыСервер.ХМ_СоздатьКнопкуКоманды(ЭтаФорма,"ДоговорыОПСКнопка3",Элементы.ДоговорыОПСКоманднаяПанель,"ВывестиСписок");
	//уп_ДинамическиеЭлементыСервер.ХМ_СоздатьКнопкуКоманды(ЭтаФорма,"ДоговорыОПСКнопка2",Элементы.ДоговорыОПСКоманднаяПанель,"СортироватьСписокПоУбыванию");
	//уп_ДинамическиеЭлементыСервер.ХМ_СоздатьКнопкуКоманды(ЭтаФорма,"ДоговорыОПСКнопка1",Элементы.ДоговорыОПСКоманднаяПанель,"СортироватьСписокПоВозрастанию");
		
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ДоговорыОПСХМ_ДатаЗаявленияПоРешению",Элементы.ДоговорыОПС,"Объект.ДоговорыОПС.ХМ_ДатаЗаявленияПоРешению");
	
КонецПроцедуры


Процедура ХМ_НеТиповыеИзменения()
	//ЛыткинАМ Новая ДоговорыОПСОбрабатыватьПриИзменении + команда на форме
	//ЛыткинАМ ДоговорыОПС Добавлены кнопки сортировки
	// ХМНПФ+ 09.02.2016 Шадрин А.В. // Новая колонка "Дата заявления по решению" в таблице на странице "Договоры для корректировки" // №192
	// ХМНПФ+ 10.02.2016 Шадрин А.В. // Новый реквизит на форме ХМ_УчитыватьОстатки // №193
	// ХМНПФ+ 16.02.2016 Шадрин А.В. // Добавлена сортировка в контекстное меню в таблице на странице "Договоры для корректировки" // №213
	//ЛыткинАМ Новая ОставитьПоЗаявленияПрошлогоГода + команда на форме
	//ЛыткинАМ Новая ОставитьПоЗаявленияПрошлогоГодаНаСервере + команда на форме
КонецПроцедуры

	//ЛыткинАМ Новая ОставитьПоЗаявленияПрошлогоГодаНаСервере + команда на форме
&НаСервере
Процедура ОставитьПоЗаявленияПрошлогоГодаНаСервере()
	МассивУдалить = Новый Массив();
	КонецГода= НачалоГода(ТекущаяДата())-1;
	Для каждого СтрокаДоговорОПС Из Объект.ДоговорыОПС Цикл
		Если Не КонецГода(СтрокаДоговорОПС.ХМ_ДатаЗаявленияПоРешению) = КонецГода Тогда
			МассивУдалить.Добавить(СтрокаДоговорОПС);		
		КонецЕсли;
	КонецЦикла;// Вставить содержимое обработчика.
	Для каждого СтрокаДоговорОПС Из МассивУдалить Цикл
		Объект.ДоговорыОПС.Удалить(СтрокаДоговорОПС);		
	КонецЦикла;// Вставить содержимое обработчика.
КонецПроцедуры

	//ЛыткинАМ Новая ОставитьПоЗаявленияПрошлогоГода + команда на форме
&НаКлиенте
Процедура ОставитьПоЗаявленияПрошлогоГода(Команда)
	ОставитьПоЗаявленияПрошлогоГодаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ХМДоговорыОПСОбрабатыватьПриИзмененииПосле(Элемент)
	лок_Обрабатывать = Элементы.ДоговорыОПС.ТекущиеДанные.Обрабатывать;
	Для каждого Инд Из Элементы.ДоговорыОПС.ВыделенныеСтроки Цикл
		ВыдСтрока = Объект.ДоговорыОПС.НайтиПоИдентификатору(Инд);
		Если Не ВыдСтрока.Обрабатывать = лок_Обрабатывать Тогда
			ВыдСтрока.Обрабатывать = лок_Обрабатывать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
