Процедура ХМНачислитьПоОтменеПриостановки(уп_Приостановка, ВыполнитьПереначисление = Ложь) Экспорт
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_ПриостановкаВыплат.Ссылка КАК уп_ПриостановкаВыплат,
		|	уп_НачислениеПенсий.Ссылка КАК уп_НачислениеПенсий
		|ИЗ
		|	Документ.уп_ПриостановкаВыплат КАК уп_ПриостановкаВыплат
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_НачислениеПенсий КАК уп_НачислениеПенсий
		|		ПО (уп_НачислениеПенсий.ДокументОснование = уп_ПриостановкаВыплат.Ссылка)
		|			И (уп_НачислениеПенсий.ПометкаУдаления = ЛОЖЬ)
		|ГДЕ
		|	уп_ПриостановкаВыплат.Ссылка В (&уп_Приостановка)
		|	И уп_ПриостановкаВыплат.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уп_ВидыОперацийПриостановкаНПО.ОтменаПриостановки)
		|	И уп_ПриостановкаВыплат.ПометкаУдаления = Ложь";
	
	Запрос.УстановитьПараметр("уп_Приостановка",уп_Приостановка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.уп_НачислениеПенсий) Тогда
			Если ВыполнитьПереначисление = Истина Тогда
				НовыйДокумент = Выборка.уп_НачислениеПенсий.ПолучитьОбъект();
				НовыйДокумент.СписокПенсионеров.Очистить();
				НовыйДокумент.НачислениеЗадолженностиПоПриостановкам.Очистить();

			Иначе
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Для приостановки " + Выборка.уп_ПриостановкаВыплат + " уже есть существующее начисление " + Выборка.уп_НачислениеПенсий + " .";
				Сообщение.КлючДанных = Выборка.уп_ПриостановкаВыплат;
				Сообщение.Сообщить();
				Продолжить;	
			КонецЕсли;
		Иначе	
			НовыйДокумент = Документы.уп_НачислениеПенсий.СоздатьДокумент(); 
		КонецЕсли;
		НовыйДокумент.Заполнить(Выборка.уп_ПриостановкаВыплат);
		НовыйДокумент.Записать();
		Документы.уп_НачислениеПенсий.НПФ_РассчитатьСервер(НовыйДокумент);
		НовыйДокумент.Записать();
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
	КонецЦикла;
	
КонецПроцедуры
