// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_СформироватьРешения() // №318
&НаСервере
Процедура ХМ_СформироватьРешения()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПричиныЗакрытияДоговоровОПС.ДоговорОПС КАК ДоговорОПС
		|ПОМЕСТИТЬ Договора
		|ИЗ
		|	РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(&ДатаРешения, ) КАК ПричиныЗакрытияДоговоровОПС
		|ГДЕ
		|	ПричиныЗакрытияДоговоровОПС.ПричинаЗакрытия = ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти)
		|	И ПричиныЗакрытияДоговоровОПС.ДоговорОПС.Участник.уп_ФизЛицо.уп_ДатаСмерти <= &ДатаКон6мес
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПричиныЗакрытияДоговоровОПС.ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РешениеОВыплатеСПН.Заявление.ДоговорОПС КАК ДоговорОПС
		|ПОМЕСТИТЬ РешенияОВыплатеСПН
		|ИЗ
		|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК РешениеОВыплатеСПН
		|ГДЕ
		|	РешениеОВыплатеСПН.Ссылка.Проведен
		|	И РешениеОВыплатеСПН.Разрешить
		|	И РешениеОВыплатеСПН.Ссылка.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				Договора.ДоговорОПС
		|			ИЗ
		|				Договора КАК Договора)
		|	И ГОД(РешениеОВыплатеСПН.Ссылка.Дата) < ГОД(&ДатаРешения)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РешениеОВыплатеСПН.Заявление.ДоговорОПС
		|ИЗ
		|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Правопреемники31 КАК РешениеОВыплатеСПН
		|ГДЕ
		|	РешениеОВыплатеСПН.Ссылка.Проведен
		|	И РешениеОВыплатеСПН.Разрешить
		|	И РешениеОВыплатеСПН.Ссылка.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				Договора.ДоговорОПС
		|			ИЗ
		|				Договора КАК Договора)
		|	И ГОД(РешениеОВыплатеСПН.Ссылка.Дата) < ГОД(&ДатаРешения)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РезервыОПСОстатки.Организация КАК Организация,
		|	РезервыОПСОстатки.ДоговорОПС КАК ДоговорОПС,
		|	РезервыОПСОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.уп_РезервыОПС.Остатки(
		|			&ДатаРешения,
		|			ТипРезерва В (&ТипыРезервовОПС)
		|				И ДоговорОПС В
		|					(ВЫБРАТЬ
		|						Договора.ДоговорОПС
		|					ИЗ
		|						Договора КАК Договора)) КАК РезервыОПСОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РешенияОВыплатеСПН КАК РешенияОВыплатеСПН
		|		ПО (РешенияОВыплатеСПН.ДоговорОПС = РезервыОПСОстатки.ДоговорОПС)
		|ГДЕ
		|	РезервыОПСОстатки.СуммаОстаток > 0";
	
		//|	И (ПричиныЗакрытияДоговоровОПС.ДоговорОПС.Участник.уп_ФизЛицо.уп_ДатаСмерти < &ДатаНач
		//|			ИЛИ ПричиныЗакрытияДоговоровОПС.ДоговорОПС.Участник.уп_ФизЛицо.уп_ДатаСмерти МЕЖДУ &ДатаКон И &ДатаКон6мес)
	
	//ДатаНач = НачалоГода(ДобавитьМесяц(НачалоГода(ДатаРешения)-(24*60*60),-12));
	ДатаКон = КонецГода(ДобавитьМесяц(НачалоГода(Объект.ДатаРешения)-(24*60*60),-12))+1;
	ДатаКон6мес = КонецМесяца(ДобавитьМесяц(ДатаКон,6));
	ТипыРезервовОПС = Новый СписокЗначений;
	ТипыРезервовОПС.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	ТипыРезервовОПС.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты);
	ТипыРезервовОПС.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН);
	ТипыРезервовОПС.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ);
	
	//Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	//Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	//Запрос.УстановитьПараметр("ПоСмерти", Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти);
	Запрос.УстановитьПараметр("ДатаКон6мес", ДатаКон6мес);
	Запрос.УстановитьПараметр("ДатаРешения", Объект.ДатаРешения);
	Запрос.УстановитьПараметр("ТипыРезервовОПС", ТипыРезервовОПС);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	    СоздатьДокумент(Выборка.ДоговорОПС, Выборка.СуммаОстаток);
	КонецЦикла;
КонецПроцедуры

// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_УстановитьДействияФормы()
&НаСервере
Процедура ХМ_УстановитьДействияФормы()
	УстановитьДействие("ПриОткрытии", "ХМ_ПриОткрытии");
КонецПроцедуры

// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_УстановитьДействияФормы()
&НаКлиенте
Процедура ХМ_ПриОткрытии()
	 ХМ_ПриОткрытииСервер();
КонецПроцедуры

// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_ПриОткрытииСервер() // №318
&НаСервере
Процедура ХМ_ПриОткрытииСервер()
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("ХМ_Провести");
	НоваяКоманда.Действие = "ХМ_Провести";
	НоваяКоманда.Заголовок = "Провести";
	
	НовыйЭлемент = Элементы.Добавить("ХМ_Провести", Тип("КнопкаФормы"),Элементы.Группа4);
	НовыйЭлемент.ИмяКоманды = "ХМ_Провести";
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.ЖурналПроводок;
	НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
КонецПроцедуры

// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_Провести() // №318
&НаКлиенте
Процедура ХМ_Провести()
	ХМ_ПровестиСервер();
КонецПроцедуры

// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_ПровестиСервер() // №318
&НаСервере
Процедура ХМ_ПровестиСервер()
	Для каждого стр из Объект.НовыеНачисления Цикл
		Док = стр.Документ.ПолучитьОбъект();
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 18.04.2016 ШадринАВ // КнопкаВыполнитьНажатие() // №318
	// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_СформироватьРешения() // №318
	// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_Провести() // №318
	// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_ПровестиСервер() // №318	
	// ХМНПФ 18.04.2016 ШадринАВ // ПриСозданииНаСервере()
	// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_УстановитьДействияФормы()
	// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_ПриСозданииНаСервере()	
КонецПроцедуры


&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// ХМНПФ 18.04.2016 ШадринАВ // ПриСозданииНаСервере
	ХМ_УстановитьДействияФормы();
	// ХМНПФ 18.04.2016 ШадринАВ // ПриСозданииНаСервере
КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("СформироватьНаСервере")
Процедура ХМСформироватьНаСервере()
	Если Объект.ДополнительнаяВыплата Тогда
		ДатаНач = НачалоГода(ДобавитьМесяц(НачалоГода(Объект.ДатаРешения)-(24*60*60),-12));
		ДатаКон = КонецГода(ДобавитьМесяц(НачалоГода(Объект.ДатаРешения)-(24*60*60),-12));
	Иначе
		ДатаНач = НачалоМесяца(ДобавитьМесяц(Объект.ДатаРешения,-7));
		ДатаКон = КонецМесяца(ДобавитьМесяц(Объект.ДатаРешения,-7));
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПричиныЗакрытияДоговоровОПС.ДоговорОПС
	|ИЗ
	|	РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(&ДатаРешения, ДоговорОПС.Организация = &Организация) КАК ПричиныЗакрытияДоговоровОПС
	|ГДЕ
	|	ПричиныЗакрытияДоговоровОПС.ПричинаЗакрытия = &ПоСмерти
	|	И ПричиныЗакрытияДоговоровОПС.ДоговорОПС.Участник.уп_ФизЛицо.уп_ДатаСмерти >= &ДатаНач
	|	И ПричиныЗакрытияДоговоровОПС.ДоговорОПС.Участник.уп_ФизЛицо.уп_ДатаСмерти <= &ДатаКон";

	Запрос.УстановитьПараметр("ПоСмерти", Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("ДатаРешения", Объект.ДатаРешения);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	ТЗ = Результат.Выгрузить();

	Элементы.Сформировать.Доступность = Ложь;
	Элементы.Отменить.Доступность = Истина;
	Элементы.Применить.Доступность = Истина;
	ЕстьНеутвержденныеДокументы = Истина;
	Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.ОсновнаяПанель.ПодчиненныеЭлементы.Получить(0);

	#Вставка
	// +ХМНПФ 18.04.2016 ШадринАВ // КнопкаВыполнитьНажатие() // №318
	//--СформироватьРешения(ТЗ);
	Если Объект.ДополнительнаяВыплата Тогда
		ХМ_СформироватьРешения();
	Иначе 
	#КонецВставки
	СформироватьРешения(ТЗ);
	#Вставка
	КонецЕсли;	
	// -ХМНПФ 18.04.2016 ШадринАВ // КнопкаВыполнитьНажатие() // №318  
	#КонецВставки
	
КонецПроцедуры

