
&ИзменениеИКонтроль("ОпределитьПодписанта")
Функция ХМОпределитьПодписанта(ДокСсылка)
	ДанныеПодписанта = Новый Структура("ПрПодп, ПодпФамилия, ПодпИмя, ПодпОтчество, НаимДокПодп");

	Если ДокСсылка.УказатьПодписанта = 1 Тогда 
		ДанныеПодписанта.ПрПодп = "2"; 

		Если ЗначениеЗаполнено(ДокСсылка.Подписант)	Тогда
			ФИОПредставителя = СокрЛП(ДокСсылка.Подписант.ФИО);
			СоставляющиеФИО = СоставляющиеФИО(ФИОПредставителя);
			ДанныеПодписанта.ПодпФамилия = СоставляющиеФИО.Фамилия;
			ДанныеПодписанта.ПодпИмя = СоставляющиеФИО.Имя;
			ДанныеПодписанта.ПодпОтчество = СоставляющиеФИО.Отчество;
		КонецЕсли; 
		ДанныеПодписанта.НаимДокПодп = ДокСсылка.ДокументПредставителя; 
#Вставка
		//ЛыткинАМ //Для печать факсимилие
		ДанныеПодписанта.Вставить("ПодписантСсылка",ДокСсылка.Подписант);	
#КонецВставки
	Иначе	
		СведенияОПредставителе = РегламентированнаяОтчетностьВызовСервера.ПолучитьПоКодамСведенияОПредставителе(
		ДокСсылка.Организация, ДокСсылка.Организация.КодНалоговогоОргана, ДокСсылка.Организация.КПП);
		ИФНС = ДокСсылка.Организация.РегистрацияВНалоговомОргане;
		ТипПодписанта = СведенияОПредставителе.ТипПодписанта; 

		ДанныеПодписанта.ПрПодп = ТипПодписанта;

		Если ТипПодписанта = "1" Тогда
			ФИОПодписанта = СведенияОРуководителе(ДокСсылка); 				
#Вставка
			//РустановаСР  скопировала из уп_СправкаОбУплатеВзносовНПО //Для печать факсимилие
			Если ЗначениеЗаполнено(ДокСсылка.Ответственный.ФизическоеЛицо) Тогда
				ФИОПодписанта = ДокСсылка.Ответственный.ФизическоеЛицо;	
			КонецЕсли;
			ДанныеПодписанта.Вставить("ПодписантСсылка",ФИОПодписанта.Ссылка);	
#КонецВставки    

			ДанныеПодписанта.ПодпФамилия = ФИОПодписанта.Фамилия;
			ДанныеПодписанта.ПодпИмя = ФИОПодписанта.Имя;
			ДанныеПодписанта.ПодпОтчество = ФИОПодписанта.Отчество;

		ИначеЕсли ТипПодписанта = "2" Тогда  
			ФИОПредставителя = СведенияОПредставителе.ФИОПредставителя;
			ДокументПредставителя = СведенияОПредставителе.ДокументПредставителя;
			ДанныеПодписанта.НаимДокПодп = ДокументПредставителя; 

			СоставляющиеФИО = СоставляющиеФИО(ФИОПредставителя);
			ДанныеПодписанта.ПодпФамилия = СоставляющиеФИО.Фамилия;
			ДанныеПодписанта.ПодпИмя = СоставляющиеФИО.Имя;
			ДанныеПодписанта.ПодпОтчество = СоставляющиеФИО.Отчество;
#Вставка
			//ЛыткинАМ //Для печать факсимилие
			ДанныеПодписанта.Вставить("ПодписантСсылка",СведенияОПредставителе.ПредставительСсылка);	
#КонецВставки
		КонецЕсли;   
	КонецЕсли;
	Возврат ДанныеПодписанта;
КонецФункции

&ИзменениеИКонтроль("СведенияОРуководителе")
Функция ХМСведенияОРуководителе(ВыгружаемыйДокумент)

	Результат = Новый Структура("Фамилия, Имя, Отчество", "", "", "");

	РеквизитыОтветственныхЛиц = ОтветственныеЛицаБП.ОтветственныеЛица(ВыгружаемыйДокумент.Организация, ВыгружаемыйДокумент.Дата);
	Если ЗначениеЗаполнено(РеквизитыОтветственныхЛиц.Руководитель) Тогда
		Результат.Фамилия 	= СокрЛП(РеквизитыОтветственныхЛиц.РуководительФИО.Фамилия);
		Результат.Имя 		= СокрЛП(РеквизитыОтветственныхЛиц.РуководительФИО.Имя);
		Результат.Отчество	= СокрЛП(РеквизитыОтветственныхЛиц.РуководительФИО.Отчество);
	КонецЕсли;

	#Вставка
	//ЛыткинАМ //Для печать факсимилие
	Результат.Вставить("Ссылка",РеквизитыОтветственныхЛиц.Руководитель);	
	#КонецВставки
	Возврат Результат;

КонецФункции
