
Процедура ХМ_НеТиповыеИзменения()
	// +ХМНПФ 28.02.17 Функция ПечатьДоговора15052012(МассивОбъектов, ИмяМакета) Кучеров//добавлена опция Экспорт для возможности получения печатной формы из веб сервисов
	// +ХМНПФ 03.04.17 Функция ПечатьПоручения(МассивОбъектов) Экспорт Кучеров//добавлена опция Экспорт для возможности получения печатной формы из веб сервисов
	// +ХМНПФ 03.04.17 Функция ПечатьЗаявления(МассивОбъектов, ТипЗаявления)  Экспорт Кучеров//добавлена опция Экспорт для возможности получения печатной формы из веб сервисов
	// +ХМНПФ 03.04.17 Кучеров// Новая Функция ХМ_ПечатьWeb()
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// +ХМНПФ 01.03.17 Кучеров// Новая Функция ХМ_ПечатьWeb()
// для получения печатных форм со стороны Web сервисов
// аналог процедуры печать типового варианта пользовательского интерфейса
Функция ХМ_ПечатьWeb(МассивОбъектов,ИмяМакета) Экспорт
	ТабДокумент = Новый ТабличныйДокумент; // заглушка на случай если не сформируется ни чего 
	Если      ИмяМакета = "Договор03062013" Тогда
		ТабДокумент = ПечатьДоговора01102019(МассивОбъектов);
	ИначеЕсли ИмяМакета = "Поручение" Тогда
		ТабДокумент = ПечатьПоручения(МассивОбъектов);
	ИначеЕсли ИмяМакета = "ЗаявлениеПФРНПФ" Тогда
		ТабДокумент = ПечатьЗаявления(МассивОбъектов, "ПФР");
	ИначеЕсли ИмяМакета = "ЗаявлениеНПФНПФ" Тогда
		ТабДокумент = ПечатьЗаявления(МассивОбъектов, "НПФ");
	КонецЕсли;
	
	Возврат ТабДокумент;
КонецФункции 

#КонецЕсли
                                                                                            