
Процедура ХМ_НеТиповыеИзменения()
	// +ХМНПФ 28.02.2017 Кучеров // Новая Функция ХМ_ПечатьWeb()
	// -ХМНПФ 28.02.2017 Кучеров // убрал директиву #На клиенте
КонецПроцедуры

// +ХМНПФ 28.0217 Кучеров// Новая Функция ХМ_ПечатьWeb()
// для получения печатных форм со стороны Web сервисов
// аналог процедуры печать типового варианта пользовательского интерфейса
Функция ХМ_ПечатьWeb(ИмяМакета) Экспорт
	ТабДокумент = Новый ТабличныйДокумент; // заглушка на случай если не сформируется ни чего 
	Если      ИмяМакета = "Заявление" Тогда
		Если Дата < Дата("20150101") Тогда
			ТабДокумент = ПечатьДокумента("Заявление");
		Иначе
			ТабДокумент = ПечатьДокумента("Заявление2015");
		КонецЕсли;
	ИначеЕсли ИмяМакета = "Решение" Тогда
		ТабДокумент = ПечатьРешенияОбОтказеСервер();
	ИначеЕсли ИмяМакета = "Приложение2" тогда
		ТабДокумент = ПечатьПриложение2();
	ИначеЕсли ИмяМакета = "Приложение2_2" тогда
		ТабДокумент = ПечатьПриложение2_2();
	ИначеЕсли ИмяМакета = "РеестрАдресовПравопреемников" тогда
		ТабДокумент = ПечатьРеестраАдресов();
	КонецЕсли;
	
	Возврат ТабДокумент;
КонецФункции 

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, РежимПроведения, СтрокаТЗ = Неопределено, СтруктураТЧ = Неопределено) Экспорт
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ДоверенныеЛицаУчастников);
		#КонецЕсли
		Возврат;	
	КонецЕсли;
	
	Движение = Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц.Добавить();
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.ДоговорОПС = ДоговорОПС;
	Движение.ЗастрахованноеЛицо = Правопреемник;
	Движение.ТипЛицевогоСчета = ТипЛицевогоСчета;
	Движение.НомерЛицевогоСчета = НомерЛицевогоСчета;
	Если НЕ ЗначениеЗаполнено(Получатель) Тогда
		Движение.Банк = Справочники.Контрагенты.ПустаяСсылка();
	Иначе
		Движение.Банк = Получатель;
	КонецЕсли;
	Движение.ФормаВыплаты = ФормаВыплаты;
	Движение.РасчетныйСчет = РасчетныйСчет;
	
	Если ЗначениеЗаполнено(ДоверенноеЛицо) Тогда
		Движение = Движения.уп_ДоверенныеЛицаУчастников.Добавить();
		Движение.Период = Дата;
		Движение.Участник = Правопреемник;
		Движение.ДоверенноеЛицо = ДоверенноеЛицо;
	КонецЕсли;	
	
	#Если Сервер Тогда
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ДоверенныеЛицаУчастников);
	#КонецЕсли
КонецПроцедуры

&После("ПриУстановкеНовогоНомера")
Процедура ХМ_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	ХМ_ПодпискиНаСобытия.ХМ_НомераРешенийПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);	
КонецПроцедуры
