
// ХМНПФ 07.06.2018 КлименкоМИ // Новая ХМ_ДоговорОПСПриИзмененииНаСервере() // №1682
&НаСервере
Процедура ХМ_ДоговорОПСПриИзмененииНаСервере()
	СуммаНаСчете = 0;
	//найти сумму на счете
	Если Не Объект.ДоговорОПС.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезервыОПСОстатки.ДоговорОПС,
		|	РезервыОПСОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.уп_РезервыОПС.Остатки(&ДатаДок, ДоговорОПС = &ДоговорОПС) КАК РезервыОПСОстатки";
		
		Запрос.УстановитьПараметр("ДатаДок", КонецДня(Объект.Дата));
		Запрос.УстановитьПараметр("ДоговорОПС", Объект.ДоговорОПС);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
		    СуммаНаСчете = Выборка.СуммаОстаток;
		КонецЕсли;
	КонецЕсли;
	Элементы.ТекСумма.Заголовок = "Сумма на счете:     "+Формат(СуммаНаСчете,"ЧДЦ=2; ЧРГ=; ЧН=0") + " руб.";
КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 07.06.2018 КлименкоМИ // ПриСозданииНаСервере() // №1682
	// ХМНПФ 07.06.2018 КлименкоМИ // Новая ХМ_ДоговорОПСПриИзмененииНаСервере() // №1682
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура ХМПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		//Объект.Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
		//Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	#Удаление 
	ДоговорОПСПриИзмененииНаСервере();
	#КонецУдаления  
	#Вставка 
	// +ХМНПФ 07.06.2018 КлименкоМИ // ПриСозданииНаСервере() // №1682
	ХМ_ДоговорОПСПриИзмененииНаСервере();
	// -ХМНПФ 07.06.2018 КлименкоМИ // ПриСозданииНаСервере() // №1682	
	#КонецВставки
	мЭлемент=Элементы.ГруппаПечать;
	Для Каждого эл Из ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы Цикл
		Если эл.Имя="ФормаПечать" Тогда
			мЭлемент=эл;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры
