&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму();
КонецПроцедуры

Процедура ХМДополнитьФорму() 
	
	// ХМНПФ+ 14.12.2015 ЛыткинАМ // добавлена колонка ХМ_ДатаВОПУ //№81
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,"НаличиеФайлов.ЕстьФайлы КАК ЕстьФайлы","НаличиеФайлов.ЕстьФайлы КАК ЕстьФайлы, Документуп_ЗаявлениеЗЛОЕдиновременнойВыплате.ХМ_ДатаВОПУ КАК ХМ_ДатаВОПУ");
	// ХМНПФ+ 14.12.2015 ЛыткинАМ // добавлена колонка ХМ_ДатаВОПУ //№81
	
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ДатаВОПУ",Элементы.Список,"Список.ХМ_ДатаВОПУ");
		
КонецПроцедуры 

// ХМНПФ 13.01.2016 ШадринАВ // Новая ХМ_ПриОткрытии() // №130
&НаКлиенте
Процедура ХМ_ПриОткрытии()
	//ПриОткрытии();
	//+ ХМНПФ 07.05.2018 КлименкоМИ // Новая ХМ_ПолучитьФильтроватьЗаявления() // №1531		
	//--Если ПараметрыСеанса.ТекущийПользователь.ХМ_ФильтроватьЗаявления Тогда
	Если ХМ_ПолучитьФильтроватьЗаявления() Тогда
	//- ХМНПФ 07.05.2018 КлименкоМИ // Новая ХМ_ПолучитьФильтроватьЗаявления() // №1531			
		// отбор
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПринятоеРешение", , ВидСравненияКомпоновкиДанных.Равно, ,	Истина,	
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ХМ_ДатаВОПУ", '00010101000000', ВидСравненияКомпоновкиДанных.НеРавно, ,	Истина,	
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		//сортировка
		Список.Порядок.Элементы.Очистить();
		НовыйПорядок = Список.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		НовыйПорядок.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
		НовыйПорядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
		НовыйПорядок.Поле = Новый ПолеКомпоновкиДанных("ХМ_ДатаВОПУ");
		НовыйПорядок.Использование = Истина;
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

// ХМНПФ 07.05.2018 КлименкоМИ // Новая ХМ_ПолучитьФильтроватьЗаявления() // №1531
&НаСервере
Функция ХМ_ПолучитьФильтроватьЗаявления()
	Возврат ПараметрыСеанса.ТекущийПользователь.ХМ_ФильтроватьЗаявления;	
КонецФункции

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 14.12.2015 ЛыткинАМ // добавлена колонка ХМ_ДатаВОПУ // №81
	// ХМНПФ 13.01.2016 ШадринАВ // Новая ХМ_ПриОткрытии()  // №130 в типовой конфигурации нет ПриОткрытии()
	// ХМНПФ 13.01.2016 ШадринАВ // Новая ХМ_УстановитьДействияФормы()
	// ХМНПФ 13.01.2016 ШадринАВ // ПриСозданииНаСервере()
	// ХМНПФ 07.05.2018 КлименкоМИ // Новая ХМ_ПолучитьФильтроватьЗаявления() // №1531
КонецПроцедуры

&НаКлиенте
Процедура ХМПриОткрытииПосле(Отказ)
	// ХМНПФ 13.01.2016 ШадринАВ // Новая ХМ_УстановитьДействияФормы()
	ХМ_ПриОткрытии();
КонецПроцедуры
