
&НаСервере
&ИзменениеИКонтроль("РассчитатьРазмер")
Процедура ХМРассчитатьРазмер()
	БазаРасчета = Объект.Расшифровка.Итог("Сумма"); 
	Если Объект.Срок<>0 Тогда
		Объект.Размер = БазаРасчета/Объект.Срок;
#Вставка
	//ЛыткинАМ //https://redmine.npf.com/issues/4270
	Объект.Размер = ЦЕЛ(БазаРасчета/Объект.Срок*100)/100;
#КонецВставки
	Иначе
		Объект.Размер = 0;
		Если БазаРасчета<>0 Тогда 
			Сообщить("Не указан срок для расчета срочной выплаты");
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
&Перед("ПриОткрытии")
Процедура ХМПриОткрытии(Отказ)
	//ЛыткинАМ //https://redmine.npf.com/issues/4251
	ХМ_ПерваяВыплатаОтдельно = Истина;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПолучитьСрокПоТаблицеДожития")
Процедура ХМПолучитьСрокПоТаблицеДожития()
	МассивСообщений = Новый Массив; 
	Если ЗначениеЗаполнено(Объект.Заявление) Тогда
		ДатаНачалаВыплат = Объект.Заявление.Дата;
	Иначе
		ДатаНачалаВыплат = Объект.ДатаРасчета;
	КонецЕсли;	
	#Вставка
		//ЛыткинАМ //https://redmine.npf.com/issues/4251
		Объект.СрокДляРасчетаПожизненнойПенсии = уп_АктуарныеРасчеты.ОжидаемыйПериодДожитияВМесяцах(Объект.ТаблицаДожития, Объект.НомерСчета, ДатаНачалаВыплат, МассивСообщений, ХМ_ПерваяВыплатаОтдельно);
	#КонецВставки
	#Удаление
		Объект.СрокДляРасчетаПожизненнойПенсии = уп_АктуарныеРасчеты.ОжидаемыйПериодДожитияВМесяцах(Объект.ТаблицаДожития, Объект.НомерСчета, ДатаНачалаВыплат, МассивСообщений, Ложь);
	#КонецУдаления
	Если МассивСообщений.Количество()>0 Тогда
		Для а=1 по МассивСообщений.Количество() Цикл
			ТекстСообщения = МассивСообщений.Получить(а-1);
			Сообщить(ТекстСообщения,СтатусСообщения.Важное);
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры
