
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 15.01.2016 ШадринАВ // Новый реквизит ХМ_РазмерГП // №133
	// ХМНПФ+ 20.01.2016 ШадринАВ // Новый реквизит ХМ_ДатаГосПенсии // №138
КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму();
КонецПроцедуры

Процедура ХМДополнитьФорму()	
	
	СвойстваГруппы = Новый Структура();
	СвойстваГруппы.Вставить("ОтображатьЗаголовок", Ложь);
	СвойстваГруппы.Вставить("ВставитьПередЭлементом",Элементы.ГруппаПериодРазмер);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьОбычнуюГруппу(ЭтаФорма,"ХМ_ГосПенсия",Элементы.Расчет,СвойстваГруппы);

	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_РазмерГП",Элементы["ХМ_ГосПенсия"],"Объект.ХМ_РазмерГП");
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ДатаГосПенсии",Элементы["ХМ_ГосПенсия"],"Объект.ХМ_ДатаГосПенсии");
		
КонецПроцедуры