&НаСервере
Процедура ОбработкаКомандыНаСервере(ПараметрКоманды)          
	Для каждого НачислениеНДФЛ Из ПараметрКоманды Цикл
		НачислениеНДФЛ_Объект = НачислениеНДФЛ.ПолучитьОБъект();
		Если Ложь Тогда НачислениеНДФЛ_Объект = Документы.уп_НачислениеНДФЛ.СоздатьДокумент(); КонецЕсли;
		МассивНаУдаление = Новый Массив();
		Для каждого СтрокаНДФЛ Из НачислениеНДФЛ_Объект.НДФЛ Цикл
			Если СтрокаНДФЛ.Налог <= 1 И СтрокаНДФЛ.Налог>=-1 Тогда
				МассивНаУдаление.Добавить(СтрокаНДФЛ);	
			КонецЕсли;
		КонецЦикла;                                   
		Для каждого СтрокаНДФЛ Из МассивНаУдаление Цикл
			УдалитьВычеты = НачислениеНДФЛ_Объект.ПримененныеВычетыНаДетейИИмущественные.НайтиСтроки(Новый Структура("ИдентификаторСтрокиНДФЛ",СтрокаНДФЛ.ИдентификаторСтрокиНДФЛ));
			Для каждого СтрокаВычета Из УдалитьВычеты Цикл
				НачислениеНДФЛ_Объект.ПримененныеВычетыНаДетейИИмущественные.Удалить(СтрокаВычета);
			КонецЦикла;
			НачислениеНДФЛ_Объект.НДФЛ.Удалить(СтрокаНДФЛ);
		КонецЦикла;                                   
		МассивНаУдаление = Новый Массив();
		Для каждого СтрокаНач Из НачислениеНДФЛ_Объект.Начисления Цикл
			Если НачислениеНДФЛ_Объект.НДФЛ.НайтиСтроки(Новый Структура("ФизическоеЛицо",СтрокаНач.ФизЛицо)).Количество() = 0 Тогда
				МассивНаУдаление.Добавить(СтрокаНач);	
			КонецЕсли;
		КонецЦикла;                                   
		Для каждого СтрокаНач Из МассивНаУдаление Цикл
			НачислениеНДФЛ_Объект.Начисления.Удалить(СтрокаНач);
		КонецЦикла;                                   
		НачислениеНДФЛ_Объект.Записать();	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОбработкаКомандыНаСервере(ПараметрКоманды);	
	Сигнал();
КонецПроцедуры
