
&НаСервере
&ИзменениеИКонтроль("ЗаполнитьТЧПоДокументуОснованию")
Процедура ХМЗаполнитьТЧПоДокументуОснованию()
	Если Объект.ЭтоНераспределенныйПлатеж Тогда
		Возврат;
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	//если к поступлению привязано начисление резервов, то заполняем по нему
	//если нет, то по расшифровке платежа 
	//ищем начисление резрвов 
	Объект.СписокСчетов.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_НачислениеРезервовПлВходящие.Ссылка,
	|	уп_НачислениеРезервовПлВходящие.ДокументОснование,
	|	СУММА(уп_НачислениеРезервовПлВходящие.СуммаВзноса) КАК СуммаВзноса
	|ИЗ
	|	Документ.уп_НачислениеРезервов.ДокументыОснования КАК уп_НачислениеРезервовПлВходящие
	|ГДЕ
	|	уп_НачислениеРезервовПлВходящие.ДокументОснование = &ПлПоручениеВходящее
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_НачислениеРезервовПлВходящие.Ссылка,
	|	уп_НачислениеРезервовПлВходящие.ДокументОснование";

	Запрос.УстановитьПараметр("ПлПоручениеВходящее", Объект.ДокументОснование);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда
		НачислениеРезервов = Выборка.Ссылка;
		Для Каждого стр из НачислениеРезервов.ДокументыОснования Цикл
			ДоговорКонтрагента = стр.ДоговорКонтрагента;
			ДоговорПДС = ДоговорКонтрагента.уп_Договор;
#Вставка
			//ЛыткинАМ //24.01.2025 //https://redmine.npf.com/issues/4024
			Если Не ТипЗнч(ДоговорПДС) = Тип("СправочникСсылка.пдс_ДоговорыПДС") Тогда
				ДоговорПДС = Неопределено;
			КонецЕсли;
#КонецВставки
			Если ЗначениеЗаполнено(ДоговорПДС) Тогда  
				Если ДоговорПДС.ТипДоговора = Перечисления.пдс_ТипыДоговоровПДС.ВПользуТретьихЛиц Тогда
					СписокПС = ПолучитьПСПоДоговору(ДоговорПДС); 
					Если СписокПС.Количество()>0 Тогда
						СуммаНаПС = стр.СуммаВзноса/СписокПС.Количество();
						Для а = 0 по СписокПС.Количество()-1 Цикл 
							ПС = СписокПС.Получить(а);
							НовСтр = Объект.СписокСчетов.Добавить();
							НовСтр.НомерСчета = ПС;
							НовСтр.СуммаВзноса = СуммаНаПС; 
						КонецЦикла;
					Иначе
						НовСтр = Объект.СписокСчетов.Добавить();
						НовСтр.НомерСчета = ДоговорПДС.ПенсионныйСчет;
						НовСтр.СуммаВзноса = стр.СуммаВзноса; 
					КонецЕсли; 
				Иначе 
					НовСтр = Объект.СписокСчетов.Добавить();
					НовСтр.НомерСчета = ДоговорПДС.ПенсионныйСчет;
					НовСтр.СуммаВзноса = стр.СуммаВзноса; 
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
	Иначе
		Платежка = Объект.ДокументОснование;
		Для Каждого стр из Платежка.РасшифровкаПлатежа Цикл
			ДоговорКонтрагента = стр.ДоговорКонтрагента;
			ДоговорПДС = ДоговорКонтрагента.уп_Договор;
#Вставка
			//ЛыткинАМ //24.01.2025 //https://redmine.npf.com/issues/4024
			Если Не ТипЗнч(ДоговорПДС) = Тип("СправочникСсылка.пдс_ДоговорыПДС") Тогда
				ДоговорПДС = Неопределено;
			КонецЕсли;
#КонецВставки
			Если ЗначениеЗаполнено(ДоговорПДС) Тогда  
				Если ДоговорПДС.ТипДоговора = Перечисления.пдс_ТипыДоговоровПДС.ВПользуТретьихЛиц Тогда
					СписокПС = ПолучитьПСПоДоговору(ДоговорПДС); 
					Если СписокПС.Количество()>0 Тогда
						СуммаНаПС = стр.СуммаПлатежа/СписокПС.Количество();
						Для а = 0 по СписокПС.Количество()-1 Цикл 
							ПС = СписокПС.Получить(а);
							НовСтр = Объект.СписокСчетов.Добавить();
							НовСтр.НомерСчета = ПС;
							НовСтр.СуммаВзноса = СуммаНаПС; 
						КонецЦикла;
					Иначе
						НовСтр = Объект.СписокСчетов.Добавить();
						НовСтр.НомерСчета = ДоговорПДС.ПенсионныйСчет;
						НовСтр.СуммаВзноса = стр.СуммаПлатежа; 
					КонецЕсли; 
				Иначе 
					НовСтр = Объект.СписокСчетов.Добавить();
					НовСтр.НомерСчета = ДоговорПДС.ПенсионныйСчет;
					НовСтр.СуммаВзноса = стр.СуммаПлатежа; 
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры
