
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 23.01.2019 ГригорьевМА // ДобавитьКомандыПечати() // №2003
КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьКомандыПечати")
Процедура ХМДобавитьКомандыПечати(КомандыПечати)

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Итоги";
	КомандаПечати.Представление = НСтр("ru = 'Итоги по типам сумм'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента,уф_ФормаСписка";
	КомандаПечати.Порядок = 20;
	
	#Вставка
	// +ХМНПФ 23.01.2019 ГригорьевМА // ДобавитьКомандыПечати() // №2003
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "КорректировкаНомераДоговораОПСвФайлеXMLотПФР";
	КомандаПечати.Представление = НСтр("ru = 'Корректировка номера договора ОПС в файле XML от ПФР'");
    КомандаПечати.Обработчик    = "ХМ_ОбщийМодульПечатныеФормы.ОбработкаКомандыПечатиКорректировкиНомераДоговораОПСвФайлеXMLотПФР";
	КомандаПечати.СписокФорм    = "уф_ФормаДокумента";
	КомандаПечати.Порядок = 30;
	// -ХМНПФ 23.01.2019 ГригорьевМА // ДобавитьКомандыПечати() // №2003
	#КонецВставки

КонецПроцедуры

