
&НаСервере
&После("РассчитатьНаСервере")
Процедура ХМРассчитатьНаСервере()
	//https://redmine.npf.com/issues/3971
	ЗаполнитьПолучателиНаСервере();
КонецПроцедуры

&НаСервере
&После("ЗаполнитьПолучателиНаСервере")
Процедура ХМЗаполнитьПолучателиНаСервере()
	//https://redmine.npf.com/issues/3971
	Выбыл = (Объект.ВидРасторженияДоговора = Перечисления.уп_ВидыРасторжения.ПоСмерти);  
	
	Если Выбыл Тогда   
		
		тзПолучатели = Объект.Получатели.Выгрузить();
		
		ЕстьВыплаты = Ложь;
		
		Для Каждого Стр Из тзПолучатели Цикл 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	уп_ПрочиеНачисленияОбороты.Участник КАК Участник,
			|	СУММА(уп_ПрочиеНачисленияОбороты.СуммаПриход) КАК СуммаПриход
			|ИЗ
			|	РегистрНакопления.уп_ПрочиеНачисления.Обороты(
			|			&начМомВремени,
			|			&МомВремени,
			|			Регистратор,
			|			ТипРезерва В (&СписокТиповРезерва)
			|				И Участник = &Участник
			|				И ТипВыплаты = &ТипВыплаты
			|				И НомерСчета.Участник = &Умерший) КАК уп_ПрочиеНачисленияОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	уп_ПрочиеНачисленияОбороты.Участник";
			
			Запрос.УстановитьПараметр("МомВремени", Объект.Дата-1);
			Запрос.УстановитьПараметр("начМомВремени", Объект.РегистрирующийДокумент.ДатаСмерти); 
			
			СписокТиповРезерва = Новый СписокЗначений;
			СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.ИПС);
			СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.СПС);
			СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.ПожизненныхВыплат);
			Запрос.УстановитьПараметр("СписокТиповРезерва", СписокТиповРезерва);
			Запрос.УстановитьПараметр("ТипВыплаты", Перечисления.уп_ТипыВыплат.ВыплатыНаследникам);
			Запрос.УстановитьПараметр("Участник", Стр.Получатель);
			Запрос.УстановитьПараметр("Умерший", Объект.Участник);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
				
				Стр.СуммаВыплаты = Стр.СуммаВыплаты - ВыборкаДетальныеЗаписи.СуммаПриход;
				Стр.СуммаВНачале = Стр.СуммаВНачале - ВыборкаДетальныеЗаписи.СуммаПриход;
				Стр.НБВНачале    = Стр.НБВНачале - ВыборкаДетальныеЗаписи.СуммаПриход;
				Стр.НБ = Стр.НБ - ВыборкаДетальныеЗаписи.СуммаПриход;
				
				ЕстьВыплаты = Истина;

			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьВыплаты Тогда    
			Объект.Получатели.Загрузить(тзПолучатели);
		КонецЕсли;

	КонецЕсли;	
	
КонецПроцедуры
