

//СтрокаПравилСервер

Процедура KU_ДолгПоНачислениям_ЗагрузитьВРегистр(ДеревоНаСервере,ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	ДокументКомментарий ="Долги по начислениям Каспер";

	Организация =Справочники.Организации.НайтиПоНаименованию("Ханты-Мансийский НПФ АО");
	
	Для каждого ВыборкаПериод Из ДеревоНаСервере.Строки Цикл
		
		Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
			ОперацияНПО = Документы.уп_ОперацияНПО.СоздатьДокумент();
		    ОперацияНПО.ВидРучнойОперации=Справочники.уп_ВидыРучныхОперацийНПФ.НайтиПоКоду("000000023"); 
			ОперацияНПО.Дата = ВыборкаПериод.OPER_DATE - 5;
			ОперацияНПО.Организация=Справочники.Организации.НайтиПоНаименованию("Ханты-Мансийский НПФ АО"); 
			ОперацияНПО.Комментарий = ДокументКомментарий;
		    ОперацияНПО.Содержание = ДокументКомментарий;
			ОперацияНПО.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователи.ТекущийПользователь(), "ОсновнойОтветственный"); 
			ОперацияНПО.Записать(РежимЗаписиДокумента.Запись); 
		Иначе
			ОперацияНПО = ОперацияНПОСсылка.ПолучитьОбъект();
		КонецЕсли;

		//запись в регистр уп_НачисленияПенсий
		НаборЗаписей = РегистрыНакопления.уп_НачисленияПенсий.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Регистратор.Установить(ОперацияНПО.Ссылка);  
		
		
		Для каждого СтрокаДанных Из ВыборкаПериод.Строки Цикл 
			Если Не ЗначениеЗаполнено(СтрокаДанных.Счет) Тогда
				Продолжить;
			КонецЕсли;
			НоваяЗапись = НаборЗаписей.Добавить();  
			НоваяЗапись.Активность = Истина;   
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход; 
			НоваяЗапись.Период     = ОперацияНПО.Дата;
			НоваяЗапись.НачПериода = СтрокаДанных.oper_begin_o;
			НоваяЗапись.КонПериода = КонецМесяца(СтрокаДанных.oper_begin_o);
			НоваяЗапись.Регистратор = ОперацияНПО.Ссылка;
			НоваяЗапись.НомерСчета = СтрокаДанных.Счет;  
			НоваяЗапись.ДнейВПериоде = День(КонецМесяца(СтрокаДанных.oper_begin_o));
	        НоваяЗапись.Сумма = СтрокаДанных.oper_sum;  
	        НоваяЗапись.Схема = СтрокаДанных.Схема;	
			НоваяЗапись.ТипРезерва =СтрокаДанных.ТипРезерваСписания;
			НоваяЗапись.ТипСуммы =СтрокаДанных.ТипСумм; 
			НоваяЗапись.ТипРезерваНачисления =СтрокаДанных.ТипРезерваСписания;
			НоваяЗапись.НомерСчетаНачисления = СтрокаДанных.СчетИсточник; 
			
		КонецЦикла;
		ТабНачислений = НаборЗаписей.Выгрузить();

		ТабРезервовНПО = Документы.уп_ВозвратПенсий.ДвиженияПоРезервамНПО(ОперацияНПО.Ссылка, ОперацияНПО.Дата, Организация, ТабНачислений, , , Истина);
		
		//запись в регистр уп_Резервы
		НаборЗаписейРезервы = РегистрыНакопления.уп_Резервы.СоздатьНаборЗаписей(); 
		НаборЗаписейРезервы.Отбор.Регистратор.Установить(ОперацияНПО.Ссылка);  

		Для каждого СтрокаРезервов Из ТабРезервовНПО Цикл
			СтрокаРезерыНачислений = НаборЗаписейРезервы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезерыНачислений,СтрокаРезервов);
			СтрокаРезерыНачислений.ВидДвижения = ВидДвиженияНакопления.Приход;
			                                                                     
			СтрокаРезерыНачислений = НаборЗаписейРезервы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезерыНачислений,СтрокаРезервов);
			СтрокаРезерыНачислений.ВидДвижения = ВидДвиженияНакопления.Расход;
			СтрокаРезерыНачислений.ТипРезерва = СтрокаРезервов.ТипРезерваИсх;
		КонецЦикла;
	
		НаборЗаписей.Записать();
		НаборЗаписейРезервы.Записать();		
		ОперацияНПО.Записать(РежимЗаписиДокумента.Запись); 
	    ДокументОстатков = ОперацияНПО.Ссылка;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Выполнена загрузка "+ ДокументКомментарий + " в "+ДокументОстатков;
		Сообщение.КлючДанных = ДокументОстатков;
		Сообщение.Сообщить();
	КонецЦикла;
	
КонецПроцедуры

Процедура KU_ДолгПоЗадолженности_ЗагрузитьВРегистр(ДеревоНаСервере,ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	ДокументКомментарий ="Долги по задолженности Каспер";

	Организация =Справочники.Организации.НайтиПоНаименованию("Ханты-Мансийский НПФ АО");
	
	Для каждого ВыборкаПериод Из ДеревоНаСервере.Строки Цикл
		
		Если Не ЗначениеЗаполнено(ОперацияНПОСсылка) Тогда
			ОперацияНПО = Документы.уп_ОперацияНПО.СоздатьДокумент();
		    ОперацияНПО.ВидРучнойОперации=Справочники.уп_ВидыРучныхОперацийНПФ.НайтиПоКоду("000000023"); 
			ОперацияНПО.Дата = ВыборкаПериод.OPER_DATE - 5;
			ОперацияНПО.Организация=Справочники.Организации.НайтиПоНаименованию("Ханты-Мансийский НПФ АО"); 
			ОперацияНПО.Комментарий = ДокументКомментарий;
		    ОперацияНПО.Содержание = ДокументКомментарий;
			ОперацияНПО.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователи.ТекущийПользователь(), "ОсновнойОтветственный"); 
			ОперацияНПО.Записать(РежимЗаписиДокумента.Запись); 
		Иначе
			ОперацияНПО = ОперацияНПОСсылка.ПолучитьОбъект();
		КонецЕсли;
				
		НаборЗаписей = РегистрыНакопления.уп_ЗадолженностьПоПенсиям.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Регистратор.Установить(ОперацияНПО.Ссылка);  
		
		
		Для каждого СтрокаДанных Из ВыборкаПериод.Строки Цикл 
			Если Не ЗначениеЗаполнено(СтрокаДанных.Счет) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяЗапись = НаборЗаписей.ДобавитьПриход();  
			НоваяЗапись.Активность = Истина;
			
			НоваяЗапись.Счетчик = 1;
			НоваяЗапись.НомерСчета = СтрокаДанных.Счет;
			НоваяЗапись.Регистратор = ОперацияНПО.Ссылка;
			НоваяЗапись.Период = ОперацияНПО.Дата;
			НоваяЗапись.НачалоПериода = СтрокаДанных.oper_begin;
			НоваяЗапись.КонецПериода = СтрокаДанных.oper_end;
			НоваяЗапись.СуммаПенсии = СтрокаДанных.oper_sum;
			
		КонецЦикла;
		НаборЗаписей.Записать();
		ОперацияНПО.Записать(РежимЗаписиДокумента.Запись); 
	    ДокументОстатков = ОперацияНПО.Ссылка;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Выполнена загрузка "+ ДокументКомментарий + " в "+ДокументОстатков;
		Сообщение.КлючДанных = ДокументОстатков;
		Сообщение.Сообщить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиТДНаФорму(ДеревоНаСервере,ОперацияНПОСсылка = Неопределено, СтрокаПравилСервер = Неопределено) Экспорт
	
	//ДополнительныеПараметры.С1_РезультатыЗапроса.Добавить(Новый Структура("Имя, ТекстЗапроса, ТЗ",
	//			СтрокаТаблицы.ПредставлениеТаблицы +":"+ СтруктураЗагрузкиКлиент.МетаданныеЗначения_Имя + " (" + ПолучитьМетаТип_по_ТипОбъекта(СтрокаТаблицы.ТипОбъекта)+СтрокаТаблицы.ИмяТаблицы+")",СтруктураЗагрузкиКлиент.ТекстЗапроса,СтруктураЗагрузкиКлиент.ТЗ));
	//РезультатЗагрузки.Результат = Истина; 
	Если СтрокаПравилСервер = Неопределено Тогда
		СтрокаПравилСервер = Новый Структура();		
	КонецЕсли;
	
	Если ТипЗнч(ДеревоНаСервере) = Тип("ДеревоЗначений") ИЛИ ТипЗнч(ДеревоНаСервере) = Тип("ТаблицаЗначений") Тогда
		ПострПечать = Новый ПостроительОтчета;
		Если СтрокаПравилСервер.Свойство("ТекстЗапроса") Тогда
			ПострПечать.ТекстЗаголовка = СтрокаПравилСервер.ТекстЗапроса;
	    КонецЕсли;
		ПострПечать.ИсточникДанных = Новый ОписаниеИсточникаДанных(ДеревоНаСервере); 
	    ПострПечать.Выполнить();
	    Для каждого Колонка Из ПострПечать.ВыбранныеПоля Цикл
	        Колонка.Представление = ДеревоНаСервере.Колонки[Колонка.Имя].Заголовок;
		КонецЦикла;         
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ПострПечать.Вывести(ТабличныйДокумент);
		СтрокаПравилСервер.Вставить("ТабличныйДокумент",ТабличныйДокумент);
	ИначеЕсли  ТипЗнч(ДеревоНаСервере) = Тип("ТабличныйДокумент") Тогда;
		ТабличныйДокумент = ДеревоНаСервере;
		СтрокаПравилСервер.Вставить("ТабличныйДокумент",ТабличныйДокумент);
	Иначе
		СтрокаПравилСервер.Вставить("ТабличныйДокумент",Новый ТабличныйДокумент);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПечатьДерева(ТабДок,Секция,СтрокаДерева,Уровень = 0,Колонки)
    Для Каждого стр Из СтрокаДерева.Строки Цикл
        НомерКолонки = 0;
        отступ = "";
        Для н = 1 По Уровень Цикл   
            отступ = отступ + " ";
        КонецЦикла;
        Для Каждого КЛ Из Колонки Цикл
            НомерКолонки = НомерКолонки + 1;
            Секция.Область(1, НомерКолонки).Текст = ?(НомерКолонки = 1, отступ+стр[КЛ.Имя], стр[КЛ.Имя]);
        КонецЦикла;
        ТабДок.Вывести(Секция,Уровень+1);
        ПечатьДерева(ТабДок,Секция,стр,Уровень+1,Колонки);
    КонецЦикла;
КонецПроцедуры