
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 25.01.2019 ШадринАВ // ПолучитьСписокВидимыхКолонов_ДоговорыОПС() // №2010
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПолучитьСписокВидимыхКолонов_ДоговорыОПС")
Функция ХМПолучитьСписокВидимыхКолонов_ДоговорыОПС()
	ПутьКДаннымТаблицы = Элементы.ДоговорыОПС.ПутьКДанным + ".";

	Массив = Новый Массив;
	#Удаление 
	Массив.Добавить("НомерСтроки");		
	#КонецУдаления
	#Вставка		
	// +ХМНПФ 25.01.2019 ШадринАВ // ПолучитьСписокВидимыхКолонов_ДоговорыОПС() // №2010
	Массив.Добавить("Объект.ДоговорыОПС.НомерСтроки");
	// -ХМНПФ 25.01.2019 ШадринАВ // ПолучитьСписокВидимыхКолонов_ДоговорыОПС() // №2010
	#КонецВставки
	Если Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма10 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ОснованиеПрекращения");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма11 ИЛИ Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма32 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма12 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ПлатежныйДокумент");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма14 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "Заявление");
		Массив.Добавить(ПутьКДаннымТаблицы + "ВидВыплаты");
		Массив.Добавить(ПутьКДаннымТаблицы + "Сумма");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма15 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "Получатель");
		Массив.Добавить(ПутьКДаннымТаблицы + "ДокументРегистрации");
		Массив.Добавить(ПутьКДаннымТаблицы + "Документ");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма16 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "Организация");	
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма17 Тогда 
		Массив.Добавить(ПутьКДаннымТаблицы + "Организация");	
		Массив.Добавить(ПутьКДаннымТаблицы + "Счет");	
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма18 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗапросВПФР");
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма30 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "НужнаВыпискаЕРЗЛ");
		Массив.Добавить(ПутьКДаннымТаблицы + "НужныСведенияОВзносах");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма37 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "Сумма");
		Массив.Добавить(ПутьКДаннымТаблицы + "СуммаВыплаты");
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма38
		ИЛИ Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма39
		ИЛИ Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма45 Тогда
		Массив.Добавить(ПутьКДаннымТаблицы + "ДоговорОПС");
		Массив.Добавить(ПутьКДаннымТаблицы + "ЗастрахованноеЛицо");
		Массив.Добавить(ПутьКДаннымТаблицы + "СНИЛС");
		Массив.Добавить(ПутьКДаннымТаблицы + "Заявление");
	КонецЕсли;

	Возврат Массив;
КонецФункции
