// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
Функция ПолучитьРасширенныйСписокПенсионеров(ИмяТаблицы = "ТабСчетовПоПериодам")
	Запрос = Новый Запрос;
	Если ИмяТаблицы = "ТабСчетовПоПериодам" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	НачислениеПенсийСписокПенсионеров.Ссылка КАК Ссылка,
		               |	НачислениеПенсийСписокПенсионеров.НомерСтроки КАК НомерСтроки,
		               |	НачислениеПенсийСписокПенсионеров.ПенсионныйДоговор КАК ПенсионныйДоговор,
		               |	НачислениеПенсийСписокПенсионеров.НомерСчета КАК НомерСчета,
		               |	НачислениеПенсийСписокПенсионеров.Участник КАК Участник,
		               |	НачислениеПенсийСписокПенсионеров.Сумма КАК Сумма,
		               |	НачислениеПенсийСписокПенсионеров.НачалоПериодаНачисления КАК НачалоПериодаНачисления,
		               |	НачислениеПенсийСписокПенсионеров.КонецПериодаНачисления КАК КонецПериодаНачисления,
		               |	НачислениеПенсийСписокПенсионеров.Схема КАК Схема,
		               |	НачислениеПенсийСписокПенсионеров.Периодичность КАК Периодичность,
		               |	НачислениеПенсийСписокПенсионеров.Доплата КАК Доплата,
		               |	НачислениеПенсийСписокПенсионеров.Пенсия КАК Пенсия,
		               |	НачислениеПенсийСписокПенсионеров.ЭтоВосстановлениеЗадолженности КАК ЭтоВосстановлениеЗадолженности,
		               |	НачислениеПенсийСписокПенсионеров.ТипПенсии КАК ТипПенсии,
		               |	НачислениеПенсийСписокПенсионеров.НомерСчета.Участник.уп_ФизЛицо КАК НомерСчетаУчастникуп_ФизЛицо,
		               |	НачислениеПенсийСписокПенсионеров.НомерСчета.Владелец.Организация КАК НомерСчетаВладелецОрганизация,
		               |	НачислениеПенсийСписокПенсионеров.НомерСчета.Участник КАК НомерСчетаУчастник,
		               |	НачислениеПенсийСписокПенсионеров.НомерСчета.Владелец КАК НомерСчетаВладелец,
		               |	НачислениеПенсийСписокПенсионеров.НомерСчета.Владелец.ПенсионныйСчет КАК НомерСчетаВладелецПенсионныйСчет
					   |ИЗ
		               |	Документ.уп_НачислениеПенсий.СписокПенсионеров КАК НачислениеПенсийСписокПенсионеров
		               |ГДЕ
		               |	НачислениеПенсийСписокПенсионеров.Ссылка = &Ссылка";
		
	КонецЕсли;

	Запрос.УстановитьПараметр("Ссылка",Ссылка); 
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура НПФ_ОбработкаПроведения(Отказ, Режим)
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	// Проверка ручной корректировки
	Если уп_ОсновнаяПоставкаСервер.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект,Ложь) Тогда
		Возврат
	КонецЕсли;
	ТабБухУчет = уп_ОбщегоНазначенияУчетРезервов.СформироватьСтруктуруТаблицыБУ();
	СрезПенсионныхПравил = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
	ПроводкиПоНачислению = СрезПенсионныхПравил.ПроводкиПоНачислению;
	ВестиУчетПСпоТипамДоговоровЕПС = СрезПенсионныхПравил.ВестиУчетПСпоТипамДоговоровЕПС;
	МассивСообщений = Новый СписокЗначений;
	Отказ = Ложь;
	ДатаНачалаУчетаРезервовНачисления = Константы.уп_ДатаНачалаВеденияРезервовНачисленияНПО.Получить();
	Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И Дата>=ДатаНачалаУчетаРезервовНачисления Тогда
		лУчетРезервовНачисленияНПО = Истина;	
	Иначе
		лУчетРезервовНачисленияНПО = Ложь;	
	КонецЕсли;
	ДатаНачалаВеденияУчетаПоСхемам = Константы.уп_УчетРезерваНПОвРазрезеСхем.Получить();
	Если ЗначениеЗаполнено(ДатаНачалаВеденияУчетаПоСхемам) И ДатаНачалаВеденияУчетаПоСхемам<=Дата Тогда
		ВестиУчетПоСхемам = Истина;
	Иначе
		ВестиУчетПоСхемам = Ложь;
	КонецЕсли;	
	
	//КодДохода = РегистрыСведений.КодыДоходовУчастников.ПолучитьПоследнее(Дата,Новый Структура("ВидДохода",Перечисления.ВидыДоходовУчастников.Пенсия)).КодДохода;
    КодДохода = ПланыВидовРасчета.Начисления.уп_Пенсия.КодДоходаНДФЛ;
	
	Если НЕ ЗначениеЗаполнено(КодДохода) Тогда
		//СообщитьОбОшибке("В регистре сведений Коды доходов Участников не указан код дохода для пенсионных выплат.",,Заголовок);
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("В плане видов характеристик Основные начисления организации не указан код дохода для пенсионных выплат.",,Заголовок);
		Отказ = Истина;
	КонецЕсли;
	
	ТЗДляПроверки = ЭтотОбъект.СписокПенсионеров.Выгрузить();
	ТЗДляПроверки.Свернуть("НачалоПериодаНачисления, КонецПериодаНачисления, Периодичность"); 
	
	ЕстьОщибки = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("НачалоПериодаНачисления", Дата('00010101')); 

	Если ТЗДляПроверки.НайтиСтроки(ПараметрыОтбора).Количество() > 0 Тогда
		
		Сообщить("В табличной части основные сведения есть пустые даты в колонке: начало периода начисления");
		
		ЕстьОщибки = Истина;
		
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("КонецПериодаНачисления", Дата('00010101')); 

	Если ТЗДляПроверки.НайтиСтроки(ПараметрыОтбора).Количество() > 0 Тогда
		
		Сообщить("В табличной части основные сведения есть пустые даты в колонке: конец периода начисления");
		
		ЕстьОщибки = Истина;
		
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Периодичность", Перечисления.уп_ПериодичностьВыплат.ПустаяСсылка()); 

	Если ТЗДляПроверки.НайтиСтроки(ПараметрыОтбора).Количество() > 0 Тогда
		
		Сообщить("В табличной части основные сведения есть пустые значения в колонке: периодичность выплаты");
		
		ЕстьОщибки = Истина;
		
	КонецЕсли;
	
	
	Если  ЕстьОщибки Тогда 
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТЗСол = Новый ТаблицаЗначений;
	ТЗСол.Колонки.Добавить("НомерСчета");
	ТЗСол.Колонки.Добавить("Схема");
	ТЗСол.Колонки.Добавить("ТипПенсии");
	ТЗСол.Колонки.Добавить("ПенсионныйДоговор");
	ТЗСол.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТЗСол.Колонки.Добавить("НалоговаяБаза", Новый ОписаниеТипов("Число"));

	ТЗСол.Колонки.Добавить("МожноСписать", Новый ОписаниеТипов("Число"));

	#Вставка
	// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
	ТЗСол.Колонки.Добавить("НомерСчетаДоговора");
	#КонецВставки
	
	//проверим у всех ли схем задан порядок списания
	ТабСхем = СписокПенсионеров.Выгрузить();
	ТабСхем.Свернуть("Схема, ТипПенсии");
	ТабСхем.Колонки.Добавить("ИПС", Новый ОписаниеТипов("Булево"));
	ТабСхем.Колонки.Добавить("СПС", Новый ОписаниеТипов("Булево"));
	ТабСхем.Колонки.Добавить("РПВ", Новый ОписаниеТипов("Булево"));
	
	#Удаление
	//ТабСчетов = СписокПенсионеров.Выгрузить();
	//ТабСчетов.Свернуть("ПенсионныйДоговор,НомерСчета,Схема, ТипПенсии", "Сумма");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_НачислениеПенсийСписокПенсионеров.ПенсионныйДоговор КАК ПенсионныйДоговор,
	|	уп_НачислениеПенсийСписокПенсионеров.НомерСчета КАК НомерСчета,
	|	СУММА(уп_НачислениеПенсийСписокПенсионеров.Сумма) КАК Сумма,
	|	уп_НачислениеПенсийСписокПенсионеров.Схема КАК Схема,
	|	уп_НачислениеПенсийСписокПенсионеров.ТипПенсии КАК ТипПенсии
	|ПОМЕСТИТЬ ВТ_ТабСчетов
	|ИЗ
	|	Документ.уп_НачислениеПенсий.СписокПенсионеров КАК уп_НачислениеПенсийСписокПенсионеров
	|ГДЕ
	|	уп_НачислениеПенсийСписокПенсионеров.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_НачислениеПенсийСписокПенсионеров.ПенсионныйДоговор,
	|	уп_НачислениеПенсийСписокПенсионеров.НомерСчета,
	|	уп_НачислениеПенсийСписокПенсионеров.Схема,
	|	уп_НачислениеПенсийСписокПенсионеров.ТипПенсии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ЛьготыПоНДФЛСрезПоследних.НомерСчета КАК НомерСчета,
	|	уп_ЛьготыПоНДФЛСрезПоследних.ПенсиюИсключатьИзНБ КАК ПенсиюИсключатьИзНБ
	|ПОМЕСТИТЬ ВТ_НалоговаяБаза
	|ИЗ
	|	РегистрСведений.уп_ЛьготыПоНДФЛ.СрезПоследних(
	|			&ДатаДок,
	|			НомерСчета В
	|				(ВЫБРАТЬ
	|					ВТ_ТабСчетов.НомерСчета
	|				ИЗ
	|					ВТ_ТабСчетов)) КАК уп_ЛьготыПоНДФЛСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТабСчетов.ПенсионныйДоговор КАК ПенсионныйДоговор,
	|	ВТ_ТабСчетов.НомерСчета КАК НомерСчета,
	|	ВТ_ТабСчетов.Сумма КАК Сумма,
	|	ВТ_ТабСчетов.Схема КАК Схема,
	|	ВТ_ТабСчетов.ТипПенсии КАК ТипПенсии,
	|	ЕСТЬNULL(ВТ_НалоговаяБаза.ПенсиюИсключатьИзНБ, ЛОЖЬ) КАК ИсключатьИзНБ
	|ИЗ
	|	ВТ_ТабСчетов КАК ВТ_ТабСчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НалоговаяБаза КАК ВТ_НалоговаяБаза
	|		ПО ВТ_ТабСчетов.НомерСчета = ВТ_НалоговаяБаза.НомерСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_НалоговаяБаза
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ТабСчетов";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаДок", Дата);
	Результат = Запрос.Выполнить();
	
	ТабСчетов = Результат.Выгрузить();
	#КонецУдаления
	#Вставка
	ТабСчетов = СписокПенсионеров.Выгрузить();
	ТабСчетов.Свернуть("ПенсионныйДоговор,НомерСчета,Схема, ТипПенсии", "Сумма");
	// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
	ТабСчетов = ПолучитьРасширенныйСписокПенсионеров();
	ТабСчетов.Свернуть("ПенсионныйДоговор,НомерСчета,Схема, ТипПенсии, НомерСчетаУчастникуп_ФизЛицо, НомерСчетаВладелецОрганизация, НомерСчетаУчастник, НомерСчетаВладелец, НомерСчетаВладелецПенсионныйСчет", "Сумма");
	ТабСчетов.Индексы.Добавить("НомерСчета");
	#КонецВставки
	ТабСчетов.Колонки.Добавить("НалоговаяБаза", Новый ОписаниеТипов("Число"));
	ТабСчетов.Колонки.Добавить("МожноСписать", Новый ОписаниеТипов("Число"));
	ТабСчетов.Колонки.Добавить("СуммаДог", Новый ОписаниеТипов("Число"));

	ТабСчетов.Колонки.Добавить("СуммаИзРПВ", Новый ОписаниеТипов("Число"));
	ТабСчетов.Колонки.Добавить("ТаблицаИсточников", Новый ОписаниеТипов("ТаблицаЗначений"));
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("НачалоПериода");
	ТЗ.Колонки.Добавить("КонецПериода");
	ТЗ.Колонки.Добавить("ДнейВПериоде");
	ТЗ.Колонки.Добавить("ПериодРегистрации");
	ТЗ.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТЗ.Колонки.Добавить("Сумма2", Новый ОписаниеТипов("Число"));
	
	Для Каждого стр из ТабСхем Цикл
		ТекСхема = стр.Схема;
		Порядок_ИПС = ТекСхема.ИсточникиВыплат_ИПС.Выгрузить();
		Порядок_СПС = ТекСхема.ИсточникиВыплат_СПС.Выгрузить();
		Если (Порядок_ИПС.Количество() = 0) и (Порядок_СПС.Количество() = 0) Тогда
			Если ТекСхема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат 
				или стр.ТипПенсии = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
				//посмотрим порядок ведения резерва ПВ
				ПорядокВеденияРПВ = уп_НПФ.ОпределитьПорядокВеденияПожизненногоРезерва(ТекСхема, Дата);
				Если ПорядокВеденияРПВ = Перечисления.уп_РезервПожизненныхВыплат.БезАналитики Тогда
					стр.РПВ = Истина;
				КонецЕсли;	
			Иначе	
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У схемы "+ТекСхема.Код+" не установлены источники выплат.",,Заголовок);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		Иначе
			Если ТекСхема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат 
				или стр.ТипПенсии = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
				//посмотрим порядок ведения резерва ПВ
				ПорядокВеденияРПВ = уп_НПФ.ОпределитьПорядокВеденияПожизненногоРезерва(ТекСхема, Дата);
				Если ПорядокВеденияРПВ = Перечисления.уп_РезервПожизненныхВыплат.БезАналитики Тогда
					стр.РПВ = Истина;
				Иначе
					Если (Порядок_ИПС.Количество() > 0) Тогда
						стр.ИПС = Истина;
					КонецЕсли;
					Если (Порядок_СПС.Количество() > 0) Тогда
						стр.СПС = Истина;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Если (Порядок_ИПС.Количество() > 0) Тогда
					стр.ИПС = Истина;
				КонецЕсли;
				Если (Порядок_СПС.Количество() > 0) Тогда
					стр.СПС = Истина;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	//сформируем таблицу получателей для проводок по бухгалтерскому учету
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЛицевыеСчетаУчастниковСрезПоследних.НомерСчета,
	|	ЛицевыеСчетаУчастниковСрезПоследних.Банк,
	|	ПолучателиПоДоговорамОбслуживания.ПолучательВПлатежномПоручении
	|ИЗ
	|	РегистрСведений.уп_ЛицевыеСчетаУчастников.СрезПоследних(&Дата, НомерСчета В (&СписокСчетов)) КАК ЛицевыеСчетаУчастниковСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПолучателиПоДоговорамОбслуживания КАК ПолучателиПоДоговорамОбслуживания
	|		ПО ЛицевыеСчетаУчастниковСрезПоследних.Банк = ПолучателиПоДоговорамОбслуживания.ПолучательВПлатежномПоручении";
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокПенсионеров.ВыгрузитьКолонку("НомерСчета"));
	Запрос.УстановитьПараметр("Дата", Дата);	
	
	ТабПолучателей = Запрос.Выполнить().Выгрузить();
	
	Для каждого стр из ТабСхем Цикл
		//составим список счетов по схеме
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	НачислениеПенсийСписокПенсионеров.НомерСчета
		|ИЗ
		|	Документ.уп_НачислениеПенсий.СписокПенсионеров КАК НачислениеПенсийСписокПенсионеров
		|ГДЕ
		|	НачислениеПенсийСписокПенсионеров.Ссылка = &Ссылка
		|	И НачислениеПенсийСписокПенсионеров.Схема = &ТекСхема
		|	И НачислениеПенсийСписокПенсионеров.ТипПенсии = &ТипВ";
		
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("ТекСхема", стр.Схема);
		Запрос.УстановитьПараметр("ТипВ", стр.ТипПенсии);
		
		СписокСчетов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерСчета");
		
		
		Запрос = Новый Запрос;
		Если ВестиУчетПоСхемам Тогда
			УсловиеСхемы = " И СписокСчетов.Схема = РезервыОстатки.ПенсионнаяСхема";
		Иначе
			УсловиеСхемы = "";
		КонецЕсли;	
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	НачислениеПенсийСписокПенсионеров.НомерСчета КАК НомерСчета,
		               |	СУММА(НачислениеПенсийСписокПенсионеров.Сумма) КАК Сумма,
		               |	НачислениеПенсийСписокПенсионеров.Схема КАК Схема
		               |ПОМЕСТИТЬ СписокСчетов
		               |ИЗ
		               |	Документ.уп_НачислениеПенсий.СписокПенсионеров КАК НачислениеПенсийСписокПенсионеров
		               |ГДЕ
		               |	НачислениеПенсийСписокПенсионеров.Ссылка = &Ссылка
		               |	И НачислениеПенсийСписокПенсионеров.Схема = &ТекСхема
		               |	И НачислениеПенсийСписокПенсионеров.ТипПенсии = &ТипВ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	НачислениеПенсийСписокПенсионеров.НомерСчета,
		               |	НачислениеПенсийСписокПенсионеров.Схема
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	НомерСчета
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РезервыОстатки.ТипРезерва КАК ТипРезерва,
		               |	РезервыОстатки.ТипСуммы КАК ТипСуммы,
		               |	ЕСТЬNULL(РезервыОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		               |	ПорядокСписания.НомерСтроки КАК НомерСтроки,
		               |	ПорядокСписания.ОблагаетсяНДФЛ КАК ОблагаетсяНДФЛ,
		               |	СписокСчетов.НомерСчета КАК НомерСчета,
		               |	СписокСчетов.Сумма КАК Сумма,
		               |	СписокСчетов.Схема КАК Схема
		               |ИЗ
		               |	СписокСчетов КАК СписокСчетов
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_Резервы.Остатки(&МомВремени, НомерСчета В (&СписокСчетов) И ТипРезерва В (&СписокТиповРезерва)) КАК РезервыОстатки
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |				ПенсионныеСхемыИсточникиВыплат_ИПС.Ссылка КАК Ссылка,
		               |				ПенсионныеСхемыИсточникиВыплат_ИПС.ТипРезерва КАК ТипРезерва,
		               |				ПенсионныеСхемыИсточникиВыплат_ИПС.ТипСуммы КАК ТипСуммы,
		               |				ПенсионныеСхемыИсточникиВыплат_ИПС.НомерСтроки КАК НомерСтроки,
		               |				ПенсионныеСхемыИсточникиВыплат_ИПС.ОблагаетсяНДФЛ КАК ОблагаетсяНДФЛ
		               |			ИЗ
		               |				Справочник.уп_ПенсионныеСхемы.ИсточникиВыплат_ИПС КАК ПенсионныеСхемыИсточникиВыплат_ИПС
		               |			ГДЕ
		               |				ПенсионныеСхемыИсточникиВыплат_ИПС.Ссылка = &ТекСхема) КАК ПорядокСписания
		               |			ПО РезервыОстатки.ТипРезерва = ПорядокСписания.ТипРезерва
		               |				И РезервыОстатки.ТипСуммы = ПорядокСписания.ТипСуммы
		               |		ПО СписокСчетов.НомерСчета = РезервыОстатки.НомерСчета "+УсловиеСхемы+" 
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НомерСчета,
		               |	НомерСтроки
		               |ИТОГИ
		               |	СУММА(СуммаОстаток),
		               |	МАКСИМУМ(Сумма)
		               |ПО
		               |	НомерСчета";
		
		
		Запрос.УстановитьПараметр("МомВремени", МоментВремени());
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("ТекСхема", стр.Схема);
		Запрос.УстановитьПараметр("ТипВ", стр.ТипПенсии);
		Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов);
		СписокТиповРезерва = Новый СписокЗначений; //чтобы исключить резервы начисления
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.ИПС);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.СПС);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.ПожизненныхВыплат);
		Запрос.УстановитьПараметр("СписокТиповРезерва", СписокТиповРезерва);
		
		Таб = Запрос.Выполнить().Выгрузить();
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НомерСчета");
		
		Пока Выборка.Следующий() Цикл
			//СообщитьОбОшибке("Счет "+Выборка.НомерСчета.Код+" Сумма "+Выборка.СуммаОстаток,,Заголовок);
			СуммаОстаток= ?(Выборка.СуммаОстаток = Null, 0, Выборка.СуммаОстаток);
			СтрТабСчетов = ТабСчетов.Найти(Выборка.НомерСчета, "НомерСчета");
			ТабИсточников = Новый ТаблицаЗначений;
			ТабИсточников.Колонки.Добавить("НомерСчетаНачисления");
			ТабИсточников.Колонки.Добавить("ТипРезерваНачисления");
			ТабИсточников.Колонки.Добавить("ТипСуммы");
			ТабИсточников.Колонки.Добавить("Сумма");
			
			ТекСхема = СтрТабСчетов.Схема;
			//СтрТабСхем = ТабСхем.Найти(ТекСхема, "Схема");
			СтруктураОтбора = Новый Структура("Схема, ТипПенсии", ТекСхема, СтрТабСчетов.ТипПенсии);
			СтрокиТабСхем = ТабСхем.НайтиСтроки(СтруктураОтбора);
			СтрТабСхем = СтрокиТабСхем.Получить(0);
			
			Если СтрТабСхем.РПВ Тогда
				СтрТабСчетов.МожноСписать = СтрТабСчетов.Сумма;
				СтрТабСчетов.СуммаИзРПВ = СтрТабСчетов.Сумма;
				#Удаление
				Если НЕ ИсключатьИзНБ(СтрТабСчетов)	Тогда
				#КонецУдаления
					СтрТабСчетов.НалоговаяБаза = СтрТабСчетов.Сумма;  
				#Удаление
				КонецЕсли;
				#КонецУдаления
				СтрТабИсточников = ТабИсточников.Добавить();
				СтрТабИсточников.НомерСчетаНачисления = Справочники.уп_ПенсионныеСчета.ПустаяСсылка();
				СтрТабИсточников.ТипРезерваНачисления = Перечисления.уп_ТипыРезерва.ПожизненныхВыплат;
				СтрТабИсточников.Сумма = СтрТабСчетов.Сумма;
			Иначе	
				Если (СуммаОстаток = 0) Тогда
					Если СтрТабСхем.СПС Тогда
						//кандидат на списание с СПС
						СтрТЗСол = ТЗСол.Добавить();
						СтрТЗСол.НомерСчета = СтрТабСчетов.Номерсчета;
						#Удаление
						СтрТЗСол.ПенсионныйДоговор = СтрТабСчетов.НомерСчета.Владелец;
						#КонецУдаления
						#Вставка
						// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
						СтрТЗСол.ПенсионныйДоговор = СтрТабСчетов.НомерСчетаВладелец;
						СтрТЗСол.НомерСчетаДоговора = СтрТабСчетов.НомерСчетаВладелецПенсионныйСчет;
						#КонецВставки
						СтрТЗСол.Схема = ТекСхема;
						СтрТЗСол.ТипПенсии = стр.ТипПенсии;
						СтрТЗСол.Сумма = Выборка.Сумма;
						СтрТабСчетов.СуммаДог = Выборка.Сумма;
					Иначе
						#Удаление
						уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Нулевой остаток по счетам списания группы ИПС на счете "+СтрТабСчетов.НомерСчета,,Заголовок);
						#КонецУдаления
						#Вставка
						// +ХМНПФ 23.05.2024 ЛыткинАМ // !!!ОТКАЗ!!!
						уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("!!!ОТКАЗ!!!	Нулевой остаток по счетам списания группы ИПС на счете "+СтрТабСчетов.НомерСчета,,Заголовок);
						#КонецВставки
						Отказ = Истина;
					КонецЕсли;	
				Иначе
					Если СуммаОстаток<Выборка.Сумма Тогда
						Если СтрТабСхем.СПС Тогда
							//кандидат на списание с СПС
							СтрТЗСол = ТЗСол.Добавить();
							СтрТЗСол.НомерСчета = СтрТабСчетов.Номерсчета;
							#Удаление
							СтрТЗСол.ПенсионныйДоговор = СтрТабСчетов.НомерСчета.Владелец;
							#КонецУдаления
							#Вставка
							// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
							СтрТЗСол.ПенсионныйДоговор = СтрТабСчетов.НомерСчетаВладелец;
							СтрТЗСол.НомерСчетаДоговора = СтрТабСчетов.НомерСчетаВладелецПенсионныйСчет;
							#КонецВставки
							СтрТЗСол.Схема = ТекСхема;
							СтрТЗСол.ТипПенсии = стр.ТипПенсии;
							СтрТЗСол.Сумма = Выборка.Сумма-Выборка.СуммаОстаток;
							СтрТабСчетов.СуммаДог = Выборка.Сумма-Выборка.СуммаОстаток;
						Иначе
							#Удаление
							уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Недостаточно средств для выплаты начисленной суммы по счетам списания группы ИПС на счете "+СтрТабСчетов.НомерСчета,,Заголовок);
							#КонецУдаления
							#Вставка
							// +ХМНПФ 23.05.2024 ЛыткинАМ // !!!ОТКАЗ!!!
							уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(" !!!ОТКАЗ!!!	Недостаточно средств для выплаты начисленной суммы по счетам списания группы ИПС на счете "+СтрТабСчетов.НомерСчета,,Заголовок);
							#КонецВставки
							Отказ = Истина;
						КонецЕсли;
					КонецЕсли;
					ВыборкаСубсчетов = Выборка.Выбрать();
					СуммаКСписанию = 0;
					СуммаОсталось = Выборка.Сумма;
					#Вставка
					// +ХМНПФ 07.02.2025 ЛыткинАМ // https://redmine.npf.com/issues/4087
					СуммаОсталось = Мин(Выборка.Сумма, СуммаОстаток);
					#КонецВставки
					НалоговаяБаза = 0;
					
					СписыватьПропорционально = РегистрыСведений.уп_ПропорциональноеСписание.ПолучитьПоследнее(Дата, Новый Структура("Схема", ТекСхема)).СписыватьПропорционально;
					
					Если СписыватьПропорционально Тогда
						СуммаПролистали = 0;
						Пока ВыборкаСубсчетов.Следующий() Цикл
							СуммаПролистали = СуммаПролистали+ВыборкаСубСчетов.СуммаОстаток;
							СуммаКСписанию = Окр(Выборка.Сумма*ВыборкаСубСчетов.СуммаОстаток/СуммаОстаток,2,1);
							#Вставка
							// +ХМНПФ 07.02.2025 ЛыткинАМ // https://redmine.npf.com/issues/4087
							СуммаКСписанию = Окр(МИН(Выборка.Сумма,Выборка.СуммаОстаток)*ВыборкаСубСчетов.СуммаОстаток/СуммаОстаток,2,1);
							#КонецВставки
							Если СуммаПролистали = СуммаОстаток Тогда
								СуммаКСписанию = СуммаОсталось;
							КонецЕсли;	
							СуммаОсталось = СуммаОсталось - СуммаКСписанию;
							СтрТабСчетов.МожноСписать = СтрТабСчетов.МожноСписать+СуммаКСписанию;
							ВыполнитьСписаниеИПС(ВыборкаСубсчетов,СуммаКСписанию);
							Если лУчетРезервовНачисленияНПО Тогда
								ВыполнитьНачислениеИПС(ВыборкаСубсчетов,СуммаКСписанию);	
							КонецЕсли;	
							
							СтрТабИсточников = ТабИсточников.Добавить();
							СтрТабИсточников.НомерСчетаНачисления = Выборка.НомерСчета;
							СтрТабИсточников.ТипРезерваНачисления = ВыборкаСубсчетов.ТипРезерва;
							СтрТабИсточников.Сумма = СуммаКСписанию;
							СтрТабИсточников.ТипСуммы = ВыборкаСубсчетов.ТипСуммы;
							
							Если ВыборкаСубсчетов.ОблагаетсяНДФЛ Тогда
								НалоговаяБаза = НалоговаяБаза+СуммаКСписанию;
							КонецЕсли;
							Если СуммаОсталось = 0 Тогда
								Прервать;
							КонецЕсли;
						КонецЦикла;
						#Удаление
						Если НЕ ИсключатьИзНБ(СтрТабСчетов)	Тогда
						#КонецУдаления
							СтрТабСчетов.НалоговаяБаза = НалоговаяБаза;
						#Удаление
						КонецЕсли;
						#КонецУдаления
					Иначе
						Пока ВыборкаСубсчетов.Следующий() Цикл
							//СообщитьОбОшибке("Счет "+ВыборкаСубсчетов.НомерСчета.Код+" ТипРезерва "+ВыборкаСубсчетов.ТипРезерва+" ТипСуммы "+ВыборкаСубсчетов.ТИпСуммы+" Сумма "+ВыборкаСубсчетов.СуммаОстаток+" Очередь "+ВыборкаСубсчетов.НомерСтроки,,Заголовок);
							Если СуммаОсталось<=ВыборкаСубсчетов.СуммаОстаток Тогда
								СуммаКСписанию = СуммаОсталось;
								СуммаОсталось = 0;
							Иначе
								СуммаКСписанию = ВыборкаСубСчетов.СуммаОстаток;
								СуммаОсталось = СуммаОсталось - СуммаКСписанию;
							КонецЕсли;
							СтрТабСчетов.МожноСписать = СтрТабСчетов.МожноСписать+СуммаКСписанию;
							ВыполнитьСписаниеИПС(ВыборкаСубсчетов,СуммаКСписанию);
							Если лУчетРезервовНачисленияНПО Тогда
								ВыполнитьНачислениеИПС(ВыборкаСубсчетов,СуммаКСписанию);	
							КонецЕсли;						
							
							СтрТабИсточников = ТабИсточников.Добавить();
							СтрТабИсточников.НомерСчетаНачисления = Выборка.НомерСчета;
							СтрТабИсточников.ТипРезерваНачисления = ВыборкаСубсчетов.ТипРезерва;
							СтрТабИсточников.Сумма = СуммаКСписанию;
							СтрТабИсточников.ТипСуммы = ВыборкаСубсчетов.ТипСуммы;
							
							Если ВыборкаСубсчетов.ОблагаетсяНДФЛ Тогда
								НалоговаяБаза = НалоговаяБаза+СуммаКСписанию;
							КонецЕсли;
							Если СуммаОсталось = 0 Тогда
								Прервать;
							КонецЕсли;
						КонецЦикла;
						#Удаление
						Если НЕ ИсключатьИзНБ(СтрТабСчетов)	Тогда
						#КонецУдаления
							СтрТабСчетов.НалоговаяБаза = НалоговаяБаза;
						#Удаление
						КонецЕсли;
						#КонецУдаления
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ТабИсточников.Свернуть("НомерСчетаНачисления, ТипРезерваНачисления, ТипСуммы","Сумма");
			СтрТабСчетов.ТаблицаИсточников = ТабИсточников;
		КонецЦикла;
	КонецЦикла; //по схемам
	
	//списание со счетов договоров
	ТабНераспределенныхОстатков = ТЗСол.Скопировать();
	Если ТЗСол.Количество()>0 Тогда
		#Удаление
		ТЗСол.Свернуть("ПенсионныйДоговор, Схема, ТипПенсии", "Сумма, НалоговаяБаза, МожноСписать");
		#КонецУдаления
		#Вставка
		// +ХМНПФ 23.05.2024 ЛыткинАМ // учет по счетам источникам
		ТЗСол.Свернуть("НомерСчета,ПенсионныйДоговор, НомерСчетаДоговора, Схема, ТипПенсии", "Сумма, НалоговаяБаза, МожноСписать");
		// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
		#КонецВставки
		//заполним схемы договоров
		ТЗСол.Колонки.Добавить("ТаблицаИсточников");
		
		ТЗДог = ТЗСол.Скопировать();
		#Удаление
		ТЗДог.Свернуть("ПенсионныйДоговор", "Сумма");
		ТЗДог.Колонки.Добавить("НомерСчетаДоговора");
		Для каждого стр из ТЗДог Цикл
			стр.НомерСчетаДоговора = стр.ПенсионныйДоговор.ПенсионныйСчет;
		КонецЦикла;
		#КонецУдаления
		#Вставка
		// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
		ТЗДог.Свернуть("ПенсионныйДоговор,НомерСчетаДоговора", "Сумма");
		#КонецВставки
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РезервыОстатки.НомерСчета КАК НомерСчета,
		               |	РезервыОстатки.НомерСчета.Владелец КАК НомерСчетаВладелец,
		               |	РезервыОстатки.ТипРезерва КАК ТипРезерва,
		               |	РезервыОстатки.ТипСуммы КАК ТипСуммы,
		               |	РезервыОстатки.СуммаОстаток КАК СуммаОстаток,
		               |	РезервыОстатки.ПенсионнаяСхема КАК ПенсионнаяСхема
		               |ИЗ
		               |	РегистрНакопления.уп_Резервы.Остатки(&МомВремени, НомерСчета В (&СписокСчетовДоговоров) И ТипРезерва В (&СписокТиповРезерва)) КАК РезервыОстатки
		               |ИТОГИ
		               |	СУММА(СуммаОстаток)
		               |ПО
		               |	НомерСчета";
		
		Запрос.УстановитьПараметр("МомВремени", МоментВремени());
		Запрос.УстановитьПараметр("СписокСчетовДоговоров", ТЗДог.ВыгрузитьКолонку("НомерСчетаДоговора"));
		СписокТиповРезерва = Новый СписокЗначений; //чтобы исключить резервы начисления
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.ИПС);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.СПС);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.ПожизненныхВыплат);
		Запрос.УстановитьПараметр("СписокТиповРезерва", СписокТиповРезерва);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НомерСчета");
		
		ТЗСуммДоговора = Новый ТаблицаЗначений;
		ТЗСуммДоговора.Колонки.Добавить("ПенсионныйДоговор");
		ТЗСуммДоговора.Колонки.Добавить("НомерСчета");
		ТЗСуммДоговора.Колонки.Добавить("ТипРезерва");
		ТЗСуммДоговора.Колонки.Добавить("ПенсионнаяСхема");
		ТЗСуммДоговора.Колонки.Добавить("ТипСуммы");
		ТЗСуммДоговора.Колонки.Добавить("СуммаОстаток", Новый ОписаниеТипов("Число"));
		ТЗСуммДоговора.Колонки.Добавить("СуммаСписать", Новый ОписаниеТипов("Число"));
		
		#Вставка
		// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
		СоответствиеСхемСписыватьПропорционально = Новый Соответствие;
		#КонецВставки
		Пока Выборка.Следующий() Цикл
			ТЗСуммДоговора.Очистить();
			СтрТЗДог = ТЗДог.Найти(Выборка.НомерСчета, "НомерСчетаДоговора");
			Если Выборка.СуммаОстаток>=СтрТЗДог.Сумма Тогда
				ВыборкаСубсчетов = Выборка.Выбрать();
				ОшибкиСуммы = Новый Массив;
				Пока ВыборкаСубсчетов.Следующий() Цикл
					СтрТЗСуммДоговора = ТЗСуммДоговора.Добавить();   // Новая таблица куда копируем все, что касается текущей выборки. Что можно списать..
					СтрТЗСуммДоговора.ПенсионныйДоговор = СтрТЗДог.ПенсионныйДоговор;
					СтрТЗСуммДоговора.НомерСчета = Выборка.НомерСчета;
					СтрТЗСуммДоговора.ПенсионнаяСхема = ВыборкаСубсчетов.ПенсионнаяСхема;
					СтрТЗСуммДоговора.ТипРезерва = ВыборкаСубсчетов.ТипРезерва;
					СтрТЗСуммДоговора.ТипСуммы = ВыборкаСубсчетов.ТипСуммы;
					СтрТЗСуммДоговора.СуммаОстаток = ВыборкаСубсчетов.СуммаОстаток;
					Если ВыборкаСубсчетов.СуммаОстаток < 0 Тогда                                 
						ОшибкиСуммы.Добавить("По номеру счета " + Выборка.НомерСчета + " по типу резерва: " + ВыборкаСубсчетов.ТипРезерва + " по типу суммы: " + ВыборкаСубсчетов.ТипСуммы + " отрицательный остаток: " + ВыборкаСубсчетов.СуммаОстаток);
					КонецЕсли;		
				КонецЦикла;
				
				Если ЗначениеЗаполнено(ОшибкиСуммы) Тогда
					Для Каждого ОшибкаСтр Из ОшибкиСуммы Цикл
						#Удаление
						уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(ОшибкаСтр,,Заголовок);
						#КонецУдаления
						#Вставка
						// +ХМНПФ 23.05.2024 ЛыткинАМ // !!!ОТКАЗ!!!
						уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("!!!ОТКАЗ!!!	"+ОшибкаСтр,,Заголовок);
						#КонецВставки
					КонецЦикла;
					уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Проведение документа невозможно",,Заголовок);
					Отказ = Истина;
					Возврат;
				КонецЕсли;
				
				Для каждого стр из ТЗСол Цикл   //ТЗСол - таблица кандидатов на списание по счету договора... т.е. то, что должны списать..
					ТабСписанияПоСхеме = Новый ТаблицаЗначений;
					ТабСписанияПоСхеме.Колонки.Добавить("ПенсионныйДоговор");
					ТабСписанияПоСхеме.Колонки.Добавить("НомерСчета");
					ТабСписанияПоСхеме.Колонки.Добавить("Схема");
					ТабСписанияПоСхеме.Колонки.Добавить("ТипПенсии");
					ТабСписанияПоСхеме.Колонки.Добавить("ПенсионнаяСхема");
					ТабСписанияПоСхеме.Колонки.Добавить("ТипРезерва");
					ТабСписанияПоСхеме.Колонки.Добавить("ТипСуммы");
					ТабСписанияПоСхеме.Колонки.Добавить("СуммаСписать", Новый ОписаниеТипов("Число"));
					#Вставка
					// +ХМНПФ 23.05.2024 ЛыткинАМ // учет по счетам источникам
					ТабСписанияПоСхеме.Колонки.Добавить("ПенсионныйСчетИсточник");
					#КонецВставки
					Если стр.ПенсионныйДоговор = СтрТЗДог.ПенсионныйДоговор Тогда
						//СтрТабСчетов = ТабСчетов.Найти(стр.НомерСчета, "НомерСчета");
						//ТекСхема = СтрТабСчетов.Схема;
						ТекСхема = стр.Схема;
						//СтрТабСхем = ТабСхем.Найти(ТекСхема, "Схема");
						СтруктураОтбора = Новый Структура("Схема, ТипПенсии", ТекСхема, стр.ТипПенсии);
						СтрокиТабСхем = ТабСхем.НайтиСтроки(СтруктураОтбора);
						СтрТабСхем = СтрокиТабСхем.Получить(0);
						
						СуммаОсталось = стр.Сумма;
						СуммаКСписанию = 0;
						НалоговаяБаза = 0;
						Источники = стр.Схема.ИсточникиВыплат_СПС.Выгрузить(); // вся таблица источников по схеме для СПС...
						
						#Вставка
						// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
						Если СоответствиеСхемСписыватьПропорционально.Получить(ТекСхема) = Неопределено Тогда
						#КонецВставки
						СписыватьПропорционально = РегистрыСведений.уп_ПропорциональноеСписание.ПолучитьПоследнее(Дата, Новый Структура("Схема", ТекСхема)).СписыватьПропорционально;
						#Вставка
						СоответствиеСхемСписыватьПропорционально.Вставить(ТекСхема,СписыватьПропорционально);
						Иначе
							СписыватьПропорционально = СоответствиеСхемСписыватьПропорционально.Получить(ТекСхема);
						КонецЕсли;
						#КонецВставки
				
						Если СписыватьПропорционально Тогда
							//считаем общую сумму по источникам
							СуммаИсточников = 0;
							Для а=0 по Источники.Количество()-1 Цикл
								СтрИсточники = Источники[а];
								Для каждого СтрТЗСуммДоговора из ТЗСуммДоговора Цикл
									Если (СтрТЗСуммДоговора.ТипРезерва = СтрИсточники.ТипРезерва)
										и (СтрТЗСуммДоговора.ТипСуммы = СтрИсточники.ТипСуммы) Тогда
										СуммаИсточников = СуммаИсточников+СтрТЗСуммДоговора.СуммаОстаток;
									КонецЕсли;
								КонецЦикла;
							КонецЦикла;	
							СуммаПролистали = 0;
							Для а=0 по Источники.Количество()-1 Цикл
								СтрИсточники = Источники[а];
								Для каждого СтрТЗСуммДоговора из ТЗСуммДоговора Цикл   // Новая таблица куда скопировали все, что касается текущей выборки. Расшифровка по счету.
									Если (СтрТЗСуммДоговора.ТипРезерва = СтрИсточники.ТипРезерва)
										и (СтрТЗСуммДоговора.ТипСуммы = СтрИсточники.ТипСуммы) Тогда
										
										СуммаПролистали = СуммаПролистали+СтрТЗСуммДоговора.СуммаОстаток;
										СуммаКСписанию = Окр(Стр.Сумма*СтрТЗСуммДоговора.СуммаОстаток/СуммаИсточников,2,1);
										Если СуммаПролистали = СуммаИсточников Тогда
											Если СуммаОсталось<= СтрТЗСуммДоговора.СуммаОстаток Тогда
												СуммаКСписанию = СуммаОсталось;
											КонецЕсли;	
										КонецЕсли;
										СуммаОСталось = СуммаОСталось - СуммаКСписанию;
										СтрТЗСуммДоговора.СуммаОстаток = СтрТЗСуммДоговора.СуммаОстаток - СуммаКСписанию;
										СтрТЗСуммДоговора.СуммаСписать = СтрТЗСуммДоговора.СуммаСписать + СуммаКСписанию;
										стр.МожноСписать = стр.МожноСписать+СуммаКСписанию;
										Если СтрИсточники.ОблагаетсяНДФЛ Тогда
											НалоговаяБаза = НалоговаяБаза+СуммаКСписанию;
										КонецЕсли;
										НовСтрТЗПоСхемам = ТабСписанияПоСхеме.Добавить();
										НовСтрТЗПоСхемам.Схема = ТекСхема;
										НовСтрТЗПоСхемам.ТипПенсии = стр.ТипПенсии;
										НовСтрТЗПоСхемам.ПенсионныйДоговор = стр.ПенсионныйДоговор;
										НовСтрТЗПоСхемам.НомерСчета = Выборка.НомерСчета;
										НовСтрТЗПоСхемам.СуммаСписать = НовСтрТЗПоСхемам.СуммаСписать+СуммаКСписанию;
										НовСтрТЗПоСхемам.ПенсионнаяСхема = СтрТЗСуммДоговора.ПенсионнаяСхема;
										НовСтрТЗПоСхемам.ТипРезерва = СтрТЗСуммДоговора.ТипРезерва;
										НовСтрТЗПоСхемам.ТипСуммы = СтрТЗСуммДоговора.ТипСуммы;
										#Удаление
										Прервать;
										#КонецУдаления
										#Вставка
										// +ХМНПФ 23.05.2024 ЛыткинАМ // учет по счетам источникам
										НовСтрТЗПоСхемам.ПенсионныйСчетИсточник	= стр.НомерСчета;
										#КонецВставки
									КонецЕсли;
								КонецЦикла;
							КонецЦикла;	
						Иначе     // не пропорциональное списывание
							Для а=0 по Источники.Количество()-1 Цикл
								СтрИсточники = Источники[а];
								Для каждого СтрТЗСуммДоговора из ТЗСуммДоговора Цикл
									Если (СтрТЗСуммДоговора.ТипРезерва = СтрИсточники.ТипРезерва)
										и (СтрТЗСуммДоговора.ТипСуммы = СтрИсточники.ТипСуммы) Тогда
										//можно списывать
										Если СуммаОсталось<=СтрТЗСуммДоговора.СуммаОстаток Тогда
											СуммаКСписанию = СуммаОсталось;
											СуммаОсталось = 0;
										Иначе
											СуммаКСписанию = СтрТЗСуммДоговора.СуммаОстаток;
											СуммаОСталось = СуммаОСталось - СуммаКСписанию;
										КонецЕсли;
										СтрТЗСуммДоговора.СуммаОстаток = СтрТЗСуммДоговора.СуммаОстаток - СуммаКСписанию;
										СтрТЗСуммДоговора.СуммаСписать = СтрТЗСуммДоговора.СуммаСписать + СуммаКСписанию;
										стр.МожноСписать = стр.МожноСписать+СуммаКСписанию;
										Если СтрИсточники.ОблагаетсяНДФЛ Тогда
											НалоговаяБаза = НалоговаяБаза+СуммаКСписанию;
										КонецЕсли;
										НовСтрТЗПоСхемам = ТабСписанияПоСхеме.Добавить();
										НовСтрТЗПоСхемам.Схема = ТекСхема;
										НовСтрТЗПоСхемам.ТипПенсии = стр.ТипПенсии;
										НовСтрТЗПоСхемам.ПенсионныйДоговор = стр.ПенсионныйДоговор;
										НовСтрТЗПоСхемам.НомерСчета = Выборка.НомерСчета;
										НовСтрТЗПоСхемам.СуммаСписать = НовСтрТЗПоСхемам.СуммаСписать+СуммаКСписанию;
										НовСтрТЗПоСхемам.ТипРезерва = СтрТЗСуммДоговора.ТипРезерва;
										НовСтрТЗПоСхемам.ТипСуммы = СтрТЗСуммДоговора.ТипСуммы;
										НовСтрТЗПоСхемам.ПенсионнаяСхема = СтрТЗСуммДоговора.ПенсионнаяСхема;
										#Вставка
										// +ХМНПФ 23.05.2024 ЛыткинАМ // учет по счетам источникам
										НовСтрТЗПоСхемам.ПенсионныйСчетИсточник	= стр.НомерСчета;
										#КонецВставки
										Прервать;
									КонецЕсли;
								КонецЦикла;
								Если СуммаОсталось = 0 Тогда
									Прервать;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						Если СуммаОсталось > 0 Тогда
							#Удаление
							уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Нет возможности списать сумму со счета "+СокрЛП(СтрТзДог.НомерСчетаДоговора)+" по схеме "+стр.Схема.Код,,Заголовок);
							#КонецУдаления
							#Вставка
							// +ХМНПФ 23.05.2024 ЛыткинАМ // !!!ОТКАЗ!!!
							уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("!!!ОТКАЗ!!!	По счету: "+стр.НомерСчета+" нет возможности списать солидарную сумму со счета "+СокрЛП(СтрТзДог.НомерСчетаДоговора)+" по схеме "+стр.Схема.Код,,Заголовок);
							#КонецВставки
							Отказ = Истина;
						Иначе
							стр.НалоговаяБаза = стр.НалоговаяБаза+НалоговаяБаза;
						КонецЕсли;
					КонецЕсли;
					Если ТабСписанияПоСхеме.Количество()>0 Тогда
						ВыполнитьСписаниеСПС(ТабСписанияПоСхеме,лУчетРезервовНачисленияНПО);
						ТабИсточников = Новый ТаблицаЗначений;
						ТабИсточников.Колонки.Добавить("НомерСчетаНачисления");
						ТабИсточников.Колонки.Добавить("ТипРезерваНачисления");
						ТабИсточников.Колонки.Добавить("ТипСуммы");
						ТабИсточников.Колонки.Добавить("Сумма");
						
						ТабСписанияПоСхеме.Свернуть("НомерСчета, ТипРезерва,ТипСуммы", "СуммаСписать");
						Для Каждого СтрТабСписанияПоСхеме ИЗ ТабСписанияПоСхеме Цикл
							НовСтрТабИсточника = ТабИсточников.Добавить();
							НовСтрТабИсточника.НомерСчетаНачисления = СтрТабСписанияПоСхеме.НомерСчета;
							НовСтрТабИсточника.ТипРезерваНачисления = СтрТабСписанияПоСхеме.ТипРезерва;
							НовСтрТабИсточника.Сумма = СтрТабСписанияПоСхеме.СуммаСписать;
							НовСтрТабИсточника.ТипСуммы = СтрТабСписанияПоСхеме.ТипСуммы;
						КонецЦикла;
						стр.ТаблицаИсточников = ТабИсточников;
					КонецЕсли;
				КонецЦикла;
			Иначе
				#Удаление
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("На счете договора "+СтрТЗДог.ПенсионныйДоговор.Код+" недостаточно средств для выплаты. На счете "+Выборка.СуммаОстаток+", необходимо "+СтрТЗДог.Сумма,,Заголовок);
				#КонецУдаления
				#Вставка
				// +ХМНПФ 23.05.2024 ЛыткинАМ // !!!ОТКАЗ!!!
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("!!!ОТКАЗ!!!	На счете договора "+СтрТЗДог.ПенсионныйДоговор.Код+" недостаточно средств для выплаты. На счете "+Выборка.СуммаОстаток+", необходимо "+СтрТЗДог.Сумма,,Заголовок);
				#КонецВставки
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	//надо распределить налоговую базу по таблице списания с солидарных счетов 
	Если НЕ Отказ Тогда
		Для каждого стр из ТЗСол Цикл //все надо прописать в ТабСчетов
			Если стр.Сумма = стр.МожноСписать  Тогда
				#Удаление
				МассивСтрокТаблицы = ТабСчетов.НайтиСтроки(Новый Структура("ПенсионныйДоговор, Схема, ТипПенсии", стр.ПенсионныйДоговор, стр.схема, стр.ТипПенсии));
				#КонецУдаления
				#Вставка
				// +ХМНПФ 23.05.2024 ЛыткинАМ // учет по счетам источникам
				МассивСтрокТаблицы = ТабСчетов.НайтиСтроки(Новый Структура("НомерСчета, ПенсионныйДоговор, Схема, ТипПенсии", стр.НомерСчета, стр.ПенсионныйДоговор, стр.схема, стр.ТипПенсии));
				#КонецВставки
				// т.е. строки всех участников с таким пенс. дог и схемой
				Если стр.Сумма = стр.НалоговаяБаза Тогда
					Для  каждого строкаМассива из МассивСтрокТаблицы Цикл
						строкаМассива.МожноСписать = строкаМассива.МожноСписать+строкаМассива.СуммаДог; 
						#Удаление
						Если НЕ ИсключатьИзНБ(строкаМассива) Тогда
						#КонецУдаления
							строкаМассива.НалоговаяБаза = строкаМассива.НалоговаяБаза+строкаМассива.СуммаДог;
						#Удаление
						КонецЕсли;	
						#КонецУдаления

					КонецЦикла;
				Иначе //налоговую базу надо распределять пропорционально
					коэффициент = стр.НалоговаяБаза/стр.Сумма;
					Для  каждого строкаМассива из МассивСтрокТаблицы Цикл

						строкаМассива.МожноСписать = строкаМассива.МожноСписать+строкаМассива.СуммаДог;
						#Удаление
						Если НЕ ИсключатьИзНБ(строкаМассива) Тогда
						#КонецУдаления
							строкаМассива.НалоговаяБаза = строкаМассива.НалоговаяБаза+строкаМассива.СуммаДог*коэффициент;
						#Удаление
						КонецЕсли;
						#КонецУдаления

					КонецЦикла;

				КонецЕсли;
				//заполнить таблицу источников
				ТабИсточниковТЗСол = стр.ТаблицаИсточников;
				Для  каждого строкаМассива из МассивСтрокТаблицы Цикл
					СуммаНадо = строкаМассива.СуммаДог;
					ТабИсточников = строкаМассива.ТаблицаИсточников;
					Для каждого СтрокаТабИсточниклвТЗСол из ТабИсточниковТЗСол Цикл
						СуммаМожно = Мин(СуммаНадо, СтрокаТабИсточниклвТЗСол.Сумма);
						НовСтрТабИсточников = ТабИсточников.Добавить();
						НовСтрТабИсточников.НомерСчетаНачисления = СтрокаТабИсточниклвТЗСол.НомерСчетаНачисления;
						НовСтрТабИсточников.ТипРезерваНачисления = СтрокаТабИсточниклвТЗСол.ТипРезерваНачисления;
						НовСтрТабИсточников.Сумма = СуммаМожно;
						НовСтрТабИсточников.ТипСуммы = СтрокаТабИсточниклвТЗСол.ТипСуммы;
						
						СуммаНадо = СуммаНадо-СуммаМожно;
						СтрокаТабИсточниклвТЗСол.Сумма = СтрокаТабИсточниклвТЗСол.Сумма-СуммаМожно;
						
						Если СуммаНадо = 0 Тогда
							Прервать;
						КонецЕсли;	
					КонецЦикла;	
					//строкаМассива.ТаблицаИсточников = ТабИсточников;
					Если СуммаНадо<>0 Тогда
						Отказ = Истина;
						#Удаление
						Сообщить("Неудалось распределить сумму списания по источникам по договору "+стр.ПенсионныйДоговор+" по схеме "+стр.Схема);
						#КонецУдаления
						#Вставка
						// +ХМНПФ 23.05.2024 ЛыткинАМ // !!!ОТКАЗ!!!
						Сообщить("!!!ОТКАЗ!!!	Неудалось распределить сумму списания по источникам по договору "+стр.ПенсионныйДоговор+" по схеме "+стр.Схема);
						#КонецВставки
					КонецЕсли;	
				КонецЦикла;
				//Иначе
				//	Протокол.ДобавитьСтроку("По счету № "+стр.Номерсчета+" начислено "+стр.Сумма+", возможно списать "+стр.МожноСписать);

			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
	//списание из РПВ
	СуммаИзРПВ = ТабСчетов.Итог("СуммаИзРПВ");
	Если СуммаИзРПВ<>0 Тогда
		//проверить остаток в РПВ
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_РезервыОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.уп_Резервы.Остатки(
		|			&ДатаДок,
		|			НомерСчета = &ПустойСчет
		|				И Организация = &Организация
		|				И ТипРезерва = &РПВ) КАК уп_РезервыОстатки";
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ДатаДок", Дата);
		Запрос.УстановитьПараметр("ПустойСчет", Справочники.уп_ПенсионныеСчета.ПустаяСсылка());
		Запрос.УстановитьПараметр("РПВ", Перечисления.уп_ТипыРезерва.ПожизненныхВыплат);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			СуммаВРезервеРПВ = Выборка.СуммаОстаток;
		Иначе
			СуммаВРезервеРПВ = 0;
		КонецЕсли;
		Если СуммаВРезервеРПВ>=СуммаИзРПВ Тогда
			//списываем
			СуммыРПВСоСхемами = ТабСчетов.Скопировать();
			СуммыРПВСоСхемами.Свернуть("Схема", "СуммаИзРПВ");
			Для Каждого стрРПВСоСхемами из СуммыРПВСоСхемами Цикл
				Если стрРПВСоСхемами.СуммаИзРПВ<>0 Тогда
					Движение = Движения.уп_Резервы.ДобавитьРасход();
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Регистратор = Ссылка;
					Движение.НомерСчета = Справочники.уп_ПенсионныеСчета.ПустаяСсылка();
					Движение.ТипРезерва = Перечисления.уп_ТипыРезерва.ПожизненныхВыплат;
					Движение.Сумма = стрРПВСоСхемами.СуммаИзРПВ;
					Движение.Движение = Перечисления.уп_ВидыДвижений.Начисление;
					Движение.Схема = стрРПВСоСхемами.Схема;
					Если ВестиУчетПоСхемам Тогда
						Движение.ПенсионнаяСхема = стрРПВСоСхемами.Схема;
					КонецЕсли;
					
					Если лУчетРезервовНачисленияНПО Тогда
						Движение = Движения.уп_Резервы.ДобавитьПриход();
						Движение.Период = Дата;
						Движение.Организация = Организация;
						Движение.Регистратор = Ссылка;
						Движение.НомерСчета = Справочники.уп_ПенсионныеСчета.ПустаяСсылка();
						Движение.ТипРезерва = Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийПожизненныхВыплат;
						Движение.Сумма = стрРПВСоСхемами.СуммаИзРПВ;
						Движение.Движение = Перечисления.уп_ВидыДвижений.Начисление;
						Движение.Схема = стрРПВСоСхемами.Схема;
						Если ВестиУчетПоСхемам Тогда
							Движение.ПенсионнаяСхема = стрРПВСоСхемами.Схема;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Нет возможности списать из резерва пожизненных выплат "+СуммаИзРПВ+" , недостача составляет "+(СуммаИзРПВ-СуммаВРезервеРПВ),,Заголовок);
			Отказ = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
	ИтогНачислено = ТабСчетов.Итог("Сумма");
	ИтогСписано = ТабСчетов.Итог("МожноСписать");
	Если ИтогНачислено = ИтогСписано Тогда  //проводим
		//Для каждого стр из  ТабСчетов Цикл
		//	РаспределитьНачисление(стр, ТабПолучателей);
		//КонецЦикла;
		ТабСчетовПоПериодам = СписокПенсионеров.Выгрузить();
		#Вставка
		// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
		ТабСчетовПоПериодам = ПолучитьРасширенныйСписокПенсионеров("ТабСчетовПоПериодам");
		хм_Ускорение = Новый Структура("уп_Пенсия,КатегорияДохода,уп_РаспределятьНачисленияПоМесяцам",
			ПланыВидовРасчета.Начисления.уп_Пенсия,ПланыВидовРасчета.Начисления.уп_Пенсия.КатегорияДохода,Константы.уп_РаспределятьНачисленияПоМесяцам.Получить());
		#КонецВставки
		ТабСчетовПоПериодам.Колонки.Добавить("НалоговаяБаза", Новый ОписаниеТипов("Число"));
		ТабСчетовПоПериодам.Колонки.Добавить("СуммаИзРПВ", Новый ОписаниеТипов("Число"));
		ТабСчетовПоПериодам.Колонки.Добавить("ТаблицаИсточников", Новый ОписаниеТипов("ТаблицаЗначений"));
		Для каждого СтрокаТабЧасти Из ТабСчетовПоПериодам Цикл
			СтрокаТабСчетов = ТабСчетов.Найти(СтрокаТабЧасти.НомерСчета, "НомерСчета");
			Если СтрокаТабСчетов.Сумма<>0 Тогда
				СтрокаТабЧасти.НалоговаяБаза = Окр(СтрокаТабСчетов.НалоговаяБаза * СтрокаТабЧасти.Сумма / СтрокаТабСчетов.Сумма, 2);
			КонецЕсли;
			СтрокаТабЧасти.СуммаИзРПВ = СтрокаТабСчетов.СуммаИзРПВ;
			СтрокаТабЧасти.ТаблицаИсточников = СтрокаТабСчетов.ТаблицаИсточников;
			#Удаление
			РаспределитьНачисление(СтрокаТабЧасти, ТабПолучателей);
			#КонецУдаления
			#Вставка
			// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
			РаспределитьНачисление(СтрокаТабЧасти, ТабПолучателей, хм_Ускорение);
			#КонецВставки
		КонецЦикла;
	Иначе   // ищем ощибки

		//Протокол = Новый ТекстовыйДокумент;
		Для Каждого стр из ТабСчетов Цикл
			Если стр.Сумма<>стр.МожноСписать Тогда
			#Удаление
				Сообщить("По счету № "+стр.Номерсчета+" начислено "+стр.Сумма+", возможно списать "+стр.МожноСписать);
			#КонецУдаления
			#Вставка
			// +ХМНПФ 23.05.2024 ЛыткинАМ // !!!ОТКАЗ!!!
				Сообщить("!!!ОТКАЗ!!!	По счету № "+стр.Номерсчета+" начислено "+стр.Сумма+", возможно списать "+стр.МожноСписать);
			#КонецВставки
			КонецЕсли;
		КонецЦикла;
		//Протокол.Показать();
		
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не Доначисление Тогда
		Для каждого стр из СписокПенсионеров Цикл
			Движение = Движения.уп_СчетчикНачислений.Добавить();
			Движение.НомерСчета = стр.НомерСчета;
			Движение.Период = ПериодНачисления;
			//Движение.Период = Дата;
			Движение.Количество = 1;
			
			//Бардошина +
			Если стр.Доплата > 0 Тогда 
				Движение = Движения.уп_СчетчикДоплат.Добавить();
				Движение.НомерСчета = стр.НомерСчета;
				Движение.Период = ПериодНачисления;
				Движение.НачПериода = стр.НачалоПериодаНачисления;
				Движение.КонПериода = стр.КонецПериодаНачисления;
				Движение.Сумма = стр.Доплата;
				Движение.Счетчик = 1;
			КонецЕсли;
			//Бардошина -
		КонецЦикла;	
	КонецЕсли;
	//Бардошина +
	//по ТЧ "Список пенсионеров" проверяем наличие остатка в РН npo_НачислениеЗадолженностиПоПриостановкам (соответствие по всем измерениям), списываем его
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_НачислениеПенсийСписокПенсионеров.НомерСчета КАК НомерСчета,
		|	уп_НачислениеПенсийСписокПенсионеров.НачалоПериодаНачисления КАК НачПериода,
		|	уп_НачислениеПенсийСписокПенсионеров.КонецПериодаНачисления КАК КонПериода,
		|	СУММА(уп_НачислениеПенсийСписокПенсионеров.Сумма) КАК Сумма,
		|	СУММА(уп_НачислениеПенсийСписокПенсионеров.Доплата) КАК Доплата,
		|	МИНИМУМ(уп_НачислениеПенсийСписокПенсионеров.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ СписокПенсионеров
		|ИЗ
		|	Документ.уп_НачислениеПенсий.СписокПенсионеров КАК уп_НачислениеПенсийСписокПенсионеров
		|ГДЕ
		|	уп_НачислениеПенсийСписокПенсионеров.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_НачислениеПенсийСписокПенсионеров.НомерСчета,
		|	уп_НачислениеПенсийСписокПенсионеров.НачалоПериодаНачисления,
		|	уп_НачислениеПенсийСписокПенсионеров.КонецПериодаНачисления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерСчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокПенсионеров.НомерСтроки КАК НомерСтроки,
		|	npo_ЗадолженностьПоПенсиямОстатки.НомерСчета КАК НомерСчета,
		|	npo_ЗадолженностьПоПенсиямОстатки.НачалоПериода КАК НачалоПериода,
		|	npo_ЗадолженностьПоПенсиямОстатки.КонецПериода КАК КонецПериода,
		|	СписокПенсионеров.Сумма КАК Сумма,
		|	СписокПенсионеров.Доплата КАК Доплата,
		|	npo_ЗадолженностьПоПенсиямОстатки.СчетчикОстаток КАК СчетчикОстаток,
		|	npo_ЗадолженностьПоПенсиямОстатки.СуммаПенсииОстаток КАК СуммаОстаток,
		|	npo_ЗадолженностьПоПенсиямОстатки.СуммаДоплатыОстаток КАК ДоплатаОстаток,
		|	ПРЕДСТАВЛЕНИЕ(npo_ЗадолженностьПоПенсиямОстатки.НомерСчета) КАК НомерСчетаТекст
		|ИЗ
		|	СписокПенсионеров КАК СписокПенсионеров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.уп_ЗадолженностьПоПенсиям.Остатки(
		|				&МоментВремени,
		|				НомерСчета В
		|					(ВЫБРАТЬ
		|						СписокПенсионеров.НомерСчета КАК НомерСчета
		|					ИЗ
		|						СписокПенсионеров КАК СписокПенсионеров)) КАК npo_ЗадолженностьПоПенсиямОстатки
		|		ПО СписокПенсионеров.НомерСчета = npo_ЗадолженностьПоПенсиямОстатки.НомерСчета
		|			И СписокПенсионеров.НачПериода = npo_ЗадолженностьПоПенсиямОстатки.НачалоПериода
		|			И СписокПенсионеров.КонПериода = npo_ЗадолженностьПоПенсиямОстатки.КонецПериода";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СуммаНехватка = Выборка.Сумма - Выборка.СуммаОстаток;
		ДоплатаНехватка = Выборка.Доплата - Выборка.ДоплатаОстаток;
		Если СуммаНехватка > 0 ИЛИ ДоплатаНехватка > 0 Тогда
			Если СуммаНехватка > 0 Тогда
				ТекстСообщения = "По счету № " + Выборка.НомерСчетаТекст + " сумма превышает сумму задолженности на " + СуммаНехватка + " руб."; 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СписокПенсионеров["+(Выборка.НомерСтроки-1)+"].Сумма", "Объект", Отказ);
			КонецЕсли;
			Если ДоплатаНехватка > 0 Тогда
				ТекстСообщения = "По счету № " + Выборка.НомерСчетаТекст + " сумма доплаты превышает сумму задолженности на " + ДоплатаНехватка + " руб."; 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СписокПенсионеров["+(Выборка.НомерСтроки-1)+"].Доплата", "Объект", Отказ);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		Движение = Движения.уп_ЗадолженностьПоПенсиям.ДобавитьРасход();
		Движение.НомерСчета = Выборка.НомерСчета;
		Движение.Период = Дата;
		Движение.НачалоПериода = Выборка.НачалоПериода;
		Движение.КонецПериода = Выборка.КонецПериода;
		Движение.Счетчик = Выборка.СчетчикОстаток;
		Движение.СуммаПенсии = Выборка.Сумма;
		Движение.СуммаДоплаты = Выборка.Доплата;
	КонецЦикла;
	
	//приходные движения в РН npo_НачислениеЗадолженностиПоПриостановкам 
	Для каждого стр из НачислениеЗадолженностиПоПриостановкам Цикл
		Движение = Движения.уп_ЗадолженностьПоПенсиям.ДобавитьПриход();
		Движение.НомерСчета = стр.НомерСчета;
		Движение.Период = Дата;
		Движение.НачалоПериода = стр.НачалоПериодаНачисления;
		Движение.КонецПериода = стр.КонецПериодаНачисления;
		Движение.Счетчик = 1;
		Движение.СуммаПенсии = стр.Сумма;
		Движение.СуммаДоплаты = стр.Доплата;
	КонецЦикла;	
	//Бардошина -
	
	//ОПА НПО 2018.06.18 +
	Если НЕ Доначисление Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_НачислениеПенсийСписокПенсионеров.НомерСчета КАК НомерСчета,
		|	уп_НачислениеПенсийСписокПенсионеров.Периодичность КАК Периодичность
		|ПОМЕСТИТЬ ПенсСчета
		|ИЗ
		|	Документ.уп_НачислениеПенсий.СписокПенсионеров КАК уп_НачислениеПенсийСписокПенсионеров
		|ГДЕ
		|	уп_НачислениеПенсийСписокПенсионеров.Ссылка = &Ссылка
		|	И НЕ уп_НачислениеПенсийСписокПенсионеров.ЭтоВосстановлениеЗадолженности
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	уп_НачислениеПенсийnpo_НачислениеЗадолженностиПоПриостановкам.НомерСчета,
		|	уп_НачислениеПенсийnpo_НачислениеЗадолженностиПоПриостановкам.Периодичность
		|ИЗ
		|	Документ.уп_НачислениеПенсий.НачислениеЗадолженностиПоПриостановкам КАК уп_НачислениеПенсийnpo_НачислениеЗадолженностиПоПриостановкам
		|ГДЕ
		|	уп_НачислениеПенсийnpo_НачислениеЗадолженностиПоПриостановкам.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПенсСчета.НомерСчета КАК НомерСчета,
		|	ПенсСчета.Периодичность КАК Периодичность
		|ИЗ
		|	ПенсСчета КАК ПенсСчета";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = Движения.уп_ДатыСледующихВыплат.Добавить();
			Движение.НомерСчета = Выборка.НомерСчета;
			Движение.Период = Дата;
			Если Выборка.Периодичность = Перечисления.уп_ПериодичностьВыплат.Ежегодно Тогда
				лДатаСледующейВыплаты = ДобавитьМесяц(Дата,12);	
			ИначеЕсли Выборка.Периодичность = Перечисления.уп_ПериодичностьВыплат.Полугодие Тогда
				лДатаСледующейВыплаты = ДобавитьМесяц(Дата,6);	
			ИначеЕсли Выборка.Периодичность = Перечисления.уп_ПериодичностьВыплат.Ежеквартально Тогда
				лДатаСледующейВыплаты = ДобавитьМесяц(Дата,3);	
			ИначеЕсли Выборка.Периодичность = Перечисления.уп_ПериодичностьВыплат.Ежемесячно Тогда
				лДатаСледующейВыплаты = ДобавитьМесяц(Дата,1);	
			КонецЕсли;
			Движение.ДатаСледующейВыплаты = лДатаСледующейВыплаты;
		КонецЦикла;
	КонецЕсли;
	//ОПА НПО 2018.06.18 -
	
	Если (ОтражатьВБухгалтерскомУчете и ПроводкиПоНачислению)  Тогда
		уп_ОбщегоНазначенияУчетРезервов.ДополнитьТаблицуБухУчета(Дата, ТабБухУчет, Ссылка, Отказ);
		Если ОтражатьВБухгалтерскомУчете и ПроводкиПоНачислению Тогда
			уп_ОбщегоНазначенияУчетРезервов.СделатьДвиженияПоБухУчету(ЭтотОбъект, ТабБухУчет);
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	//проставить размер пенсии по срочным выплатам с расчетным размером
	Если НЕ Доначисление Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_НачислениеПенсийСписокПенсионеров.НомерСчета КАК НомерСчета,
		|	МАКСИМУМ(уп_НачислениеПенсийСписокПенсионеров.КонецПериодаНачисления) КАК КонецПериодаНачисления
		|ПОМЕСТИТЬ МаксПериодНачисления
		|ИЗ
		|	Документ.уп_НачислениеПенсий.СписокПенсионеров КАК уп_НачислениеПенсийСписокПенсионеров
		|ГДЕ
		|	уп_НачислениеПенсийСписокПенсионеров.Ссылка = &Ссылка
		|	И (уп_НачислениеПенсийСписокПенсионеров.Схема.ТипПенсионнойСхемы = &СрочныхВыплат
		|   ИЛИ уп_НачислениеПенсийСписокПенсионеров.ТипПенсии = &СрочныхВыплат)
		|	И уп_НачислениеПенсийСписокПенсионеров.Схема.ФиксированныеВыплаты = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_НачислениеПенсийСписокПенсионеров.НомерСчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксПериодНачисления.НомерСчета КАК НомерСчета,
		|	СУММА(уп_НачислениеПенсийСписокПенсионеров.Пенсия) КАК Пенсия
		|ПОМЕСТИТЬ ТаблицаПоследнихНачислений
		|ИЗ
		|	МаксПериодНачисления КАК МаксПериодНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_НачислениеПенсий.СписокПенсионеров КАК уп_НачислениеПенсийСписокПенсионеров
		|		ПО МаксПериодНачисления.НомерСчета = уп_НачислениеПенсийСписокПенсионеров.НомерСчета
		|			И МаксПериодНачисления.КонецПериодаНачисления = уп_НачислениеПенсийСписокПенсионеров.КонецПериодаНачисления
		|ГДЕ
		|	уп_НачислениеПенсийСписокПенсионеров.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	МаксПериодНачисления.НомерСчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РазмерПенсииСрезПоследних.НомерСчета КАК НомерСчета,
		|	уп_РазмерПенсииСрезПоследних.Размер КАК Размер
		|ПОМЕСТИТЬ ПоследниеЗарегистрированныеДанные
		|ИЗ
		|	РегистрСведений.уп_РазмерПенсии.СрезПоследних(
		|			&ДатаДок,
		|			НомерСчета В
		|				(ВЫБРАТЬ
		|					МаксПериодНачисления.НомерСчета
		|				ИЗ
		|					МаксПериодНачисления)) КАК уп_РазмерПенсииСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПоследнихНачислений.НомерСчета КАК НомерСчета,
		|	ТаблицаПоследнихНачислений.Пенсия КАК Пенсия,
		|	ПоследниеЗарегистрированныеДанные.Размер КАК Размер
		|ИЗ
		|	ТаблицаПоследнихНачислений КАК ТаблицаПоследнихНачислений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследниеЗарегистрированныеДанные КАК ПоследниеЗарегистрированныеДанные
		|		ПО ТаблицаПоследнихНачислений.НомерСчета = ПоследниеЗарегистрированныеДанные.НомерСчета";
		
		Запрос.УстановитьПараметр("ДатаДок", Новый Граница(Дата, ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("СрочныхВыплат", Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Пенсия<>ВыборкаДетальныеЗаписи.Размер Тогда
				Движение = Движения.уп_РазмерПенсии.Добавить();
				Движение.Период = Дата;
				Движение.НомерСчета = ВыборкаДетальныеЗаписи.НомерСчета;
				Движение.Размер = ВыборкаДетальныеЗаписи.Пенсия;
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;

	
	Движения.уп_Резервы.Записать();
	Движения.уп_НачисленияПенсий.Записать();
	Движения.уп_ЗадолженностьПоПенсиям.Записать(); //Бардошина+-
	Движения.уп_ДатыСледующихВыплат.Записать(); //ОПА НПО 2018.04.28 +-
	Движения.уп_НДФЛСведенияОДоходахУчастников.Записать();
	Движения.Хозрасчетный.Записать();
	
	// stepanov@orticongroup.ru +	
	Движения.уп_СчетчикНачислений.Записать();
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();

	Запрос.Текст = "ВЫБРАТЬ
	|	уп_СхемаСчетаСрезПоследних.НомерСчета,
	|	уп_СхемаСчетаСрезПоследних.НомерСчета.Участник.Представление КАК Участник
	|ПОМЕСТИТЬ СписокПенсионныхСчетов
	|ИЗ
	|	РегистрСведений.уп_СхемаСчета.СрезПоследних(&ДатаКонца, НомерСчета В (&СписокСчетов)) КАК уп_СхемаСчетаСрезПоследних
	|ГДЕ
	|	уп_СхемаСчетаСрезПоследних.Схема.ТипПенсионнойСхемы = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.СрочныхВыплат)
	|   ИЛИ уп_СхемаСчетаСрезПоследних.ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.СрочныхВыплат)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокПенсионныхСчетов.НомерСчета,
	|	СписокПенсионныхСчетов.Участник
	|ИЗ
	|	СписокПенсионныхСчетов КАК СписокПенсионныхСчетов";
	
	Запрос.УстановитьПараметр("СписокСчетов", СписокПенсионеров.ВыгрузитьКолонку("НомерСчета"));
	Запрос.УстановитьПараметр("ДатаКонца", Новый Граница(КонецМесяца(ПериодНачисления), ВидГраницы.Включая));
	
	ВыборкаПакет = Запрос.ВыполнитьПакет();	
	ТаблицаСчетов = ВыборкаПакет[1].Выгрузить();
	
	Если ТаблицаСчетов.Количество() > 0 Тогда
				
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.уп_СчетчикНачислений");
		ЭлементБлокировки.ИсточникДанных = ТаблицаСчетов;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("НомерСчета", "НомерСчета");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.уп_КоличествоНазначенныхВыплат");
		ЭлементБлокировки.ИсточникДанных = ТаблицаСчетов;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("НомерСчета", "НомерСчета");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

		Блокировка.Заблокировать();
		
		Запрос.Текст = "ВЫБРАТЬ
		#Вставка
	//++https://redmine.npf.com/issues/4274
	|	уп_СчетчикНачислений.НомерСчета КАК НомерСчета,
	|	МАКСИМУМ(ЕСТЬNULL(хм_СрезСчетчик.Количество, 0)) + СУММА(ВЫБОР
	|			КОГДА хм_СрезСчетчик.ДатаУстановкиСостояния ЕСТЬ NULL
	|				ТОГДА ЕСТЬNULL(уп_СчетчикНачислений.Количество, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоОборот
	|ПОМЕСТИТЬ уп_СчетчикНачисленийОбороты
	|ИЗ
	|	РегистрНакопления.уп_СчетчикНачислений КАК уп_СчетчикНачислений
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.хм_СрезСчетчикНачисленийНПО.СрезПоследних(&ДатаКонца,НомерСчета В (&СписокСчетов)) КАК хм_СрезСчетчик
	|		ПО (уп_СчетчикНачислений.НомерСчета = хм_СрезСчетчик.НомерСчета)
	|			И уп_СчетчикНачислений.Период < хм_СрезСчетчик.ДатаУстановкиСостояния 
	|			И хм_СрезСчетчик.ДатаУстановкиСостояния  >= &ДатаНачала	
	|		ГДЕ уп_СчетчикНачислений.Период >= &ДатаНачала 
	|			И уп_СчетчикНачислений.Период <= &ДатаКонцаПериод
	|			И уп_СчетчикНачислений.НомерСчета В (&СписокСчетов)
	|		СГРУППИРОВАТЬ ПО уп_СчетчикНачислений.НомерСчета
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//--https://redmine.npf.com/issues/4274
		#КонецВставки
		|	ЕСТЬNULL(уп_КоличествоНазначенныхВыплатСрезПоследних.НомерСчета.Код, уп_СчетчикНачисленийОбороты.НомерСчета.Код) КАК НомерСчета,
		|	СписокПенсионныхСчетов.Участник,
		|	ЕСТЬNULL(уп_КоличествоНазначенныхВыплатСрезПоследних.КоличествоВыплат, 0) - ЕСТЬNULL(уп_СчетчикНачисленийОбороты.КоличествоОборот, 0) КАК Дельта
		|ИЗ
		|	СписокПенсионныхСчетов КАК СписокПенсионныхСчетов
		#Удаление
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_СчетчикНачислений.Обороты(&ДатаНачала, &ДатаКонца, Период, НомерСчета В (&СписокСчетов)) КАК уп_СчетчикНачисленийОбороты
		#КонецУдаления
		#Вставка
		//++https://redmine.npf.com/issues/4274
		|	ПОЛНОЕ СОЕДИНЕНИЕ 	уп_СчетчикНачисленийОбороты КАК уп_СчетчикНачисленийОбороты
		//--https://redmine.npf.com/issues/4274
		#КонецВставки
		|		ПО СписокПенсионныхСчетов.НомерСчета = уп_СчетчикНачисленийОбороты.НомерСчета
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.уп_КоличествоНазначенныхВыплат.СрезПоследних(
		|				&ДатаКонца,
		|				НомерСчета В
		|					(ВЫБРАТЬ
		|						СписокПенсионныхСчетов.НомерСчета
		|					ИЗ
		|						СписокПенсионныхСчетов КАК СписокПенсионныхСчетов)) КАК уп_КоличествоНазначенныхВыплатСрезПоследних
		|		ПО СписокПенсионныхСчетов.НомерСчета = уп_КоличествоНазначенныхВыплатСрезПоследних.НомерСчета
		|ГДЕ
		|	ЕСТЬNULL(уп_КоличествоНазначенныхВыплатСрезПоследних.КоличествоВыплат, 0) - ЕСТЬNULL(уп_СчетчикНачисленийОбороты.КоличествоОборот, 0) <= 0";
		
		Запрос.УстановитьПараметр("ДатаНачала", Дата('19900101'));
		#Вставка
		//++https://redmine.npf.com/issues/4274                           
		Запрос.УстановитьПараметр("ДатаКонцаПериод", Запрос.Параметры.ДатаКонца.Значение);
		#КонецВставки
		
		СчетаПоследнихВыплат = Запрос.Выполнить().Выгрузить();
		
		Для каждого СтрокаСпискаСчетов Из СчетаПоследнихВыплат Цикл
			
			Если СтрокаСпискаСчетов.Дельта = 0 Тогда
				СтрокаСообщения = НСтр("ru = 'По ПС № %1, %2 последняя выплата.'");
				СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, СокрЛП(СтрокаСпискаСчетов.НомерСчета), СтрокаСпискаСчетов.Участник);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
				МассивСообщений.Добавить(СтрокаСообщения);
			//Иначе
			//	СтрокаСообщения = НСтр("ru = 'По ПС № %1, %2 превышено число выплат.'");
			//	СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, СокрЛП(СтрокаСпискаСчетов.НомерСчета), СтрокаСпискаСчетов.Участник);
			//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
			КонецЕсли;
			
		КонецЦикла;
		
		Запрос.МенеджерВременныхТаблиц.Закрыть();
		
	КонецЕсли;
	// stepanov@orticongroup.ru -
	
	//проверка на окончание справки по инвалидности
	//выполняется по последним записям в регистре
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_СостоянияПССрезПоследних.ДатаОкончанияОснований,
		|	уп_СостоянияПССрезПоследних.НомерСчета,
		|	уп_СостоянияПССрезПоследних.НомерСчета.Участник КАК Участник
		|ИЗ
		|	РегистрСведений.уп_СостоянияПС.СрезПоследних(, НомерСчета В (&СписокСчетов)) КАК уп_СостоянияПССрезПоследних
		|ГДЕ
		|	уп_СостоянияПССрезПоследних.ДатаОкончанияОснований МЕЖДУ &ДатаНачалаОснований И &ДатаОкончанияОснований";
	
	Запрос.УстановитьПараметр("ДатаНачалаОснований", Дата);
	Запрос.УстановитьПараметр("ДатаОкончанияОснований", КонецМесяца(Добавитьмесяц(Дата,3)));
	Запрос.УстановитьПараметр("СписокСчетов", СписокПенсионеров.ВыгрузитьКолонку("НомерСчета"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаСообщения = НСтр("ru = 'У ПС № %1, %2, %3 заканчивается срок действия пенсионных оснований.'");
		СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения, СокрЛП(ВыборкаДетальныеЗаписи.НомерСчета), ВыборкаДетальныеЗаписи.Участник, Формат(ВыборкаДетальныеЗаписи.ДатаОкончанияОснований,"ДФ=dd.MM.yyyy"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения);
		МассивСообщений.Добавить(СтрокаСообщения);
	КонецЦикла;
	ДополнительныеСвойства.Вставить("МассивСообщений", МассивСообщений);
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура НПФ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	Если (ДанныеЗаполнения = Неопределено) ИЛИ Не ЭтотОбъект.Метаданные().Реквизиты.ДокументОснование.Тип.СодержитТип(ТипЗнч(ДанныеЗаполнения)) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним реквизиты из стандартного набора по документу основанию.
	уп_ОсновнаяПоставкаСервер.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, ДанныеЗаполнения);
	#Удаление
	Если  ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уп_ПриостановкаВыплат") И ДанныеЗаполнения.ПричинаПриостановки=Справочники.уп_ПричиныПриостановок.ОкончаниеПенсионныхОснований Тогда
		ПериодНачисления = НачалоМесяца(ДанныеЗаполнения.Дата);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уп_ПриостановкаВыплат") Тогда
	#КонецУдаления
	#Вставка
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уп_ПриостановкаВыплат") Тогда
	#КонецВставки
		ПериодНачисления = НачалоМесяца(ДанныеЗаполнения.ДатаКонца);
		#Вставка
		// +ХМНПФ 26.04.2022 ХлопцевБА // Начисление пенсии после воостановления // №3453
		ЭтотОбъект.Дата = КонецМесяца(ПериодНачисления);
		// -ХМНПФ 26.04.2022 ХлопцевБА // Начисление пенсии после воостановления // №3453
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	уп_НачислениеПенсий.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.уп_НачислениеПенсий КАК уп_НачислениеПенсий
			|ГДЕ
			|	уп_НачислениеПенсий.ДокументОснование = &ДокументОснование
			|	И уп_НачислениеПенсий.ПометкаУдаления = ЛОЖЬ
			|	И НЕ уп_НачислениеПенсий.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ВызватьИсключение "По возобновлению уже есть начисление, повторное создание документа начисления невозможно или требует пометки на удаление существующего начисления."
		КонецЕсли;
		#КонецВставки

	Иначе
		ПериодНачисления = НачалоМесяца(ДанныеЗаполнения.Дата);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения.ДатаВосстановления) Тогда
		Возврат;
	КонецЕсли;	
	ОтражатьНБТекущимПериодом = Истина;
	ДокументОснование = ДанныеЗаполнения;
	Для Каждого стр из ДанныеЗаполнения.СписокСчетов Цикл 
		ДатаПериода = ДанныеЗаполнения.ДатаВосстановления;
		ДобавлятьСтроку = Истина;
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уп_ПриостановкаВыплат") И ЗначениеЗаполнено(стр.ТипПриостановки)
			И ДанныеЗаполнения.ПричинаПриостановки<>Справочники.уп_ПричиныПриостановок.ОкончаниеПенсионныхОснований Тогда 
			ДобавлятьСтроку = Ложь;
			Сообщить("По пенсионному счету "+СокрЛП(стр.НомерСчета)+" задолженность по пенсии накоплена в регистре учета задолженности и будет выплачена автоматически.");
			#Вставка
			ВызватьИсключение "По пенсионному счету "+СокрЛП(стр.НомерСчета)+" задолженность по пенсии накоплена в регистре учета задолженности и будет выплачена автоматически.";
			#КонецВставки
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уп_СправкаОбИнвалидности")	И ЗначениеЗаполнено(стр.Расшифровка) Тогда
			ДобавлятьСтроку = Ложь;
			Сообщить("По пенсионному счету "+СокрЛП(стр.НомерСчета)+" задолженность по пенсии накоплена в регистре учета задолженности и будет выплачена автоматически.");
			#Вставка
			ВызватьИсключение "По пенсионному счету "+СокрЛП(стр.НомерСчета)+" задолженность по пенсии накоплена в регистре учета задолженности и будет выплачена автоматически.";
			#КонецВставки
		ИначеЕсли  ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уп_ПриостановкаВыплат") И ДанныеЗаполнения.ПричинаПриостановки=Справочники.уп_ПричиныПриостановок.ОкончаниеПенсионныхОснований Тогда
			//надо смотреть - есть накопленная задолженность или нет
			Если стр.Задолженность<>0 Тогда //задолженность накапливалась и в документ счет добавлятть не надо
				ДобавлятьСтроку = Ложь; 
				Сообщить("По пенсионному счету "+СокрЛП(стр.НомерСчета)+" задолженность по пенсии накоплена в регистре учета задолженности и будет выплачена автоматически.");
			КонецЕсли;	
		КонецЕсли;
		Если ДобавлятьСтроку Тогда
			ПериодичностьВыплат = РегистрыСведений.уп_ПериодичностьВыплат.ПолучитьПоследнее(ДанныеЗаполнения.Дата, Новый Структура("НомерСчета", стр.НомерСчета)).ПериодичностьВыплат;
			КоэфПериода = уп_НПФ.ЧисловойКоэффициентПериода(ПериодичностьВыплат);
			ДанныеСхемы = РегистрыСведений.уп_СхемаСчета.ПолучитьПоследнее(ДанныеЗаполнения.Дата, Новый Структура("НомерСчета", стр.НомерСчета)); 
			#Удаление
			Если ДанныеСхемы.Схема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат
				или ДанныеСхемы.ТипПенсии = Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат Тогда //надо определить дату окончания выплат
				// определить количество оставшихся выплат 
				//смотрим количество сделанных выплат
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	уп_СчетчикНачисленийОбороты.КоличествоОборот
				|ИЗ
				|	РегистрНакопления.уп_СчетчикНачислений.Обороты(&ДатаНачалаВремен, &ДатаДок, Период, НомерСчета = &НомерСчета) КАК уп_СчетчикНачисленийОбороты";
				Запрос.УстановитьПараметр("НомерСчета", стр.НомерСчета);
				Запрос.УстановитьПараметр("ДатаНачалаВремен", '19800101');
				Запрос.УстановитьПараметр("ДатаДок", ТекущаяДата());
			#КонецУдаления
			#Вставка
//++https://redmine.npf.com/issues/4274
//	|		(ВЫБРАТЬ уп_СчетчикНачислений.НомерСчета, Максимум(естьNUll(хм_СрезСчетчик.Количество,0)) + СУММА(ВЫБОР КОГДА хм_СрезСчетчик.ДатаУстановкиСостояния есть NUll Тогда естьNUll(уп_СчетчикНачислений.Количество,0) ИНАЧЕ 0 КОНЕЦ) КАК КоличествоОборот
//	|		ИЗ РегистрНакопления.уп_СчетчикНачислений КАК уп_СчетчикНачислений
//	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.хм_СрезСчетчикНачисленийНПО.СрезПоследних(&ДатаДок,НомерСчета = &НомерСчета) КАК хм_СрезСчетчик
//	|		ПО (уп_СчетчикНачислений.НомерСчета = хм_СрезСчетчик.НомерСчета)
//	|			И уп_СчетчикНачислений.Период < хм_СрезСчетчик.ДатаУстановкиСостояния 
//	|		ГДЕ уп_СчетчикНачислений.Период <= &ДатаДок 
//	|			И уп_СчетчикНачислений.НомерСчета = &НомерСчета
//	|		СГРУППИРОВАТЬ ПО уп_СчетчикНачислений.НомерСчета
//	|		) КАК уп_СчетчикНачисленийОбороты";
//--https://redmine.npf.com/issues/4274
			Пока уп_НПФ.ОпределитьДатуНачалаПериода(ДатаПериода,ПериодичностьВыплат)<=уп_НПФ.ОпределитьДатуНачалаПериода(ПериодНачисления,ПериодичностьВыплат) Цикл
			#КонецВставки
				#Удаление
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					КолНачислено = Выборка.КоличествоОборот;
				Иначе
					КолНачислено = 0;
				КонецЕсли;
				КолНазначено = РегистрыСведений.уп_КоличествоНазначенныхВыплат.ПолучитьПоследнее(ДанныеЗаполнения.Дата, Новый Структура("НомерСчета", стр.НомерСчета)).КоличествоВыплат;
				
				КолОставшихсяВыплат = КолНазначено-КолНачислено;
				ДатаНачПериода = уп_НПФ.ОпределитьДатуНачалаПериода(ДатаПериода,ПериодичностьВыплат);
				Если ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежегодно Тогда
					лДатаОкончанияСрочнойВыплаты = ДобавитьМесяц(НачалоМесяца(ДатаНачПериода),КолОставшихсяВыплат*12)-1;	
				ИначеЕсли ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Полугодие Тогда
					лДатаОкончанияСрочнойВыплаты = ДобавитьМесяц(НачалоМесяца(ДатаНачПериода),КолОставшихсяВыплат*6)-1;
				ИначеЕсли ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежеквартально Тогда
					лДатаОкончанияСрочнойВыплаты = ДобавитьМесяц(НачалоМесяца(ДатаНачПериода),КолОставшихсяВыплат*3)-1;	
				ИначеЕсли ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежемесячно Тогда
					лДатаОкончанияСрочнойВыплаты = ДобавитьМесяц(НачалоМесяца(ДатаНачПериода),КолОставшихсяВыплат)-1;
				Иначе
					лДатаОкончанияСрочнойВыплаты = уп_НПФ.ОпределитьДатуНачалаПериода(ПериодНачисления,ПериодичностьВыплат);
				КонецЕсли;
			Иначе
				лДатаОкончанияСрочнойВыплаты = уп_НПФ.ОпределитьДатуНачалаПериода(ПериодНачисления,ПериодичностьВыплат);
			КонецЕсли;	
			Пока уп_НПФ.ОпределитьДатуНачалаПериода(ДатаПериода,ПериодичностьВыплат)<=уп_НПФ.ОпределитьДатуНачалаПериода(ПериодНачисления,ПериодичностьВыплат)
				и уп_НПФ.ОпределитьДатуНачалаПериода(ДатаПериода,ПериодичностьВыплат)<=лДатаОкончанияСрочнойВыплаты Цикл
				#КонецУдаления
				#Вставка
				Если  ПериодНачисления <=  уп_НПФ.ОпределитьДатуНачалаПериода(ДатаПериода,ПериодичностьВыплат) И НЕ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уп_ПриостановкаВыплат") Тогда
				#КонецВставки
				НовСтр = СписокПенсионеров.Добавить();
				НовСтр.НачалоПериодаНачисления = уп_НПФ.ОпределитьДатуНачалаПериода(ДатаПериода,ПериодичностьВыплат);
				НовСтр.КонецПериодаНачисления = уп_НПФ.ОпределитьДатуКонцаПериода(ДатаПериода,ПериодичностьВыплат);
				НовСтр.НомерСчета = стр.НомерСчета;
				НовСтр.ПенсионныйДоговор = стр.НомерСчета.Владелец;
				НовСтр.Периодичность = ПериодичностьВыплат;
				НовСтр.Схема = ДанныеСхемы.Схема; 
				Если ЗначениеЗаполнено(ДанныеСхемы.ТипПенсии) Тогда
					НовСтр.ТипПенсии = ДанныеСхемы.ТипПенсии;
				Иначе
					НовСтр.ТипПенсии = НовСтр.Схема.ТипПенсионнойСхемы;
				КонецЕсли;	
				НовСтр.Участник = стр.НомерСчета.Участник;
				#Вставка
				Иначе
					// +ХМНПФ 26.04.2022 ХлопцевБА // Начисление пенсии после воостановления // №3453
					НовСтр = НачислениеЗадолженностиПоПриостановкам.Добавить();
					НовСтр.НачалоПериодаНачисления = уп_НПФ.ОпределитьДатуНачалаПериода(ДатаПериода,ПериодичностьВыплат);
					НовСтр.КонецПериодаНачисления = уп_НПФ.ОпределитьДатуКонцаПериода(ДатаПериода,ПериодичностьВыплат);
					Новстр.НомерСчета = стр.НомерСчета;
					НовСтр.ПенсионныйДоговор = стр.НомерСчета.Владелец;
					НовСтр.Периодичность = ПериодичностьВыплат;
					НовСтр.Участник = стр.НомерСчета.Участник;
					// +ХМНПФ 26.04.2022 ХлопцевБА // Начисление пенсии после воостановления // №3453
				КонецЕсли;
				#КонецВставки
					
					ДатаПериода = ДобавитьМесяц(ДатаПериода,КоэфПериода);
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&После("ПередЗаписью")
Процедура НПФ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("НеОтражатьНБТекущимПериодом") = Неопределено И НЕ ЭтотОбъект.ОтражатьНБТекущимПериодом И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Сообщить("Для корректности налогового учета требуется отражать НБ текущим периодом");
		Отказ = Истина;
	КонецЕсли;
	//ЛыткинАМ - распределение документов по дате
	Дата = НачалоДня(Дата)+60*Месяц(ПериодНачисления);
КонецПроцедуры

&ИзменениеИКонтроль("ВыполнитьСписаниеСПС")
Процедура ХМВыполнитьСписаниеСПС(ТабСумм, пУчетРезервовНачисления)
	Для каждого стр из ТабСумм Цикл
		Если стр.СуммаСписать<>0 Тогда
			Движение = Движения.уп_Резервы.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Регистратор = Ссылка;
			Движение.НомерСчета =   стр.НомерСчета;
			Движение.ТипРезерва = стр.ТипРезерва;
			Движение.ТипСуммы = стр.ТипСуммы;
			Движение.Сумма = стр.СуммаСписать;
			Движение.Схема = стр.Схема;
			Движение.Движение = Перечисления.уп_ВидыДвижений.Начисление;
			//ОПА НПО 2018.04.28 +
			Если ВестиУчетПСпоТипамДоговоровЕПС Тогда
				Движение.ВидДвиженияПоТипамЕПС = уп_ОбщегоНазначенияСервер.npo_ОпределитьВидДвиженияПоТипамЕПС(Дата,"уп_НачислениеПенсий",,стр.НомерСчета,,ВестиУчетПСпоТипамДоговоровЕПС);
			Иначе
				Движение.ВидДвиженияПоТипамЕПС = уп_ОбщегоНазначенияСервер.npo_ОпределитьВидДвиженияПоТипамЕПС(Дата,"уп_НачислениеПенсий",стр.ТипРезерва,,,ВестиУчетПСпоТипамДоговоровЕПС);
			КонецЕсли;	
			#Вставка
			// +ХМНПФ 23.05.2024 ЛыткинАМ // учет по счетам источникам
			Движение.ПенсионныйСчетИсточник	= стр.ПенсионныйСчетИсточник;
			#КонецВставки
			//ОПА НПО 2018.04.28 -
			Если ВестиУчетПоСхемам Тогда
				Движение.ПенсионнаяСхема = стр.ПенсионнаяСхема;
			КонецЕсли;

			Если пУчетРезервовНачисления Тогда
				Движение = Движения.уп_Резервы.ДобавитьПриход();
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Регистратор = Ссылка;
				Движение.НомерСчета =   стр.НомерСчета;
				Если стр.ТипРезерва = Перечисления.уп_ТипыРезерва.ПожизненныхВыплат Тогда
					Движение.ТипРезерва = Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийПожизненныхВыплат;
				Иначе
					Движение.ТипРезерва = Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийСПС;
				КонецЕсли;
				Движение.ТипСуммы = стр.ТипСуммы;
				Движение.Сумма = стр.СуммаСписать;
				Движение.Схема = стр.Схема;
				Движение.Движение = Перечисления.уп_ВидыДвижений.Начисление;
				Если ВестиУчетПоСхемам Тогда
					Движение.ПенсионнаяСхема = стр.Схема;
				КонецЕсли;
				#Вставка
				// +ХМНПФ 23.05.2024 ЛыткинАМ // учет по счетам источникам
				Движение.ПенсионныйСчетИсточник	= стр.ПенсионныйСчетИсточник;
				#КонецВставки
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// ХМНПФ 27.01.2017 ШадринАВ // Новая ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №779
Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ, СтруктураТЧ) Экспорт
	Если Проведен Тогда
		// ХМНПФ 27.01.2017 ШадринАВ // Новая ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №779
		ЗагрузитьПроводкиПоДокументуНаСервере(СтрокаТЗ.ved_id);
		ЗаполнитьРегистрыНДФЛДохода();
		РучнаяКорректировка = Истина;
		Записать();
		ОбработкаПроведения(Отказ, Режим);
	Иначе
		ОбработкаУдаленияПроведения(Отказ)
	КонецЕсли;  
	КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 22.08.2016 ШадринАВ // длина номера изменена с 8 до 18 // №459
	// ХМНПФ 27.01.2017 ШадринАВ // Новая ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №779
КонецПроцедуры  

Функция ТекстЗапросаПроводокКаспер(ID_VED_ID) 
 
    Результат = Документы.уп_НачислениеПенсий.ПолучитьМакет("ТекстЗапросаПроводокКаспер").ПолучитьТекст();
	Результат = СтрЗаменить(Результат,"%ID_VED_ID%",ID_VED_ID);
	
	Возврат Результат;
	
КонецФункции  

Функция ТекстЗапросаПроводок1С() 
 	Возврат 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТACC_ID.VED_ID КАК VED_ID,
	|	ВТACC_ID.oper_date_pp КАК oper_date_pp,
	|	ВТACC_ID.ACC_ID КАК ACC_ID,
	|	ВТACC_ID.ACC_ID_S КАК ACC_ID_S,
	|	ПОДСТРОКА(ВТACC_ID.ved_list, 1, 50) КАК ved_list,
	|	ВТACC_ID.oper_begin_o КАК oper_begin_o,
	|	ПОДСТРОКА(ВТACC_ID.opergroup_sid, 1, 50) КАК opergroup_sid,
	|	ПОДСТРОКА(ВТACC_ID.pens_sub_map, 1, 50) КАК pens_sub_map,
	|	ВТACC_ID.oper_sum КАК oper_sum,
	|	ВТACC_ID.BaseNdfl КАК BaseNdfl
	|ПОМЕСТИТЬ ВТ_ACC_ID
	|ИЗ
	|	&ВТACC_ID КАК ВТACC_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ACC_ID.VED_ID КАК VED_ID,
	|	ВТ_ACC_ID.oper_date_pp КАК oper_date_pp,
	|	ВТ_ACC_ID.ACC_ID КАК ACC_ID,
	|	ВТ_ACC_ID.ved_list КАК ved_list,
	|	ВТ_ACC_ID.opergroup_sid КАК opergroup_sid,
	|	ВТ_ACC_ID.pens_sub_map КАК pens_sub_map,
	|	ХМ_КасперСчета.Счет КАК Счет,
	|	ВЫРАЗИТЬ(ХМ_КасперPROP_SID.Справочник КАК Справочник.уп_ПенсионныеСхемы).Ссылка КАК Схема,
	|	ВЫРАЗИТЬ(ХМ_КасперPROP_SID1.Справочник КАК Справочник.уп_ТипыСумм).Ссылка КАК ТипСумм,
	|	ВЫБОР
	|		КОГДА ВТ_ACC_ID.ved_list = ""СПС""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.СПС)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.ИПС)
	|	КОНЕЦ КАК ТипРезерваСписания,
	|	ВЫБОР
	|		КОГДА ВТ_ACC_ID.ved_list = ""СПС""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.РезервНачисленийПенсийСПС)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.РезервНачисленийПенсийИПС)
	|	КОНЕЦ КАК ТипРезерваНачисления,
	|	ВТ_ACC_ID.oper_sum КАК oper_sum,
	|	ВТ_ACC_ID.BaseNdfl КАК BaseNdfl,
	|	ВТ_ACC_ID.oper_begin_o КАК oper_begin_o,
	|	ХМ_КасперСчета1.Счет КАК СчетИсточник
	|ИЗ
	|	ВТ_ACC_ID КАК ВТ_ACC_ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХМ_КасперPROP_SID КАК ХМ_КасперPROP_SID
	|		ПО ВТ_ACC_ID.pens_sub_map = ХМ_КасперPROP_SID.PROP_SID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХМ_КасперPROP_SID КАК ХМ_КасперPROP_SID1
	|		ПО ВТ_ACC_ID.opergroup_sid = ХМ_КасперPROP_SID1.PROP_SID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХМ_КасперСчета КАК ХМ_КасперСчета
	|		ПО ВТ_ACC_ID.ACC_ID = ХМ_КасперСчета.ACC_ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХМ_КасперСчета КАК ХМ_КасперСчета1
	|		ПО ВТ_ACC_ID.ACC_ID_S = ХМ_КасперСчета1.ACC_ID";       

	
КонецФункции     

Процедура ЗагрузитьПроводкиПоДокументуНаСервере(Знач ved_id, Знач РезервНачислений = Истина)
	
	Перем Запрос, НаборЗаписей, НоваяЗапись, НоваяЗаписьПриход, ПроизвольныйЗапрос, тзХМ_КасперСчета, ТЧЗапроса, Число;
	
	Число = Формат(ved_id, "ЧГ=");
	ПроизвольныйЗапрос =  ТекстЗапросаПроводокКаспер(Строка(Число));  
	ТЧЗапроса = ХМ_ЗагрузкаТЗ_Клиент.ИмпортИзКасперМодульОбъекта(ПроизвольныйЗапрос); 	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПроводок1С(); 
	Запрос.УстановитьПараметр("ВТACC_ID", ТЧЗапроса);
	
	тзХМ_КасперСчета = Запрос.Выполнить().Выбрать();    
	
	//запись в регистр
	НаборЗаписейРезервы = Движения.уп_Резервы;
	НаборЗаписейРезервы.Очистить();
	
	НаборЗаписейНачисления = Движения.уп_НачисленияПенсий;
	НаборЗаписейНачисления.Очистить();

	Пока тзХМ_КасперСчета.Следующий() Цикл 
		//СхемаДПрошлая = РегистрыСведений.уп_СхемаСчета.ПолучитьПоследнее(Период, Новый Структура("НомерСчета", тзХМ_КасперСчета.Счет)); 
		
		НоваяЗапись = НаборЗаписейРезервы.Добавить();  
		НоваяЗапись.Активность = Истина;   
		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход; 
		НоваяЗапись.Период     = тзХМ_КасперСчета.oper_date_pp;
		НоваяЗапись.Организация = Организация;
		НоваяЗапись.Регистратор = Ссылка;
		НоваяЗапись.НомерСчета = тзХМ_КасперСчета.СчетИсточник;  
		НоваяЗапись.ТипРезерва =тзХМ_КасперСчета.ТипРезерваСписания;
		НоваяЗапись.ТипСуммы =тзХМ_КасперСчета.ТипСумм;
		НоваяЗапись.Сумма =тзХМ_КасперСчета.oper_sum; 
		НоваяЗапись.Движение = Перечисления.уп_ВидыДвижений.Начисление;
		НоваяЗапись.Схема = тзХМ_КасперСчета.Схема;
		НоваяЗапись.ВидДвиженияПоТипамЕПС= Перечисления.уп_ВидыДвиженийПоТипамЕПС.НачислениеПенсии_Инвестиционный; 
		НоваяЗапись.ПенсионныйСчетИсточник  = тзХМ_КасперСчета.Счет;
		
		//Приход в начисления
		Если РезервНачислений Тогда 
			НоваяЗапись = НаборЗаписейРезервы.Добавить();  
			НоваяЗапись.Активность = Истина;   
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход; 
			НоваяЗапись.Период     = тзХМ_КасперСчета.oper_date_pp;
			НоваяЗапись.Организация = Организация;
			НоваяЗапись.Регистратор = Ссылка;
			НоваяЗапись.НомерСчета = тзХМ_КасперСчета.СчетИсточник;  
			НоваяЗапись.ТипРезерва =тзХМ_КасперСчета.ТипРезерваНачисления;
			НоваяЗапись.ТипСуммы =тзХМ_КасперСчета.ТипСумм;
			НоваяЗапись.Сумма =тзХМ_КасперСчета.oper_sum; 
			НоваяЗапись.Движение = Перечисления.уп_ВидыДвижений.Начисление;
			НоваяЗапись.Схема = тзХМ_КасперСчета.Схема;	
			НоваяЗапись.ВидДвиженияПоТипамЕПС= Перечисления.уп_ВидыДвиженийПоТипамЕПС.НачислениеПенсии_Инвестиционный; 
			НоваяЗапись.ПенсионныйСчетИсточник  = тзХМ_КасперСчета.Счет;
		КонецЕсли; 	
		
		НоваяЗапись = НаборЗаписейНачисления.Добавить();  
		НоваяЗапись.Активность = Истина;   
		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход; 
		НоваяЗапись.Период     = тзХМ_КасперСчета.oper_date_pp;
		НоваяЗапись.НачПериода = тзХМ_КасперСчета.oper_begin_o;
		НоваяЗапись.КонПериода = КонецМесяца(тзХМ_КасперСчета.oper_begin_o);
		НоваяЗапись.Регистратор = Ссылка;
		НоваяЗапись.НомерСчета = тзХМ_КасперСчета.Счет;  
		НоваяЗапись.ДнейВПериоде = День(КонецМесяца(тзХМ_КасперСчета.oper_begin_o));
		НоваяЗапись.Сумма =тзХМ_КасперСчета.oper_sum; 
		НоваяЗапись.НалоговаяБазаПоНДФЛ =тзХМ_КасперСчета.BaseNdfl; 
		НоваяЗапись.Схема = тзХМ_КасперСчета.Схема;	
		НоваяЗапись.ТипРезерва =тзХМ_КасперСчета.ТипРезерваСписания;
		НоваяЗапись.ТипСуммы =тзХМ_КасперСчета.ТипСумм; 
		НоваяЗапись.ТипРезерваНачисления =тзХМ_КасперСчета.ТипРезерваСписания;
		НоваяЗапись.НомерСчетаНачисления = тзХМ_КасперСчета.СчетИсточник; 
	КонецЦикла;
	
	
	НаборЗаписейРезервы.Записать();
	НаборЗаписейНачисления.Записать();
	
КонецПроцедуры

Функция ПолучитьСсылкуИзНавигационной(НС)
    
    ПерваяТочка = Найти(НС, "e1cib/data/");
    ВтораяТочка = Найти(НС, "?ref=");
    
    ПредставлениеТипа   = Сред(НС, ПерваяТочка + 11, ВтораяТочка - ПерваяТочка - 11);
    ШаблонЗначения = ЗначениеВСтрокуВнутр(ПредопределенноеЗначение(ПредставлениеТипа + ".ПустаяСсылка"));
    ЗначениеСсылки = СтрЗаменить(ШаблонЗначения, "00000000000000000000000000000000", Сред(НС, ВтораяТочка + 5));
    Возврат ЗначениеИзСтрокиВнутр(ЗначениеСсылки);
    
КонецФункции

Процедура ЗаполнитьРегистрыНДФЛДохода()
        	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_НачисленияПенсий.Регистратор КАК Регистратор,
		|	уп_НачисленияПенсий.НомерСчета КАК НомерСчета,
		|	НАЧАЛОПЕРИОДА(уп_НачисленияПенсий.Период, МЕСЯЦ) КАК Период,
		|	СУММА(уп_НачисленияПенсий.НалоговаяБазаПоНДФЛ*ВЫБОР КОГДА уп_НачисленияПенсий.ВидДвижения = &ВидДвиженияПриход ТОГДА 1 ИНАЧЕ -1 КОНЕЦ) КАК НБ_Оборот,
		|	уп_НачисленияПенсий.ВидДвижения КАК ВидДвижения
		|ПОМЕСТИТЬ уп_Начисления
		|ИЗ
		|	РегистрНакопления.уп_НачисленияПенсий КАК уп_НачисленияПенсий
		|ГДЕ
		|	уп_НачисленияПенсий.Регистратор = &ССЫЛКА
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_НачисленияПенсий.НомерСчета,
		|	НАЧАЛОПЕРИОДА(уп_НачисленияПенсий.Период, МЕСЯЦ),
		|	уп_НачисленияПенсий.Регистратор,
		|	уп_НачисленияПенсий.ВидДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_Начисления.Регистратор КАК Регистратор,
		|	уп_Начисления.НомерСчета КАК НомерСчета,
		|	уп_Начисления.НомерСчета.Участник КАК Участник,
		|	уп_Начисления.Период КАК Период,
		|	уп_Начисления.НБ_Оборот КАК НБ_Оборот,
		|	уп_Начисления.НомерСчета.Участник.уп_ФизЛицо КАК ФизическоеЛицо,
//		|	уп_НачислениеПенсий.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	ИСТИНА КАК Активность,
		|	уп_НачислениеПенсий.Организация КАК Организация,
		|	&КодДохода1240 КАК КодДохода,
		|	уп_Начисления.Период КАК ПериодРегистрации,
		|	уп_Начисления.НБ_Оборот КАК СуммаДохода,
		|	&ВидРасчетаНегосударственнаяПенсия КАК ВидРасчета,
		|	уп_НачислениеПенсий.Организация КАК ГоловнаяОрганизация,
		|	уп_Начисления.Период КАК МесяцНалоговогоПериода,
		|	&КатегорияДоходаПоСтавке_1_1_224 КАК КатегорияДохода,
		|	&РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	&НачислениеНегПенсия КАК Начисление,
//		|	уп_НачислениеПенсий.ПодразделениеОрганизации КАК Подразделение,
		|	уп_Начисления.Период КАК ДатаПолученияДохода
		|ИЗ
		|	уп_Начисления КАК уп_Начисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_НачислениеПенсий КАК уп_НачислениеПенсий
		|		ПО уп_Начисления.Регистратор = уп_НачислениеПенсий.Ссылка";
	
	Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидРасчетаНегосударственнаяПенсия", ПланыВидовРасчета.Начисления.уп_Пенсия);
	Запрос.УстановитьПараметр("КатегорияДоходаПоСтавке_1_1_224", Перечисления.КатегорииДоходовНДФЛ.ПрочиеДоходыПоСтавкеПункта11Статьи224НКРФ);
	Запрос.УстановитьПараметр("КодДохода1240", Справочники.ВидыДоходовНДФЛ.НайтиПоКоду("1240"));
	Запрос.УстановитьПараметр("НачислениеНегПенсия", ПланыВидовРасчета.Начисления.уп_Пенсия);
	Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", ПолучитьСсылкуИзНавигационной("e1cib/data/Справочник.РегистрацииВНалоговомОргане?ref=a06b00224d4d1e2c11e535ccff832241"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЧПроводок = РезультатЗапроса.Выгрузить();
	
	НЗ_БП = Движения.СведенияОДоходахНДФЛ;
	НЗ_БП.Очистить();

	НЗ_УП = Движения.уп_НДФЛСведенияОДоходахУчастников;
	НЗ_УП.Очистить();
	Для каждого СтрокаДет Из ТЧПроводок Цикл
		СтрокаНЗ = НЗ_БП.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНЗ,СтрокаДет);
		СтрокаНЗ = НЗ_УП.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНЗ,СтрокаДет);
	КонецЦикла;
	НЗ_БП.Записать();
	НЗ_УП.Записать();
 
КонецПроцедуры

Функция АрхивТекстЗапросаПроводок(ID_VED_ID) 
 
	СимволыЗамены = Формат(ПериодНачисления, "ДФ=""дд.ММ.гггг"""); 
	

	Результат =
	
	"select t.ved_id, t.oper_date_pp,t.ACC_ID, t.ved_list, t.opergroup_sid, t.pens_sub_map, sum(oper_sum) as oper_sum
	|    from (
	|    select v.ved_id,v.ved_type, v.ved_sum, o.oper_begin, decode(c.doc_id, 17, 'СПС','ИПС') as ved_list, 
	|    vv.ved_val_id, decode(c.doc_id, 17, 17,C.ACC_ID) as ACC_ID, decode(c.doc_id, 17, '0031-00',C.acc_num) AS acc_num,vv.sum_ved ,
	|     decode(o.oper_dt_cr, 'dt', -o.oper_sum, 'cr', o.oper_sum, 0) as oper_sum, nvl(o.oper_date_p,o.oper_date) as oper_date_pp,
	|     og2.oper_name2 as oper_name, og2.opergroup_sid, decode(c.doc_id, 17, 'К-СПС',dv.prop_val) as pens_sub_map , O.OPER_TYPE_SID
	|    from ved v
	|    inner join ved_val vv on VV.VED_ID = v.ved_id
	|    inner join acc c on c.acc_id = vv.acc_id and c.doc_id not in (39)  and c.acc_type_sid <> 'ИЛС' 
	|    inner join v_actor va on va.actor_id = c.actor_id
	|    inner join oper o on O.VED_VAL_ID = vv.ved_val_id and o.acc_id = vv.acc_id and o.oper_dt_cr = 'cr' and o.oper_type_sid in ('adi', 'adv')
	|    left join opergroup og2 on o.oper_type_sid = og2.oper_type_sid and o.group_sid = og2.group_sid and nvl(o.group_sid2, '-1') = nvl(og2.group_sid2, '-1')
	|    left join (select f.set_doc_id, f.actor_id,f.acc_id  from pf_table f where f.pf_id = (select max(pf_id) from KU.PF_LIST)) f on f.acc_id = c.acc_id
	|    left join doc_val dv on dv.doc_id = f.set_doc_id and dv.actor_id = f.actor_id and dv.prop_sid = 'pens_sub_map' 
	|    left join V_VPL_HALF_VZRI h_VZRI on h_VZRI.ACC_ID=c.ACC_ID and h_VZRI.OPER_BEGIN = O.OPER_BEGIN and NOT O.OPER_DATE = O.OPER_BEGIN
	|    where nvl(h_VZRI.HALF_VZRI,0) = 0 and V.VED_ID="+ID_VED_ID+" 
	|    ) t
	|    group by t.oper_date_pp,t.ACC_ID, t.ved_list, t.opergroup_sid, t.ved_id, t.pens_sub_map
	|    order by t.ved_id  
	|";	
	
	АрхивРезультат = "select t.ved_id, t.oper_date_pp,t.ACC_ID, t.ved_list, t.opergroup_sid, t.pens_sub_map, sum(oper_sum) as oper_sum, ACC_ID_dbt, zdbt
	|from (
	|select v.ved_id,v.ved_type, v.ved_sum, o.oper_begin,dbt.VED_PERIOD, decode(c.doc_id, 17, 'СПС','ИПС') as ved_list, 
	|vv.ved_val_id, decode(c.doc_id, 17, 17,C.ACC_ID) as ACC_ID, decode(c.doc_id, 17, '0031-00',C.acc_num) AS acc_num,vv.sum_ved ,
	| decode(o.oper_dt_cr, 'dt', -o.oper_sum, 'cr', o.oper_sum, 0) as oper_sum, nvl(o.oper_date_p,o.oper_date) as oper_date_pp,
	| og2.oper_name2 as oper_name, og2.opergroup_sid, decode(c.doc_id, 17, 'К-СПС',dv.prop_val) as pens_sub_map , dbt.ACC_ID_dbt ,O.OPER_TYPE_SID,
	|  case when c.ACC_ID =dbt.ACC_ID_dbt and (O.OPER_TYPE_SID='dbc' or o.oper_begin=dbt.VED_PERIOD )  then 1 else null end as zdbt
	|from ved v
	|inner join ved_val vv on VV.VED_ID = v.ved_id 
	|inner join acc c on c.acc_id = vv.acc_id and c.doc_id not in (39)  and c.acc_type_sid <> 'ИЛС' 
	|inner join v_actor va on va.actor_id = c.actor_id
	|inner join oper o on O.VED_VAL_ID = vv.ved_val_id and o.acc_id = vv.acc_id and o.oper_dt_cr not in ('nn', 'dt')
	|left join opergroup og2 on o.oper_type_sid = og2.oper_type_sid and o.group_sid = og2.group_sid and nvl(o.group_sid2, '-1') = nvl(og2.group_sid2, '-1')
	|left join (select f.set_doc_id, f.actor_id,f.acc_id  from pf_table f where f.pf_id = (select max(pf_id) from KU.PF_LIST)) f on f.acc_id = c.acc_id
	|left join doc_val dv on dv.doc_id = f.set_doc_id and dv.actor_id = f.actor_id and dv.prop_sid = 'pens_sub_map' 
	|left join V_VPL_DBT dbt on dbt.ACC_ID_dbt=C.ACC_ID and dbt.VED_PERIOD=trunc(ADD_MONTHS(to_date('"+СимволыЗамены+"'), -1), 'MM') 
	|where V.VED_ID="+ID_VED_ID+" 
	|) t
	|where t.zdbt is null
	|group by t.oper_date_pp,t.ACC_ID, t.ved_list, t.opergroup_sid, t.ved_id, t.pens_sub_map, t.ACC_ID_dbt, zdbt
	|order by t.ved_id";  
	
	Возврат Результат;
	
КонецФункции     

Функция АрхивТекстЗапросаПроводок1С() 
 	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТACC_ID.VED_ID КАК VED_ID,
	|	ВТACC_ID.oper_date_pp КАК oper_date_pp,
	|	ВТACC_ID.ACC_ID КАК ACC_ID,
	|	ПОДСТРОКА(ВТACC_ID.ved_list, 1, 50) КАК ved_list,
	|	ПОДСТРОКА(ВТACC_ID.opergroup_sid, 1, 50) КАК opergroup_sid,
	|	ПОДСТРОКА(ВТACC_ID.pens_sub_map, 1, 50) КАК pens_sub_map,
	|	ВТACC_ID.oper_sum КАК oper_sum
	|ПОМЕСТИТЬ ВТ_ACC_ID
	|ИЗ
	|	&ВТACC_ID КАК ВТACC_ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ACC_ID.VED_ID КАК VED_ID,
	|	ВТ_ACC_ID.oper_date_pp КАК oper_date_pp,
	|	ВТ_ACC_ID.ACC_ID КАК ACC_ID,
	|	ВТ_ACC_ID.ved_list КАК ved_list,
	|	ВТ_ACC_ID.opergroup_sid КАК opergroup_sid,
	|	ВТ_ACC_ID.pens_sub_map КАК pens_sub_map,
	|	ХМ_КасперСчета.Счет КАК Счет,
	|	ВЫРАЗИТЬ(ХМ_КасперPROP_SID.Справочник КАК Справочник.уп_ПенсионныеСхемы).Ссылка КАК Схема,
	|	ВЫРАЗИТЬ(ХМ_КасперPROP_SID1.Справочник КАК Справочник.уп_ТипыСумм).Ссылка КАК ТипСумм,
	|	ВЫБОР
	|		КОГДА ВТ_ACC_ID.ved_list = ""СПС""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.СПС)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.ИПС)
	|	КОНЕЦ КАК ТипРезерваСписания,
	|	ВЫБОР
	|		КОГДА ВТ_ACC_ID.ved_list = ""СПС""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.РезервНачисленийПенсийСПС)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезерва.РезервНачисленийПенсийИПС)
	|	КОНЕЦ КАК ТипРезерваНачисления,
	|	ВТ_ACC_ID.oper_sum КАК oper_sum
	|ИЗ
	|	ВТ_ACC_ID КАК ВТ_ACC_ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХМ_КасперPROP_SID КАК ХМ_КасперPROP_SID
	|		ПО ВТ_ACC_ID.pens_sub_map = ХМ_КасперPROP_SID.PROP_SID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХМ_КасперPROP_SID КАК ХМ_КасперPROP_SID1
	|		ПО ВТ_ACC_ID.opergroup_sid = ХМ_КасперPROP_SID1.PROP_SID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХМ_КасперСчета КАК ХМ_КасперСчета
	|		ПО ВТ_ACC_ID.ACC_ID = ХМ_КасперСчета.ACC_ID";       

	
КонецФункции     

Процедура АрхивЗагрузитьНачисленияПенсийПоДокументуНаСервере(Знач ved_id)
	
	Перем Запрос, НаборЗаписей, НоваяЗапись, ПроизвольныйЗапрос, тзХМ_КасперСчета, ТЧЗапроса, Число;
	
	Число = Формат(ved_id, "ЧГ=");
	ПроизвольныйЗапрос =  АрхивТекстЗапросаПроводок(Строка(Число));  
	ТЧЗапроса = ХМ_ЗагрузкаТЗ_Клиент.ИмпортИзКасперМодульОбъекта(ПроизвольныйЗапрос); 	
	Запрос = Новый Запрос;
	Запрос.Текст = АрхивТекстЗапросаПроводок1С(); 
	
	Запрос.УстановитьПараметр("ВТACC_ID", ТЧЗапроса);
	
	тзХМ_КасперСчета = Запрос.Выполнить().Выбрать();    
	
	//запись в регистр
	НаборЗаписей = Движения.уп_НачисленияПенсий;
	НаборЗаписей.Очистить();
	
	
	
	Пока тзХМ_КасперСчета.Следующий() Цикл 
		
		НоваяЗапись = НаборЗаписей.Добавить();  
		НоваяЗапись.Активность = Истина;   
		НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход; 
		НоваяЗапись.Период     = тзХМ_КасперСчета.oper_date_pp;
		НоваяЗапись.НачПериода = тзХМ_КасперСчета.oper_begin_o;
		НоваяЗапись.КонПериода = КонецМесяца(тзХМ_КасперСчета.oper_begin_o);
		НоваяЗапись.Регистратор = Ссылка;
		НоваяЗапись.НомерСчета = тзХМ_КасперСчета.Счет;  
		НоваяЗапись.ДнейВПериоде = День(КонецМесяца(тзХМ_КасперСчета.oper_begin_o));
		НоваяЗапись.Сумма =тзХМ_КасперСчета.oper_sum; 
		НоваяЗапись.НалоговаяБазаПоНДФЛ =тзХМ_КасперСчета.BaseNdfl; 
		НоваяЗапись.Схема = тзХМ_КасперСчета.Схема;	
		НоваяЗапись.ТипРезерва =тзХМ_КасперСчета.ТипРезерваСписания;
		НоваяЗапись.ТипСуммы =тзХМ_КасперСчета.ТипСумм; 
		НоваяЗапись.ТипРезерваНачисления =тзХМ_КасперСчета.ТипРезерваСписания;
		НоваяЗапись.НомерСчетаНачисления = тзХМ_КасперСчета.СчетИсточник; 
		
	КонецЦикла;
	
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура ХМОбработкаПроведения(Отказ, Режим)
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;

	Документы.уп_НачислениеПенсий.уп_НачислениеПенсий(ЭтотОбъект, Отказ, Режим);
	
КонецПроцедуры

&ИзменениеИКонтроль("РаспределитьПоМесяцам")
Функция ХМРаспределитьПоМесяцам(Сумма, Сумма2, НачалоПериода, КонецПериода, Периодичность, хм_Ускорение)
	ТЗ.Очистить();
	
	#Вставка
	// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
	Если Не хм_Ускорение = Неопределено Тогда
		Распределять = хм_Ускорение.уп_РаспределятьНачисленияПоМесяцам;
	Иначе
	#КонецВставки
	Распределять = Константы.уп_РаспределятьНачисленияПоМесяцам.Получить();
	#Вставка
	КонецЕсли;
    #КонецВставки
	
	Если Распределять Тогда
		//первый период
		ТНачалоПериода = НачалоПериода;
		ТКонецПериода = КонецМесяца(НачалоПериода);
		если ТКонецПериода>КонецПериода тогда
			ТКонецПериода = КонецПериода;
		конецесли;
		СТР = ТЗ.Добавить();
		СТР.НачалоПериода = ТНачалоПериода;
		СТР.КонецПериода = ТКонецПериода;
		СТР.ПериодРегистрации = НачалоМесяца(ТНачалоПериода);
		//остальные периоды
		пока ТКонецПериода<КонецПериода цикл
			ТНачалоПериода =  НачалоМесяца( ДобавитьМесяц(ТНачалоПериода,1) );
			ТКонецПериода = КонецМесяца(ТНачалоПериода);
			если ТКонецПериода>КонецПериода тогда
				ТКонецПериода = КонецПериода;
			конецесли;
			если (ТКонецПериода - ТНачалоПериода)>0 тогда
				СТР = ТЗ.Добавить();
				СТР.НачалоПериода = ТНачалоПериода;
				СТР.КонецПериода = ТКонецПериода;
				СТР.ПериодРегистрации = НачалоМесяца(ТНачалоПериода);
			конецесли;		
		конеццикла;
		ВесьПериод = уп_НПФ.ДнейМеждуДатами(НачалоПериода, КонецПериода);	
		Для Н=0 по ТЗ.Количество()-1 цикл
			СТР = ТЗ[Н];
			СТР.ДнейВПериоде = уп_НПФ.ДнейМеждуДатами(СТР.НачалоПериода, СТР.КонецПериода);
			если Н<ТЗ.Количество()-1 тогда
				СТР.Сумма = Окр( (СТР.ДнейВПериоде / ВесьПериод)*Сумма , 2); 
				СТР.Сумма2 = Окр( (СТР.ДнейВПериоде / ВесьПериод)*Сумма2 , 2); 
			иначе
				СТР.Сумма = Сумма - ТЗ.Итог("Сумма");
				СТР.Сумма2 = Сумма2 - ТЗ.Итог("Сумма2");
			конецесли;
		Конеццикла;
	Иначе
		ДатаВПериоде = уп_НПФ.ОпределитьДатуВПериоде(Дата, Периодичность, НачалоПериода); 
		СТР = ТЗ.Добавить();
		СТР.НачалоПериода = НачалоПериода;
		СТР.КонецПериода = КонецПериода;
		СТР.ПериодРегистрации = НачалоМесяца(ДатаВПериоде);
		СТР.Сумма = Сумма;
		СТР.Сумма2 = Сумма2;
		СТР.ДнейВПериоде = уп_НПФ.ДнейМеждуДатами(СТР.НачалоПериода, СТР.КонецПериода);
	КонецЕсли;
	Возврат ТЗ;
КонецФункции

&ИзменениеИКонтроль("РаспределитьНачисление")
Функция ХМРаспределитьНачисление(СТР, ТабПолучателей, хм_Ускорение)
	СуммаРаспределения = СТР.Сумма;
	ТаблицаИсточников = СТР.ТаблицаИсточников;	
	//начисление
	ДатаНачПериода = уп_НПФ.ОпределитьДатуНачалаПериода(СТР.НачалоПериодаНачисления, СТР.Периодичность); 
	#Удаление 
	ТЗмес = РаспределитьПоМесяцам(СТР.Сумма, СТР.НалоговаяБаза, ДатаНачПериода, СТР.КонецПериодаНачисления, СТР.Периодичность);		
	#КонецУдаления
	#Вставка 
	ТЗмес = РаспределитьПоМесяцам(СТР.Сумма, СТР.НалоговаяБаза, ДатаНачПериода, СТР.КонецПериодаНачисления, СТР.Периодичность, хм_Ускорение);
	#КонецВставки
	для Н=0 по ТЗмес.Количество()-1 цикл
		ДоляНачисления = ТЗмес[Н];

		СуммаНадо = ДоляНачисления.Сумма;
		СуммаНадо2 = ДоляНачисления.Сумма2;
		Для Каждого стрТабИсточников из ТаблицаИсточников Цикл
			СуммаКСписанию = Мин(СуммаНадо, стрТабИсточников.Сумма);
			СуммаКСписаниюНБ = Мин(СуммаНадо2, стрТабИсточников.Сумма);

			Движение = Движения.уп_НачисленияПенсий.Добавить();
			Движение.Период = Дата;
			Движение.Регистратор = Ссылка;
			Движение.НомерСчета = СТР.НомерСчета;
			Движение.НачПериода = ДоляНачисления.НачалоПериода;
			Движение.КонПериода =  ДоляНачисления.КонецПериода;
			//Движение.Сумма = ДоляНачисления.Сумма;
			//Движение.НалоговаяБазаПоНДФЛ = ДоляНачисления.Сумма2; //Облагается НДФЛ
			Движение.Сумма = СуммаКСписанию;
			Движение.НалоговаяБазаПоНДФЛ = СуммаКСписаниюНБ; //Облагается НДФЛ
			Движение.ДнейВПериоде =  ДоляНачисления.ДнейВПериоде;
			Движение.Схема = стр.Схема;
			Движение.ТипПенсии = стр.ТипПенсии;
			Движение.НомерСчетаНачисления = стрТабИсточников.НомерСчетаНачисления;
			Движение.ТипРезерваНачисления = стрТабИсточников.ТипРезерваНачисления;
			Если лУчетРезервовНачисленияНПО Тогда
				Движение.ТипРезерва = стрТабИсточников.ТипРезерваНачисления;
				Движение.ТипСуммы = стрТабИсточников.ТипСуммы;
			Конецесли;
			СуммаНадо = СуммаНадо-СуммаКСписанию;
			СуммаНадо2 = СуммаНадо2-СуммаКСписаниюНБ;

			стрТабИсточников.Сумма = стрТабИсточников.Сумма-СуммаКСписанию;
			Если СуммаНадо = 0 Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		Если СуммаНадо<>0 Тогда
			Сообщить("Некорректное распределение по источникам по пенсионному счету "+СТР.НомерСчета);
			Отказ = Истина;
		КонецЕсли;	

		Если ДоляНачисления.Сумма2<>0 Тогда
			Движение = Движения.уп_НДФЛСведенияОДоходахУчастников.Добавить();
			Если ОтражатьНБТекущимПериодом Тогда
				Движение.Период = НачалоМесяца(Дата);
				//Движение.Период = Дата;
				Движение.ПериодРегистрации = НачалоМесяца(Дата);
			Иначе
				Движение.Период = НачалоМесяца(Дата);
				//Движение.Период = Дата;
				Движение.ПериодРегистрации = ДоляНачисления.ПериодРегистрации;
			КонецЕсли;	
			Движение.Регистратор = Ссылка; 
			#Вставка 
			// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
			Если Не хм_Ускорение = Неопределено Тогда
				Движение.Организация = СТР.НомерСчетаВладелецОрганизация;
			Иначе
			#КонецВставки
			Движение.Организация = СТР.НомерСчета.Владелец.Организация;
			#Вставка 
			КонецЕсли;
			#КонецВставки
			Движение.КодДохода = КодДохода;
			#Вставка 
			// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
			Если Не хм_Ускорение = Неопределено Тогда
				Движение.Участник = СТР.НомерСчетаУчастник;
			Иначе
			#КонецВставки
			Движение.Участник = СТР.НомерСчета.Участник;
			#Вставка 
			КонецЕсли;
			#КонецВставки
			Движение.НомерСчета = СТР.НомерСчета; 
			Движение.СуммаДохода = ДоляНачисления.Сумма2; //Облагается НДФЛ
			#Вставка 
			// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
			Если Не хм_Ускорение = Неопределено Тогда
				Движение.ВидРасчета = хм_Ускорение.уп_Пенсия;
			Иначе
			#КонецВставки
			Движение.ВидРасчета = ПланыВидовРасчета.Начисления.уп_Пенсия;
			#Вставка 
			КонецЕсли;
            #КонецВставки
		
			Движение = Движения.СведенияОДоходахНДФЛ.Добавить();
			Если ОтражатьНБТекущимПериодом Тогда
				Движение.Период = НачалоМесяца(Дата);
				//Движение.Период = Дата;
				Движение.МесяцНалоговогоПериода = НачалоМесяца(Дата);
			Иначе
				Движение.Период = НачалоМесяца(Дата);
				//Движение.Период = Дата;
				Движение.МесяцНалоговогоПериода = ДоляНачисления.ПериодРегистрации;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Организация.ГоловнаяОрганизация) Тогда
				Движение.ГоловнаяОрганизация = Организация;
			Иначе
				Движение.ГоловнаяОрганизация = Организация.ГоловнаяОрганизация;
			КонецЕсли;
			Движение.ДатаПолученияДохода = НачалоМесяца(Дата);
			Движение.Организация = Организация;
			Движение.ИсточникДоходаЗаПределамиРФ =Ложь;
			Движение.КодДохода = КодДохода;
			#Вставка 
			// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
			Если Не хм_Ускорение = Неопределено Тогда
				Движение.Начисление = хм_Ускорение.уп_Пенсия;
				Движение.КатегорияДохода = хм_Ускорение.КатегорияДохода;
			Иначе
			#КонецВставки
			Движение.Начисление = ПланыВидовРасчета.Начисления.уп_Пенсия;
			Движение.КатегорияДохода = ПланыВидовРасчета.Начисления.уп_Пенсия.КатегорияДохода;
			#Вставка 
			КонецЕсли;
			#КонецВставки
			Движение.Подразделение = ПодразделениеОрганизации;
			Если ПодразделениеОрганизации.ОбособленноеПодразделение Тогда
				//РегистрацияВНалоговомОргане = ПодразделениеОрганизации.РегистрацияВНалоговомОргане;
				РегистрацияВНалоговомОргане = ЗарплатаКадры.РегистрацияВНалоговомОргане(ПодразделениеОрганизации, Дата);
			Иначе
				РегистрацияВНалоговомОргане = ЗарплатаКадры.РегистрацияВНалоговомОргане(Организация, Дата);
			КонецЕсли;
			Движение.РегистрацияВНалоговомОргане = РегистрацияВНалоговомОргане;
			Движение.СуммаДохода = ДоляНачисления.Сумма2; //Облагается НДФЛ
			#Вставка 
			// +ХМНПФ 23.05.2024 ЛыткинАМ // хм_Ускорение // №3873
			Если Не хм_Ускорение = Неопределено Тогда
				Движение.ФизическоеЛицо = СТР.НомерСчетаУчастникуп_ФизЛицо;
			Иначе
			#КонецВставки
			Движение.ФизическоеЛицо = СТР.НомерСчета.Участник.уп_ФизЛицо;
			#Вставка 
			КонецЕсли;
			#КонецВставки	
		КонецЕсли;
	конеццикла;

	Если ОтражатьВБухгалтерскомУчете  Тогда
		СтрПолуч = ТабПолучателей.Найти(стр.НомерСчета, "НомерСчета");
		Если НЕ СтрПолуч = Неопределено Тогда
			Если СтрПолуч.ПолучательВПлатежномПоручении = Null Тогда
				Получатель = СтрПолуч.Банк;
			Иначе
				Получатель = СтрПолуч.ПолучательВПлатежномПоручении;
			КонецЕсли;
			ВидДвижения = Перечисления.уп_ВидыДвижений.Начисление;
			Если стр.Схема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат
				или стр.ТипПенсии = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
				ПризнакДт = Истина;
			Иначе
				ПризнакДт = Ложь;
			КонецЕсли;
			ДоговорКонтрагента = Получатель.ОсновнойДоговорКонтрагента;
			//здесь еще надо определить какой получатель, если через кассу - по ним надо аналитику загнать
			Если НЕ ЗначениеЗаполнено(Получатель) Тогда //через кассу
				Получатель = Стр.НомерСчета.Участник;
				ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
			КонецЕсли;

			Если стр.СуммаИзРПВ<>0 Тогда
				//это РПВ без аналитики
				уп_ОбщегоНазначенияУчетРезервов.ДобавитьСтрокуВТабБухУчет(ТабБухУчет, Дата, Организация, ВидДвижения, Справочники.Контрагенты.ПустаяСсылка(), Справочники.ДоговорыКонтрагентов.ПустаяСсылка(),
				Стр.Схема, ПризнакДт, Получатель, ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Стр.Сумма);
			Иначе
				уп_ОбщегоНазначенияУчетРезервов.ДобавитьСтрокуВТабБухУчет(ТабБухУчет, Дата, Организация, ВидДвижения, Стр.НомерСчета.Владелец.Вкладчик, Стр.НомерСчета.Владелец.ДоговорКонтрагента,
				Стр.Схема, ПризнакДт, Получатель, ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Стр.Сумма);
			КонецЕсли;
		Иначе
			Сообщить("Для пенсионного счета "+стр.НомерСчета+" не зарегистрированы платежные реквизиты. Проведение по БУ не может быть выполнено.");
		КонецЕсли;
	КонецЕсли;

	Возврат истина;
КонецФункции
