
#Область ХМНПФ


Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 29.02.2016 ШадринАВ // новый флаг на форме "Не прекращать выплаты" // №244
	// ХМНПФ+ 20.02.2016 ШадринАВ // новое поле на форме ХМ_ВозвратСПлатежногоПоручения // №278
	// ХМНПФ+ 28.03.2016 ШадринАВ // новое поле Участник на форме  // №276
	// ХМНПФ+ 17.10.2017 ШадринАВ // новый флаг на форме "Возврат переплаты" // №1995
	// ХМНПФ+ 11.04.2018 КлименкоМИ // новый флаг на форме "Возврат в ИЛС" // №1510
	// ХМНПФ 11.04.2018 КлименкоМИ // УстановитьВидимость() // №1510	
	// ХМНПФ 27.12.2018 ГригорьевМА // новый ХМ_ПриСозданииНаСервере() // №1967
КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	// ХМНПФ 11.04.2018 КлименкоМИ // новый ХМ_ПриСозданииНаСервере() // №1510
	ХМ_РаботаСФормами.уп_ВозвратПрочихНачисленийОПСПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);	
КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//+ХМНПФ 28.03.2016 ШадринАВ // ХМ_ПриСозданииНаСервере()  // №276
	Элементы.ДоговорОПС.КнопкаОткрытия = Истина;
	//-ХМНПФ 28.03.2016 ШадринАВ // ХМ_ПриСозданииНаСервере()  // №276
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ХМ_ВозвратВИЛС = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("УстановитьВидимость")
Процедура ХМУстановитьВидимость()
	Если Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
		Элементы.Правопреемник.Видимость = Истина;
	Иначе
		Элементы.Правопреемник.Видимость = Ложь;
	КонецЕсли;
	Если Объект.ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.ВозвратНачислений
		или Объект.ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.ВозвращенныйПлатежВРезерв
		или Объект.ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.ОтвергнутыйПлатежВРезерв Тогда
		Элементы.ПредставлениеОснования.Видимость = Ложь;
	Иначе
		Элементы.ПредставлениеОснования.Видимость = Истина;
	КонецЕсли;	
	//Элементы.Группа2.Видимость=Объект.ОтражатьВБухгалтерскомУчете;
	#Вставка
	// +ХМНПФ 11.04.2018 КлименкоМИ // УстановитьВидимость() // №1510	
	Если Объект.ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.ВозвратНачислений
		И  Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
		Элементы.ХМ_ВозвратВИЛС.Видимость = Истина;
	Иначе
		Элементы.ХМ_ВозвратВИЛС.Видимость = Ложь;
	КонецЕсли;
	// -ХМНПФ 11.04.2018 КлименкоМИ // УстановитьВидимость() // №1510
	#КонецВставки
КонецПроцедуры

#КонецОбласти
