
&НаСервере
Функция ПечатьПриложение2() 

	СведенияОбОрг = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата);	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = Документы.пдс_РешениеОбОтказеВВыплатеВыкупнойСуммы.ПолучитьМакет("хмПДС_Приложение2");
	ОбластьМакета = Макет.ПолучитьОбласть("Отчет");
	ОбластьМакета.Параметры.ДатаРешения = Объект.Дата;
    //ОбластьМакета.Параметры.Число =  Формат(Объект.Дата, "ДФ=dd");
	//ОбластьМакета.Параметры.Месяц = Формат(Объект.Дата, "ДФ=MMMM");
	//ОбластьМакета.Параметры.Год = Формат(Объект.Дата, "ДФ=yyyy");
	ОбластьМакета.Параметры.НомерРешения = Объект.Номер;
	ОбластьМакета.Параметры.НаименованиеФонда = СведенияОбОрг.ПолноеНаименование;
	ОбластьМакета.Параметры.ФИОУчастника = Объект.Участник.Наименование;
	ОбластьМакета.Параметры.НомерСчета = Объект.ДокументОснование.НомерСчета;
	ОбластьМакета.Параметры.ДатаЗаявления = Формат(Объект.ДокументОснование.ДатаРегистрации, "ДФ=dd.MM.yyyy") ;
	ОбластьМакета.Параметры.НомерЗаявления = Объект.ДокументОснование.Номер;
	
	Причина = ВРег(Объект.ПричинаОтказа.Наименование);
	
	Если НЕ (СтрНайти(Причина, ВРег("Непоступление")) = 0 И  СтрНайти(Причина, ВРег("документов")) = 0)  Тогда
		ОбластьМакета.Параметры.Картинка1 = "V";
	ИначеЕсли НЕ (СтрНайти(Причина, ВРег("Отсутствие")) = 0 И  СтрНайти(Причина, ВРег("средств")) = 0) Тогда
		ОбластьМакета.Параметры.Картинка2 = "V";
	Иначе
		ОбластьМакета.Параметры.Картинка3 = "V";
		ОбластьМакета.Параметры.РасшифровкаПричины = Объект.ПричинаОтказа.Наименование
	КонецЕсли; 
	
	//Пока делаем статичными
	ОбластьМакета.Параметры.ДолжностьОтветственного = "Начальник отдела пенсионного учета";
	ОбластьМакета.Параметры.ФИООтветственного = "Знаменщикова Н.Н.";
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

&НаСервере
Функция ПечатьПриложение5() 
//	Если Объект.ТипРешения = Перечисления.пдс_ТипыЗаявленияНаВыкупнуюСумму.ПоОсобымОбстоятельствам Тогда
    //Печать для решения ОЖС
	
		СведенияОбОрг = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата);	
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
		ТабличныйДокумент.ОтображатьСетку = Ложь;
		ТабличныйДокумент.АвтоМасштаб = Истина;
		
		Макет = Документы.пдс_РешениеОбОтказеВВыплатеВыкупнойСуммы.ПолучитьМакет("хмПДС_Приложение5");
		ОбластьМакета = Макет.ПолучитьОбласть("Отчет");
	    ОбластьМакета.Параметры.ДатаРешения = Объект.Дата;
		ОбластьМакета.Параметры.НомерРешения = Объект.Номер;
		ОбластьМакета.Параметры.НаименованиеФонда = СведенияОбОрг.ПолноеНаименование;
		
		ИмяУчастника = Объект.Участник.уп_ФизЛицо.Имя;
		ОтчУчастника = Объект.Участник.уп_ФизЛицо.Отчество;	
		ОбластьМакета.Параметры.ФИОУчастника = ИмяУчастника + " " + ОтчУчастника;


		ОбластьМакета.Параметры.НомерДоговора = Объект.ДокументОснование.НомерСчета.Владелец; 
		ОбластьМакета.Параметры.ДатаДоговора = Формат(Объект.ДокументОснование.НомерСчета.Владелец.ДатаЗаключенияДоговора, "ДФ=dd.MM.yyyy");
		ОбластьМакета.Параметры.ДатаЗаявления = Формат(Объект.ДокументОснование.ДатаРегистрации, "ДФ=dd.MM.yyyy");
		ОбластьМакета.Параметры.НомерЗаявления = Объект.ДокументОснование.Номер;
		
		Причина = ВРег(Объект.ПричинаОтказа.Наименование);
		
		Если НЕ (СтрНайти(Причина, ВРег("Непоступление")) = 0 И  СтрНайти(Причина, ВРег("документов")) = 0)  Тогда
			ОбластьМакета.Параметры.Картинка1 = "V";
		ИначеЕсли НЕ (СтрНайти(Причина, ВРег("Отсутствие")) = 0 И  СтрНайти(Причина, ВРег("средств")) = 0) Тогда
			ОбластьМакета.Параметры.Картинка2 = "V";
		Иначе
			ОбластьМакета.Параметры.Картинка3 = "V";
			ОбластьМакета.Параметры.РасшифровкаПричины = Объект.ПричинаОтказа.Наименование
		КонецЕсли; 

		//Пока делаем статичными
		ОбластьМакета.Параметры.ДолжностьОтветственного = "Начальник отдела пенсионного учета";
		ОбластьМакета.Параметры.ФИООтветственного = "Знаменщикова Н.Н.";
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Возврат ТабличныйДокумент;
		
//	КонецЕсли;	
КонецФункции

&НаСервере
Функция хмПДС_ОпределитьФормы()
	// ++ Ортикон Плыгун 08.06.2025
	РазрешенныеФормы = Новый Структура;
	Если Объект.ТипЗаявления = Перечисления.пдс_ТипыЗаявленияНаВыкупнуюСумму.ПоОсобымОбстоятельствам Тогда
    	РазрешенныеФормы.Вставить("Приложение2", Истина);
		РазрешенныеФормы.Вставить("Приложение5", Истина);
	Иначе
		РазрешенныеФормы.Вставить("Приложение2", Ложь);
		РазрешенныеФормы.Вставить("Приложение5", Ложь);
	КонецЕсли;
	Возврат РазрешенныеФормы
	// -- Ортикон
КонецФункции

#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура хмПДС_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ++ Ортикон Плыгун 08.06.2025
		хмПДС_ВывестиКомандыПечати();
	// -- Ортикон
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура хмПДС_ПечатьПриложения2(Команда)
// ++ Ортикон Плыгун 08.06.2025
//	ПараметрыОткрытия = Новый Структура();
//	ПараметрыОткрытия.Вставить("Организация", Объект.Владелец);
//	ПараметрыОткрытия.Вставить("НомерСчета", Объект.Ссылка);
//	ПараметрыОткрытия.Вставить("ФормироватьФайлыДляПечати", Ложь);
//	ПараметрыОткрытия.Вставить("Дата1", Объект.Дата);
	//ОткрытьФорму("Отчет.хмПДС_.Форма.ФормаОтчета", ПараметрыОткрытия, ЭтотОбъект);
	РазрешенныеФормы = хмПДС_ОпределитьФормы();
	Если РазрешенныеФормы.Приложение2 Тогда	
		ТабДок = ПечатьПриложение2();
		ТабДок.Показать("Решение об отказе");
	Иначе
		Сообщить("Для решения выбрана не верная форма")
	КонецЕсли;
// -- Ортикон
КонецПроцедуры

&НаКлиенте
Процедура хмПДС_ПечатьПриложения5(Команда)
// ++ Ортикон Плыгун 08.06.2025
//	ПараметрыОткрытия = Новый Структура();
//	ПараметрыОткрытия.Вставить("Организация", Объект.Владелец);
//	ПараметрыОткрытия.Вставить("НомерСчета", Объект.Ссылка);
//	ПараметрыОткрытия.Вставить("ФормироватьФайлыДляПечати", Ложь);
//	ПараметрыОткрытия.Вставить("Дата1", Объект.Дата);
	//ОткрытьФорму("Отчет.хмПДС_.Форма.ФормаОтчета", ПараметрыОткрытия, ЭтотОбъект);
	РазрешенныеФормы = хмПДС_ОпределитьФормы();
	Если РазрешенныеФормы.Приложение5 Тогда		
		ТабДок = ПечатьПриложение5();
		ТабДок.Показать("Уведомление об отказе");
	Иначе
		Сообщить("Для решения выбрана не верная форма")
	КонецЕсли;	
// -- Ортикон
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вывести команду печать Решение об отказе. Ортикон Плыгун 08.06.2025
//
&НаСервере
Процедура хмПДС_ВывестиКомандыПечати()
	Если Объект.ТипЗаявления = Перечисления.пдс_ТипыЗаявленияНаВыкупнуюСумму.ПоОсобымОбстоятельствам Тогда
		//Печать для решения ОЖС 
		//Приложение 2
		КомандаПриложение2 = Команды.Добавить("хмПДС_ПечатьПриложения2");
		КомандаПриложение2.Заголовок = НСтр("ru = 'Решение об отказе-ОЖС (Приложение 2)'");
		КомандаПриложение2.Подсказка = НСтр("ru = 'Решение об отказе-ОЖС (Приложение 2)'");
		КомандаПриложение2.Действие = "хмПДС_ПечатьПриложения2";

		ЭлементПриложение2 = Элементы.Вставить("хмПДС_ПечатьПриложения2",
			Тип("КнопкаФормы"), Элементы.ФормаГруппаПечать);
		ЭлементПриложение2.ИмяКоманды = КомандаПриложение2.Имя;      
	    //Приложение 5
		КомандаПриложение5 = Команды.Добавить("хмПДС_ПечатьПриложения5");
		КомандаПриложение5.Заголовок = НСтр("ru = 'Уведомление об отказе-ОЖС (Приложение 5)'");
		КомандаПриложение5.Подсказка = НСтр("ru = 'Уведомление об отказе-ОЖС (Приложение 5)'");
		КомандаПриложение5.Действие = "хмПДС_ПечатьПриложения5";

		ЭлементПриложение5 = Элементы.Вставить("хмПДС_ПечатьПриложения5",
			Тип("КнопкаФормы"), Элементы.ФормаГруппаПечать);
		ЭлементПриложение5.ИмяКоманды = КомандаПриложение5.Имя; 
	КонецЕсли;
КонецПроцедуры
#КонецОбласти 
 

