
&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	уп_НачислениеПенсий.Ссылка КАК уп_Начисление
			|ИЗ
			|	Документ.уп_НачислениеПенсий КАК уп_НачислениеПенсий
			|ГДЕ
			|	уп_НачислениеПенсий.ДокументОснование = &ДокументОснование
			|	И уп_НачислениеПенсий.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			уп_Начисление = ВыборкаДетальныеЗаписи.уп_Начисление;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
