
&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
    //https://redmine.npf.com/issues/4261
	Элементы.хм_ПрочаяИнформация.ТолькоПросмотр = Не РольДоступна("ПолныеПрава"); 
КонецПроцедуры                                                                                      


Процедура ХМ_ДополнитьФорму() 
//Надо делать...	
//	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьОбычнуюГруппу(ЭтаФорма, "хм_ПрочаяИнформация", ЭтаФорма, Новый Структура("ВставитьПередЭлементом,Заголовок,Поведение",Элементы.СписокСчетов,"(Каспер) Прочая информация",ПоведениеОбычнойГруппы.Свертываемая));
	
КонецПроцедуры


