
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 26.10.2015 ШадринАВ // ПриСозданииНаСервере() // ОПС_заяв_на_основ_дгвр
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура ХМПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверим объект на то, что он еще не внесен в ИБ
	// Установим значения по умолчанию для организации и ответственного для нового документа
	Если Объект.Ссылка.Пустая() Тогда 
		УстановитьЗначенияПоУмолчанию();
		#Вставка 
		// +ХМНПФ 26.10.2015 ШадринАВ // ПриСозданииНаСервере() // ОПС_заяв_на_основ_дгвр
		Если ЗначениеЗаполнено(Объект.ДоговорОПС) Тогда
			РассчитатьОстаток(Объект);
			АвтозаполнениеПараметровВыплат();
		КонецЕсли;
		// -ХМНПФ 26.10.2015 ШадринАВ // ПриСозданииНаСервере() // ОПС_заяв_на_основ_дгвр	
		#КонецВставки
	КонецЕсли;

	// Установим отбор по организации и застрахованному лицу для выбора договоров ОПС
	НазначитьСвязиПараметровВыбора();

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры
