&ИзменениеИКонтроль("ПараметрыЗаписиТабличногоДокументаВФормат")
Функция bess_ПараметрыЗаписиТабличногоДокументаВФормат(Формат)
	Результат = Новый Структура("Расширение, ТипФайла");
	Если Формат = Перечисления.ФорматыСохраненияОтчетов.XLSX Тогда
		Результат.Расширение = ".xlsx";
		Результат.ТипФайла = ТипФайлаТабличногоДокумента.XLSX;

	ИначеЕсли Формат = Перечисления.ФорматыСохраненияОтчетов.XLS Тогда
		Результат.Расширение = ".xls";
		Результат.ТипФайла = ТипФайлаТабличногоДокумента.XLS;

	ИначеЕсли Формат = Перечисления.ФорматыСохраненияОтчетов.ODS Тогда
		Результат.Расширение = ".ods";
		Результат.ТипФайла = ТипФайлаТабличногоДокумента.ODS;

	ИначеЕсли Формат = Перечисления.ФорматыСохраненияОтчетов.MXL Тогда
		Результат.Расширение = ".mxl";
		Результат.ТипФайла = ТипФайлаТабличногоДокумента.MXL;

	ИначеЕсли Формат = Перечисления.ФорматыСохраненияОтчетов.PDF Тогда
		Результат.Расширение = ".pdf";
		Результат.ТипФайла = СтандартныеПодсистемыСервер.ТипФайлаТабличногоДокументаPDF();

	ИначеЕсли Формат = Перечисления.ФорматыСохраненияОтчетов.HTML Тогда
		Результат.Расширение = ".html";
		Результат.ТипФайла = ТипФайлаТабличногоДокумента.HTML5;

	ИначеЕсли Формат = Перечисления.ФорматыСохраненияОтчетов.HTML4 Тогда
		Результат.Расширение = ".html";
		Результат.ТипФайла = ТипФайлаТабличногоДокумента.HTML4;

	ИначеЕсли Формат = Перечисления.ФорматыСохраненияОтчетов.DOCX Тогда
		Результат.Расширение = ".docx";
		Результат.ТипФайла = ТипФайлаТабличногоДокумента.DOCX;

	ИначеЕсли Формат = Перечисления.ФорматыСохраненияОтчетов.TXT Тогда
		Результат.Расширение = ".txt";
		Результат.ТипФайла = ТипФайлаТабличногоДокумента.TXT;

	ИначеЕсли Формат = Перечисления.ФорматыСохраненияОтчетов.ANSITXT Тогда
		Результат.Расширение = ".txt";
		Результат.ТипФайла = ТипФайлаТабличногоДокумента.ANSITXT;

	#Вставка	
	// Доработка вида файла - замена разделителя из ANSI текст в CSV	
	//ИначеЕсли Формат = Перечисления.ФорматыСохраненияОтчетов.CSV_ANSI Тогда
	//	Результат.Расширение = ".csv";
	//	Результат.ТипФайла = ТипФайлаТабличногоДокумента.ANSITXT;
	#КонецВставки
	Иначе 
		// "Рыба" для всех форматов, добавленных при внедрении, обработчик сохранения
		// которых должен находиться в переопределяемом модуле.
		Результат.Расширение = Неопределено;
		Результат.ТипФайла = Неопределено;

	КонецЕсли;

	Возврат Результат;
КонецФункции

&ИзменениеИКонтроль("СформироватьИСохранитьОтчет")
Процедура ХМСформироватьИСохранитьОтчет(ПараметрыЖурнала, ПараметрыОтчета, ДеревоОтчетов, ПараметрыДоставки, ПолучательСсылка)
	
	// Определение корневой строки дерева, соответствующей получателю.
	// 1 - Получатели 
	//   Ключ      - Ссылка
	//   Значение  - каталог получателя.
	//   Настройки - представление сформированных отчетов.
	СтрокаПолучатель = ОпределитьСтрокуДереваДляПолучателя(ДеревоОтчетов, ПолучательСсылка, ПараметрыДоставки);
	КаталогПолучателя = СтрокаПолучатель.Значение;

	// Формирование отчета для получателя.
	Результат = СформироватьОтчет(ПараметрыЖурнала, ПараметрыОтчета, ПолучательСсылка);
	
	// Проверка результата
	Если Не Результат.Сформирован Или (Результат.Пустой И Не ПараметрыОтчета.ОтправлятьЕслиПустой) Тогда
		
		Если ПолучитьФункциональнуюОпцию("ХранитьИсториюРассылкиОтчетов")
		   И ТипЗнч(ПараметрыЖурнала.Данные) = Тип("СправочникСсылка.РассылкиОтчетов") Тогда
			Если Результат.Сформирован Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
				"ru = '- ""%1"" не был отправлен, так как пустой.'"), Строка(ПараметрыОтчета.Отчет));
			Иначе
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
				"ru = '- ""%1"" не был отправлен, так как не сформирован из-за некорректно указанных параметров.'"),
				Строка(ПараметрыОтчета.Отчет));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ПолучательСсылка) Тогда
				АдресаПолучателя = ПараметрыДоставки.Получатели.Получить(ПолучательСсылка);
				Если АдресаПолучателя <> Неопределено Тогда
					АдресаПолучателя = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(АдресаПолучателя);
					Для Каждого Кому Из АдресаПолучателя Цикл
						ПоляИстории = ПоляИсторииРассылкиОтчетов(ПараметрыЖурнала.Данные, ПолучательСсылка, ПараметрыДоставки.ДатаВыполнения);
						ПоляИстории.УчетнаяЗапись = ПараметрыДоставки.УчетнаяЗапись;
						ПоляИстории.АдресЭП = Кому.Адрес;
						ПоляИстории.Комментарий = ТекстСообщения;
						ПоляИстории.Выполнена = Ложь;
						ПоляИстории.СпособПолучения = СпособПолученияРассылки(ПараметрыДоставки, ПолучательСсылка, Кому.Адрес);
						
						РегистрыСведений.ИсторияРассылкиОтчетов.ЗафиксироватьРезультатВыполненияРассылкиПолучателю(ПоляИстории);
					КонецЦикла;
				КонецЕсли;
			Иначе
				Для Каждого Получатель Из ПараметрыДоставки.Получатели Цикл 
					АдресаПолучателя = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(Получатель.Значение);
					Для Каждого Кому Из АдресаПолучателя Цикл
						ПоляИстории = ПоляИсторииРассылкиОтчетов(ПараметрыЖурнала.Данные, Получатель.Ключ, ПараметрыДоставки.ДатаВыполнения);
						ПоляИстории.УчетнаяЗапись = ПараметрыДоставки.УчетнаяЗапись;
						ПоляИстории.АдресЭП = Кому.Адрес;
						ПоляИстории.Комментарий = ТекстСообщения;
						ПоляИстории.Выполнена = Ложь;
						ПоляИстории.СпособПолучения = СпособПолученияРассылки(ПараметрыДоставки, Получатель.Ключ, Кому.Адрес);
						
						РегистрыСведений.ИсторияРассылкиОтчетов.ЗафиксироватьРезультатВыполненияРассылкиПолучателю(ПоляИстории);
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;

		Возврат;
		
	КонецЕсли;
	
	// Регистрация промежуточного результата.
	// 2 - Табличные документы получателей.
	//   Ключ      - имя отчета.
	//   Значение  - табличный документ.
	//   Настройки - все параметры отчета.
	СтрокаОтчет = СтрокаПолучатель.Строки.Добавить();
	СтрокаОтчет.Уровень   = 2;
	СтрокаОтчет.Ключ      = Строка(ПараметрыОтчета.Отчет);
	СтрокаОтчет.Значение  = Результат.ТабДок;
	СтрокаОтчет.Настройки = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОтчета);
	
	// Для корректной передачи в длительные операции, подготовим строку дерева. Иначе возникает ошибка:
	// "Переданное значение не может быть помещено в ХранилищеЗначения,
	// поскольку не сериализуется или содержит вложенный несериализуемый элемент".
	СтрокаОтчет.Настройки.Удалить("Объект");
	СтрокаОтчет.Настройки.Удалить("КомпоновщикНастроекКД");
	Если СтрокаОтчет.Настройки.Свойство("Метаданные") Тогда
		СтрокаОтчет.Настройки.Метаданные = СтрокаОтчет.Настройки.Метаданные.ПолноеИмя();
	КонецЕсли;
	
	ПредставлениеОтчета = СокрЛП(СтрокаОтчет.Ключ);
	
	Если ПараметрыДоставки.ИспользоватьЭлектроннуюПочту И ПараметрыДоставки.ВставлятьОтчетыВТекстПисьма
		И Не ПараметрыДоставки.ПрикреплятьОтчетыВоВложения И Не ПараметрыДоставки.ИспользоватьПапку 
		И Не ПараметрыДоставки.ИспользоватьСетевойКаталог И Не ПараметрыДоставки.ИспользоватьFTPРесурс Тогда
	
		ПараметрыОтчетаДляТекстаПисьма = ПараметрыОтчетаДляТекстаПисьма(КаталогПолучателя, ПредставлениеОтчета,
			ПараметрыОтчета.ШаблонНаименования, ПолучательСсылка, СтрокаОтчет.Значение);
		ПодготовитьОтчетДляТекстаПисьма(ПараметрыДоставки, ПараметрыОтчетаДляТекстаПисьма, ПараметрыЖурнала);
	Иначе
		Период = ПолучитьПериодИзПользовательскихНастроек(ПараметрыОтчета.ПользовательскиеНастройкиКД);
		ОтчетПодготовленДляТекстаПисьма = Ложь;
		// Сохранение табличного документа в форматы.
		ПредставлениеФорматов = "";
		Для Каждого Формат Из ПараметрыОтчета.Форматы Цикл

			ПараметрыФормата = ПараметрыДоставки.ПараметрыФорматов.Получить(Формат);

			Если ПараметрыФормата = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			ПолноеИмяФайла = ПолноеИмяФайлаПоШаблону(
			КаталогПолучателя, СтрокаОтчет.Ключ, ПараметрыФормата, ПараметрыДоставки,
				ПараметрыОтчета.ШаблонНаименования, Период);

			НайтиСвободноеИмяФайла(ПолноеИмяФайла);

			СтандартнаяОбработка = Истина;
			РассылкаОтчетовПереопределяемый.ПередСохранениемТабличногоДокументаВФормат(
				СтандартнаяОбработка, СтрокаОтчет.Значение, Формат, ПолноеИмяФайла);
		
			// Сохранение отчета встроенными средствами.
			Если СтандартнаяОбработка = Истина Тогда
				ЗаголовокОшибки = НСтр("ru = 'Невозможно записать отчет ''%1'' в формате ''%2'':'");

				Если ПараметрыФормата.ТипФайла = Неопределено Тогда
					ЗаписьЖурнала(ПараметрыЖурнала, УровеньЖурналаРегистрации.Ошибка,
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ЗаголовокОшибки, СтрокаОтчет.Ключ,
						ПараметрыФормата.Имя), НСтр("ru = 'Формат не поддерживается.'"));
					Продолжить;
				КонецЕсли;

				ДокументРезультат = СтрокаОтчет.Значение; // ТабличныйДокумент
				Попытка
					ДокументРезультат.Записать(ПолноеИмяФайла, ПараметрыФормата.ТипФайла);
				Исключение
					ЗаписьЖурнала(ПараметрыЖурнала, УровеньЖурналаРегистрации.Ошибка,
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ЗаголовокОшибки, СтрокаОтчет.Ключ,
						ПараметрыФормата.Имя), ИнформацияОбОшибке());
					Продолжить;
				КонецПопытки;
				#Вставка
				// Доработка табличного файла - замена разделителя из ANSI текст в CSV
				//Ф = Новый Файл(ПолноеИмяФайла); 
				//Если Ф.Существует() И Формат = Перечисления.ФорматыСохраненияОтчетов.CSV_ANSI Тогда 
				//	ТекстовыйФайлCSV = Новый ТекстовыйДокумент; 
				//	ТекстовыйФайлCSV.Прочитать(ПолноеИмяФайла,КодировкаТекста.ANSI); 
				//	КоличествоСтрокФайла = ТекстовыйФайлCSV.КоличествоСтрок();
				//	Если КоличествоСтрокФайла > 0 Тогда 
				//		ЗначениеРазделителя = "|"; 
				//		Для Каждого Элемент Из ПараметрыОтчета.КомпоновщикНастроекКД.ПользовательскиеНастройки.Элементы Цикл 
				//			Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И Строка(Элемент.Параметр) = "РазделительCSV" И Элемент.Использование Тогда 
				//				ЗначениеРазделителя = Элемент.Значение; 
				//			КонецЕсли; 
				//		КонецЦикла; 
				//		Для НомерСтрокиФайла = 1 По КоличествоСтрокФайла Цикл 
				//			СтрокаФайла = ТекстовыйФайлCSV.ПолучитьСтроку(НомерСтрокиФайла); 
				//			НоваяСтрокаФайла = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("	",СтрокаФайла,ЗначениеРазделителя); 
				//			ТекстовыйФайлCSV.ЗаменитьСтроку(НомерСтрокиФайла, НоваяСтрокаФайла); 
				//		КонецЦикла; 
				//		ТекстовыйФайлCSV.Записать(ПолноеИмяФайла,КодировкаТекста.ANSI); 
				//	КонецЕсли; 
				//КонецЕсли; 
                #КонецВставки
			КонецЕсли;
		
			// Проверки и регистрация результата.
			ВременныйФайл = Новый Файл(ПолноеИмяФайла);
			Если Не ВременныйФайл.Существует() Тогда
				ЗаписьЖурнала(ПараметрыЖурнала, УровеньЖурналаРегистрации.Ошибка,
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ЗаголовокОшибки + Символы.ПС 
						+ НСтр("ru = 'Файл ''%3'' не существует.'"), СтрокаОтчет.Ключ, ПараметрыФормата.Имя,
					ВременныйФайл.ПолноеИмя));
				Продолжить;
			КонецЕсли;
		
			// Регистрация конечного результата - сохраненного отчета во временном каталоге.
			// 3 - Файлы получателей
			//   Ключ      - имя файла
			//   Значение  - полный путь к файлу.
			//   Настройки - настройки файла.
			СтрокаФайл = СтрокаОтчет.Строки.Добавить();
			СтрокаФайл.Уровень = 3;
			СтрокаФайл.Ключ      = ВременныйФайл.Имя;
			СтрокаФайл.Значение  = ВременныйФайл.ПолноеИмя;

			СтрокаФайл.Настройки = Новый Структура("ФайлСКаталогом, ИмяФайла, ПолноеИмяФайла, ИмяКаталога, ПолноеИмяКаталога, 
				|Формат, Имя, Расширение, ТипФайла, Ссылка");

			СтрокаФайл.Настройки.Формат = Формат;
			ЗаполнитьЗначенияСвойств(СтрокаФайл.Настройки, ПараметрыФормата, "Имя, Расширение, ТипФайла");

			СтрокаФайл.Настройки.ИмяФайла          = ВременныйФайл.Имя;
			СтрокаФайл.Настройки.ПолноеИмяФайла    = ВременныйФайл.ПолноеИмя;
			СтрокаФайл.Настройки.ИмяКаталога       = ВременныйФайл.ИмяБезРасширения + "_files";
			СтрокаФайл.Настройки.ПолноеИмяКаталога = ВременныйФайл.Путь + СтрокаФайл.Настройки.ИмяКаталога + ПолучитьРазделительПутиСервера();

			КаталогФайла = Новый Файл(СтрокаФайл.Настройки.ПолноеИмяКаталога);

			СтрокаФайл.Настройки.ФайлСКаталогом = (КаталогФайла.Существует() И КаталогФайла.ЭтоКаталог());

			Если СтрокаФайл.Настройки.ФайлСКаталогом И Не ПараметрыДоставки.Архивировать Тогда
			// Каталог вместе с файлом архивируются, а вместо файла отправляется архив файла с каталогом.
				ИмяАрхива       = ВременныйФайл.ИмяБезРасширения + ".zip";
				ПолноеИмяАрхива = КаталогПолучателя + ИмяАрхива;

				РежимСохранения = РежимСохраненияПутейZIP.СохранятьОтносительныеПути;
				РежимОбработки  = РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно;

				ЗаписьZipФайла = Новый ЗаписьZipФайла(ПолноеИмяАрхива);
				ЗаписьZipФайла.Добавить(СтрокаФайл.Настройки.ПолноеИмяФайла, РежимСохранения, РежимОбработки);
				ЗаписьZipФайла.Добавить(СтрокаФайл.Настройки.ПолноеИмяКаталога, РежимСохранения, РежимОбработки);
				ЗаписьZipФайла.Записать();

				СтрокаФайл.Ключ     = ИмяАрхива;
				СтрокаФайл.Значение = ПолноеИмяАрхива;
			КонецЕсли;

			КаталогФайла = Неопределено;
			ВременныйФайл = Неопределено;

			ПредставлениеФорматов = ПредставлениеФорматов + ?(ПредставлениеФорматов = "", "", ", ") + ?(
				ПараметрыДоставки.ДобавлятьСсылки = "КФорматам", "<a href = '" + СтрокаФайл.Значение + "'>", "")
				+ ПараметрыФормата.Имя + ?(ПараметрыДоставки.ДобавлятьСсылки = "КФорматам", "</a>", "");
			
		//
			Если ПараметрыДоставки.ДобавлятьСсылки = "ПослеОтчетов" Тогда
				ПредставлениеОтчета = ПредставлениеОтчета + Символы.ПС + "<" + СтрокаФайл.Значение + ">";
			КонецЕсли;

			Если ПараметрыДоставки.ИспользоватьЭлектроннуюПочту И ПараметрыДоставки.ВставлятьОтчетыВТекстПисьма Тогда
				Если (ПараметрыДоставки.ПисьмоВФорматеHTML И Формат = Перечисления.ФорматыСохраненияОтчетов.HTML)
				   Или (НЕ ПараметрыДоставки.ПисьмоВФорматеHTML И Формат = Перечисления.ФорматыСохраненияОтчетов.TXT) Тогда
					ПараметрыОтчетаДляТекстаПисьма = ПараметрыОтчетаДляТекстаПисьма(КаталогПолучателя, ПредставлениеОтчета,
						ПараметрыОтчета.ШаблонНаименования, ПолучательСсылка, СтрокаОтчет.Значение);
					ПодготовитьОтчетДляТекстаПисьма(ПараметрыДоставки, ПараметрыОтчетаДляТекстаПисьма,
						ПараметрыЖурнала, ПолноеИмяФайла);
					ОтчетПодготовленДляТекстаПисьма = Истина;
				КонецЕсли;
			КонецЕсли;

		КонецЦикла;
		
		Если ПараметрыДоставки.ИспользоватьЭлектроннуюПочту И ПараметрыДоставки.ВставлятьОтчетыВТекстПисьма И НЕ ОтчетПодготовленДляТекстаПисьма Тогда
			ПараметрыОтчетаДляТекстаПисьма = ПараметрыОтчетаДляТекстаПисьма(КаталогПолучателя, ПредставлениеОтчета,
				ПараметрыОтчета.ШаблонНаименования, ПолучательСсылка, СтрокаОтчет.Значение);
			ПодготовитьОтчетДляТекстаПисьма(ПараметрыДоставки, ПараметрыОтчетаДляТекстаПисьма, ПараметрыЖурнала);
		КонецЕсли;

	КонецЕсли;
	
	// Представление конкретного отчета.
	ПредставлениеОтчета = СтрЗаменить(ПредставлениеОтчета, "[ПредставлениеФорматов]", ПредставлениеФорматов);
	СтрокаОтчет.Настройки.Вставить("ПредставлениеВПисьме", ПредставлениеОтчета);
	
КонецПроцедуры

&ИзменениеИКонтроль("ПараметрыФормированияОтчета")
Функция ХМПараметрыФормированияОтчета1(ПараметрыОтчета, Получатель)
	
	ПараметрыФормированияОтчета = Новый Структура;
	
	// Заполнение персонализированных данных получателей.
	Если Получатель <> Неопределено И ПараметрыОтчета.Свойство("ПерсональныеОтборы") Тогда
		Если ПараметрыОтчета.СКД Тогда
			ПользовательскиеНастройкиКД = ПараметрыОтчета.КомпоновщикНастроекКД.ПользовательскиеНастройки;
			
			Для Каждого КлючИЗначение Из ПараметрыОтчета.ПерсональныеОтборы Цикл
				Настройка = ПользовательскиеНастройкиКД.ПолучитьОбъектПоИдентификатору(КлючИЗначение.Ключ);
				
				Если ТипЗнч(Настройка) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
					Настройка.ПравоеЗначение = Получатель;
				ИначеЕсли ТипЗнч(Настройка) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
					Настройка.Значение = Получатель;
				КонецЕсли;
			КонецЦикла;
			
			ПараметрыФормированияОтчета.Вставить("ПользовательскиеНастройкиКД", ПользовательскиеНастройкиКД);
		Иначе
			Для Каждого КлючИЗначение Из ПараметрыОтчета.ПерсональныеОтборы Цикл
				ПараметрыОтчета.Объект[КлючИЗначение.Ключ] = Получатель;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Отчет, Объект, СКД, КомпоновщикНастроекКД");
	ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, ПараметрыОтчета);
	
	РассылкаОтчетовПереопределяемый.ПриПодготовкеПараметровФормированияОтчета(ПараметрыФормированияОтчета, ДополнительныеПараметры);

	Результат = ВариантыОтчетов.ПараметрыФормированияОтчета();
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Результат, ПараметрыФормированияОтчета, Истина);

	ЗаполнитьЗначенияСвойств(ПараметрыОтчета, ДополнительныеПараметры);
	Результат.Подключение = ПараметрыОтчета;
	
	#Вставка
	//Для Каждого Формат Из ПараметрыОтчета.Форматы Цикл
	//	Если Формат = Перечисления.ФорматыСохраненияОтчетов.CSV_ANSI Тогда 
	//		Результат.Вставить("ВыводитьВТаблицуЗначений");
	//	Иначе
	//		Результат.Вставить("ВыводитьВТабличныйДокумент");
	//	КонецЕсли;
	//КонецЦикла;
	#КонецВставки
	
	Возврат Результат;
	
КонецФункции
