// ХМНПФ 06.04.2018 КлименкоМИ // новая ХМ_ПриСозданииНаСервере() // №1491
&НаСервере
Процедура  ХМ_УстановитьДействияФормы()  
	Элементы.ДоговорыОПС.Подвал = Истина;
	Элементы.ДоговорыОПССумма.ПутьКДаннымПодвала = "Объект.ДоговорыОПС.ИтогСумма";
КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 06.04.2018 КлименкоМИ // ПриСозданииНаСервере() // №1491
	// ХМНПФ 06.04.2018 КлименкоМИ // новая ХМ_УстановитьДействияФормы() // №1491
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура ХМПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ОтборДоговорОПС") Тогда

		Элемент = УсловноеОформление.Элементы.Добавить();

		МассивТЧ = Новый Массив;
		МассивТЧ.Добавить(Элементы.ДоговорыОПС);
		МассивТЧ.Добавить(Элементы.ДоговорыОПС1);
		МассивТЧ.Добавить(Элементы.ДоговорыОПС2);
		МассивТЧ.Добавить(Элементы.ДоговорыОПСВыплаты);
		МассивТЧ.Добавить(Элементы.ИДДоговорыОПС);
		МассивТЧ.Добавить(Элементы.ИДДоговорыОПС1);

		Для Каждого ТЧ Из МассивТЧ Цикл

			Для Каждого Колонка Из ТЧ.ПодчиненныеЭлементы Цикл
				ОформляемоеПоле = Элемент.Поля.Элементы.Добавить();    
				ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Колонка.Имя);
			КонецЦикла; 

		КонецЦикла;

		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДоговорыОПС.ДоговорОПС");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
		ОтборЭлемента.ПравоеЗначение = Параметры.ОтборДоговорОПС;

		Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

		ОтборДоговорОПС = Параметры.ОтборДоговорОПС;

	КонецЕсли;

	#Вставка		
	//  ХМНПФ 06.04.2018 КлименкоМИ // ПриСозданииНаСервере() // №1491
	ХМ_УстановитьДействияФормы();
	//  ХМНПФ 06.04.2018 КлименкоМИ // ПриСозданииНаСервере() // №1491
  	#КонецВставки
	
КонецПроцедуры


