
#Область ХМНПФ
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 19.12.2018 ГригорьевМА // ХМ_ПриСозданииНаСервере() // №1949
	// ХМНПФ 19.12.2018 ГригорьевМА // Модуль // №1949
КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	// +ХМНПФ 18.12.2018 ГригорьевМА  // Модуль // №1949
	Если ХМ_ОграниченияДоступа.ХМ_ДанныеРодственника(ФизическоеЛицо.Ссылка) Тогда
		Отказ = Истина;
		Сообщить("Для текущего пользователя доступ к физлицу "+ФизическоеЛицо.Наименование+" ограничен. Родственные связи с физлицом.");
	КонецЕсли;
	// -ХМНПФ 18.12.2018 ГригорьевМА  // Модуль // №1949
КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// +ХМНПФ 19.12.2018 ГригорьевМА  // Модуль // №1949
	ХМ_РаботаСФормами.ФизическиеЛицаПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// -ХМНПФ 18.12.2018 ГригорьевМА  // Модуль // №1949
КонецПроцедуры
//~УНПФ        


///////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "СВОЙСТВ"

&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, ФизическоеЛицо.Ссылка);
КонецПроцедуры

#КонецОбласти
