// ХМНПФ 12.09.2017 ШадринАВ // Новая ГиперссылкаЗаявлениеНажатие() // №1166
&НаКлиенте
Процедура ХМ_ГиперссылкаЗаявлениеНажатие(Элемент)
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ОбъектЗаявление = Объект.ДокументОснование.ПолучитьОбъект();
		ОбъектЗаявление.ПолучитьФорму( , ЭтаФорма, Строка(Объект)).Открыть();
	КонецЕсли;
КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 15.01.2016 ШадринАВ // Новый реквизит ХМ_РазмерГП // №133
	// ХМНПФ+ 20.01.2016 ШадринАВ // Новый реквизит ХМ_ДатаГосПенсии // №138
	// ХМНПФ 12.09.2017 ШадринАВ // Новая ХМ_ГиперссылкаЗаявлениеНажатие() // №1166
КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму();
КонецПроцедуры

Процедура ХМДополнитьФорму()	
	
	СвойстваГруппы = Новый Структура();
	СвойстваГруппы.Вставить("ОтображатьЗаголовок", Ложь);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьОбычнуюГруппу(ЭтаФорма,"ХМ_ГосПенсия",Элементы.Расчет,СвойстваГруппы);

	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_РазмерГП",Элементы["ХМ_ГосПенсия"],"Объект.ХМ_РазмерГП");
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ДатаГосПенсии",Элементы["ХМ_ГосПенсия"],"Объект.ХМ_ДатаГосПенсии");
		
КонецПроцедуры