
&Перед("ПриНачалеРаботыСистемы")
Процедура ХМПриНачалеРаботыСистемы()

	//+Софтпоинт
	//ЗагрузкаМониторинга();
	//-Софтпоинт

КонецПроцедуры

#Область Софтпоинт

Процедура ЗагрузкаМониторинга()
	
	mon = Неопределено;
	
	// ВНИМАНИЕ. Чтобы ВЫБОРОЧНО отключить загрузку компоненты для x64\x86, необходимо в переменных ПутьКВКДля32хБитногоКлиента\ПутьКВКДля64хБитногоКлиента оставить пустые значения. К примеру, если не нужна загрузка 32-х битной компоненты, то укажите путь следующим образом: ПутьКВКДля32хБитногоКлиента = "";
	
	// Здесь необходимо ввести путь к шаре с 32-х битной компонентой. Шара должна быть доступна всем пользователям на чтение и запись
	ПутьКВКДля32хБитногоКлиента = "\\1C2\SoftPointPerfExpert_Thin_x32\SPMon32.dll";
	
	// Здесь необходимо ввести путь к шаре с 64-х битной компонентой. Шара должна быть доступна всем пользователям на чтение и запись
	ПутьКВКДля64хБитногоКлиента = "\\1C2\SoftPointPerfExpert_Thin_x64\SPMon64.dll";
	
	try
		СисИнфо = Новый СистемнаяИнформация;
		
		Если СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
			
			Если Не ПустаяСтрока(ПутьКВКДля64хБитногоКлиента) Тогда
				
				ПодключитьВнешнююКомпоненту(ПутьКВКДля64хБитногоКлиента, "Компонента", ТипВнешнейКомпоненты.Native);
				Попытка
					mon = Новый("AddIn.Компонента.SPMonExtension");
					
					Если mon.InitMonitor() = 0 Тогда
						СообщениеМониторинга("Ошибка инициализации мониторинга64: " + mon.GetLastError());
						Возврат;
					КонецЕсли;
					
				Исключение
					СообщениеМониторинга("Не могу создать объект из компоненты " + ОписаниеОшибки());
					Возврат;
				КонецПопытки;			
			КонецЕсли;
			
		Иначе
			
			Если Не ПустаяСтрока(ПутьКВКДля32хБитногоКлиента) Тогда
				
				ПодключитьВнешнююКомпоненту(ПутьКВКДля32хБитногоКлиента, "Компонента", ТипВнешнейКомпоненты.Native);
				Попытка
					mon = Новый("AddIn.Компонента.SPMonExtension");
					
					Если mon.InitMonitor() = 0 Тогда
						СообщениеМониторинга("Ошибка инициализации мониторинга32: " + mon.GetLastError());
						Возврат;
					КонецЕсли;
					
				Исключение
					СообщениеМониторинга("Не могу создать объект из компоненты " + ОписаниеОшибки());
					Возврат;
				КонецПопытки;			
			КонецЕсли;
			
		КонецЕсли
		
	except
		СообщениеМониторинга("Ошибка 1С при загрузке внешней компоненты мониторинга: " + ОписаниеОшибки());
		Возврат;
	endtry;
	
	Если mon <> Неопределено Тогда
		
		try
			
			try
				параметрыСессии = сфп_СлужебныйСофтпоинт.PerfExpert_УзнатьПараметрыПодключения();
			except
				СообщениеМониторинга("PerfExpert не удалось получить данные сеанса. Это не повлияет на работу 1С, но сообщите об этом администратору: " + ОписаниеОшибки());
				Возврат;
			endtry;
			
			mon.SetParam("interface_compatibility_mode", параметрыСессии.РежимСовместимостиИнтерфейса);
			mon.SetParam("client_interface_variant", параметрыСессии.ВариантИнтерфейсаКлиентскогоПриложения);
			mon.SetParam("client_window_mode", параметрыСессии.РежимОткрытияФормПриложения);
			
			mon.SetParam("server", НСтр(СтрокаСоединенияИнформационнойБазы(), "Srvr"));
			mon.SetParam("db", СтрокаСоединенияИнформационнойБазы());
			
			// система взаимодействия с пользователями
			mon.SetParam("chatserver", "");			// str: chatserver host
			mon.SetParam("interactive_system", "enabled");	// flag: enabled/disabled
			mon.SetParam("chatsystem", "enabled");			// flag: enabled/disabled
			mon.SetParam("hinged_icon", "enabled");			// flag: enabled/disabled
			
			номерСеанса = СтрЗаменить(Строка(параметрыСессии.Сеанс), Символы.НПП, "");
			
			Если mon.SetupMonitor(параметрыСессии.Пользователь, номерСеанса) = 0 Тогда
				СообщениеМониторинга("Ошибка запуска мониторинга: " + mon.GetLastError());
				Возврат;	
			КонецЕсли;
			
			mon.SetParam("user", ИмяПользователя());
			mon.SetParam("log", "on");
			
		except
			СообщениеМониторинга("Ошибка 1С при запуске мониторинга: " + ОписаниеОшибки());
			Возврат;
		endtry;
		
	КонецЕсли
	
КонецПроцедуры

Процедура СообщениеМониторинга(сообщение)
	Сообщить(сообщение);
КонецПроцедуры

#КонецОбласти
