
&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМ_ЗаполнитьОбщимПроцентом = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ХМСуммаКРаспределениюПриИзмененииПосле(Элемент)
	ИтогРублеДни =	Объект.НовыеНачисления.Итог("РублеДни");
	Если Не ИтогРублеДни = 0 Тогда
		ХМ_ОбщийПроцент = 100 * Объект.ДнейВГоду * Объект.СуммаКРаспределению / ИтогРублеДни;
	КонецЕсли;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("КнопкаПрименитьНаСервере")
Процедура ХМКнопкаПрименитьНаСервере()

	ТабНачислений = Объект.НовыеНачисления.Выгрузить();
#Вставка
	//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4123
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("Организация", Объект.Организация);
	ДопПараметры.Вставить("ХМ_ОбщийПроцент", ХМ_ОбщийПроцент);
	ДопПараметры.Вставить("ХМ_ЗаполнитьОбщимПроцентом", ХМ_ЗаполнитьОбщимПроцентом);
	уп_ОбработчикУдаления.ЗаписатьДанныеВДокументыИД(Объект.НовыеНачисления.Выгрузить(),ДопПараметры,Объект.ДнейВГоду
	,Объект.ДатаФормированияДокументов,Объект.ГруппаДоговоров,Объект.ДоговорОПС,Объект.ТипРезерва,Объект.ОтборТипРезерва);
#КонецВставки
#Удаление
	уп_ОбработчикУдаления.ЗаписатьДанныеВДокументыИД(Объект.НовыеНачисления.Выгрузить(),Объект.Организация,Объект.ДнейВГоду
	,Объект.ДатаФормированияДокументов,Объект.ГруппаДоговоров,Объект.ДоговорОПС,Объект.ТипРезерва,Объект.ОтборТипРезерва);
#КонецУдаления

КонецПроцедуры
