
#Область ХМНПФ
Процедура ХМ_НеТиповыеИзменения()
	// ЛыткинА.М. //2016-07-28 //№455  //ДатаНазначения на форме
	// ХМНПФ 21.01.2019 ГригорьевМА  // Новая ХМ_ПриСозданииНаСервере() // №2000
	// +ХМНПФ 21.01.2019 ГригорьевМА  // Модуль // №2000
КонецПроцедуры

// ХМНПФ 21.01.2019 ГригорьевМА  // Новая ХМ_ПриСозданииНаСервере() // №2000
&НаСервере
Процедура ХМПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	ХМ_РаботаСФормами.уп_ИндексацияСрочнойВыплатыПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);	
КонецПроцедуры
// -ХМНПФ 21.01.2019 ГригорьевМА  // Модуль // №2000
#КонецОбласти 
