
Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 16.03.2016 ЛыткинАМ // Новый реквизит ХМ_ДоговорыС// №275
	// ХМНПФ+ 16.03.2016 ЛыткинАМ // Новый реквизит ХМ_ДоговорыПо// №275
КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму();
КонецПроцедуры

Процедура ХМДополнитьФорму() 
	
	СвойстваГруппы = Новый Структура();
	СвойстваГруппы.Вставить("Отображение",ОтображениеОбычнойГруппы.СлабоеВыделение);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьОбычнуюГруппу(ЭтаФорма,"ХМ_ГруппаДоговорыСПо",Элементы.ГруппаСтраницаИсточник,СвойстваГруппы);
	
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ДоговорыС",Элементы["ХМ_ГруппаДоговорыСПо"],"Объект.ХМ_ДоговорыС");
    уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ДоговорыПо",Элементы["ХМ_ГруппаДоговорыСПо"],"Объект.ХМ_ДоговорыПо");
   		
КонецПроцедуры
