Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 01.07.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №406
	// ХМНПФ+ 22.08.2016 ШадринАВ // длина номера изменена с 15 до 27 // №459
КонецПроцедуры

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ, СтруктураТЧ) Экспорт
	// +ХМНПФ 01.07.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №406
	//--Если СокрЛП(ЭтотОбъект.Вид.Код) = "уп_01" И НЕ ЗначениеЗаполнено(СтрокаТЗ.ДокументРегистрации) Тогда
	Если СокрЛП(ЭтотОбъект.Вид.Код) = "уп_01" И НЕ ЗначениеЗаполнено(СтрокаТЗ.ДокументРегистрации) Тогда // только для види "судебное решение"
	// ХМНПФ 01.07.2016 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №406
		Объект = СтрокаТЗ.уп_ЗаявлениеПравопреемникаОВыплатеОПС.ПолучитьОбъект();
		Объект.ДокументРегистрации = ЭтотОбъект.Ссылка;
		Объект.ПоРешениюСуда = Истина;
		Объект.ДатаСудебногоРешения = ЭтотОбъект.ДатаВступленияВСилу;
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Объект);
	КонецЕсли;
КонецПроцедуры