// ХМНПФ 29.01.2019 ШадринАВ // Новая ХМ_УдалитьПачкиПакетаЭД() // №2014
&НаСервере
Процедура ХМ_УдалитьПачкиПакетаЭД()
	ТабУдаляемыхДок = Новый Массив;
	Для каждого СтрокаТЧ Из Объект.СоставПакета Цикл
		ТабУдаляемыхДок.Добавить(СтрокаТЧ.ПачкаЭД);		
	КонецЦикла; 
	уп_ОбработчикУдаления.УдалитьСозданныеДокументы(ТабУдаляемыхДок);
КонецПроцедуры // ХМ_УдалитьПачкиПакетаЭД()

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 29.01.2019 ШадринАВ // Новая ХМ_УдалитьПачкиПакетаЭД() // №2014
	// ХМНПФ 29.01.2019 ШадринАВ // ОчиститьПакетЭД() // №2014
	// ХМНПФ 29.01.2019 ШадринАВ // ОбработкаВыбора() // №2014
	// ХМНПФ 29.01.2019 ШадринАВ // ЗаполнитьПакетЭД() // №2014   
    // ХМНПФ 05.03.2019 ГригорьевМА // ПоместитьВАрхив() // №2086
	// ХМНПФ 05.03.2019 ГригорьевМА // ЗаполнитьФайлВПакете() // №2086
	// ХМНПФ 25.03.2019 ГригорьевМА // ЗаполнитьФайлВПакете() // №2086
	// ХМНПФ 12.12.2019 ШадринАВ // Модуль // №2606
	// ХМНПФ 12.12.2019 ШадринАВ // Новая ХМ_ПриСозданииНаСервере() // №2606
	// ХМНПФ 12.12.2019 ШадринАВ // УстановитьВидимость() // №2606
	// ХМНПФ 12.12.2019 ШадринАВ // УстановитьБлокировкуРедактирования_РеквизитыФормы() // №2606
	// ХМНПФ 12.12.2019 ШадринАВ // ЗаполнитьПакетЭДНаСервере() // №2606
	// ХМНПФ 18.02.2020 МилевскийАЮ // ЗаполнитьПакетЭДНаСервере() // №2682
КонецПроцедуры

// +ХМНПФ 12.12.2019 ШадринАВ // Модуль // №2606
&НаСервере
Процедура ХМПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	ХМ_РаботаСФормами.уп_ПакетЭД_v2ФормаДокументаПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("ЗаполнитьПакетЭДНаСервере")
Процедура ХМЗаполнитьПакетЭДНаСервере(Протокол, ДопПараметры)
	ПараметрыФормы = ПолучитьПараметрыФормыПоУмолчанию();
	#Вставка		
	// +ХМНПФ 12.12.2019 ШадринАВ // ЗаполнитьПакетЭДНаСервере() // №2606
	ПараметрыФормы.Вставить("ХМ_ПакетЭДv2", Объект.Ссылка);
	// -ХМНПФ 12.12.2019 ШадринАВ // ЗаполнитьПакетЭДНаСервере() // №2606
	// +ХМНПФ 18.02.2020 МилевскийАЮ // ЗаполнитьПакетЭДНаСервере() // №2682
	ПараметрыФормы.Вставить("ДатаЗапроса", Объект.ДатаЗапроса);
	// -ХМНПФ 18.02.2020 МилевскийАЮ // ЗаполнитьПакетЭДНаСервере() // №2682
    #КонецВставки
	
	Если Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма2 Тогда
		ПараметрыФормы.Вставить("ТипВыплаты", Перечисления.уп_ТипыВыплат.ПереводВДругойПФ);

		СписокПричинЗакрытия = Новый Массив;
		СписокПричинЗакрытия.Добавить(Перечисления.уп_ПричиныЗакрытияДоговораОПС.АннулированиеЛицензии);
		ПараметрыФормы.Вставить("ПричиныЗакрытия", СписокПричинЗакрытия);
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма36 Тогда
		ПараметрыФормы.Вставить("ДокументОснование", ДопПараметры);
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма37 Тогда
		ПараметрыФормы.Вставить("ПараметрыУЗР", Объект.ПараметрыУЗР);
		ПараметрыФормы.Вставить("ДатаВыгрузки", Объект.ДатаЗапроса);
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма17 Тогда
		ПараметрыФормы.Вставить("Счет", ДопПараметры.Счет);
	ИначеЕсли Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма42
		ИЛИ Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма43
		ИЛИ Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма44
		ИЛИ Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма45
		ИЛИ Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма46
		ИЛИ Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма47
		ИЛИ Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма48
		ИЛИ Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма49
		ИЛИ Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма50
		ИЛИ Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма51 Тогда
		Если НЕ ДопПараметры = Неопределено Тогда
			Если ДопПараметры.Свойство("СписокДоговоров") Тогда 
				ПараметрыФормы.Вставить("СписокДоговоров", ДопПараметры.СписокДоговоров);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Обработки.уп_СформироватьПакетыЭД_v2.Создать().ЗаполнитьПакетЭД(Объект, ПараметрыФормы, Протокол);

	Если Объект.ВидЭД = Перечисления.уп_ВидыЭД_v2.Форма12 Тогда
		ЗаполнитьРасшифровку();
	КонецЕсли;

КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("ЗаполнитьФайлВПакете")
Процедура ХМЗаполнитьФайлВПакете(ИмяФайла)
	//НоваяСтрока = Объект.СписокФайлов_.Добавить();
	//НоваяСтрока.ИмяФайла = ИмяФайла;
	#Вставка 
	// +ХМНПФ 05.03.2019 ГригорьевМА // ЗаполнитьФайлВПакете() // №2086
	//НоваяСтрока.ИмяФайла = ?(Прав(ИмяФайла, 6) = "XML.GZ", Лев(ИмяФайла, СтрДлина(ИмяФайла) - 7) + ".gz", ИмяФайла);
	// -ХМНПФ 05.03.2019 ГригорьевМА // ЗаполнитьФайлВПакете() // №2086
	#КонецВставки
	//НоваяСтрока.UUID = Лев(Прав(ИмяФайла, 43), 36);
КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("ОчиститьПакетЭДНаСервере")
Процедура ХМОчиститьПакетЭДНаСервере()
	#Вставка		
	// +ХМНПФ 29.01.2019 ШадринАВ // ЗаполнитьПакетЭД() // №2014
	// +ХМНПФ 05.10.2020 МилевскийАЮ // ОчиститьПакетЭДНаСервере // №2937
	//ХМ_УдалитьПачкиПакетаЭД();	
	// -ХМНПФ 05.10.2020 МилевскийАЮ // ОчиститьПакетЭДНаСервере // №2937
	// -ХМНПФ 29.01.2019 ШадринАВ // ЗаполнитьПакетЭД() // №2014
	#КонецВставки
	Объект.СоставПакета.Очистить();
	Расшифровка.Очистить();
	уп_ПакетЭД_v2.ОчиститьНомераДокументов(Объект.Ссылка,, Ложь);

	Записать();

	Обновить();
КонецПроцедуры


&НаКлиенте
&ИзменениеИКонтроль("ПоместитьВАрхив")
Процедура ХМПоместитьВАрхив(ПутьКАрхиватору, ИмяФайла)
	WScript = Новый COMОбъект("WScript.Shell");
	#Удаление 
	СтрокаЗапуска = """" + ПутьКАрхиватору + ?(Прав(ПутьКАрхиватору, 1) = "\", "", "\") + "7z.exe"" a -y -tgzip -mx5 """ + ИмяФайла + ".gz" + """ """ + ИмяФайла +  """";
	#КонецУдаления 
	#Вставка 
	// +ХМНПФ 05.03.2019 ГригорьевМА // ПоместитьВАрхив() // №2086
	СтрокаЗапуска = """" + ПутьКАрхиватору + ?(Прав(ПутьКАрхиватору, 1) = "\", "", "\") + "7z.exe"" a -y -tgzip -mx5 """ + Лев(ИмяФайла, СтрДлина(ИмяФайла)-4) + ".gz" + """ """ + ИмяФайла +  """";
	// -ХМНПФ 05.03.2019 ГригорьевМА // ПоместитьВАрхив() // №2086 	
	#КонецВставки
	Попытка
		WScript.Run(СтрокаЗапуска, 0, Истина);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось записать файл в архив. Возможно указан неправильный каталог 7-Zip: " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("УстановитьБлокировкуРедактирования_РеквизитыФормы")
Процедура ХМУстановитьБлокировкуРедактирования_РеквизитыФормы(Заблокировать)
	Элементы.ВидЭД.ТолькоПросмотр 				 = Заблокировать;
	Элементы.Организация.ТолькоПросмотр 		 = Заблокировать;
	//Элементы.Дата.ТолькоПросмотр 				 = Заблокировать;
	//Элементы.Период.Доступность 				 = НЕ Заблокировать;
	Элементы.НачалоПериода.ТолькоПросмотр 		 = Заблокировать;
	Элементы.КонецПериода.ТолькоПросмотр 		 = Заблокировать;
	Элементы.Получатель.ТолькоПросмотр 			 = Заблокировать;
	//Элементы.ДокументОснование.ТолькоПросмотр 	 = Заблокировать;
	Элементы.Коэффициент.ТолькоПросмотр 		 = Заблокировать;
	Элементы.Уведомление.ТолькоПросмотр 		 = Заблокировать;
	Элементы.ИсключитьПереданные.ТолькоПросмотр  = Заблокировать;
	Элементы.ПоТребованиюПФР.ТолькоПросмотр 	 = Заблокировать;
	Элементы.Ответственный.ТолькоПросмотр 		 = Заблокировать;
	Элементы.Руководитель.ТолькоПросмотр 		 = Заблокировать;
	Элементы.ЗаГод.ТолькоПросмотр 				 = Заблокировать;
	Элементы.ИсключитьПустыеСуммы.ТолькоПросмотр = Заблокировать;
	//Элементы.ДатаЗапроса.ТолькоПросмотр			 = Заблокировать;
	Элементы.ПорядокОтраженияРезультатаИнвестирования.ТолькоПросмотр = Заблокировать;
	Элементы.ПорядокСбора.ТолькоПросмотр = Заблокировать;
	Элементы.ПлатежныйДокумент.ТолькоПросмотр 	 = Заблокировать;

	//Элементы.Период.Видимость = НЕ Заблокировать;
	#Вставка 		
	// +ХМНПФ 12.12.2019 ШадринАВ // УстановитьБлокировкуРедактирования_РеквизитыФормы() // №2606
	Элементы.ХМ_ТипРешенийОВыплате.ТолькоПросмотр = Заблокировать;
	// -ХМНПФ 12.12.2019 ШадринАВ // УстановитьБлокировкуРедактирования_РеквизитыФормы() // №2606
	#КонецВставки
КонецПроцедуры


&НаКлиенте
&ИзменениеИКонтроль("УстановитьВидимость")
Процедура ХМУстановитьВидимость()

	ВидЭД = Объект.ВидЭД;	

	Если ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма12") Тогда
		Элементы.ПлатежныйДокумент.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.ПоступлениеНаРасчетныйСчет");
		Элементы.Расшифровка.Видимость = Истина;
	Иначе
		Элементы.ПлатежныйДокумент.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.СписаниеСРасчетногоСчета");
		Элементы.Расшифровка.Видимость = Ложь;
	КонецЕсли;

	ВидимостьДокументаОснования = 
	ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма1")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма2")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма3")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма5")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма6")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма12");

	ВидимостьПлатежногодокумента = 
	ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма1")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма2")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма3")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма5")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма6")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма12")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма44");

	Элементы.ДатаЗапроса.Видимость 		    = 	 
	ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.форма18")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.форма37");


	Если ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.форма37") Тогда
		Элементы.ДатаЗапроса.Заголовок = "Дата выгрузки";
		Элементы.ДатаЗапроса.Подсказка = "";
		Элементы.ГруппаУЗР.Видимость = Истина;
	Иначе
		Элементы.ГруппаУЗР.Видимость = Ложь;
	КонецЕсли;

	Элементы.ДокументОснование.Видимость 	= 	 ВидимостьДокументаОснования;
	Элементы.ПлатежныйДокумент.Видимость 	= 	 ВидимостьПлатежногодокумента;
	Элементы.ГруппаШапкаГоризонт5.Видимость = НЕ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма19");
	Элементы.СоставПакета.Видимость 		= НЕ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма19");
	Элементы.Коэффициент.Видимость 			= 	 ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма19");
	Элементы.ИсключитьПереданные.Видимость 	= 	 ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма14");
	Элементы.НачалоПериода.Видимость 		= НЕ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма31");
	Элементы.ПорядокСбора.Видимость 		= 	 ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма27");
	Элементы.ИсключитьПустыеСуммы.Видимость = 	 ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма28");
	Элементы.ЗаГод.Видимость 			   	= 	 ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма28");

	Элементы.СоставПакетаПолучатель.Видимость 
	= ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма22") ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма23");			
	Элементы.СоставПакетаВариантРешения.Видимость 
	= ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма20") ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма24");
	Элементы.СоставПакетаКодВыплаты.Видимость 
	= ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма20");


	Элементы.СоставПакетаИмяФайла.Видимость 	= Элементы.ПутьКАрхиву.Видимость;			
	Элементы.СоставПакетаСумма.Видимость 		= Объект.СоставПакета.Итог("Сумма") > 0;		
	Элементы.СоставПакетаОтделениеПФР.Видимость = ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма32");

	Если ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.форма20") Тогда
		Элементы.СоставПакетаДатаВыплаты.Видимость = Истина;
		Элементы.СоставПакетаДатаВыплаты.Заголовок = "Дата решения";
	ИначеЕсли ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.форма24") Тогда
		Элементы.СоставПакетаДатаВыплаты.Видимость = Истина;
		Элементы.СоставПакетаДатаВыплаты.Заголовок = "Дата выплаты";
	ИначеЕсли ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.форма25") Тогда
		Элементы.СоставПакетаДатаВыплаты.Видимость = Истина;
		Элементы.СоставПакетаДатаВыплаты.Заголовок = "Дата решения";
	ИначеЕсли ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.форма18") Тогда
		Элементы.СоставПакетаДатаВыплаты.Видимость = Истина;
		Элементы.СоставПакетаДатаВыплаты.Заголовок = "Дата запроса";
	Иначе
		Элементы.СоставПакетаДатаВыплаты.Видимость = Ложь;
	КонецЕсли;

	//Элементы.СоставПакетаГруппа1.Видимость = ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма30");

	Элементы.СоставПакетаЗаполнитьПакетЭД.Видимость = НЕ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма30");
	Элементы.СоставПакетаЗаполнитьПакетЭД1.Видимость = ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма30");
	Элементы.СоставПакетаПодборДоговоровОПС.Видимость = ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма30")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма42")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма43")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма44")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма45")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма46")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма47")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма48")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма49")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма50")
	ИЛИ ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма51");

	Если ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма18") Тогда
		Элементы.СоставПакетаЗаполнитьПакетЭД1.Заголовок = "По заявлениям";
	ИначеЕсли ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма30") Тогда
		Элементы.СоставПакетаЗаполнитьПакетЭД1.Заголовок = "Накопительный период";
	Иначе
		Элементы.СоставПакетаЗаполнитьПакетЭД1.Заголовок = "Заполнить";
	КонецЕсли;

	Если ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма31") Тогда
		Элементы.КонецПериода.Заголовок = "На дату";
	Иначе
		Элементы.КонецПериода.Заголовок = "по";
	КонецЕсли;

	Элементы.ГруппаШапкаГоризонт5.Видимость = Истина;
	Элементы.Группа5.Видимость = Истина;		
	#Вставка		
	// +ХМНПФ 12.12.2019 ШадринАВ // УстановитьВидимость() // №2606
	Элементы.ХМ_ТипРешенийОВыплате.Видимость = ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма20");
	// -ХМНПФ 12.12.2019 ШадринАВ // УстановитьВидимость() // №2606
   	#КонецВставки
	
	Если ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма36") Или 
		ВидЭД = ПредопределенноеЗначение("Перечисление.уп_ВидыЭД_v2.Форма37") Тогда 
		Элементы.Группа2.Видимость = Ложь;
	Иначе
		Элементы.Группа2.Видимость = Истина;
	КонецЕсли;

	Элементы.ПакетЭД_Основание.Видимость = ЗначениеЗаполнено(Объект.ПакетЭД_Основание);

КонецПроцедуры
// -ХМНПФ 12.12.2019 ШадринАВ // Модуль // №2606
