
&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму();
КонецПроцедуры

Процедура ХМДополнитьФорму() 
	
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,"ЧекиНПД.НомерЧека КАК НомерЧека","ЧекиНПД.НомерЧека КАК НомерЧека, ДокументПоступлениеНаРасчетныйСчет.ХМ_КварталВыплаты КАК ХМ_КварталВыплаты");
		
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("ВставитьПередЭлементом", Элементы.Комментарий);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_КварталВыплаты",Элементы.Список,"Список.ХМ_КварталВыплаты",СвойстваПоля);
		
КонецПроцедуры 