#Область ОбменБанкЭДО

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыПрямогоОбменаСБанками(Знач Банк, Знач Организация)
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("СоглашениеПрямогоОбменаСБанками", Справочники.УдалитьСоглашенияОбИспользованииЭД.ПустаяСсылка());
	СтруктураРеквизитов.Вставить("СообщениеПрямогоОбмена", "");

	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Банк", Банк);
	Запрос.Параметры.Вставить("Организация", Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоглашенияОбИспользованииЭД.Ссылка КАК СоглашениеПрямогоОбменаСБанками,
	|	СоглашенияОбИспользованииЭД.Контрагент,
	|	СоглашенияОбИспользованииЭД.СтатусСоглашения
	|ИЗ
	|	Справочник.УдалитьСоглашенияОбИспользованииЭД КАК СоглашенияОбИспользованииЭД
	|ГДЕ
	|	СоглашенияОбИспользованииЭД.Контрагент = &Банк
	|	И СоглашенияОбИспользованииЭД.Организация = &Организация
	|	И СоглашенияОбИспользованииЭД.ПометкаУдаления = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		СтруктураРеквизитов.Вставить("СоглашениеПрямогоОбменаСБанками", Выборка.СоглашениеПрямогоОбменаСБанками);
		
		СообщениеПрямогоОбмена = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Соглашение о прямом обмене %1'"), НРег(Выборка.СтатусСоглашения));
			
		СтруктураРеквизитов.Вставить("СообщениеПрямогоОбмена", СообщениеПрямогоОбмена);
		
	КонецЕсли;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура НастройкаЭДОНажатие(Элемент)
	
	Обработчик = Новый ОписаниеОповещения("ПослеСозданияНастройкиЭДО", ЭтотОбъект);
	ОбменСБанкамиКлиент.ОткрытьСоздатьНастройкуОбмена(
		Объект.Владелец, Объект.Банк, Объект.НомерСчета, Обработчик);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьРеквизитыПрямогоОбменаСБанками(Форма)
	
	Если ЗначениеЗаполнено(Форма.Объект.Банк)
		И ТипЗнч(Форма.Объект.Владелец) = Тип("СправочникСсылка.Организации") 
		И Не Форма.Объект.Валютный Тогда
		
		РеквизитыПрямогоОбмена = ПолучитьРеквизитыПрямогоОбменаСБанками(Форма.Объект.Банк, Форма.Объект.Владелец);
		
		Форма.СоглашениеПрямогоОбменаСБанками = РеквизитыПрямогоОбмена.СоглашениеПрямогоОбменаСБанками;
		Форма.СообщениеПрямогоОбмена = РеквизитыПрямогоОбмена.СообщениеПрямогоОбмена;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеСозданияНастройкиЭДО(НастройкаЭДО, Параметры) Экспорт
	
	Элементы.НастройкаЭДО.Заголовок = ОбменСБанкамиКлиентСервер.ЗаголовокНастройкиОбменаСБанком(
		Объект.Владелец, Объект.Банк);
	
КонецПроцедуры	

&НаКлиенте
Процедура СообщениеПрямогоОбменаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//Если ЗначениеЗаполнено(СоглашениеПрямогоОбменаСБанками) Тогда
	//	ПараметрыФормы = Новый Структура("Ключ, РежимОткрытияОкна",
	//		СоглашениеПрямогоОбменаСБанками, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//	ОткрытьФорму("Справочник.УдалитьСоглашенияОбИспользованииЭД.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	//КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ХМ_НеТиповыеИзменения()

	// ХМНПФ 15.01.2015 ЛыткинАМ // На форму добавлено еще одно наименование ХМ_Наименование // №0

КонецПроцедуры 

#КонецОбласти  

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму();
КонецПроцедуры 

&НаСервере
Процедура ХМДополнитьФорму() 
	
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("ВставитьПередЭлементом", Элементы.ГруппаНастройкиПлатежныхПорученийТребований);  
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_Наименование",Этаформа,"Объект.Наименование");
		
КонецПроцедуры
