&Перед("ПередЗаписью")
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = Дата;	
	КонецЕсли;	

	СуммаДокумента = спУчастники.Итог("Выплата");

	Если Не ЗначениеЗаполнено(НомерПо) Тогда
		НомерПо = Число(Номер);
	КонецЕсли;
	
КонецПроцедуры

&После("ПриУстановкеНовогоНомера")
Процедура ХМПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(хм_ВыгрузкаОписиИПорученииПенсияНаПочту.НомерПО) КАК НомерПО
		|ИЗ
		|	Документ.хм_ВыгрузкаОписиИПорученииПенсияНаПочту КАК хм_ВыгрузкаОписиИПорученииПенсияНаПочту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Номер = Документы.хм_ВыгрузкаОписиИПорученииПенсияНаПочту.ДобавитьЛидирующиеНули(ВыборкаДетальныеЗаписи.НомерПО+1,5);
		НомерПо = Число(Номер);
		СтандартнаяОбработка = Ложь;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
// Вставить содержимое обработчика.
КонецПроцедуры

&После("ПриКопировании")
Процедура ХМПриКопировании(ОбъектКопирования)
	НомерПо = 0;
КонецПроцедуры
