Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 18.12.2018 ГригорьевМА  // Новая ХМ_ПриСозданииНаСервере() // №1945
	// ХМНПФ 18.12.2018 ГригорьевМА  // Модуль // №1945
КонецПроцедуры

// ХМНПФ 18.12.2018 ГригорьевМА  // Новая ХМ_ПриСозданииНаСервере() // №1945
&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//ХМ_РаботаСФормами.уп_РешениеОВыплатеСредствПНИзРезерваФондаПоОПСПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка); 
КонецПроцедуры
// -ХМНПФ 18.12.2018 ГригорьевМА  // Модуль // №1945
