
// ХМНПФ+ 12.02.2019 ХлопцевБА // РасчитатьПервуюВыплату // №1498
&НаСервере
Процедура НПФ_РасчитатьПервуюВыплатуПередНаСервере()
	
	Дата = Объект.Дата;
	СписокСчетов = Объект.СписокСчетов;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	хм_ПорядокРасчетаРазмераПенсииПоПенсионнойСхемеСрезПоследних.ПенсионнаяСхема КАК ПенсионнаяСхема,
	|	хм_ПорядокРасчетаРазмераПенсииПоПенсионнойСхемеСрезПоследних.ПорядокРасчета КАК ПорядокРасчета,
	|	хм_ПорядокРасчетаРазмераПенсииПоПенсионнойСхемеСрезПоследних.Период КАК Период
	|ПОМЕСТИТЬ втВсе
	|ИЗ
	|	РегистрСведений.хм_ПорядокРасчетаРазмераПенсииПоПенсионнойСхеме.СрезПоследних(&КонПериода, ПенсионнаяСхема В (&мПенсионнаяСхема)) КАК хм_ПорядокРасчетаРазмераПенсииПоПенсионнойСхемеСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(втВсе.Период) КАК Период,
	|	втВсе.ПенсионнаяСхема КАК ПенсионнаяСхема
	|ПОМЕСТИТЬ втМаксимум
	|ИЗ
	|	втВсе КАК втВсе
	|
	|СГРУППИРОВАТЬ ПО
	|	втВсе.ПенсионнаяСхема
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВсе.ПенсионнаяСхема КАК ПенсионнаяСхема,
	|	втВсе.ПорядокРасчета КАК ПорядокРасчета
	|ИЗ
	|	втВсе КАК втВсе
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМаксимум КАК втМаксимум
	|		ПО втВсе.ПенсионнаяСхема = втМаксимум.ПенсионнаяСхема
	|			И втВсе.Период = втМаксимум.Период";
	
	Запрос.УстановитьПараметр("КонПериода", Дата);
	Запрос.УстановитьПараметр("мПенсионнаяСхема", СписокСчетов.Выгрузить().ВыгрузитьКолонку("Схема"));
	
	тзСхемыРасчета = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из СписокСчетов Цикл
		
		ФизЛицо = Стр.Участник.уп_ФизЛицо;
		
		Процент   = Стр.ПроцентПервойВыплаты;
		РезервСКД = Стр.ВзносыНаИПС + Стр.ИДНаИПС;
		
		Если Стр.ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежегодно Тогда
			ПериодичностьВыплатЧисло = 1;
		ИначеЕсли Стр.ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежеквартально Тогда
			ПериодичностьВыплатЧисло = 3;
		ИначеЕсли Стр.ПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежемесячно Тогда
			ПериодичностьВыплатЧисло = 12;
		КонецЕсли;
		ДатаРождения = ФизЛицо.ДатаРождения;
		Возраст = Цел((Дата - ДатаРождения)/(60*60*24*365));
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	хм_КоэффициентРасчетаПожизненнойНПОСрезПоследних.Мужчины КАК Мужчины,
		|	хм_КоэффициентРасчетаПожизненнойНПОСрезПоследних.Женщины КАК Женщины,
		|	хм_КоэффициентРасчетаПожизненнойНПОСрезПоследних.Общий КАК Общий
		|ИЗ
		|	РегистрСведений.хм_КоэффициентРасчетаПожизненнойНПО.СрезПоследних(
		|			&КонПериода,
		|			Возраст = &Возраст
		|				И Доходность = 0) КАК хм_КоэффициентРасчетаПожизненнойНПОСрезПоследних";
		
		Запрос.УстановитьПараметр("Возраст", Возраст);
		Запрос.УстановитьПараметр("КонПериода", Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ФизЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
				Коэфициент = ВыборкаДетальныеЗаписи.Мужчины;
			Иначе
				Коэфициент = ВыборкаДетальныеЗаписи.Женщины;
			КонецЕсли;
		КонецЦикла;
		
		нСтрока = тзСхемыРасчета.Найти(Стр.Схема,"ПенсионнаяСхема");	
		
		Если нСтрока <> Неопределено Тогда
			ПорядокРасчета = нСтрока.ПорядокРасчета;
		Иначе	
			ПорядокРасчета = Перечисления.хм_ПорядокРасчетаСуммыПенсииНПО.ПравилаОт23072013;
		КонецЕсли;	
		
		Если Стр.ПерваяВылата Тогда
			
			Если ПорядокРасчета = Перечисления.хм_ПорядокРасчетаСуммыПенсииНПО.ПравилаОт14052001 Тогда
				
				Если Стр.Схема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
					
					Стр.РазмерПервойВыплаты = ((1-Процент/100)* РезервСКД / (ПериодичностьВыплатЧисло * Коэфициент)) +  ((Процент/100)* РезервСКД); 
					
				Иначе
					
					Стр.РазмерПервойВыплаты = ((1-Процент/100)* РезервСКД / Стр.КоличествоВыплат ) +  ((Процент/100)* РезервСКД); 
					
				КонецЕсли;	
				
				
			ИначеЕсли ПорядокРасчета = Перечисления.хм_ПорядокРасчетаСуммыПенсииНПО.ПравилаОт23072013 Тогда	
				
				Стр.РазмерПервойВыплаты = (Процент/100)* РезервСКД; 
				
			Иначе                        
				//Сообщить();
			КонецЕсли;	
			
		КонецЕсли;  //конец расчета первой выплаты 
		
		
		//Обычная выплата 
		Если ПорядокРасчета = Перечисления.хм_ПорядокРасчетаСуммыПенсииНПО.ПравилаОт14052001 Тогда
			
			Если Стр.Схема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
				
				
				Стр.РазмерВыплаты = ((1-Процент/100)* РезервСКД / (ПериодичностьВыплатЧисло * Коэфициент)); 
				
			Иначе // если не пожизненая 
				
				Стр.РазмерВыплаты = ((1-Процент/100)* РезервСКД / Стр.КоличествоВыплат ); 
				
			КонецЕсли;	
			
			
		ИначеЕсли ПорядокРасчета = Перечисления.хм_ПорядокРасчетаСуммыПенсииНПО.ПравилаОт23072013 Тогда	
			
			Если Стр.Схема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
				
				Стр.РазмерВыплаты = (РезервСКД - Стр.РазмерПервойВыплаты)/(ПериодичностьВыплатЧисло * Коэфициент)
				
			Иначе // не пожизнена 
				
				Стр.РазмерВыплаты = (РезервСКД - Стр.РазмерПервойВыплаты)/(Стр.КоличествоВыплат -1);
				
			КонецЕсли;
		Иначе                        
			//Сообщить();
		КонецЕсли;
		
		//Иначе
		//	//Сообщить();
		//Конецесли;	
		
	КонецЦикла;
	
КонецПроцедуры
// ХМНПФ- 12.02.2019 ХлопцевБА // РасчитатьПервуюВыплату // №1498

&НаКлиенте
Процедура НПФ_РасчитатьПервуюВыплатуПеред(Команда)
	НПФ_РасчитатьПервуюВыплатуПередНаСервере();
КонецПроцедуры

&НаСервере
&После("РасчетСрочныхПенсийНаСервере")
Процедура НПФ_РасчетСрочныхПенсийНаСервере()
	
	Для каждого стр из Объект.СписокСчетов Цикл
		//округляем по тз ЮЦАУ
		стр.РазмерВыплаты = Цел(стр.РазмерВыплаты);
	КонецЦикла;	
	
КонецПроцедуры
