
&НаКлиенте
Процедура ХМСуммаКРаспределениюПриИзмененииПосле(Элемент) 
	//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4120
	ИтогРублеДни =	Объект.НовыеНачисления.Итог("РублеДни");
	Если Не ИтогРублеДни = 0 Тогда
		ХМ_ОбщийПроцент = 100 * Объект.ДнейВГоду * Объект.СуммаКРаспределению / ИтогРублеДни;
	КонецЕсли;
КонецПроцедуры

//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4120
&НаКлиенте
//АРХИВ - не подходит так как это не строки начисления, а расчет по группировкам.
Процедура ХМХМ_ЗаполнитьПроцентПосле(Команда)
	//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4120
	Для каждого Строка Из Объект.НовыеНачисления Цикл
    	Строка.Процент = ХМ_ОбщийПроцент;
		Строка.ФиксПроцент = Истина;
	КонецЦикла;
КонецПроцедуры

//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4120
&НаКлиенте
//АРХИВ - не подходит так как это не строки начисления, а расчет по группировкам.
Процедура ХМХМ_ЗафиксироватьИРассчитатьПоПроцентуПосле(Команда)
 	
	
	Точность = 15;                              
	ТочностьЧисло = 0.000000000000001;
	ИдемВперед = Истина;
	БылПроцент = ХМ_ОбщийПроцент;
	Для Инд = 1 По 100 Цикл
		Для каждого Строка Из Объект.НовыеНачисления Цикл
	    	Строка.Процент = ХМ_ОбщийПроцент;
	    	Строка.ФиксПроцент = Истина;
			Строка.Сумма = Строка.Процент * Строка.РублеДни / (100 * Объект.ДнейВГоду)
		КонецЦикла;                                                                  
		ИтогСуммаКРаспределению =	Объект.НовыеНачисления.Итог("Сумма");
		Если ИтогСуммаКРаспределению =	Объект.СуммаКРаспределению Тогда
			Прервать;
		Иначе
			Если Инд =  1 Тогда
				НадоУменьшать = ИтогСуммаКРаспределению > Объект.СуммаКРаспределению;
				ОбратныйПроход = Ложь;
			КонецЕсли;
			Если НадоУменьшать Тогда
				Если ИтогСуммаКРаспределению >	Объект.СуммаКРаспределению И Не ОбратныйПроход Тогда
					Точность = Точность - 1;
					ТочностьЧисло = ТочностьЧисло * 10;
					НовыйХМ_ОбщийПроцент = Окр(ХМ_ОбщийПроцент,Точность);
					Если НовыйХМ_ОбщийПроцент > ХМ_ОбщийПроцент Тогда
						ХМ_ОбщийПроцент = НовыйХМ_ОбщийПроцент - ТочностьЧисло;		
					Иначе
						ХМ_ОбщийПроцент = НовыйХМ_ОбщийПроцент;
					КонецЕсли;
				ИначеЕсли ИтогСуммаКРаспределению <	Объект.СуммаКРаспределению Тогда
					МаксимальныйОбщийПроцент = ХМ_ОбщийПроцент;
					ХМ_ОбщийПроцент = ХМ_ОбщийПроцент + ТочностьЧисло; 
					ОбратныйПроход = Истина;
					Точность = Точность + 1;
					ТочностьЧисло = ТочностьЧисло / 10;

					ХМ_ОбщийПроцент = ХМ_ОбщийПроцент - ТочностьЧисло;	
				Иначе
					ХМ_ОбщийПроцент = ХМ_ОбщийПроцент - ТочностьЧисло;	
				КонецЕсли;
			Иначе
				Если ИтогСуммаКРаспределению <	Объект.СуммаКРаспределению И Не ОбратныйПроход Тогда
					Точность = Точность - 1;
					ТочностьЧисло = ТочностьЧисло * 10;
					НовыйХМ_ОбщийПроцент = Окр(ХМ_ОбщийПроцент,Точность);
					Если НовыйХМ_ОбщийПроцент < ХМ_ОбщийПроцент Тогда
						ХМ_ОбщийПроцент = НовыйХМ_ОбщийПроцент + ТочностьЧисло;		
					Иначе
						ХМ_ОбщийПроцент = НовыйХМ_ОбщийПроцент;
					КонецЕсли;
				ИначеЕсли ИтогСуммаКРаспределению >	Объект.СуммаКРаспределению Тогда
					МаксимальныйОбщийПроцент = ХМ_ОбщийПроцент;
					ХМ_ОбщийПроцент = ХМ_ОбщийПроцент - ТочностьЧисло; 
					ОбратныйПроход = Истина;
					Точность = Точность + 1;
					ТочностьЧисло = ТочностьЧисло / 10;

					ХМ_ОбщийПроцент = ХМ_ОбщийПроцент + ТочностьЧисло;	
				Иначе
					ХМ_ОбщийПроцент = ХМ_ОбщийПроцент + ТочностьЧисло;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаписатьДанныеВДокументыИДНПО")
Процедура ХМЗаписатьДанныеВДокументыИДНПО()

	ТабНачислений = Объект.НовыеНачисления.Выгрузить();

	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("Организация", Объект.Организация);
	ДопПараметры.Вставить("ДнейВГоду", Объект.ДнейВГоду); 
	ДопПараметры.Вставить("ДатаФормированияДокументов", Объект.ДатаФормированияДокументов);
	ДопПараметры.Вставить("ГруппаДоговоров", Объект.ГруппаДоговоров); 
	ДопПараметры.Вставить("ПенсионныйДоговор", Объект.ПенсионныйДоговор); 
	ДопПараметры.Вставить("ТипРезерва", Объект.ТипРезерва); 
	ДопПараметры.Вставить("Схема", Объект.Схема);   
	ДопПараметры.Вставить("ИнвестиционнаяСтратегия", Объект.ИнвестиционнаяСтратегия);
	ДопПараметры.Вставить("ОтборТипРезерва", Объект.ОтборТипРезерва);
	ДопПараметры.Вставить("ОтборПенсионныйДоговор", Объект.ОтборПенсионныйДоговор);
	ДопПараметры.Вставить("ОтборПодразделение", Объект.ОтборПодразделение);
	ДопПараметры.Вставить("ОтборИнвестиционнаяСтратегия", Объект.ОтборИнвестиционнаяСтратегия);
#Вставка
	//ХМНПФ+ //ЛыткинАМ //https://redmine.npf.com/issues/4120
	ДопПараметры.Вставить("ХМ_ОбщийПроцент", ХМ_ОбщийПроцент);
	ДопПараметры.Вставить("ХМ_ЗаполнитьОбщимПроцентом", ХМ_ЗаполнитьОбщимПроцентом);
#КонецВставки
	уп_ОбработчикУдаления.ЗаписатьДанныеВДокументыИДПДС(ТабНачислений,ДопПараметры);

КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМ_ЗаполнитьОбщимПроцентом = Истина;
КонецПроцедуры
