
&НаСервере
&ИзменениеИКонтроль("СформироватьТЗДокументаПоПенсиям")
Процедура НПФ_СформироватьТЗДокументаПоПенсиям(ТЗДокумента)
	
	РКОПоУмолчанию = ПорядокРКОПоУмолчанию();
	
	ТекстОтбора = "";
	#Вставка
	// ХМНПФ+ 03.12.2021 ХлопцевБА // новый  Отбор по счету // №2787
	Если НЕ ЭтотОбъект["хм_ОтборПС"].Пустая() Тогда
		ТекстОтбора = ТекстОтбора + ?(ЭтотОбъект["ИспользоватьОтборПС"]," И НомерСчета = &хм_ОтборПС","");
	КонецЕсли;
	// ХМНПФ- 03.12.2021 ХлопцевБА // новый  Отбор по счету // №2787
	#КонецВставки
	ТекстОтбора = ТекстОтбора + ?(объект.ИспользоватьОтборДоговор," И НомерСчета.Владелец В ИЕРАРХИИ (&Договор)","");
	ТекстОтбора = ТекстОтбора + ?(объект.ИспользоватьОтборПодразделение," И НомерСчета.Владелец.ПодразделениеБУ В ИЕРАРХИИ (&Подразделение)","");
	ТекстОтбора = ТекстОтбора + ?(объект.ИспользоватьОтборФилиал," И НомерСчета.Владелец.Филиал В ИЕРАРХИИ (&Филиал)","");
	
	//надо вычесть НДФЛ по отвергнутому платежу, если там есть остатки				
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ИсполнительныйЛист.Участник КАК Участник,
	|	СУММА(ВЫБОР
	|			КОГДА уп_ДействующиеИсполнительныеЛистыСрезПоследних.Действует
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЕстьИсполнительныйЛист
	|ПОМЕСТИТЬ ИсполнительныеЛисты
	|ИЗ
	|	РегистрСведений.уп_ДействующиеИсполнительныеЛисты.СрезПоследних(&ДатаДок, ИсполнительныйЛист.Организация = &Организация) КАК уп_ДействующиеИсполнительныеЛистыСрезПоследних
	|ГДЕ
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.Действует = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ИсполнительныйЛист.Участник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияПенсийОстатки.НомерСчета КАК НомерСчета,
	|	НачисленияПенсийОстатки.НомерСчета.Владелец.ПодразделениеБУ КАК ПодразделениеБУ,
	|	НачисленияПенсийОстатки.НачПериода КАК НачПериода,
	|	НачисленияПенсийОстатки.КонПериода КАК КонПериода,
	|	НачисленияПенсийОстатки.СуммаОстаток КАК СуммаОстаток,
	|	НачисленияПенсийОстатки.НомерСчета.Участник КАК Участник,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.НалогОстаток, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияОстаток, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке18Остаток, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке20Остаток, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке22Остаток, 0) КАК Налог,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.НалогОстаток, 0) КАК НДФЛ13,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияОстаток, 0) КАК НДФЛ15, 
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке18Остаток, 0) КАК НДФЛ18, 
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке20Остаток, 0) КАК НДФЛ20, 
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке22Остаток, 0) КАК НДФЛ22, 
	|	ЛицевыеСчетаУчастниковСрезПоследних.ТипЛицевогоСчета КАК ТипЛицевогоСчета,
	|	ЛицевыеСчетаУчастниковСрезПоследних.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
	|	ЛицевыеСчетаУчастниковСрезПоследних.Банк КАК Банк,
	|	ЛицевыеСчетаУчастниковСрезПоследних.РасчетныйСчет КАК РасчетныйСчет,
	|	ЛицевыеСчетаУчастниковСрезПоследних.ФормаВыплаты КАК ФормаВыплаты,
	|	НомераОчередейСрезПоследних.НомерОчереди КАК НомерОчереди,
	|	ПолучателиПоДоговорамОбслуживания.ПолучательВПлатежномПоручении КАК ПолучательВПлатежномПоручении,
	|	ПолучателиПоДоговорамОбслуживания.РасчетныйСчет КАК РасчетныйСчетВПлатежномПоручении,
	|	уп_СхемаСчетаСрезПоследних.Схема КАК Схема,
	|	ВЫБОР
	|		КОГДА уп_СхемаСчетаСрезПоследних.ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.ПустаяСсылка)
	|			ТОГДА уп_СхемаСчетаСрезПоследних.Схема.ТипПенсионнойСхемы
	|		ИНАЧЕ уп_СхемаСчетаСрезПоследних.ТипПенсии
	|	КОНЕЦ КАК ТипПенсии,
	|	ДоверенныеЛицаУчастниковСрезПоследних.ДоверенноеЛицо КАК ДоверенноеЛицо,
	|	ЕСТЬNULL(уп_ОтвергнутыеПлатежиПенсийНПООстатки.НДФЛОстаток, 0) КАК НДФЛОтвергнутыйПлатеж,
	|	ЕСТЬNULL(ИсполнительныеЛисты.ЕстьИсполнительныйЛист, 0) КАК ЕстьИсполнительныйЛист,
	|	уп_ПараметрыПенсионногоДоговораСрезПоследних.ШаблонДоговора КАК ШаблонДоговора
	|ПОМЕСТИТЬ ОснТаблицаДанных
	|ИЗ
	|	РегистрНакопления.уп_НачисленияПенсий.Остатки(&ДатаДок, НомерСчета.Владелец.Организация = &Организация "+ТекстОтбора+") КАК НачисленияПенсийОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_НДФЛУчастниковРасчетыСБюджетом.Остатки(
	|				&ДатаДок,
	|				Организация = &Организация
	|					И ВидРасчета = &ВидРасчета) КАК НДФЛУчастниковРасчетыСБюджетомОстатки
	|		ПО НачисленияПенсийОстатки.НомерСчета = НДФЛУчастниковРасчетыСБюджетомОстатки.НомерСчета
	|			И НачисленияПенсийОстатки.НомерСчета.Участник = НДФЛУчастниковРасчетыСБюджетомОстатки.Участник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_НомераОчередей.СрезПоследних(&ДатаДок, НомерСчета.Владелец.Организация = &Организация) КАК НомераОчередейСрезПоследних
	|		ПО НачисленияПенсийОстатки.НомерСчета = НомераОчередейСрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ДоверенныеЛицаУчастников.СрезПоследних(&ДатаДок, ) КАК ДоверенныеЛицаУчастниковСрезПоследних
	|		ПО НачисленияПенсийОстатки.НомерСчета.Участник = ДоверенныеЛицаУчастниковСрезПоследних.Участник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ЛицевыеСчетаУчастников.СрезПоследних(&ДатаДок, Организация = &Организация) КАК ЛицевыеСчетаУчастниковСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПолучателиПоДоговорамОбслуживания КАК ПолучателиПоДоговорамОбслуживания
	|			ПО ЛицевыеСчетаУчастниковСрезПоследних.Банк = ПолучателиПоДоговорамОбслуживания.Получатель
	|		ПО НачисленияПенсийОстатки.НомерСчета = ЛицевыеСчетаУчастниковСрезПоследних.НомерСчета
	|			И НачисленияПенсийОстатки.НомерСчета.Участник = ЛицевыеСчетаУчастниковСрезПоследних.Участник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияПС.СрезПоследних(&ДатаДок, ) КАК уп_СостоянияПССрезПоследних
	|		ПО НачисленияПенсийОстатки.НомерСчета = уп_СостоянияПССрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СхемаСчета.СрезПоследних(&ДатаДок, ) КАК уп_СхемаСчетаСрезПоследних
	|		ПО НачисленияПенсийОстатки.НомерСчета = уп_СхемаСчетаСрезПоследних.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_ОтвергнутыеПлатежиПенсийНПО.Остатки(&ДатаДок, НомерСчета.Владелец.Организация = &Организация) КАК уп_ОтвергнутыеПлатежиПенсийНПООстатки
	|		ПО НачисленияПенсийОстатки.НомерСчета = уп_ОтвергнутыеПлатежиПенсийНПООстатки.НомерСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсполнительныеЛисты КАК ИсполнительныеЛисты
	|		ПО НачисленияПенсийОстатки.НомерСчета.Участник = ИсполнительныеЛисты.Участник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПараметрыПенсионногоДоговора.СрезПоследних(&ДатаДок, ) КАК уп_ПараметрыПенсионногоДоговораСрезПоследних
	|		ПО НачисленияПенсийОстатки.НомерСчета.Владелец = уп_ПараметрыПенсионногоДоговораСрезПоследних.ПенсионныйДоговор
	|ГДЕ
	|	уп_СостоянияПССрезПоследних.Состояние НЕ В (&ВыплатыПриостановлены) "+?(объект.ИспользоватьОтборОчередностьВыплаты,"
	|	И НомераОчередейСрезПоследних.НомерОчереди = &НомерОчереди","")+?(объект.ИспользоватьОтборПолучатель,"
	|	И (ПолучателиПоДоговорамОбслуживания.ПолучательВПлатежномПоручении = &Получатель
	|			ИЛИ ЛицевыеСчетаУчастниковСрезПоследних.Банк = &Получатель)","")+"
	|	И ЕстьNULL(ЛицевыеСчетаУчастниковСрезПоследних.НеДействует,ЛОЖЬ) = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОснТаблицаДанных.НомерСчета КАК НомерСчета,
	|	ОснТаблицаДанных.ПодразделениеБУ КАК ПодразделениеБУ,
	|	ОснТаблицаДанных.НачПериода КАК НачПериода,
	|	ОснТаблицаДанных.КонПериода КАК КонПериода,
	|	ОснТаблицаДанных.СуммаОстаток КАК СуммаОстаток,
	|	ОснТаблицаДанных.Участник КАК Участник,
	|	ОснТаблицаДанных.Налог КАК Налог, 
	|	ОснТаблицаДанных.НДФЛ13 КАК НДФЛ13, 
	|	ОснТаблицаДанных.НДФЛ15 КАК НДФЛ15, 
	|	ОснТаблицаДанных.НДФЛ18 КАК НДФЛ18, 
	|	ОснТаблицаДанных.НДФЛ20 КАК НДФЛ20,
	|	ОснТаблицаДанных.НДФЛ22 КАК НДФЛ22,
	|	ОснТаблицаДанных.ТипЛицевогоСчета КАК ТипЛицевогоСчета,
	|	ОснТаблицаДанных.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
	#Удаление
	|	ОснТаблицаДанных.Банк КАК Банк,
	|	ОснТаблицаДанных.РасчетныйСчет КАК РасчетныйСчет,
	#КонецУдаления
	#Вставка
	// ХМНПФ+ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
	|ВЫБОР КОГДА ХМ_Банки.Ссылка ЕСТЬ NULL Тогда ОснТаблицаДанных.Банк ИНАЧЕ ОснТаблицаДанных.Участник КОНЕЦ КАК Банк
	|,ЕстьNull(ХМ_БанковскиеСчета.Ссылка,ОснТаблицаДанных.РасчетныйСчет) КАК РасчетныйСчет
	|,ВЫБОР КОГДА НЕ уп_КонтрагентВыплатЧерезПочту.Значение ЕСТЬ NULL ТОГДА ИСТИНА ИНАЧЕ ЕСТЬNULL(уп_ДоговорыСБанками.ДоговорЗаключен, ЛОЖЬ) КОНЕЦ КАК ДоговорЗаключен
	|,ЕстьNULL(уп_КонтрагентВыплатЧерезПочту.Значение, 
	|	ЕстьNULL(ОснТаблицаДанных.ПолучательВПлатежномПоручении, 
	|	ОснТаблицаДанных.Банк)) КАК ПолучательВПлПор
	|,ЕстьNULL(ХМ_БанковскиеСчета.Ссылка,
	|	ЕстьNULL(уп_КонтрагентВыплатЧерезПочту.Значение.ОсновнойБанковскийСчет, 
	|	ЕстьNULL(ОснТаблицаДанных.РасчетныйСчетВПлатежномПоручении, 
	|	ОснТаблицаДанных.РасчетныйСчет))) КАК РасчетныйСчетВПлПор
	|,ЕстьNULL(ЕстьNULL(ХМ_БанковскиеСчета.Ссылка.Банк,
	|	ЕстьNULL(уп_КонтрагентВыплатЧерезПочту.Значение.ОсновнойБанковскийСчет.Банк, 
	|	ЕстьNULL(ОснТаблицаДанных.РасчетныйСчетВПлатежномПоручении.Банк, 
	|	ОснТаблицаДанных.РасчетныйСчет.Банк))),Значение(Справочник.Банки.ПустаяСсылка)) КАК РасчетныйСчетВПлПорБанк
	|,ХМ_Банки.Ссылка КАК ХМ_Банк
	|,ХМ_БанковскиеСчета.Ссылка КАК ХМ_БанковскийСчет
	|,(ВЫБОР КОГДА ХМ_Банки.Ссылка ЕСТЬ NULL Тогда ОснТаблицаДанных.Банк.ЮридическоеФизическоеЛицо ИНАЧЕ ОснТаблицаДанных.Участник.ЮридическоеФизическоеЛицо КОНЕЦ)  КАК БанкЮридическоеФизическоеЛицо
	|,ОснТаблицаДанных.НомерСчета.Владелец КАК НомерСчетаВладелец
	|,
	// ХМНПФ- 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
	#КонецВставки
	|	ОснТаблицаДанных.ФормаВыплаты КАК ФормаВыплаты,
	|	ОснТаблицаДанных.НомерОчереди КАК НомерОчереди,
	|	ОснТаблицаДанных.ПолучательВПлатежномПоручении КАК ПолучательВПлатежномПоручении,
	|	ОснТаблицаДанных.РасчетныйСчетВПлатежномПоручении КАК РасчетныйСчетВПлатежномПоручении,
	|	ОснТаблицаДанных.Схема КАК Схема,
	|	ОснТаблицаДанных.ТипПенсии КАК ТипПенсии,
	|	ОснТаблицаДанных.ДоверенноеЛицо КАК ДоверенноеЛицо,
	|	ОснТаблицаДанных.НДФЛОтвергнутыйПлатеж КАК НДФЛОтвергнутыйПлатеж,
	|	ОснТаблицаДанных.ЕстьИсполнительныйЛист КАК ЕстьИсполнительныйЛист,
	|	ОснТаблицаДанных.ШаблонДоговора КАК ШаблонДоговора,
	|	ВЫБОР КОГДА ОснТаблицаДанных.ШаблонДоговора<>ЗНАЧЕНИЕ(Справочник.уп_ШаблоныДоговоров.ПустаяСсылка) 
	|			ТОГДА ЕстьNULL(уп_ПорядокРасчетаРКОСрезПоследних.РКОВСумме, &РКОПоУмолчанию) 
	|			ИНАЧЕ &РКОПоУмолчанию 
	|	КОНЕЦ КАК РКОПоШаблону
	|ИЗ
	|	ОснТаблицаДанных КАК ОснТаблицаДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПорядокРасчетаРКО.СрезПоследних(&ДатаДок, Организация = &Организация И ТипВыплаты = &ТипВыплатРКО) КАК уп_ПорядокРасчетаРКОСрезПоследних
	|		ПО ОснТаблицаДанных.ШаблонДоговора = уп_ПорядокРасчетаРКОСрезПоследних.ШаблонДоговора
	#Вставка
	// ХМНПФ+ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ДоговорыСБанками КАК уп_ДоговорыСБанками 
	|	ПО уп_ДоговорыСБанками.Организация = &Организация 
	|	  И  уп_ДоговорыСБанками.Банк = ЕстьNULL(ОснТаблицаДанных.РасчетныйСчетВПлатежномПоручении.Банк,ОснТаблицаДанных.РасчетныйСчет.Банк) 
	|	  
	|	ЛЕВОЕ СОЕДИНЕНИЕ Константа.уп_КонтрагентВыплатЧерезПочту КАК уп_КонтрагентВыплатЧерезПочту
	|	ПО ОснТаблицаДанных.ФормаВыплаты В (Значение(Перечисление.уп_ФормыВыплаты.Почта), 
	|			Значение(Перечисление.уп_ФормыВыплаты.ПочтаСДоставкойНаДом),
	|			Значение(Перечисление.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением),
	|			Значение(Перечисление.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением))
	|	  
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Банки КАК ХМ_Банки 
	|	ПО &ХМ_УстановитьВКачествеПолучателяУчастникаИЗаполнитьРС_НПО = Истина
	|	И НЕ ВЫБОР КОГДА НЕ уп_КонтрагентВыплатЧерезПочту.Значение ЕСТЬ NULL ТОГДА ИСТИНА ИНАЧЕ ЕСТЬNULL(уп_ДоговорыСБанками.ДоговорЗаключен, ЛОЖЬ) КОНЕЦ
	|	И ХМ_Банки.ХМ_Контрагент =  ОснТаблицаДанных.Банк
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		(
	|			ВЫБРАТЬ 
	|				ХМ_БанковскиеСчета.Банк, 
	|				ХМ_БанковскиеСчета.Владелец, 
	|				ХМ_БанковскиеСчета.НомерСчета, 
	|				Максимум(ХМ_БанковскиеСчета.Ссылка) КАК Ссылка
	|			ИЗ 
	|				Справочник.БанковскиеСчета КАК ХМ_БанковскиеСчета 
	|		ГДЕ 
	|			ХМ_БанковскиеСчета.ПометкаУдаления = Ложь
	|		СГРУППИРОВАТЬ ПО 
	|				ХМ_БанковскиеСчета.Банк, ХМ_БанковскиеСчета.Владелец, ХМ_БанковскиеСчета.НомерСчета
	|		)
	|	КАК ХМ_БанковскиеСчета
	|	ПО  ХМ_БанковскиеСчета.Банк = ХМ_Банки.Ссылка
	|		И ХМ_БанковскиеСчета.Владелец = ОснТаблицаДанных.Участник
	|		И ХМ_БанковскиеСчета.НомерСчета = ОснТаблицаДанных.НомерЛицевогоСчета
	// ХМНПФ- 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
	#КонецВставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Участник,
	|	НомерСчета,
	|	НомерОчереди,
	|	НачПериода,
	|	КонПериода";
	
	Запрос.УстановитьПараметр("ДатаДок", КонецДня(объект.ДатаФормированияДокументов));
	Запрос.УстановитьПараметр("Организация", объект.Организация);
	Запрос.УстановитьПараметр("НомерОчереди", объект.ОтборОчередностьВыплаты);
	Запрос.УстановитьПараметр("Получатель", объект.ОтборПолучатель);
	Запрос.УстановитьПараметр("Договор", объект.ОтборДоговор);
	Запрос.УстановитьПараметр("Подразделение", объект.ОтборПодразделение);
	Запрос.УстановитьПараметр("Филиал", объект.ОтборФилиал);	 
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.Начисления.уп_Пенсия);
	СписокПриостановок = Новый СписокЗначений;
	СписокПриостановок.Добавить(Перечисления.уп_СостоянияПС.ВыплатыПриостановлены);
	СписокПриостановок.Добавить(Перечисления.уп_СостоянияПС.НачисленияПриостановлены);
	Запрос.УстановитьПараметр("ВыплатыПриостановлены", СписокПриостановок);
	Запрос.УстановитьПараметр("ТипВыплатРКО", Перечисления.уп_ТипыВыплат.ВыплатыПенсий);
	Запрос.УстановитьПараметр("РКОПоУмолчанию", РКОПоУмолчанию);
	#Вставка
	// ХМНПФ+ 03.12.2021 ХлопцевБА // новый  Отбор по счету // №2787
	Запрос.УстановитьПараметр("хм_ОтборПС", ЭтотОбъект["хм_ОтборПС"]);
	// ХМНПФ+ 03.12.2021 ХлопцевБА // новый  Отбор по счету // №2787
	// ХМНПФ+ 05.09.2024 ЛыткинАМ // новый  Отбор по форме выплаты // №0
	Запрос.УстановитьПараметр("хм_ОтборФормаВыплаты", ЭтотОбъект["хм_ОтборФормаВыплаты"]);
	Если НЕ ЭтотОбъект["хм_ОтборФормаВыплаты"].Пустая() И ЭтотОбъект["ИспользоватьОтборФормаВыплаты"] Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ЕстьNULL(ЛицевыеСчетаУчастниковСрезПоследних.НеДействует,ЛОЖЬ) = ЛОЖЬ", "И ЕстьNULL(ЛицевыеСчетаУчастниковСрезПоследних.НеДействует,ЛОЖЬ) = ЛОЖЬ И ЛицевыеСчетаУчастниковСрезПоследних.ФормаВыплаты = &хм_ОтборФормаВыплаты");
	КонецЕсли;
	// ХМНПФ- 05.09.2024 ЛыткинАМ // новый  Отбор по форме выплаты // №0
	// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
	Запрос.УстановитьПараметр("ХМ_УстановитьВКачествеПолучателяУчастникаИЗаполнитьРС_НПО", ЭтотОбъект["ХМ_УстановитьВКачествеПолучателяУчастникаИЗаполнитьРС_НПО"]);
	#КонецВставки
	
	Если Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратПенсииНПО Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "уп_НачисленияПенсий", "уп_ВозвратыПенсийНПО");
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ФиксУчастник = "";
	НачалоПериода = "";
	КонецПериода = "";
	НомерОчереди = "";
	ЗачтеноНДФЛ = 0;
	Почта = Константы.уп_КонтрагентВыплатЧерезПочту.Получить();
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Организация",Объект.Организация);
	ПараметрыОтбора.Вставить("ВидДеятельности",Объект.уп_ВидДеятельности);
	ПараметрыОтбора.Вставить("Подразделение",Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	СтруктураДанныхОсновная = РегистрыСведений.уп_ПолучателиДляВыплатныхРеестров.ПолучитьДанные(ПараметрыОтбора);
	
	Пока Выборка.Следующий() Цикл
		
		Если ФиксУчастник<>Выборка.НомерСчета Тогда
			НовСтр = ТЗДокумента.Добавить();
			НовСтр.ПС = Выборка.НомерСчета;
			НовСтр.Схема = Выборка.Схема;
			НовСтр.ТипПенсии = Выборка.ТипПенсии;
			НовСтр.ПодразделениеБУ = Выборка.ПодразделениеБУ;
			НовСтр.Участник = Выборка.Участник;
			НовСтр.ФормаВыплаты = Выборка.ФормаВыплаты;
			НовСтр.НомерОчереди = Выборка.НомерОчереди;
			НовСтр.НачалоПериода = Выборка.НачПериода;
			НовСтр.КонецПериода = Выборка.КонПериода;
			НовСтр.ДоверенноеЛицо = Выборка.ДоверенноеЛицо;
			НовСтр.ТипЛицевогоСчета = Выборка.ТипЛицевогоСчета;
			НовСтр.НомерЛицевогосчета = Выборка.НомерЛицевогоСчета;
			НовСтр.ЕстьИсполнительныйЛист = Выборка.ЕстьИсполнительныйЛист;
			НовСтр.Получатель = Выборка.Банк;
			//ПолучательВПлПор = РегистрыСведений.ПолучателиПоДоговорамОбслуживания.Получить(Новый Стуртура("Получатель",Выборка.Банк)).ПолучательВПлатежномПоручении;
			Если Выборка.ПолучательВПлатежномПоручении<>Null Тогда
				НовСтр.ПолучательВПлПор = Выборка.ПолучательВПлатежномПоручении;
				НовСтр.РасчетныйСчет = Выборка.РасчетныйСчетВПлатежномПоручении;
			Иначе
				НовСтр.ПолучательВПлПор = Выборка.Банк;
				НовСтр.РасчетныйСчет = Выборка.РасчетныйСчет;
			КонецЕсли;
#Вставка
	// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
			ДоговорЗаключен = Выборка.ДоговорЗаключен;
			НовСтр.ПСВладелец = Выборка.НомерСчетаВладелец;
#КонецВставки
#Удаление
			Попытка
				Банк = НовСтр.РасчетныйСчет.Банк;
			Исключение
				//не указаны реквизиты получателя
				Банк = Справочники.Банки.ПустаяСсылка();
			КонецПопытки;
			ДоговорЗаключен = РегистрыСведений.уп_ДоговорыСБанками.Получить(Новый Структура("Организация,Банк",объект.Организация,Банк)).ДоговорЗаключен;
#КонецУдаления
			Если ДоговорЗаключен Тогда
				НовСтр.ДоговорЗаключен = Истина;
			Иначе
				НовСтр.ДоговорЗаключен = Ложь
			КонецЕсли;
			
			Если  Выборка.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.Почта 
				или Выборка.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДом
				или Выборка.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением
				или Выборка.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением Тогда
				НовСтр.ПолучательВПлПор = Почта;
				НовСтр.РасчетныйСчет = Почта.ОсновнойБанковскийСчет;
#Удаление
				Попытка
					Банк = НовСтр.РасчетныйСчет.Банк;
				Исключение
					//не указаны реквизиты получателя
					Банк = Справочники.Банки.ПустаяСсылка();
				КонецПопытки;
#КонецУдаления
				НовСтр.ДоговорЗаключен = Истина;
			КонецЕсли; 
#Вставка
	// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
			Если ЗначениеЗаполнено(Выборка.ФормаВыплаты) И ЭтотОбъект["ХМ_УстановитьВКачествеПолучателяУчастникаИЗаполнитьРС_НПО"] И НовСтр.ДоговорЗаключен = Ложь И Не ЗначениеЗаполнено(НовСтр.РасчетныйСчет) Тогда
				Если ЗначениеЗаполнено(Выборка.ХМ_Банк) Тогда
					БанковскийСчет = Справочники.БанковскиеСчета.СоздатьЭлемент();
					БанковскийСчет.Наименование = Выборка.НомерЛицевогоСчета + ", " + Выборка.ХМ_Банк.Наименование;
					БанковскийСчет.Владелец = Выборка.Участник;
					БанковскийСчет.НомерСчета = Выборка.НомерЛицевогоСчета;
					БанковскийСчет.Банк = Выборка.ХМ_Банк;
					БанковскийСчет.ВалютаДенежныхСредств = Справочники.Валюты.НайтиПоНаименованию("руб.");
					БанковскийСчет.ВидСчета = "Расчетный";
					БанковскийСчет.Записать();
					НовСтр.РасчетныйСчет = БанковскийСчет.Ссылка;
				Иначе
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Контрагент "+ Выборка.ПолучательВПлПор + " участника "+Выборка.Участник+" не выбран в качестве контрагента банка, создание расчетного счета невозможно";
					Сообщение.КлючДанных = Выборка.ПолучательВПлПор;
					Сообщение.Сообщить();
				КонецЕсли;
			КонецЕсли;
#КонецВставки
			НовСтр.РКОПоШаблону = Выборка.РКОПоШаблону;
			
			
			Если Объект.ФормироватьОбщиеРеестры И Выборка.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
#Вставка
	// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
				Если Выборка.БанкЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
#КонецВставки
#Удаление
				Если Выборка.Банк.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
#КонецУдаления
					НовСтр.ЭтоРеестр = Истина; 
					НовСтр.ПолучательТЧ = НовСтр.ПолучательВПлПор;
					НовСтр.РасчетныйСчетТЧ = НовСтр.РасчетныйСчет;
					НовСтр.ДоговорЗаключен = Истина; 
					НовСтр.ПолучательВПлПор = СтруктураДанныхОсновная.Контрагент;
					НовСтр.РасчетныйСчет = СтруктураДанныхОсновная.РасчетныйСчет;
					
					Если НЕ Выборка.ПодразделениеБУ = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
						ПараметрыОтбора = Новый Структура();
						ПараметрыОтбора.Вставить("Организация",Объект.Организация);
						ПараметрыОтбора.Вставить("ВидДеятельности",Объект.уп_ВидДеятельности);
						ПараметрыОтбора.Вставить("Подразделение",Выборка.ПодразделениеБУ);
						СтруктураДанных = РегистрыСведений.уп_ПолучателиДляВыплатныхРеестров.ПолучитьДанные(ПараметрыОтбора);
						
						Если СтруктураДанных.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
						Иначе
							НовСтр.ПолучательВПлПор = СтруктураДанных.Контрагент;
							НовСтр.РасчетныйСчет = СтруктураДанных.РасчетныйСчет;
						КонецЕсли;
					КонецЕсли;	 
				КонецЕсли;
			КонецЕсли;	 
			
			НДФЛКЗачету = Выборка.Налог-Выборка.НДФЛОтвергнутыйПлатеж;
			НДФЛ13 = Выборка.НДФЛ13;
			НДФЛ15 = Выборка.НДФЛ15;
			НДФЛ18 = Выборка.НДФЛ18;
			НДФЛ20 = Выборка.НДФЛ20;
			НДФЛ22 = Выборка.НДФЛ22;
			ЗачтеноНДФЛ = 0;
			
			ФиксУчастник = Выборка.НомерСчета;
			НомерОчереди = Выборка.НомерОчереди;
			
		КонецЕсли;
		НовСтр.Сумма = НовСтр.Сумма+Выборка.СуммаОстаток;
		Если НДФЛКЗачету<=Выборка.СуммаОстаток Тогда
			НовСтр.НДФЛ = НовСтр.НДФЛ+НДФЛКЗачету;
			НовСтр.НДФЛ13 = НовСтр.НДФЛ13+НДФЛ13;
			НовСтр.НДФЛ15 = НовСтр.НДФЛ15+НДФЛ15;
			НовСтр.НДФЛ18 = НовСтр.НДФЛ18+НДФЛ18;
			НовСтр.НДФЛ20 = НовСтр.НДФЛ20+НДФЛ20;
			НовСтр.НДФЛ22 = НовСтр.НДФЛ13+НДФЛ22;
			НДФЛКЗачету = 0;
		Иначе
			Если Выборка.СуммаОстаток < 0 Тогда
				НовСтр.НДФЛ = НовСтр.НДФЛ+НДФЛКЗачету;
				НДФЛКЗачету = 0;
			Иначе
				НовСтр.НДФЛ = НовСтр.НДФЛ+Выборка.СуммаОстаток;
				НДФЛКЗачету = НДФЛКЗачету-Выборка.СуммаОстаток;
			КонецЕсли;
		КонецЕсли;
		Если Выборка.КонПериода>НовСтр.КонецПериода Тогда
			НовСтр.КонецПериода = Выборка.КонПериода;
		КонецЕсли;
		
	КонецЦикла;
	
	#Вставка
	// ХМНПФ+
	ТЗДокумента = ПроверитьНаОплатыИзлишнеВыплаченныхСуммНПО (ТЗДокумента,КонецДня(объект.ДатаФормированияДокументов));
	// ХМНПФ-
	#КонецВставки
КонецПроцедуры

&НаКлиенте
Процедура НПФ_хм_ОтборПСПриИзменении(Элемент)
	ЭтотОбъект["ИспользоватьОтборПС"] = ЗначениеЗаполнено(ЭтотОбъект["хм_ОтборПС"]);
КонецПроцедуры

&НаСервере
Функция ПроверитьНаОплатыИзлишнеВыплаченныхСуммНПО (ТЗДокумента,ДатаФормирования)
	
	тзУдержаний = ТЗДокумента.Скопировать();
	
	тзУдержаний.Очистить();
	
	Запрос = Новый Запрос;
	
//19.03.2024 ПлыгунЮВ +
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних.НомерСчета КАК ПС,
	//|	хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних.ВариантВозвратаИзлишнеВыплаченныхСумм КАК ВариантВозвратаИзлишнеВыплаченныхСумм,
	//|	хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних.ПроцентУдержания КАК ПроцентУдержания,
	//|	хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних.ЗадолженностьПогашена КАК ЗадолженностьПогашена
	//|ИЗ
	//|	РегистрСведений.хм_ПроцентУдержанияИзВыплатыНПО.СрезПоследних(&ДатаФормирования, НЕ ЗадолженностьПогашена) КАК хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних";

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних.НомерСчета КАК ПС,
		|	хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних.ВариантВозвратаИзлишнеВыплаченныхСумм КАК ВариантВозвратаИзлишнеВыплаченныхСумм,
		|	хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних.ПроцентУдержания КАК ПроцентУдержания,
		|	хм_УчетУдержанийНПООбороты.СуммаОборот КАК СуммаОборот
		|ИЗ
		|	РегистрСведений.хм_ПроцентУдержанияИзВыплатыНПО.СрезПоследних(
		|				&ДатаФормирования, 
		|				ВариантВозвратаИзлишнеВыплаченныхСумм = ЗНАЧЕНИЕ(Перечисление.хм_ВариантВозвратаИзлишнеВыплаченныхСуммНПО.ПроцентОтПенсии)) КАК хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.хм_УчетУдержанийНПО.Обороты(, &ДатаФормирования, , ) КАК хм_УчетУдержанийНПООбороты
		|	ПО хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних.НомерСчета = хм_УчетУдержанийНПООбороты.НомерСчета
		|ГДЕ
		|	хм_УчетУдержанийНПООбороты.СуммаОборот > 0";
//19.03.2024 ПлыгунЮВ -
	
	Запрос.УстановитьПараметр("ДатаФормирования", ДатаФормирования);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	

	Пока Выборка.Следующий() Цикл
		СтруктураПоиска = Новый Структура("ПС");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
		мСтрокТЗДокумента = ТЗДокумента.НайтиСтроки(СтруктураПоиска);
		ОсталосьУдержать = Выборка.СуммаОборот;
		Для Каждого Стр Из мСтрокТЗДокумента Цикл
			СуммаУдержания = Окр((Стр.Сумма-Стр.НДФЛ)/100* Выборка.ПроцентУдержания,2,РежимОкругления.Окр15как10);
			СуммаУдержания = Мин(СуммаУдержания, ОсталосьУдержать);
			Стр.хм_СуммаУдержания = СуммаУдержания; 
			ОсталосьУдержать = ОсталосьУдержать - СуммаУдержания;
			//Стр.хм_Удержание = Истина;
		КонецЦикла;	
	КонецЦикла;	
	
	
//19.03.2024 ПлыгунЮВ +	 Закомментировал
	//Пока Выборка.Следующий() Цикл
	//	Если Выборка.ВариантВозвратаИзлишнеВыплаченныхСумм = Перечисления.хм_ВариантВозвратаИзлишнеВыплаченныхСуммНПО.ПроцентОтПенсии Тогда
	//		СтруктураПоиска = Новый Структура("ПС");
	//		ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
	//		мСтрокТЗДокумента = ТЗДокумента.НайтиСтроки(СтруктураПоиска);
	//		Для Каждого Стр Из мСтрокТЗДокумента Цикл
	//			СуммаУдержание = Окр((Стр.Сумма-Стр.НДФЛ)/100* Выборка.ПроцентУдержания,2,РежимОкругления.Окр15как10);
	//			нСтрУдержаний = тзУдержаний.Добавить();
	//			ЗаполнитьЗначенияСвойств(нСтрУдержаний,Стр);
	//			нСтрУдержаний.Сумма = СуммаУдержание * (-1);
	//			нСтрУдержаний.НДФЛ = 0;
	//			нСтрУдержаний.СуммаВозмещения = 0;
	//			нСтрУдержаний.СуммаВосполнения = 0;
	//			нСтрУдержаний.СуммаКомпенсации = 0;
	//		КонецЦикла;	
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Для Каждого Стр Из тзУдержаний Цикл
	//	нСтр = ТЗДокумента.Добавить();
	//	ЗаполнитьЗначенияСвойств(нСтр,Стр);
	//	нСтр.хм_Удержание = Истина;
	//КонецЦикла;	
//19.03.2024 ПлыгунЮВ +	
	Возврат(ТЗДокумента)
	
КонецФункции	

&НаСервере
Процедура НПФ_ХМ_СоздатьРСПоРазовымПП_НПОВместоНаСервере()

	уп_ОбщегоНазначенияСервер.НПФ_ХМ_СоздатьРСПоРазовымПП_НПОВместоНаСервере(Объект.НовыеНачисления.Выгрузить(,"Документ").ВыгрузитьКолонку("Документ"));
	
КонецПроцедуры

&НаКлиенте
Процедура ХМ_СоздатьРСПоРазовымПП_НПО(Команда)
	НПФ_ХМ_СоздатьРСПоРазовымПП_НПОВместоНаСервере();
	ХМ_Обновить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ХМНастроитьОплатуЧерезРеестр(Команда)
	ПерейтиПоНавигационнойСсылке("e1cib/list/РегистрСведений.уп_ДоговорыСБанками");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьОтборФормаВыплаты()
	// ХМНПФ+ 05.09.2024 ЛыткинАМ // новый  Отбор по форме выплаты // №0
	Элементы.Группа16.Видимость = Объект.ТипВыплаты	= ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПенсий");
	// ХМНПФ 14.01.2025 ЛыткинАМ // ГоризонтОстатковПоНачислениям //https://redmine.npf.com/issues/4000
	Элементы["ГоризонтОстатковПоНачислениям"].Видимость = Объект.ТипВыплаты	= ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПенсийОПС");   
	
	// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
	Если Объект.ТипВыплаты	= ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПенсий") Тогда 
		Объект.ПоПачкам = Истина;                                                                              
		Объект.КоличествоВПачке = 1000; 
		ЭтотОбъект["ХМ_УстановитьВКачествеПолучателяУчастникаИЗаполнитьРС_НПО"] = Истина;
		Если Объект.ФормироватьОбщиеРеестры = Ложь Тогда
			Объект.ФормироватьОбщиеРеестры = Истина;
			УстановитьПолучателяРеестров();	
			УправлениеСтраницами();                  
		КонецЕсли;
	Иначе	
		ЭтотОбъект["ХМ_УстановитьВКачествеПолучателяУчастникаИЗаполнитьРС_НПО"] = Ложь;
		//ХМ_УстановитьВКачествеПолучателяУчастникаИЗаполнитьРС_НПО = Мин(ХМ_УстановитьВКачествеПолучателяУчастникаИЗаполнитьРС_НПО, Объект.ТипВыплаты	= ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПенсий"));	
	КонецЕсли;
	Элементы["ХМ_УстановитьВКачествеПолучателяУчастникаИЗаполнитьРС_НПО"].Видимость = Объект.ТипВыплаты	= ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПенсий");

КонецПроцедуры

&НаКлиенте
Процедура ХММодульПриИзмененииПосле(Элемент)
	// ХМНПФ+ 05.09.2024 ЛыткинАМ // новый  Отбор по форме выплаты // №0
	УстановитьВидимостьОтборФормаВыплаты();
КонецПроцедуры

&НаКлиенте
Процедура ХМТипВыплатыПриИзмененииПосле(Элемент)
	// ХМНПФ+ 05.09.2024 ЛыткинАМ // новый  Отбор по форме выплаты // №0
	УстановитьВидимостьОтборФормаВыплаты();
КонецПроцедуры

&НаКлиенте
Процедура ХМПриОткрытииПосле(Отказ)
	// ХМНПФ 14.01.2025 ЛыткинАМ // ГоризонтОстатковПоНачислениям //https://redmine.npf.com/issues/4000
	ЭтотОбъект["ГоризонтОстатковПоНачислениям"] = Дата(2024,1,1,0,0,0);
	// ХМНПФ+ 05.09.2024 ЛыткинАМ // новый  Отбор по форме выплаты // №0
	УстановитьВидимостьОтборФормаВыплаты(); 
КонецПроцедуры

&НаКлиенте
Процедура НПФ_хм_ОтборФормаВыплатыПриИзменении(Элемент)
	// ХМНПФ+ 05.09.2024 ЛыткинАМ // новый  Отбор по форме выплаты // №0
	ЭтотОбъект["ИспользоватьОтборФормаВыплаты"] = ЗначениеЗаполнено(ЭтотОбъект["хм_ОтборФормаВыплаты"]);
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПересчитатьДокументПРСУчетомИЛ")
Процедура ХМПересчитатьДокументПРСУчетомИЛ(ДокОбъект)
	//выгрузить список участников
	ТабПС = ДокОбъект.СписокПенсионеров.Выгрузить();
	СписокУчастников = ТабПС.ВыгрузитьКолонку("Участник");

	//найти все действующие исполнительные листы по этим участникам
	//с уже выплаченными суммами и условиями выплат
	//получить итоги по участникам

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ИсполнительныйЛист.Участник КАК Участник,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ИсполнительныйЛист КАК ИсполнительныйЛист,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.СпособРасчета КАК СпособРасчета,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.Процент КАК Процент,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.Сумма КАК Сумма,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ПредельнаяСумма КАК ПредельнаяСумма,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ПредельнаяДата КАК ПредельнаяДата
	|ПОМЕСТИТЬ ТабИЛ
	|ИЗ
	|	РегистрСведений.уп_ДействующиеИсполнительныеЛисты.СрезПоследних(&ДатаДок, ИсполнительныйЛист.Участник В (&СписокУчастников)) КАК уп_ДействующиеИсполнительныеЛистыСрезПоследних
	|ГДЕ
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.Действует = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ВыплатыПоИсполнительнымЛистамОбороты.ИсполнительныйЛист КАК ИсполнительныйЛист,
	|	уп_ВыплатыПоИсполнительнымЛистамОбороты.СуммаОборот КАК СуммаОборот
	|ПОМЕСТИТЬ СовершенныеВыплаты
	|ИЗ
	|	РегистрНакопления.уп_ВыплатыПоИсполнительнымЛистам.Обороты(
	|			&НачалоВремен,
	|			&ДатаДок,
	|			Период,
	|			ИсполнительныйЛист В
	|					(ВЫБРАТЬ
	|						ТабИЛ.ИсполнительныйЛист
	|					ИЗ
	|						ТабИЛ)
	|				И Организация = &Организация) КАК уп_ВыплатыПоИсполнительнымЛистамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабИЛ.Участник КАК Участник,
	|	ТабИЛ.ИсполнительныйЛист КАК ИсполнительныйЛист,
	|	ТабИЛ.СпособРасчета КАК СпособРасчета,
	|	ТабИЛ.Процент КАК Процент,
	|	ТабИЛ.Сумма КАК Сумма,
	|	ТабИЛ.ПредельнаяСумма КАК ПредельнаяСумма,
	|	ТабИЛ.ПредельнаяДата КАК ПредельнаяДата,
	|	ЕСТЬNULL(СовершенныеВыплаты.СуммаОборот, 0) КАК СделаноВыплат
	|ИЗ
	|	ТабИЛ КАК ТабИЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СовершенныеВыплаты КАК СовершенныеВыплаты
	|		ПО ТабИЛ.ИсполнительныйЛист = СовершенныеВыплаты.ИсполнительныйЛист
	|
	|УПОРЯДОЧИТЬ ПО
	|	Участник,
	|	СпособРасчета
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИсполнительныйЛист)
	|ПО
	|	Участник";

	Запрос.УстановитьПараметр("ДатаДок", ДокОбъект.Дата);
	Запрос.УстановитьПараметр("НачалоВремен", '20000101');
	Запрос.УстановитьПараметр("Организация", ДокОбъект.Организация);
	Запрос.УстановитьПараметр("СписокУчастников", СписокУчастников);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаУчастник = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаУчастник.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаУчастник.Выбрать();
		//формировать по каждому участнику табличку его пенсионных счетов с суммами выплат с учетом НДФЛ
		НайденныеСтроки = ДокОбъект.СписокПенсионеров.НайтиСтроки(Новый Структура("Участник", ВыборкаУчастник.Участник));

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//по каждому исполнительному листу перебираем табличку счетов и делаем отчисления (если процент, то%,
			//а если сумма, то оставляем только НДФЛ)
			//сразу формируем таблицу выплат по исполнительным листам - потом на базе этой таблицы сделаем выплатной документ
			//проверяем, действует ли еще исполнительный лист
			ИЛДействует = Истина;
			ПроверятьПредел = Ложь;
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПредельнаяДата) И ВыборкаДетальныеЗаписи.ПредельнаяДата<ДокОбъект.Дата Тогда
				ИЛДействует = Ложь;
			КонецЕсли;
			Если ВыборкаДетальныеЗаписи.ПредельнаяСумма<>0 Тогда 
				Если ВыборкаДетальныеЗаписи.СделаноВыплат>=ВыборкаДетальныеЗаписи.ПредельнаяСумма Тогда
					ИЛДействует = Ложь;
				Иначе
					ПроверятьПредел = Истина;
					СуммаОсталосьДоПредела = ВыборкаДетальныеЗаписи.ПредельнаяСумма-ВыборкаДетальныеЗаписи.СделаноВыплат;
				КонецЕсли;
			КонецЕсли;
			Если ИЛДействует Тогда //считаем
				ТабИЛ = Новый ТаблицаЗначений;
				ТабИЛ.Колонки.Добавить("НомерСчета");
				ТабИЛ.Колонки.Добавить("ПенсионныйДоговор");
				ТабИЛ.Колонки.Добавить("Схема");
				ТабИЛ.Колонки.Добавить("Участник");
				ТабИЛ.Колонки.Добавить("НачалоПериодаНачисления");
				ТабИЛ.Колонки.Добавить("КонецПериодаНачисления");
				ТабИЛ.Колонки.Добавить("Сумма");
				ТабИЛ.Колонки.Добавить("Выплата");
				ТабИЛ.Колонки.Добавить("Получатель");
				ТабИЛ.Колонки.Добавить("РасчетныйСчет");
				Если ВыборкаДетальныеЗаписи.СпособРасчета = Перечисления.СпособыРасчетаУдержанияПоИсполнительномуДокументу.Процентом Тогда
					СуммаКТекВыплате = 0;
					Для а = 0 по НайденныеСтроки.Количество()-1 Цикл
						ТекСтрока = НайденныеСтроки.Получить(а);
						СуммаПоСтроке = ТекСтрока.Выплата;
						СуммаПодПроцент = ТекСтрока.Сумма-ТекСтрока.НДФЛ;
						СуммаИЛПоСтроке = Окр(СуммаПодПроцент*ВыборкаДетальныеЗаписи.ИсполнительныйЛист.ФиксПроцент/100,2);
						Если СуммаИЛПоСтроке>ТекСтрока.Выплата Тогда
							СуммаИЛПоСтроке = ТекСтрока.Выплата;
						КонецЕсли;	
						Если ПроверятьПредел Тогда
							Если (СуммаКТекВыплате+СуммаИЛПоСтроке)>СуммаОсталосьДоПредела Тогда
								СуммаИЛПоСтроке = СуммаОсталосьДоПредела-СуммаКТекВыплате;
							КонецЕсли;
							СуммаКТекВыплате = СуммаКТекВыплате+СуммаИЛПоСтроке;
						КонецЕсли;
						Для Каждого СтрокаИЛ из ВыборкаДетальныеЗаписи.ИсполнительныйЛист.ПолучателиПоИЛ Цикл
							СуммаИЛПолучателю = Цел(СуммаИЛПоСтроке*СтрокаИЛ.Процент)/100;
							Если СуммаИЛПолучателю>0 Тогда
								НовСтрВыплатыИЛ = ТабИЛ.Добавить();
								ЗаполнитьЗначенияСвойств(НовСтрВыплатыИЛ,ТекСтрока);
								НовСтрВыплатыИЛ.Сумма = СуммаИЛПолучателю;
								НовСтрВыплатыИЛ.Выплата = СуммаИЛПолучателю;
								НовСтрВыплатыИЛ.Получатель = СтрокаИЛ.Контрагент;
								НовСтрВыплатыИЛ.РасчетныйСчет = СтрокаИЛ.РасчетныйСчет;

								ТекСтрока.Выплата = ТекСтрока.Выплата-СуммаИЛПолучателю;
							КонецЕсли;	
						КонецЦикла;	
					КонецЦикла;
				ИначеЕсли ВыборкаДетальныеЗаписи.СпособРасчета = Перечисления.СпособыРасчетаУдержанияПоИсполнительномуДокументу.ФиксированнойСуммой Тогда
					СуммаПоИЛ = ВыборкаДетальныеЗаписи.ИсполнительныйЛист.ФиксСумма;
					СуммаКТекВыплате = 0;
					Для а = 0 по НайденныеСтроки.Количество()-1 Цикл
						ТекСтрока = НайденныеСтроки.Получить(а);
						СуммаИЛПоСтроке = Мин(СуммаПоИЛ, ТекСтрока.Выплата);
						Если ПроверятьПредел Тогда
							Если (СуммаКТекВыплате+СуммаИЛПоСтроке)>СуммаОсталосьДоПредела Тогда
								СуммаИЛПоСтроке = СуммаОсталосьДоПредела-СуммаКТекВыплате;
							КонецЕсли;
							СуммаКТекВыплате = СуммаКТекВыплате+СуммаИЛПоСтроке;
						КонецЕсли;
						Для Каждого СтрокаИЛ из ВыборкаДетальныеЗаписи.ИсполнительныйЛист.ПолучателиПоИЛ Цикл
							СуммаИЛПолучателю = Цел(СуммаИЛПоСтроке*СтрокаИЛ.Процент)/100;
							Если СуммаИЛПолучателю>0 Тогда
								НовСтрВыплатыИЛ = ТабИЛ.Добавить();
								ЗаполнитьЗначенияСвойств(НовСтрВыплатыИЛ,ТекСтрока);
								НовСтрВыплатыИЛ.Сумма = СуммаИЛПолучателю;
								НовСтрВыплатыИЛ.Выплата = СуммаИЛПолучателю;
								НовСтрВыплатыИЛ.Получатель = СтрокаИЛ.Контрагент;
								НовСтрВыплатыИЛ.РасчетныйСчет = СтрокаИЛ.РасчетныйСчет;

								ТекСтрока.Выплата = ТекСтрока.Выплата-СуммаИЛПолучателю;
								СуммаПоИЛ = СуммаПоИЛ-СуммаИЛПолучателю;
							КонецЕсли;	
						КонецЦикла;
					КонецЦикла;
				КонецЕсли;
				//создаем документы по таблице ИЛ
				ТабИЛ.Сортировать("Получатель, РасчетныйСчет");
				ТПолучатель = "";
				ТРасчетныйСчет = "";
				ВыплатнойРеестр="";
				для Н=0 по ТабИЛ.Количество()-1 цикл
					ТекСтрока = ТабИЛ.Получить(Н);
					СоответствуетДокументу=Истина;
					если ТПолучатель <> ТекСтрока.Получатель тогда
						СоответствуетДокументу=Ложь;
					конецесли;
					если ТРасчетныйСчет <> ТекСтрока.РасчетныйСчет тогда
						СоответствуетДокументу=Ложь;
					конецесли;
					если (Н=0) или не СоответствуетДокументу тогда
						если Н>0 тогда
							РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
							ВыплатнойРеестр.Записать();
							НоваяВыплата = Объект.НовыеНачисления.Добавить();
							НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
							НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
							НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
							НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
						конецесли;

						ТПолучатель = ТекСтрока.Получатель;
						ТРасчетныйСчет = ТекСтрока.РасчетныйСчет;
#Вставка
						// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
						Если ТипЗнч(ВыплатнойРеестр) = Тип("ДокументОбъект.уп_ВыплатныеРеестры") Тогда
							НомерПоследнегоДокумента = СокрЛП(ВыплатнойРеестр.Номер);
						Иначе
							НомерПоследнегоДокумента = Неопределено;
							ДокОбъект.ДополнительныеСвойства.Свойство("НомерПоследнегоДокумента",НомерПоследнегоДокумента);
						КонецЕсли;
#КонецВставки

						ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
						ЗаполнитьЗначенияСвойств(ВыплатнойРеестр,ДокОбъект);
						ВыплатнойРеестр.ПоИсполнительномуЛисту = Истина;
						ВыплатнойРеестр.ИсполнительныйЛист = ВыборкаДетальныеЗаписи.ИсполнительныйЛист;
						ВыплатнойРеестр.Получатель = ТекСтрока.Получатель;
						ВыплатнойРеестр.РасчетныйСчет = ТекСтрока.РасчетныйСчет;
#Вставка 
	// +ХМНПФ 11.09.2024 ЛыткинАМ // Исполнительный лист выплачивается по банку
						ВыплатнойРеестр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет;
					// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
					ВыплатнойРеестр.ДополнительныеСвойства.Вставить("НомерПоследнегоДокумента",НомерПоследнегоДокумента);
#КонецВставки 

						//уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
					конецесли;
					//запись строки документа
					СтрокаДокумента = ВыплатнойРеестр.СписокПенсионеров.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДокумента,ТекСтрока);

					ТУчастник = ТекСтрока.Участник;

					если Н = ТабИЛ.Количество()-1 тогда
						РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
						ВыплатнойРеестр.Записать();
						НоваяВыплата = Объект.НовыеНачисления.Добавить();
						НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
						НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
						НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
						НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
					конецесли;
				конеццикла;	
				#Вставка 
					// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
					Если ТипЗнч(ВыплатнойРеестр) = Тип("ДокументОбъект.уп_ВыплатныеРеестры") Тогда
						ДокОбъект.ДополнительныеСвойства.Вставить("НомерПоследнегоДокумента",СокрЛП(ВыплатнойРеестр.Номер))
					КонецЕсли;
				#КонецВставки 
			КонецЕсли;
		КонецЦикла;
		//по итогам пересчитать сумму
		Для а = 0 по НайденныеСтроки.Количество()-1 Цикл
			ТекСтрока = НайденныеСтроки.Получить(а);
			ТекСтрока.Сумма = ТекСтрока.Выплата+ТекСтрока.НДФЛ;
		КонецЦикла;	
	КонецЦикла;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПересчитатьДокументПНСУчетомИЛ")
Процедура ХМПересчитатьДокументПНСУчетомИЛ(ДокОбъект)
	//выгрузить список участников
	ТабПС = ДокОбъект.ДоговорыОПС.Выгрузить();
	СписокУчастников = ТабПС.ВыгрузитьКолонку("Участник");

	//найти все действующие исполнительные листы по этим участникам
	//с уже выплаченными суммами и условиями выплат
	//получить итоги по участникам

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ИсполнительныйЛист.Участник КАК Участник,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ИсполнительныйЛист КАК ИсполнительныйЛист,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.СпособРасчета КАК СпособРасчета,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.Процент КАК Процент,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.Сумма КАК Сумма,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ПредельнаяСумма КАК ПредельнаяСумма,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ПредельнаяДата КАК ПредельнаяДата
	|ПОМЕСТИТЬ ТабИЛ
	|ИЗ
	|	РегистрСведений.уп_ДействующиеИсполнительныеЛисты.СрезПоследних(&ДатаДок, ИсполнительныйЛист.Участник В (&СписокУчастников)) КАК уп_ДействующиеИсполнительныеЛистыСрезПоследних
	|ГДЕ
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.Действует = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ВыплатыПоИсполнительнымЛистамОбороты.ИсполнительныйЛист КАК ИсполнительныйЛист,
	|	уп_ВыплатыПоИсполнительнымЛистамОбороты.СуммаОборот КАК СуммаОборот
	|ПОМЕСТИТЬ СовершенныеВыплаты
	|ИЗ
	|	РегистрНакопления.уп_ВыплатыПоИсполнительнымЛистам.Обороты(
	|			&НачалоВремен,
	|			&ДатаДок,
	|			Период,
	|			ИсполнительныйЛист В
	|					(ВЫБРАТЬ
	|						ТабИЛ.ИсполнительныйЛист
	|					ИЗ
	|						ТабИЛ)
	|				И Организация = &Организация) КАК уп_ВыплатыПоИсполнительнымЛистамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабИЛ.Участник КАК Участник,
	|	ТабИЛ.ИсполнительныйЛист КАК ИсполнительныйЛист,
	|	ТабИЛ.СпособРасчета КАК СпособРасчета,
	|	ТабИЛ.Процент КАК Процент,
	|	ТабИЛ.Сумма КАК Сумма,
	|	ТабИЛ.ПредельнаяСумма КАК ПредельнаяСумма,
	|	ТабИЛ.ПредельнаяДата КАК ПредельнаяДата,
	|	ЕСТЬNULL(СовершенныеВыплаты.СуммаОборот, 0) КАК СделаноВыплат
	|ИЗ
	|	ТабИЛ КАК ТабИЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СовершенныеВыплаты КАК СовершенныеВыплаты
	|		ПО ТабИЛ.ИсполнительныйЛист = СовершенныеВыплаты.ИсполнительныйЛист
	|
	|УПОРЯДОЧИТЬ ПО
	|	Участник,
	|	СпособРасчета
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИсполнительныйЛист)
	|ПО
	|	Участник";

	Запрос.УстановитьПараметр("ДатаДок", ДокОбъект.Дата);
	Запрос.УстановитьПараметр("НачалоВремен", '20000101');
	Запрос.УстановитьПараметр("Организация", ДокОбъект.Организация);
	Запрос.УстановитьПараметр("СписокУчастников", СписокУчастников);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаУчастник = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаУчастник.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаУчастник.Выбрать();
		//формировать по каждому участнику табличку его договоров ОПС с суммами выплат 
		НайденныеСтроки = ДокОбъект.ДоговорыОПС.НайтиСтроки(Новый Структура("Участник", ВыборкаУчастник.Участник));

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//по каждому исполнительному листу перебираем табличку счетов и делаем отчисления (если процент, то%,
			//а если сумма, то оставляем только НДФЛ)
			//сразу формируем таблицу выплат по исполнительным листам - потом на базе этой таблицы сделаем выплатной документ
			//проверяем, действует ли еще исполнительный лист
			ИЛДействует = Истина;
			ПроверятьПредел = Ложь;
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПредельнаяДата) И ВыборкаДетальныеЗаписи.ПредельнаяДата<ДокОбъект.Дата Тогда
				ИЛДействует = Ложь;
			КонецЕсли;
			Если ВыборкаДетальныеЗаписи.ПредельнаяСумма<>0 Тогда 
				Если ВыборкаДетальныеЗаписи.СделаноВыплат>=ВыборкаДетальныеЗаписи.ПредельнаяСумма Тогда
					ИЛДействует = Ложь;
				Иначе
					ПроверятьПредел = Истина;
					СуммаОсталосьДоПредела = ВыборкаДетальныеЗаписи.ПредельнаяСумма-ВыборкаДетальныеЗаписи.СделаноВыплат;
				КонецЕсли;
			КонецЕсли;
			Если ИЛДействует Тогда //считаем
				ТабИЛ = Новый ТаблицаЗначений;
				ТабИЛ.Колонки.Добавить("ДоговорОПС");
				ТабИЛ.Колонки.Добавить("ТипПенсииОПС");
				ТабИЛ.Колонки.Добавить("Участник");
				ТабИЛ.Колонки.Добавить("НачалоПериодаНачисления");
				ТабИЛ.Колонки.Добавить("КонецПериодаНачисления");
				ТабИЛ.Колонки.Добавить("Сумма");
				ТабИЛ.Колонки.Добавить("Выплата");
				ТабИЛ.Колонки.Добавить("Получатель");
				ТабИЛ.Колонки.Добавить("РасчетныйСчет");
				ТабИЛ.Колонки.Добавить("ТабРасшифровки");


				Если ВыборкаДетальныеЗаписи.СпособРасчета = Перечисления.СпособыРасчетаУдержанияПоИсполнительномуДокументу.Процентом Тогда
					СуммаКТекВыплате = 0;
					Для а = 0 по НайденныеСтроки.Количество()-1 Цикл
						ТекСтрока = НайденныеСтроки.Получить(а);
						СуммаПоСтроке = ТекСтрока.Выплата;
						СуммаПодПроцент = ТекСтрока.Сумма-ТекСтрока.НДФЛ;
						СуммаИЛПоСтроке = Окр(СуммаПодПроцент*ВыборкаДетальныеЗаписи.ИсполнительныйЛист.ФиксПроцент/100,2);
						Если СуммаИЛПоСтроке>ТекСтрока.Выплата Тогда
							СуммаИЛПоСтроке = ТекСтрока.Выплата;
						КонецЕсли;	
						Если ПроверятьПредел Тогда
							Если (СуммаКТекВыплате+СуммаИЛПоСтроке)>СуммаОсталосьДоПредела Тогда
								СуммаИЛПоСтроке = СуммаОсталосьДоПредела-СуммаКТекВыплате;
							КонецЕсли;
							СуммаКТекВыплате = СуммаКТекВыплате+СуммаИЛПоСтроке;
						КонецЕсли;
						Для Каждого СтрокаИЛ из ВыборкаДетальныеЗаписи.ИсполнительныйЛист.ПолучателиПоИЛ Цикл
							СуммаИЛПолучателю = Цел(СуммаИЛПоСтроке*СтрокаИЛ.Процент)/100;
							Если СуммаИЛПолучателю>0 Тогда
								НовСтрВыплатыИЛ = ТабИЛ.Добавить();
								ЗаполнитьЗначенияСвойств(НовСтрВыплатыИЛ,ТекСтрока);
								НовСтрВыплатыИЛ.Сумма = СуммаИЛПолучателю;
								НовСтрВыплатыИЛ.Выплата = СуммаИЛПолучателю;
								НовСтрВыплатыИЛ.Получатель = СтрокаИЛ.Контрагент;
								НовСтрВыплатыИЛ.РасчетныйСчет = СтрокаИЛ.РасчетныйСчет;

								ТекСтрока.Выплата = ТекСтрока.Выплата-СуммаИЛПолучателю;

								//если это единовременная выплата, то надо еще расшифровку скорректировать
								Если ДокОбъект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС Тогда
									НаборСтрокРасшифровки = ДокОбъект.РасшифровкаСуммы.НайтиСтроки(Новый Структура("ДоговорОПС", ТекСтрока.ДоговорОПС));
									ТабРасшифровки = ИнициализироватьТабРасшифровки();
									ОсталосьСписать = СуммаИЛПолучателю;
									Для б = 0 по НаборСтрокРасшифровки.Количество()-1 Цикл
										ТекСтрокаРасшифровки = НаборСтрокРасшифровки.Получить(б);
										Если ОсталосьСписать>0 и ТекСтрокаРасшифровки.Сумма>0 Тогда
											СуммаРасшифровкиКСписанию = мин(ОсталосьСписать, ТекСтрокаРасшифровки.Сумма);
											НовСтрТабРасшифровки = ТабРасшифровки.Добавить();
											ЗаполнитьЗначенияСвойств(НовСтрТабРасшифровки,ТекСтрокаРасшифровки);
											НовСтрТабРасшифровки.Сумма = СуммаРасшифровкиКСписанию;
											НовСтрТабРасшифровки.СуммаКомпенсации = 0;
											НовСтрТабРасшифровки.СуммаВосполнения = 0;
											НовСтрТабРасшифровки.СуммаВозмещения = 0;
											ТекСтрокаРасшифровки.Сумма = ТекСтрокаРасшифровки.Сумма-СуммаРасшифровкиКСписанию;

											Если ТекСтрокаРасшифровки.СуммаКомпенсации>0 Тогда
												СуммаКомпенсацииОставляем = мин(ТекСтрокаРасшифровки.Сумма, ТекСтрокаРасшифровки.СуммаКомпенсации);
												Если СуммаКомпенсацииОставляем<>ТекСтрокаРасшифровки.СуммаКомпенсации Тогда
													НовСтрТабРасшифровки.СуммаКомпенсации = ТекСтрокаРасшифровки.СуммаКомпенсации-СуммаКомпенсацииОставляем;
													ТекСтрокаРасшифровки.СуммаКомпенсации = СуммаКомпенсацииОставляем;
												КонецЕсли;	
											КонецЕсли;
											Если ТекСтрокаРасшифровки.СуммаВосполнения>0 Тогда
												СуммаВосполненияОставляем = мин(ТекСтрокаРасшифровки.Сумма-ТекСтрокаРасшифровки.СуммаКомпенсации, ТекСтрокаРасшифровки.СуммаВосполнения);
												Если СуммаВосполненияОставляем<>ТекСтрокаРасшифровки.СуммаВосполнения Тогда
													НовСтрТабРасшифровки.СуммаВосполнения = ТекСтрокаРасшифровки.СуммаВосполнения-СуммаВосполненияОставляем;
													ТекСтрокаРасшифровки.СуммаВосполнения = СуммаВосполненияОставляем;
												КонецЕсли;	
											КонецЕсли;
											Если ТекСтрокаРасшифровки.СуммаВозмещения>0 Тогда
												СуммаВозмещенияОставляем = мин(ТекСтрокаРасшифровки.Сумма-ТекСтрокаРасшифровки.СуммаКомпенсации-ТекСтрокаРасшифровки.СуммаВосполнения, ТекСтрокаРасшифровки.СуммаВозмещения);
												Если СуммаВозмещенияОставляем<>ТекСтрокаРасшифровки.СуммаВозмещения Тогда
													НовСтрТабРасшифровки.СуммаВозмещения = ТекСтрокаРасшифровки.СуммаВозмещения-СуммаВозмещенияОставляем;
													ТекСтрокаРасшифровки.СуммаВозмещения = СуммаВозмещенияОставляем;
												КонецЕсли;	
											КонецЕсли;
										КонецЕсли;	
									КонецЦикла;	
									НовСтрВыплатыИЛ.ТабРасшифровки = ТабРасшифровки;
								КонецЕсли;
							КонецЕсли;	
						КонецЦикла;	
					КонецЦикла;
				ИначеЕсли ВыборкаДетальныеЗаписи.СпособРасчета = Перечисления.СпособыРасчетаУдержанияПоИсполнительномуДокументу.ФиксированнойСуммой Тогда
					СуммаПоИЛ = ВыборкаДетальныеЗаписи.ИсполнительныйЛист.ФиксСумма;
					СуммаКТекВыплате = 0;
					Для а = 0 по НайденныеСтроки.Количество()-1 Цикл
						ТекСтрока = НайденныеСтроки.Получить(а);
						СуммаИЛПоСтроке = Мин(СуммаПоИЛ, ТекСтрока.Выплата);
						Если ПроверятьПредел Тогда
							Если (СуммаКТекВыплате+СуммаИЛПоСтроке)>СуммаОсталосьДоПредела Тогда
								СуммаИЛПоСтроке = СуммаОсталосьДоПредела-СуммаКТекВыплате;
							КонецЕсли;
							СуммаКТекВыплате = СуммаКТекВыплате+СуммаИЛПоСтроке;
						КонецЕсли;
						Для Каждого СтрокаИЛ из ВыборкаДетальныеЗаписи.ИсполнительныйЛист.ПолучателиПоИЛ Цикл
							СуммаИЛПолучателю = Цел(СуммаИЛПоСтроке*СтрокаИЛ.Процент)/100;
							Если СуммаИЛПолучателю>0 Тогда
								НовСтрВыплатыИЛ = ТабИЛ.Добавить();
								ЗаполнитьЗначенияСвойств(НовСтрВыплатыИЛ,ТекСтрока);
								НовСтрВыплатыИЛ.Сумма = СуммаИЛПолучателю;
								НовСтрВыплатыИЛ.Выплата = СуммаИЛПолучателю;
								НовСтрВыплатыИЛ.Получатель = СтрокаИЛ.Контрагент;
								НовСтрВыплатыИЛ.РасчетныйСчет = СтрокаИЛ.РасчетныйСчет;

								ТекСтрока.Выплата = ТекСтрока.Выплата-СуммаИЛПолучателю;
								СуммаПоИЛ = СуммаПоИЛ-СуммаИЛПолучателю;

								//если это единовременная выплата, то надо еще расшифровку скорректировать
								Если ДокОбъект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС Тогда
									НаборСтрокРасшифровки = ДокОбъект.РасшифровкаСуммы.НайтиСтроки(Новый Структура("ДоговорОПС", ТекСтрока.ДоговорОПС));
									ТабРасшифровки = ИнициализироватьТабРасшифровки();
									ОсталосьСписать = СуммаИЛПолучателю;
									Для б = 0 по НаборСтрокРасшифровки.Количество()-1 Цикл
										ТекСтрокаРасшифровки = НаборСтрокРасшифровки.Получить(б);
										Если ОсталосьСписать>0 и ТекСтрокаРасшифровки.Сумма>0 Тогда
											СуммаРасшифровкиКСписанию = мин(ОсталосьСписать, ТекСтрокаРасшифровки.Сумма);
											НовСтрТабРасшифровки = ТабРасшифровки.Добавить();
											ЗаполнитьЗначенияСвойств(НовСтрТабРасшифровки,ТекСтрокаРасшифровки);
											НовСтрТабРасшифровки.Сумма = СуммаРасшифровкиКСписанию;
											НовСтрТабРасшифровки.СуммаКомпенсации = 0;
											НовСтрТабРасшифровки.СуммаВосполнения = 0;
											НовСтрТабРасшифровки.СуммаВозмещения = 0;
											ТекСтрокаРасшифровки.Сумма = ТекСтрокаРасшифровки.Сумма-СуммаРасшифровкиКСписанию;

											Если ТекСтрокаРасшифровки.СуммаКомпенсации>0 Тогда
												СуммаКомпенсацииОставляем = мин(ТекСтрокаРасшифровки.Сумма, ТекСтрокаРасшифровки.СуммаКомпенсации);
												Если СуммаКомпенсацииОставляем<>ТекСтрокаРасшифровки.СуммаКомпенсации Тогда
													НовСтрТабРасшифровки.СуммаКомпенсации = ТекСтрокаРасшифровки.СуммаКомпенсации-СуммаКомпенсацииОставляем;
													ТекСтрокаРасшифровки.СуммаКомпенсации = СуммаКомпенсацииОставляем;
												КонецЕсли;	
											КонецЕсли;
											Если ТекСтрокаРасшифровки.СуммаВосполнения>0 Тогда
												СуммаВосполненияОставляем = мин(ТекСтрокаРасшифровки.Сумма-ТекСтрокаРасшифровки.СуммаКомпенсации, ТекСтрокаРасшифровки.СуммаВосполнения);
												Если СуммаВосполненияОставляем<>ТекСтрокаРасшифровки.СуммаВосполнения Тогда
													НовСтрТабРасшифровки.СуммаВосполнения = ТекСтрокаРасшифровки.СуммаВосполнения-СуммаВосполненияОставляем;
													ТекСтрокаРасшифровки.СуммаВосполнения = СуммаВосполненияОставляем;
												КонецЕсли;	
											КонецЕсли;
											Если ТекСтрокаРасшифровки.СуммаВозмещения>0 Тогда
												СуммаВозмещенияОставляем = мин(ТекСтрокаРасшифровки.Сумма-ТекСтрокаРасшифровки.СуммаКомпенсации-ТекСтрокаРасшифровки.СуммаВосполнения, ТекСтрокаРасшифровки.СуммаВозмещения);
												Если СуммаВозмещенияОставляем<>ТекСтрокаРасшифровки.СуммаВозмещения Тогда
													НовСтрТабРасшифровки.СуммаВозмещения = ТекСтрокаРасшифровки.СуммаВозмещения-СуммаВозмещенияОставляем;
													ТекСтрокаРасшифровки.СуммаВозмещения = СуммаВозмещенияОставляем;
												КонецЕсли;	
											КонецЕсли;
										КонецЕсли;	
									КонецЦикла;	
									НовСтрВыплатыИЛ.ТабРасшифровки = ТабРасшифровки;
								КонецЕсли;
							КонецЕсли;	
						КонецЦикла;
					КонецЦикла;
				КонецЕсли;
				//создаем документы по таблице ИЛ
				ТабИЛ.Сортировать("Получатель, РасчетныйСчет");
				ТПолучатель = "";
				ТРасчетныйСчет = "";
				ВыплатнойРеестр="";
				для Н=0 по ТабИЛ.Количество()-1 цикл
					ТекСтрока = ТабИЛ.Получить(Н);
					СоответствуетДокументу=Истина;
					если ТПолучатель <> ТекСтрока.Получатель тогда
						СоответствуетДокументу=Ложь;
					конецесли;
					если ТРасчетныйСчет <> ТекСтрока.РасчетныйСчет тогда
						СоответствуетДокументу=Ложь;
					конецесли;
					если (Н=0) или не СоответствуетДокументу тогда
						если Н>0 тогда
							РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
							ВыплатнойРеестр.Записать();
							НоваяВыплата = Объект.НовыеНачисления.Добавить();
							НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
							НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
							НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
							НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
						конецесли;

						ТПолучатель = ТекСтрока.Получатель;
						ТРасчетныйСчет = ТекСтрока.РасчетныйСчет;

						ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
						ЗаполнитьЗначенияСвойств(ВыплатнойРеестр,ДокОбъект);
						ВыплатнойРеестр.ПоИсполнительномуЛисту = Истина;
						ВыплатнойРеестр.ИсполнительныйЛист = ВыборкаДетальныеЗаписи.ИсполнительныйЛист;
						ВыплатнойРеестр.Получатель = ТекСтрока.Получатель;
						ВыплатнойРеестр.РасчетныйСчет = ТекСтрока.РасчетныйСчет;
#Вставка 
	// +ХМНПФ 11.09.2024 ЛыткинАМ // Исполнительный лист выплачивается по банку
						ВыплатнойРеестр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет;
#КонецВставки 

						//уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
					конецесли;
					//запись строки документа
					СтрокаДокумента = ВыплатнойРеестр.ДоговорыОПС.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДокумента,ТекСтрока);
					//если это единовременная выплата, то надо еще расшифровку заполнить
					Если ТипЗнч(ТекСтрока.ТабРасшифровки) = Тип("ТаблицаЗначений") Тогда
						Для Каждого стрТабРасшифровки из ТекСтрока.ТабРасшифровки Цикл
							НовСтрРасшифровки = ВыплатнойРеестр.РасшифровкаСуммы.Добавить();
							ЗаполнитьЗначенияСвойств(НовСтрРасшифровки,стрТабРасшифровки);
						КонецЦикла;	
					КонецЕсли;	


					ТУчастник = ТекСтрока.Участник;

					если Н = ТабИЛ.Количество()-1 тогда
						РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
						ВыплатнойРеестр.Записать();
						НоваяВыплата = Объект.НовыеНачисления.Добавить();
						НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
						НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
						НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
						НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
					конецесли;
				конеццикла;	
			КонецЕсли;
		КонецЦикла;
		//по итогам пересчитать сумму
		Для а = 0 по НайденныеСтроки.Количество()-1 Цикл
			ТекСтрока = НайденныеСтроки.Получить(а);
			ТекСтрока.Сумма = ТекСтрока.Выплата;
		КонецЦикла;	
	КонецЦикла;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПересчитатьДокументПДССУчетомИЛ")
Процедура ХМПересчитатьДокументПДССУчетомИЛ(ДокОбъект)
	//выгрузить список участников
	ТабПС = ДокОбъект.СписокПенсионеровПДС.Выгрузить();
	СписокУчастников = ТабПС.ВыгрузитьКолонку("Участник");

	//найти все действующие исполнительные листы по этим участникам
	//с уже выплаченными суммами и условиями выплат
	//получить итоги по участникам

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ИсполнительныйЛист.Участник КАК Участник,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ИсполнительныйЛист КАК ИсполнительныйЛист,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.СпособРасчета КАК СпособРасчета,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.Процент КАК Процент,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.Сумма КАК Сумма,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ПредельнаяСумма КАК ПредельнаяСумма,
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ПредельнаяДата КАК ПредельнаяДата
	|ПОМЕСТИТЬ ТабИЛ
	|ИЗ
	|	РегистрСведений.уп_ДействующиеИсполнительныеЛисты.СрезПоследних(&ДатаДок, ИсполнительныйЛист.Участник В (&СписокУчастников)) КАК уп_ДействующиеИсполнительныеЛистыСрезПоследних
	|ГДЕ
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.Действует = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ВыплатыПоИсполнительнымЛистамОбороты.ИсполнительныйЛист КАК ИсполнительныйЛист,
	|	уп_ВыплатыПоИсполнительнымЛистамОбороты.СуммаОборот КАК СуммаОборот
	|ПОМЕСТИТЬ СовершенныеВыплаты
	|ИЗ
	|	РегистрНакопления.уп_ВыплатыПоИсполнительнымЛистам.Обороты(
	|			&НачалоВремен,
	|			&ДатаДок,
	|			Период,
	|			ИсполнительныйЛист В
	|					(ВЫБРАТЬ
	|						ТабИЛ.ИсполнительныйЛист
	|					ИЗ
	|						ТабИЛ)
	|				И Организация = &Организация) КАК уп_ВыплатыПоИсполнительнымЛистамОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабИЛ.Участник КАК Участник,
	|	ТабИЛ.ИсполнительныйЛист КАК ИсполнительныйЛист,
	|	ТабИЛ.СпособРасчета КАК СпособРасчета,
	|	ТабИЛ.Процент КАК Процент,
	|	ТабИЛ.Сумма КАК Сумма,
	|	ТабИЛ.ПредельнаяСумма КАК ПредельнаяСумма,
	|	ТабИЛ.ПредельнаяДата КАК ПредельнаяДата,
	|	ЕСТЬNULL(СовершенныеВыплаты.СуммаОборот, 0) КАК СделаноВыплат
	|ИЗ
	|	ТабИЛ КАК ТабИЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ СовершенныеВыплаты КАК СовершенныеВыплаты
	|		ПО ТабИЛ.ИсполнительныйЛист = СовершенныеВыплаты.ИсполнительныйЛист
	|
	|УПОРЯДОЧИТЬ ПО
	|	Участник,
	|	СпособРасчета
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИсполнительныйЛист)
	|ПО
	|	Участник";

	Запрос.УстановитьПараметр("ДатаДок", ДокОбъект.Дата);
	Запрос.УстановитьПараметр("НачалоВремен", '20000101');
	Запрос.УстановитьПараметр("Организация", ДокОбъект.Организация);
	Запрос.УстановитьПараметр("СписокУчастников", СписокУчастников);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаУчастник = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаУчастник.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаУчастник.Выбрать();
		//формировать по каждому участнику табличку его пенсионных счетов с суммами выплат с учетом НДФЛ
		НайденныеСтроки = ДокОбъект.СписокПенсионеровПДС.НайтиСтроки(Новый Структура("Участник", ВыборкаУчастник.Участник));

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//по каждому исполнительному листу перебираем табличку счетов и делаем отчисления (если процент, то%,
			//а если сумма, то оставляем только НДФЛ)
			//сразу формируем таблицу выплат по исполнительным листам - потом на базе этой таблицы сделаем выплатной документ
			//проверяем, действует ли еще исполнительный лист
			ИЛДействует = Истина;
			ПроверятьПредел = Ложь;
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПредельнаяДата) И ВыборкаДетальныеЗаписи.ПредельнаяДата<ДокОбъект.Дата Тогда
				ИЛДействует = Ложь;
			КонецЕсли;
			Если ВыборкаДетальныеЗаписи.ПредельнаяСумма<>0 Тогда 
				Если ВыборкаДетальныеЗаписи.СделаноВыплат>=ВыборкаДетальныеЗаписи.ПредельнаяСумма Тогда
					ИЛДействует = Ложь;
				Иначе
					ПроверятьПредел = Истина;
					СуммаОсталосьДоПредела = ВыборкаДетальныеЗаписи.ПредельнаяСумма-ВыборкаДетальныеЗаписи.СделаноВыплат;
				КонецЕсли;
			КонецЕсли;
			Если ИЛДействует Тогда //считаем
				ТабИЛ = Новый ТаблицаЗначений;
				ТабИЛ.Колонки.Добавить("НомерСчета");
				ТабИЛ.Колонки.Добавить("ПенсионныйДоговор");
				ТабИЛ.Колонки.Добавить("ТипПенсии");
				ТабИЛ.Колонки.Добавить("Участник");
				ТабИЛ.Колонки.Добавить("НачалоПериодаНачисления");
				ТабИЛ.Колонки.Добавить("КонецПериодаНачисления");
				ТабИЛ.Колонки.Добавить("Сумма");
				ТабИЛ.Колонки.Добавить("Выплата");
				ТабИЛ.Колонки.Добавить("Получатель");
				ТабИЛ.Колонки.Добавить("РасчетныйСчет");
				Если ВыборкаДетальныеЗаписи.СпособРасчета = Перечисления.СпособыРасчетаУдержанияПоИсполнительномуДокументу.Процентом Тогда
					СуммаКТекВыплате = 0;
					Для а = 0 по НайденныеСтроки.Количество()-1 Цикл
						ТекСтрока = НайденныеСтроки.Получить(а);
						СуммаПоСтроке = ТекСтрока.Выплата;
						СуммаПодПроцент = ТекСтрока.Сумма-ТекСтрока.НДФЛ;
						СуммаИЛПоСтроке = Окр(СуммаПодПроцент*ВыборкаДетальныеЗаписи.ИсполнительныйЛист.ФиксПроцент/100,2);
						Если СуммаИЛПоСтроке>ТекСтрока.Выплата Тогда
							СуммаИЛПоСтроке = ТекСтрока.Выплата;
						КонецЕсли;	
						Если ПроверятьПредел Тогда
							Если (СуммаКТекВыплате+СуммаИЛПоСтроке)>СуммаОсталосьДоПредела Тогда
								СуммаИЛПоСтроке = СуммаОсталосьДоПредела-СуммаКТекВыплате;
							КонецЕсли;
							СуммаКТекВыплате = СуммаКТекВыплате+СуммаИЛПоСтроке;
						КонецЕсли;
						Для Каждого СтрокаИЛ из ВыборкаДетальныеЗаписи.ИсполнительныйЛист.ПолучателиПоИЛ Цикл
							СуммаИЛПолучателю = Цел(СуммаИЛПоСтроке*СтрокаИЛ.Процент)/100;
							Если СуммаИЛПолучателю>0 Тогда
								НовСтрВыплатыИЛ = ТабИЛ.Добавить();
								ЗаполнитьЗначенияСвойств(НовСтрВыплатыИЛ,ТекСтрока);
								НовСтрВыплатыИЛ.Сумма = СуммаИЛПолучателю;
								НовСтрВыплатыИЛ.Выплата = СуммаИЛПолучателю;
								НовСтрВыплатыИЛ.Получатель = СтрокаИЛ.Контрагент;
								НовСтрВыплатыИЛ.РасчетныйСчет = СтрокаИЛ.РасчетныйСчет;

								ТекСтрока.Выплата = ТекСтрока.Выплата-СуммаИЛПолучателю;
							КонецЕсли;	
						КонецЦикла;	
					КонецЦикла;
				ИначеЕсли ВыборкаДетальныеЗаписи.СпособРасчета = Перечисления.СпособыРасчетаУдержанияПоИсполнительномуДокументу.ФиксированнойСуммой Тогда
					СуммаПоИЛ = ВыборкаДетальныеЗаписи.ИсполнительныйЛист.ФиксСумма;
					СуммаКТекВыплате = 0;
					Для а = 0 по НайденныеСтроки.Количество()-1 Цикл
						ТекСтрока = НайденныеСтроки.Получить(а);
						СуммаИЛПоСтроке = Мин(СуммаПоИЛ, ТекСтрока.Выплата);
						Если ПроверятьПредел Тогда
							Если (СуммаКТекВыплате+СуммаИЛПоСтроке)>СуммаОсталосьДоПредела Тогда
								СуммаИЛПоСтроке = СуммаОсталосьДоПредела-СуммаКТекВыплате;
							КонецЕсли;
							СуммаКТекВыплате = СуммаКТекВыплате+СуммаИЛПоСтроке;
						КонецЕсли;
						Для Каждого СтрокаИЛ из ВыборкаДетальныеЗаписи.ИсполнительныйЛист.ПолучателиПоИЛ Цикл
							СуммаИЛПолучателю = Цел(СуммаИЛПоСтроке*СтрокаИЛ.Процент)/100;
							Если СуммаИЛПолучателю>0 Тогда
								НовСтрВыплатыИЛ = ТабИЛ.Добавить();
								ЗаполнитьЗначенияСвойств(НовСтрВыплатыИЛ,ТекСтрока);
								НовСтрВыплатыИЛ.Сумма = СуммаИЛПолучателю;
								НовСтрВыплатыИЛ.Выплата = СуммаИЛПолучателю;
								НовСтрВыплатыИЛ.Получатель = СтрокаИЛ.Контрагент;
								НовСтрВыплатыИЛ.РасчетныйСчет = СтрокаИЛ.РасчетныйСчет;

								ТекСтрока.Выплата = ТекСтрока.Выплата-СуммаИЛПолучателю;
								СуммаПоИЛ = СуммаПоИЛ-СуммаИЛПолучателю;
							КонецЕсли;	
						КонецЦикла;
					КонецЦикла;
				КонецЕсли;
				//создаем документы по таблице ИЛ
				ТабИЛ.Сортировать("Получатель, РасчетныйСчет");
				ТПолучатель = "";
				ТРасчетныйСчет = "";
				ВыплатнойРеестр="";
				для Н=0 по ТабИЛ.Количество()-1 цикл
					ТекСтрока = ТабИЛ.Получить(Н);
					СоответствуетДокументу=Истина;
					если ТПолучатель <> ТекСтрока.Получатель тогда
						СоответствуетДокументу=Ложь;
					конецесли;
					если ТРасчетныйСчет <> ТекСтрока.РасчетныйСчет тогда
						СоответствуетДокументу=Ложь;
					конецесли;
					если (Н=0) или не СоответствуетДокументу тогда
						если Н>0 тогда
							РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
							ВыплатнойРеестр.Записать();
							НоваяВыплата = Объект.НовыеНачисления.Добавить();
							НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
							НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
							НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
							НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
						конецесли;

						ТПолучатель = ТекСтрока.Получатель;
						ТРасчетныйСчет = ТекСтрока.РасчетныйСчет;

						ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
						ЗаполнитьЗначенияСвойств(ВыплатнойРеестр,ДокОбъект);
						ВыплатнойРеестр.ПоИсполнительномуЛисту = Истина;
						ВыплатнойРеестр.ИсполнительныйЛист = ВыборкаДетальныеЗаписи.ИсполнительныйЛист;
						ВыплатнойРеестр.Получатель = ТекСтрока.Получатель;
						ВыплатнойРеестр.РасчетныйСчет = ТекСтрока.РасчетныйСчет;
#Вставка 
	// +ХМНПФ 11.09.2024 ЛыткинАМ // Исполнительный лист выплачивается по банку
						ВыплатнойРеестр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет;
#КонецВставки 

						//уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
					конецесли;
					//запись строки документа
					СтрокаДокумента = ВыплатнойРеестр.СписокПенсионеровПДС.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаДокумента,ТекСтрока);

					ТУчастник = ТекСтрока.Участник;

					если Н = ТабИЛ.Количество()-1 тогда
						РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
						ВыплатнойРеестр.Записать();
						НоваяВыплата = Объект.НовыеНачисления.Добавить();
						НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
						НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
						НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
						НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
					конецесли;
				конеццикла;	
			КонецЕсли;
		КонецЦикла;
		//по итогам пересчитать сумму
		Для а = 0 по НайденныеСтроки.Количество()-1 Цикл
			ТекСтрока = НайденныеСтроки.Получить(а);
			ТекСтрока.Сумма = ТекСтрока.Выплата+ТекСтрока.НДФЛ;
		КонецЦикла;	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ХМ_ПрименитьПроцентУдержания(ТЗДокумента)
	Если Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС И НЕ ЭтотОбъект["ХМ_ВыплатаПоВозвратам"] Тогда
		// ХМНПФ 14.01.2025 ЛыткинАМ // ГоризонтОстатковПоНачислениям //https://redmine.npf.com/issues/4000
		мСтрок = Новый Массив();
		Для каждого стрДоговора Из ТЗДокумента Цикл
			Если стрДоговора.НачалоПериода < ЭтотОбъект["ГоризонтОстатковПоНачислениям"] Тогда
				мСтрок.Добавить(стрДоговора);	
			КонецЕсли;
		КонецЦикла;
		ХМ_УдалитьСтрокиТЗ(мСтрок, ТЗДокумента);
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ХМ_ПроцентУдержанияИзВыплатыОПС.ДоговорОПС КАК ДоговорОПС,
			|	ХМ_ПроцентУдержанияИзВыплатыОПС.ТипВыплат КАК ТипВыплат,
			|	ХМ_ПроцентУдержанияИзВыплатыОПС.ПроцентУдержания КАК ПроцентУдержания,
			|	ХМ_ПроцентУдержанияИзВыплатыОПС.НетЗаявления КАК НетЗаявления,
			|	РазмерПенсииОПС.Размер КАК РазмерПенсии
			|ИЗ
			|	РегистрСведений.ХМ_ПроцентУдержанияИзВыплатыОПС.СрезПоследних(
			|			&Период,
			|			ДоговорОПС В (&СписокДоговоров)
			|				И ТипВыплат = ЗНАЧЕНИЕ(Перечисление.уп_ТипыВыплат.ВыплатыПенсийОПС)) КАК ХМ_ПроцентУдержанияИзВыплатыОПС
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.уп_РазмерПенсииОПС.СрезПоследних(&Период, ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсийОПС.Пожизненная)) КАК РазмерПенсииОПС
			|		ПО ХМ_ПроцентУдержанияИзВыплатыОПС.ДоговорОПС = РазмерПенсииОПС.ДоговорОПС
			|ГДЕ
			|	НЕ ХМ_ПроцентУдержанияИзВыплатыОПС.ЗадолженностьПогашена";
		
		Запрос.УстановитьПараметр("Период", Объект.ДатаФормированияДокументов);
		ТЗСписокДоговоров = ТЗДокумента.Скопировать();
		ТЗСписокДоговоров.Свернуть("ПС");
		Запрос.УстановитьПараметр("СписокДоговоров", ТЗСписокДоговоров);
		
		ТЗДоговорыНаУдержание = Запрос.Выполнить().Выгрузить();
		Для каждого стрПУ Из ТЗДоговорыНаУдержание Цикл
			// нужно выплатить сумму не меньше чем: МинимальнаяСуммаВыплаты = стрПУ.РазмерПенсии * (100 - стрПУ.ПроцентУдержания) / 100
			// 1 скопировать из ТЗДокумента строки по договору в ТЗДоговорОПС, сортировать по НачалоПериода 
			// 2 удалить из ТЗДокумента строки по договору
			// 3 удалять из ТЗДоговорОПС строки с отрицательной Суммой, пока общая сумма по договору не сравняется с МинимальнаяСуммаВыплаты
			//   последнюю отрицательную сумму нужно будет "подгонять"
			// 4 добавить строки из ТЗДоговорОПС в ТЗДокумента
			ОтборПоДоговоруОПС = Новый Структура("ПС",стрПУ.ДоговорОПС);
			ТЗДоговорОПС = ТЗДокумента.Скопировать(ОтборПоДоговоруОПС);
			ТЗДоговорОПС.Сортировать("НачалоПериода Убыв");
			МинимальнаяСуммаВыплаты = Окр(стрПУ.РазмерПенсии * (100 - стрПУ.ПроцентУдержания) / 100, 2, РежимОкругления.Окр15как10);
			Если МинимальнаяСуммаВыплаты <= ТЗДоговорОПС.Итог("Сумма") Тогда Продолжить; КонецЕсли;
			
			мСтрок = ТЗДокумента.НайтиСтроки(ОтборПоДоговоруОПС);
			ХМ_УдалитьСтрокиТЗ(мСтрок, ТЗДокумента);
			
			Если стрПУ.НетЗаявления Тогда // нужно выплатить текущую пенсию, а остальное пускай "висит" в начислениях
				вФлаг = Истина;
				Для каждого стрДоговора Из ТЗДоговорОПС Цикл
					Если стрДоговора.Сумма = стрПУ.РазмерПенсии И вФлаг Тогда
						вФлаг = Ложь;
						Продолжить;
					КонецЕсли;
					стрДоговора.Сумма = 0;
				КонецЦикла;
			Иначе
				Для каждого стрДоговора Из ТЗДоговорОПС Цикл
					Если стрДоговора.Сумма > 0 Тогда Продолжить; КонецЕсли;
					стрДоговора.Сумма = 0;
					ИтогПоСумме = ТЗДоговорОПС.Итог("Сумма");
					Если МинимальнаяСуммаВыплаты <= ИтогПоСумме Тогда
						// +ХМНПФ 31.03.2020 ШадринАВ // ХМ_ПрименитьПроцентУдержания() // №2732
						НомерДоговора = СокрЛП(стрПУ.ДоговорОПС.Наименование);
						Если НомерДоговора = "0706-ПС-07198" ИЛИ НомерДоговора = "0706-ПС-06012" ИЛИ НомерДоговора = "0613-ПС-01259" Тогда
							стрДоговора.Сумма = МинимальнаяСуммаВыплаты - ИтогПоСумме;
						КонецЕсли;
						// -ХМНПФ 31.03.2020 ШадринАВ // ХМ_ПрименитьПроцентУдержания() // №2732
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			ОтборПоСумме = Новый Структура("Сумма", 0);
			мСтрок = ТЗДоговорОПС.НайтиСтроки(ОтборПоСумме);
			ХМ_УдалитьСтрокиТЗ(мСтрок, ТЗДоговорОПС);
			Для каждого стрДоговора Из ТЗДоговорОПС Цикл
				стрДокумента = ТЗДокумента.Добавить();
				ЗаполнитьЗначенияСвойств(стрДокумента,стрДоговора);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ДополнитьТаблицуРасчетнымиСчетамиОрганизации")
Процедура ХМДополнитьТаблицуРасчетнымиСчетамиОрганизации(ТЗДокумента)
	ПенсионныеПравила = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Организация", Объект.Организация));

	Если Объект.Модуль = Перечисления.уп_ВидыДеятельности.ПР Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗВходящая.ФормаВыплаты КАК ФормаВыплаты,
		|	ТЗВходящая.ДоговорЗаключен КАК ДоговорЗаключен,
		|	ТЗВходящая.ПодразделениеБУ КАК ПодразделениеБУ,
		|	ТЗВходящая.ПолучательВПлПор КАК ПолучательВПлПор,
		|	ТЗВходящая.РасчетныйСчет КАК РасчетныйСчет,
		|	ТЗВходящая.НомерОчереди КАК НомерОчереди,
		|	ТЗВходящая.РКОПоШаблону КАК РКОПоШаблону, 
		|	ТЗВходящая.Участник КАК Участник,
		|	ВЫРАЗИТЬ(ТЗВходящая.ПС КАК Справочник.уп_ПенсионныеСчета) КАК ПС,
		|	ТЗВходящая.Схема КАК Схема,
		|	ТЗВходящая.ТипЛицевогоСчета КАК ТипЛицевогоСчета,
		|	ТЗВходящая.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
		|	ТЗВходящая.ПереводНаСчет КАК ПереводНаСчет,
		|	ТЗВходящая.НомерСчетаПриемник КАК НомерСчетаПриемник,
		|	ТЗВходящая.Получатель КАК Получатель,
		|	ТЗВходящая.Периодичность КАК Периодичность,
		|	ТЗВходящая.Сумма КАК Сумма,
		|	ТЗВходящая.СуммаКомпенсации КАК СуммаКомпенсации,
		|	ТЗВходящая.СуммаВосполнения КАК СуммаВосполнения,
		|	ТЗВходящая.СуммаВозмещения КАК СуммаВозмещения,
		|	ТЗВходящая.НДФЛ КАК НДФЛ,
		|	ТЗВходящая.НачалоПериода КАК НачалоПериода,
		|	ТЗВходящая.КонецПериода КАК КонецПериода,
		|	ТЗВходящая.ДокументРегистрации КАК ДокументРегистрации,
		|	ТЗВходящая.ДоверенноеЛицо КАК ДоверенноеЛицо,
		|	ТЗВходящая.ТипСуммы КАК ТипСуммы,
		|	ТЗВходящая.ТипПенсии КАК ТипПенсии,
		|	ТЗВходящая.ПричинаЗакрытия КАК ПричинаЗакрытия,
		|	ТЗВходящая.ЕстьИсполнительныйЛист КАК ЕстьИсполнительныйЛист,
		|	ТЗВходящая.ПолучательТЧ КАК ПолучательТЧ,
		|	ТЗВходящая.РасчетныйСчетТЧ КАК РасчетныйСчетТЧ,
#Вставка
//https://redmine.npf.com/issues/4549
		|	ТЗВходящая.хм_Удержание КАК хм_Удержание,
		|	ТЗВходящая.хм_СуммаУдержания КАК хм_СуммаУдержания,
// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
		|	ТЗВходящая.ПСВладелец КАК ПСВладелец,
#КонецВставки
		|	ТЗВходящая.ЭтоРеестр КАК ЭтоРеестр
		|ПОМЕСТИТЬ ВТ_Входящая
		|ИЗ
		|	&ТЗВходящая КАК ТЗВходящая
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Входящая.ФормаВыплаты КАК ФормаВыплаты,
		|	ВТ_Входящая.ДоговорЗаключен КАК ДоговорЗаключен,
		|	ВТ_Входящая.ПодразделениеБУ КАК ПодразделениеБУ,
		|	ВТ_Входящая.ПолучательВПлПор КАК ПолучательВПлПор,
		|	ВТ_Входящая.РасчетныйСчет КАК РасчетныйСчет,
		|	ВТ_Входящая.НомерОчереди КАК НомерОчереди,
		|	ВТ_Входящая.РКОПоШаблону КАК РКОПоШаблону, 
		|	ВТ_Входящая.Участник КАК Участник,
		|	ВТ_Входящая.ПС КАК ПС,
		|	ВТ_Входящая.Схема КАК Схема,
		|	ВТ_Входящая.ТипЛицевогоСчета КАК ТипЛицевогоСчета,
		|	ВТ_Входящая.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
		|	ВТ_Входящая.ПереводНаСчет КАК ПереводНаСчет,
		|	ВТ_Входящая.НомерСчетаПриемник КАК НомерСчетаПриемник,
		|	ВТ_Входящая.Получатель КАК Получатель,
		|	ВТ_Входящая.Периодичность КАК Периодичность,
		|	ВТ_Входящая.Сумма КАК Сумма,
		|	ВТ_Входящая.СуммаКомпенсации КАК СуммаКомпенсации,
		|	ВТ_Входящая.СуммаВосполнения КАК СуммаВосполнения,
		|	ВТ_Входящая.СуммаВозмещения КАК СуммаВозмещения,
		|	ВТ_Входящая.НДФЛ КАК НДФЛ,
		|	ВТ_Входящая.НачалоПериода КАК НачалоПериода,
		|	ВТ_Входящая.КонецПериода КАК КонецПериода,
		|	ВТ_Входящая.ДокументРегистрации КАК ДокументРегистрации,
		|	ВТ_Входящая.ДоверенноеЛицо КАК ДоверенноеЛицо,
		|	ВТ_Входящая.ТипСуммы КАК ТипСуммы,
		|	ВТ_Входящая.ТипПенсии КАК ТипПенсии,
		|	ВТ_Входящая.ПричинаЗакрытия КАК ПричинаЗакрытия,
		|	ВТ_Входящая.ЕстьИсполнительныйЛист КАК ЕстьИсполнительныйЛист,
		|	ВТ_Входящая.ПолучательТЧ КАК ПолучательТЧ,
		|	ВТ_Входящая.РасчетныйСчетТЧ КАК РасчетныйСчетТЧ,
		|	ВТ_Входящая.ЭтоРеестр КАК ЭтоРеестр,
#Вставка
//https://redmine.npf.com/issues/4549
		|	ВТ_Входящая.хм_Удержание КАК хм_Удержание,
		|	ВТ_Входящая.хм_СуммаУдержания КАК хм_СуммаУдержания,
// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
		|	ВТ_Входящая.ПСВладелец КАК ПСВладелец,
#КонецВставки
		|	ЕСТЬNULL(уп_ИнвестиционныеСтратегииСрезПоследних.ИнвестиционнаяСтратегия, &ПустаяИнвестиционнаяСтратегия) КАК ИнвестиционнаяСтратегия
		|ПОМЕСТИТЬ ВТ_ВходящаяСоСтратегиями
		|ИЗ
		|	ВТ_Входящая КАК ВТ_Входящая
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ИнвестиционныеСтратегии.СрезПоследних КАК уп_ИнвестиционныеСтратегииСрезПоследних
		|		ПО ВТ_Входящая.ПС.Владелец = уп_ИнвестиционныеСтратегииСрезПоследних.ПенсионныйДоговор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Входящая
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВходящаяСоСтратегиями.ФормаВыплаты КАК ФормаВыплаты,
		|	ВТ_ВходящаяСоСтратегиями.ДоговорЗаключен КАК ДоговорЗаключен,
		|	ВТ_ВходящаяСоСтратегиями.ПодразделениеБУ КАК ПодразделениеБУ,
		|	ВТ_ВходящаяСоСтратегиями.ПолучательВПлПор КАК ПолучательВПлПор,
		|	ВТ_ВходящаяСоСтратегиями.РасчетныйСчет КАК РасчетныйСчет,
		|	ВТ_ВходящаяСоСтратегиями.НомерОчереди КАК НомерОчереди,
		|	ВТ_ВходящаяСоСтратегиями.РКОПоШаблону КАК РКОПоШаблону,
		|	ВТ_ВходящаяСоСтратегиями.Участник КАК Участник,
		|	ВТ_ВходящаяСоСтратегиями.ПС КАК ПС,
		|	ВТ_ВходящаяСоСтратегиями.Схема КАК Схема,
		|	ВТ_ВходящаяСоСтратегиями.ТипЛицевогоСчета КАК ТипЛицевогоСчета,
		|	ВТ_ВходящаяСоСтратегиями.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
		|	ВТ_ВходящаяСоСтратегиями.ПереводНаСчет КАК ПереводНаСчет,
		|	ВТ_ВходящаяСоСтратегиями.НомерСчетаПриемник КАК НомерСчетаПриемник,
		|	ВТ_ВходящаяСоСтратегиями.Получатель КАК Получатель,
		|	ВТ_ВходящаяСоСтратегиями.Периодичность КАК Периодичность,
		|	ВТ_ВходящаяСоСтратегиями.Сумма КАК Сумма,
		|	ВТ_ВходящаяСоСтратегиями.СуммаКомпенсации КАК СуммаКомпенсации,
		|	ВТ_ВходящаяСоСтратегиями.СуммаВосполнения КАК СуммаВосполнения,
		|	ВТ_ВходящаяСоСтратегиями.СуммаВозмещения КАК СуммаВозмещения,
		|	ВТ_ВходящаяСоСтратегиями.НДФЛ КАК НДФЛ,
		|	ВТ_ВходящаяСоСтратегиями.НачалоПериода КАК НачалоПериода,
		|	ВТ_ВходящаяСоСтратегиями.КонецПериода КАК КонецПериода,
		|	ВТ_ВходящаяСоСтратегиями.ДокументРегистрации КАК ДокументРегистрации,
		|	ВТ_ВходящаяСоСтратегиями.ДоверенноеЛицо КАК ДоверенноеЛицо,
		|	ВТ_ВходящаяСоСтратегиями.ТипСуммы КАК ТипСуммы,
		|	ВТ_ВходящаяСоСтратегиями.ТипПенсии КАК ТипПенсии,
		|	ВТ_ВходящаяСоСтратегиями.ПричинаЗакрытия КАК ПричинаЗакрытия,
		|	ВТ_ВходящаяСоСтратегиями.ЕстьИсполнительныйЛист КАК ЕстьИсполнительныйЛист,
		|	ВТ_ВходящаяСоСтратегиями.ПолучательТЧ КАК ПолучательТЧ,
		|	ВТ_ВходящаяСоСтратегиями.РасчетныйСчетТЧ КАК РасчетныйСчетТЧ,
		|	ВТ_ВходящаяСоСтратегиями.ЭтоРеестр КАК ЭтоРеестр,
		|	ВТ_ВходящаяСоСтратегиями.ИнвестиционнаяСтратегия КАК ИнвестиционнаяСтратегия,
#Вставка
//https://redmine.npf.com/issues/4549
		|	ВТ_ВходящаяСоСтратегиями.хм_Удержание КАК хм_Удержание,
		|	ВТ_ВходящаяСоСтратегиями.хм_СуммаУдержания КАК хм_СуммаУдержания,
// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
		|	ВТ_ВходящаяСоСтратегиями.ПСВладелец КАК ПСВладелец,
#КонецВставки
		|	ВЫБОР
		|		КОГДА &УчетРСпоИнвестСтратегии
		|			ТОГДА ЕСТЬNULL(уп_СоответствияИнвестиционныхСтратегийРасчетномуСчету.РасчетныйСчет, &БанковскийСчетПоУмолчанию)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|	КОНЕЦ КАК РасчетныйСчетОрганизации
		|ИЗ
		|	ВТ_ВходящаяСоСтратегиями КАК ВТ_ВходящаяСоСтратегиями
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СоответствияИнвестиционныхСтратегийРасчетномуСчету КАК уп_СоответствияИнвестиционныхСтратегийРасчетномуСчету
		|		ПО ВТ_ВходящаяСоСтратегиями.ИнвестиционнаяСтратегия = уп_СоответствияИнвестиционныхСтратегийРасчетномуСчету.ИнвестиционнаяСтратегия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ВходящаяСоСтратегиями"; 
		Запрос.УстановитьПараметр("ТЗВходящая", ТЗДокумента); 
		Запрос.УстановитьПараметр("ПустаяИнвестиционнаяСтратегия", Справочники.уп_ИнвестиционныеСтратегии.ПустаяСсылка()); 
		Запрос.УстановитьПараметр("УчетРСпоИнвестСтратегии", ПенсионныеПравила.УчетБанковскихСчетовПоИнвестиционнымСтратегиямНПО);
		Запрос.УстановитьПараметр("БанковскийСчетПоУмолчанию", ПолучитьСчетОрганизации(Объект.Организация));


		РезультатЗапроса = Запрос.Выполнить();
		ТЗДокумента = РезультатЗапроса.Выгрузить();
	ИначеЕсли Объект.Модуль = Перечисления.уп_ВидыДеятельности.ПДС Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗВходящая.ФормаВыплаты КАК ФормаВыплаты,
		|	ТЗВходящая.ДоговорЗаключен КАК ДоговорЗаключен,
		|	ТЗВходящая.ПодразделениеБУ КАК ПодразделениеБУ,
		|	ТЗВходящая.ПолучательВПлПор КАК ПолучательВПлПор,
		|	ТЗВходящая.РасчетныйСчет КАК РасчетныйСчет,
		|	ТЗВходящая.НомерОчереди КАК НомерОчереди,
		|	ТЗВходящая.РКОПоШаблону КАК РКОПоШаблону, 
		|	ТЗВходящая.Участник КАК Участник,
		|	ВЫРАЗИТЬ(ТЗВходящая.ПС КАК Справочник.пдс_ПенсионныеСчетаПДС) КАК ПС,
		|	ТЗВходящая.Схема КАК Схема,
		|	ТЗВходящая.ТипЛицевогоСчета КАК ТипЛицевогоСчета,
		|	ТЗВходящая.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
		|	ТЗВходящая.ПереводНаСчет КАК ПереводНаСчет,
		|	ТЗВходящая.НомерСчетаПриемник КАК НомерСчетаПриемник,
		|	ТЗВходящая.Получатель КАК Получатель,
		|	ТЗВходящая.Периодичность КАК Периодичность,
		|	ТЗВходящая.Сумма КАК Сумма,
		|	ТЗВходящая.СуммаКомпенсации КАК СуммаКомпенсации,
		|	ТЗВходящая.СуммаВосполнения КАК СуммаВосполнения,
		|	ТЗВходящая.СуммаВозмещения КАК СуммаВозмещения,
		|	ТЗВходящая.НДФЛ КАК НДФЛ,
		|	ТЗВходящая.НачалоПериода КАК НачалоПериода,
		|	ТЗВходящая.КонецПериода КАК КонецПериода,
		|	ТЗВходящая.ДокументРегистрации КАК ДокументРегистрации,
		|	ТЗВходящая.ДоверенноеЛицо КАК ДоверенноеЛицо,
		|	ТЗВходящая.ТипСуммы КАК ТипСуммы,
		|	ТЗВходящая.ТипПенсии КАК ТипПенсии,
		|	ТЗВходящая.ПричинаЗакрытия КАК ПричинаЗакрытия,
		|	ТЗВходящая.ЕстьИсполнительныйЛист КАК ЕстьИсполнительныйЛист,
		|	ТЗВходящая.ПолучательТЧ КАК ПолучательТЧ,
		|	ТЗВходящая.РасчетныйСчетТЧ КАК РасчетныйСчетТЧ,
		|	ТЗВходящая.ЭтоРеестр КАК ЭтоРеестр
		|ПОМЕСТИТЬ ВТ_Входящая
		|ИЗ
		|	&ТЗВходящая КАК ТЗВходящая
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Входящая.ФормаВыплаты КАК ФормаВыплаты,
		|	ВТ_Входящая.ДоговорЗаключен КАК ДоговорЗаключен,
		|	ВТ_Входящая.ПодразделениеБУ КАК ПодразделениеБУ,
		|	ВТ_Входящая.ПолучательВПлПор КАК ПолучательВПлПор,
		|	ВТ_Входящая.РасчетныйСчет КАК РасчетныйСчет,
		|	ВТ_Входящая.НомерОчереди КАК НомерОчереди,
		|	ВТ_Входящая.РКОПоШаблону КАК РКОПоШаблону, 
		|	ВТ_Входящая.Участник КАК Участник,
		|	ВТ_Входящая.ПС КАК ПС,
		|	ВТ_Входящая.Схема КАК Схема,
		|	ВТ_Входящая.ТипЛицевогоСчета КАК ТипЛицевогоСчета,
		|	ВТ_Входящая.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
		|	ВТ_Входящая.ПереводНаСчет КАК ПереводНаСчет,
		|	ВТ_Входящая.НомерСчетаПриемник КАК НомерСчетаПриемник,
		|	ВТ_Входящая.Получатель КАК Получатель,
		|	ВТ_Входящая.Периодичность КАК Периодичность,
		|	ВТ_Входящая.Сумма КАК Сумма,
		|	ВТ_Входящая.СуммаКомпенсации КАК СуммаКомпенсации,
		|	ВТ_Входящая.СуммаВосполнения КАК СуммаВосполнения,
		|	ВТ_Входящая.СуммаВозмещения КАК СуммаВозмещения,
		|	ВТ_Входящая.НДФЛ КАК НДФЛ,
		|	ВТ_Входящая.НачалоПериода КАК НачалоПериода,
		|	ВТ_Входящая.КонецПериода КАК КонецПериода,
		|	ВТ_Входящая.ДокументРегистрации КАК ДокументРегистрации,
		|	ВТ_Входящая.ДоверенноеЛицо КАК ДоверенноеЛицо,
		|	ВТ_Входящая.ТипСуммы КАК ТипСуммы,
		|	ВТ_Входящая.ТипПенсии КАК ТипПенсии,
		|	ВТ_Входящая.ПричинаЗакрытия КАК ПричинаЗакрытия,
		|	ВТ_Входящая.ЕстьИсполнительныйЛист КАК ЕстьИсполнительныйЛист,
		|	ВТ_Входящая.ПолучательТЧ КАК ПолучательТЧ,
		|	ВТ_Входящая.РасчетныйСчетТЧ КАК РасчетныйСчетТЧ,
		|	ВТ_Входящая.ЭтоРеестр КАК ЭтоРеестр,
		|	ЕСТЬNULL(пдс_ИнвестиционныеСтратегииПДССрезПоследних.ИнвестиционнаяСтратегия, &ПустаяИнвестиционнаяСтратегия) КАК ИнвестиционнаяСтратегия
		|ПОМЕСТИТЬ ВТ_ВходящаяСоСтратегиями
		|ИЗ
		|	ВТ_Входящая КАК ВТ_Входящая
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.пдс_ИнвестиционныеСтратегииПДС.СрезПоследних КАК пдс_ИнвестиционныеСтратегииПДССрезПоследних
		|		ПО ВТ_Входящая.ПС.Владелец = пдс_ИнвестиционныеСтратегииПДССрезПоследних.ДоговорПДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_Входящая
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВходящаяСоСтратегиями.ФормаВыплаты КАК ФормаВыплаты,
		|	ВТ_ВходящаяСоСтратегиями.ДоговорЗаключен КАК ДоговорЗаключен,
		|	ВТ_ВходящаяСоСтратегиями.ПодразделениеБУ КАК ПодразделениеБУ,
		|	ВТ_ВходящаяСоСтратегиями.ПолучательВПлПор КАК ПолучательВПлПор,
		|	ВТ_ВходящаяСоСтратегиями.РасчетныйСчет КАК РасчетныйСчет,
		|	ВТ_ВходящаяСоСтратегиями.НомерОчереди КАК НомерОчереди,
		|	ВТ_ВходящаяСоСтратегиями.РКОПоШаблону КАК РКОПоШаблону,
		|	ВТ_ВходящаяСоСтратегиями.Участник КАК Участник,
		|	ВТ_ВходящаяСоСтратегиями.ПС КАК ПС,
		|	ВТ_ВходящаяСоСтратегиями.Схема КАК Схема,
		|	ВТ_ВходящаяСоСтратегиями.ТипЛицевогоСчета КАК ТипЛицевогоСчета,
		|	ВТ_ВходящаяСоСтратегиями.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
		|	ВТ_ВходящаяСоСтратегиями.ПереводНаСчет КАК ПереводНаСчет,
		|	ВТ_ВходящаяСоСтратегиями.НомерСчетаПриемник КАК НомерСчетаПриемник,
		|	ВТ_ВходящаяСоСтратегиями.Получатель КАК Получатель,
		|	ВТ_ВходящаяСоСтратегиями.Периодичность КАК Периодичность,
		|	ВТ_ВходящаяСоСтратегиями.Сумма КАК Сумма,
		|	ВТ_ВходящаяСоСтратегиями.СуммаКомпенсации КАК СуммаКомпенсации,
		|	ВТ_ВходящаяСоСтратегиями.СуммаВосполнения КАК СуммаВосполнения,
		|	ВТ_ВходящаяСоСтратегиями.СуммаВозмещения КАК СуммаВозмещения,
		|	ВТ_ВходящаяСоСтратегиями.НДФЛ КАК НДФЛ,
		|	ВТ_ВходящаяСоСтратегиями.НачалоПериода КАК НачалоПериода,
		|	ВТ_ВходящаяСоСтратегиями.КонецПериода КАК КонецПериода,
		|	ВТ_ВходящаяСоСтратегиями.ДокументРегистрации КАК ДокументРегистрации,
		|	ВТ_ВходящаяСоСтратегиями.ДоверенноеЛицо КАК ДоверенноеЛицо,
		|	ВТ_ВходящаяСоСтратегиями.ТипСуммы КАК ТипСуммы,
		|	ВТ_ВходящаяСоСтратегиями.ТипПенсии КАК ТипПенсии,
		|	ВТ_ВходящаяСоСтратегиями.ПричинаЗакрытия КАК ПричинаЗакрытия,
		|	ВТ_ВходящаяСоСтратегиями.ЕстьИсполнительныйЛист КАК ЕстьИсполнительныйЛист,
		|	ВТ_ВходящаяСоСтратегиями.ПолучательТЧ КАК ПолучательТЧ,
		|	ВТ_ВходящаяСоСтратегиями.РасчетныйСчетТЧ КАК РасчетныйСчетТЧ,
		|	ВТ_ВходящаяСоСтратегиями.ЭтоРеестр КАК ЭтоРеестр,
		|	ВТ_ВходящаяСоСтратегиями.ИнвестиционнаяСтратегия КАК ИнвестиционнаяСтратегия,
		|	ВЫБОР
		|		КОГДА &УчетРСпоИнвестСтратегии
		|			ТОГДА ЕСТЬNULL(пдс_СоответствияИнвестиционныхСтратегийРасчетномуСчету.РасчетныйСчет, &БанковскийСчетПоУмолчанию)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
		|	КОНЕЦ КАК РасчетныйСчетОрганизации
		|ИЗ
		|	ВТ_ВходящаяСоСтратегиями КАК ВТ_ВходящаяСоСтратегиями
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.пдс_СоответствияИнвестиционныхСтратегийРасчетномуСчету КАК пдс_СоответствияИнвестиционныхСтратегийРасчетномуСчету
		|		ПО ВТ_ВходящаяСоСтратегиями.ИнвестиционнаяСтратегия = пдс_СоответствияИнвестиционныхСтратегийРасчетномуСчету.ИнвестиционнаяСтратегия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ВходящаяСоСтратегиями"; 
		Запрос.УстановитьПараметр("ТЗВходящая", ТЗДокумента); 
		Запрос.УстановитьПараметр("ПустаяИнвестиционнаяСтратегия", Справочники.пдс_ИнвестиционныеСтратегииПДС.ПустаяСсылка()); 
		Запрос.УстановитьПараметр("УчетРСпоИнвестСтратегии", ПенсионныеПравила.УчетБанковскихСчетовПоИнвестиционнымСтратегиямПДС);
		Запрос.УстановитьПараметр("БанковскийСчетПоУмолчанию", ПолучитьСчетОрганизации(Объект.Организация));


		РезультатЗапроса = Запрос.Выполнить();
		ТЗДокумента = РезультатЗапроса.Выгрузить();
	Конецесли;	
КонецПроцедуры

&НаСервере
&Перед("СформироватьТЗДокумента")
Процедура ХМСформироватьТЗДокумента(ТЗДокумента)
//++https://redmine.npf.com/issues/4549
	ТЗДокумента.Колонки.Добавить("хм_Удержание",    Новый ОписаниеТипов("Булево"));
	ТЗДокумента.Колонки.Добавить("хм_СуммаУдержания",    Новый ОписаниеТипов("Число"));
//--https://redmine.npf.com/issues/4549
// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670 !!!!!!!!!!!
	СписокТиповПСВладелец = Новый Массив; 
    СписокТиповПСВладелец.Добавить(Тип("СправочникСсылка.уп_ПенсионныеДоговоры")); 
    СписокТиповПСВладелец.Добавить(Тип("СправочникСсылка.пдс_ДоговорыПДС"));
	ТЗДокумента.Колонки.Добавить("ПСВладелец",    Новый ОписаниеТипов(СписокТиповПСВладелец));
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЗаписатьДокументы")
Процедура ХМЗаписатьДокументы()
	#Вставка
		// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
//	Попытка
//		НачатьТранзакцию();
//		Блокировка = Новый БлокировкаДанных;
//		ЭлементБлокировки = Блокировка.Добавить();
//		ЭлементБлокировки.Область = "Документ.уп_ВыплатныеРеестры";
//		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
//		Блокировка.Заблокировать();
	#КонецВставки
	Если объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий 
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияНПО
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратПенсииНПО Тогда
		//сортировка по признакам   
		#Вставка
		//+ХМНПФ 14.11.2023 ХлопцевБА//группировка счетов выплачиваемых на почту// №3706  
		тзГруппировкаПоДнямВыплаты = ТЗ.Скопировать();
		тзГруппировкаПоДнямВыплаты.Свернуть("ДоставочныйДень",);
		тзГруппировкаПоДнямВыплаты.Сортировать("ДоставочныйДень");

		тзИсходная = ТЗ.Скопировать();

		Для Каждого ДеньГруппировки Из тзГруппировкаПоДнямВыплаты Цикл 

			ТЗ.Очистить();
			КлючПоиска = Новый Структура();
			КлючПоиска.Вставить("ДоставочныйДень",ДеньГруппировки.ДоставочныйДень);  
			нСтрока = тзИсходная.НайтиСтроки(КлючПоиска); 
			Для Каждого нСтр Из нСтрока Цикл 
				нСтрока =ТЗ.Добавить();
				ЗаполнитьЗначенияСвойств(нСтрока,нСтр);
			КонецЦикла;  

			//-ХМНПФ 14.11.2023 ХлопцевБА//группировка счетов выплачиваемых на почту// №3706
		#КонецВставки
		ПризнакиСортировки = "ФормаВыплаты";
		
		ПризнакиСортировки = ПризнакиСортировки + ",РасчетныйСчетОрганизации";
			ПризнакиСортировки = ПризнакиСортировки + ",ЭтоРеестр";
			ПризнакиСортировки = ПризнакиСортировки + ",ДоговорЗаключен";
			ПризнакиСортировки = ПризнакиСортировки + ",ПодразделениеБУ";
			ПризнакиСортировки = ПризнакиСортировки + ",ПолучательВПлПор";
			ПризнакиСортировки = ПризнакиСортировки + ",РасчетныйСчет";
			ПризнакиСортировки = ПризнакиСортировки + ",НомерОчереди";
			ПризнакиСортировки = ПризнакиСортировки + ",РКОПоШаблону";
			ПризнакиСортировки = ПризнакиСортировки + ",Участник"; 
			ТЗ.Сортировать(ПризнакиСортировки);
		
			ТФормаВыплаты = ""; ТПодразделение=""; ТПолучатель=""; ТОчередностьВыплаты=""; ТДоговорЗаключен=""; ВыплатнойРеестр=""; ТУчастник = ""; ТРасчетныйСчет=""; ТРКОПоШаблону = "";
		ТЭтоРеестр=""; ТРасчетныйСчетОрганизации = "";
		
			ЕстьИЛ = Ложь;
			СчетчикСтрокВДокументе = 0;
			для Н=0 по ТЗ.Количество()-1 цикл
				ТекСтрока = ТЗ.Получить(Н);
				СоответствуетДокументу=Истина;
				если ТФормаВыплаты <> ТекСтрока.ФормаВыплаты тогда
					СоответствуетДокументу=Ложь;
				конецесли; 
			
			если ТРасчетныйСчетОрганизации<>ТекСтрока.РасчетныйСчетОрганизации тогда
				СоответствуетДокументу=Ложь;
			конецесли;			
				если ТЭтоРеестр <> ТекСтрока.ЭтоРеестр Тогда
					СоответствуетДокументу=Ложь;
				конецесли;
				если ТПодразделение <> ТекСтрока.ПодразделениеБУ тогда
					СоответствуетДокументу=Ложь;
				конецесли;
				если ТПолучатель <> ТекСтрока.ПолучательВПлПор тогда
					СоответствуетДокументу=Ложь;
				конецесли;
				если ТРасчетныйСчет <> ТекСтрока.РасчетныйСчет тогда
					СоответствуетДокументу=Ложь;
				конецесли;
				Если НЕ ТекСтрока.ЭтоРеестр Тогда
					если ТОчередностьВыплаты <> ТекСтрока.НомерОчереди тогда
						СоответствуетДокументу=Ложь;
					конецесли;
				КонецЕсли;
				если (ТДоговорЗаключен <> ТекСтрока.ДоговорЗаключен)
					или ((Не ТекСтрока.ДоговорЗаключен) и (ТУчастник<>ТекСтрока.Участник)) Тогда
					СоответствуетДокументу=Ложь;
				конецесли;
				если ТРКОПоШаблону <> ТекСтрока.РКОПоШаблону тогда
					СоответствуетДокументу=Ложь;
				конецесли;
				#Вставка
				//+ХМНПФ 20.01.2022 ХлопцевБА// Ошибка:Превышение кол-ва строк в таб.чести // №2787
				Если Объект.КоличествоВПачке > 0 Тогда
					Если Н > 0 Тогда
						Если ВыплатнойРеестр.СписокПенсионеров.Количество() >= Объект.КоличествоВПачке Тогда
							СоответствуетДокументу=Ложь;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				//-ХМНПФ 20.01.2022 ХлопцевБА// Ошибка:Превышение кл-ва строк в таб.чести // №2787
				#КонецВставки
							
				//с одной стороны удобно здесь всех, кто через кассу в один документ, но с другой - если
				//кому-то заплатить не удастся, как документ проводить?
			
				если (Н=0) или не СоответствуетДокументу тогда
					если Н>0 тогда
						Если ЕстьИЛ Тогда
							ПересчитатьДокументПРСУчетомИЛ(ВыплатнойРеестр);
						КонецЕсли;
					
						Если Объект.ФормироватьОбщиеРеестры Тогда
							ВыплатнойРеестр.Реестр = ТЭтоРеестр;
						КонецЕсли;	
					
						РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр, ТРКОпоШаблону);
						#Вставка
						// +ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
						хм_РегистрацияСобытийПривелигирован.ОбновитьНумерацию();
						уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
						// -ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
						#КонецВставки
						
						ВыплатнойРеестр.Записать();
						НоваяВыплата = Объект.НовыеНачисления.Добавить();
						НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
						НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
						НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
						НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
					конецесли;
				
					ТПодразделение = ТекСтрока.ПодразделениеБУ;
					ТПолучатель = ТекСтрока.ПолучательВПлПор;
					ТОчередностьВыплаты = ТекСтрока.НомерОчереди;
					ТДоговорЗаключен = ТекСтрока.ДоговорЗаключен;
					ТФормаВыплаты = ТекСтрока.ФормаВыплаты;
					ТРасчетныйСчет = ТекСтрока.РасчетныйСчет;
					ТРКОпоШаблону = ТекСтрока.РКОПоШаблону;
					ТЭтоРеестр = ТекСтрока.ЭтоРеестр;
				ТРасчетныйСчетОрганизации = ТекСтрока.РасчетныйСчетОрганизации;
					ЕстьИЛ = Ложь;
#Вставка
					// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
					Если ТипЗнч(ВыплатнойРеестр) = Тип("ДокументОбъект.уп_ВыплатныеРеестры") Тогда
						НомерПоследнегоДокумента = СокрЛП(ВыплатнойРеестр.Номер);
					Иначе
						НомерПоследнегоДокумента = Неопределено;
					КонецЕсли;
#КонецВставки
				
					ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
					ВыплатнойРеестр.Организация = Объект.Организация;
					ВыплатнойРеестр.ТипВыплаты = объект.ТипВыплаты;
					ВыплатнойРеестр.Модуль = Объект.Модуль;
					ВыплатнойРеестр.ОтражатьВБухгалтерскомУчете = Объект.ОтражатьВБухгалтерскомУчете;
					ВыплатнойРеестр.уп_ВидДеятельности = Объект.уп_ВидДеятельности;
					ВыплатнойРеестр.Ответственный = Объект.Ответственный;
				
#Вставка
					// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
					ВыплатнойРеестр.ДополнительныеСвойства.Вставить("НомерПоследнегоДокумента",НомерПоследнегоДокумента);
#КонецВставки
					если Объект.ПереключательДатыФормированияДокументов = 0 тогда
						ЧислоЗаписи = РегистрыСведений.уп_ДатыОчередей.Получить(Новый Структура("НомерОчереди",ТОчередностьВыплаты)).ДатаВМесяце;
						если НЕ ЗначениеЗаполнено(ЧислоЗаписи) тогда
							ЧислоЗаписи = 1;
						конецесли;				
						МесяцЗаписи = Месяц(Объект.ДатаФормированияДокументов);
						ГодЗаписи = Год(Объект.ДатаФормированияДокументов);
						ДатаЗаписи = Дата(ГодЗаписи, МесяцЗаписи, ЧислоЗаписи); 
						ВыплатнойРеестр.Дата = КонецДня(ДатаЗаписи);
						ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(ДатаЗаписи);
					иначе  
						#Вставка
						//+ХМНПФ 13.11.2023 ХлопцевБА//группировка счетов выплачиваемых на почту// №3706
						Если ТекСтрока.ДоставочныйДень > 0 Тогда  
							Если День(Объект.ДатаФормированияДокументов) > 20 Тогда
								ВыплатнойРеестр.Дата = ДобавитьМесяц(Дата(Год(Объект.ДатаФормированияДокументов),Месяц(Объект.ДатаФормированияДокументов),ТекСтрока.ДоставочныйДень),1);  
								ВыплатнойРеестр.ДатаФормированияДокумента =  ДобавитьМесяц(Дата(Год(Объект.ДатаФормированияДокументов),Месяц(Объект.ДатаФормированияДокументов),ТекСтрока.ДоставочныйДень),1);  
							Иначе 
								ВыплатнойРеестр.Дата = Дата(Год(Объект.ДатаФормированияДокументов),Месяц(Объект.ДатаФормированияДокументов),ТекСтрока.ДоставочныйДень);  
								ВыплатнойРеестр.ДатаФормированияДокумента =  Дата(Год(Объект.ДатаФормированияДокументов),Месяц(Объект.ДатаФормированияДокументов),ТекСтрока.ДоставочныйДень);  
							КонецЕсли;
							ВыплатнойРеестр.Комментарий = "Дост. день: " + Строка(ТекСтрока.ДоставочныйДень);
						Иначе  
							//+ХМНПФ 13.11.2023 ХлопцевБА//группировка счетов выплачиваемых на почту// №3706 
						#КонецВставки
						ВыплатнойРеестр.Дата = КонецДня(Объект.ДатаФормированияДокументов);
						ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(Объект.ДатаФормированияДокументов); 
						#Вставка
							ВыплатнойРеестр.Комментарий = "Дост. день не указан";
						КонецЕсли; 
						#КонецВставки
					конецесли;
				
					//уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
					ВыплатнойРеестр.ПодразделениеОрганизации = ТПодразделение;
					ВыплатнойРеестр.Получатель = ТПолучатель;
					Выплатнойреестр.РасчетныйСчет = ТРасчетныйСчет;
					ВыплатнойРеестр.НомерОчереди = ТОчередностьВыплаты;
					ВыплатнойРеестр.ФормаВыплаты = ТФормаВыплаты;
				Если НЕ ВыплатнойРеестр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Касса Тогда
					ВыплатнойРеестр.РасчетныйСчетОрганизации = ТРасчетныйСчетОрганизации;
				КонецЕсли;
					СчетчикСтрокВДокументе = 0;
				
					СоответствиеДокументу = Новый Соответствие();
					СоответствиеДокументу.Вставить("Получатель",ТекСтрока.ПолучательВПлПор);
					СоответствиеДокументу.Вставить("ОчередностьВыплаты",ТекСтрока.НомерОчереди);
				конецесли;
			
				Если объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий Тогда
					//это новый участник, проверяем наличие исполнительных листов
					Если ТекСтрока.ЕстьИсполнительныйЛист>0 Тогда
						ЕстьИЛ = Истина;
					КонецЕсли;	
				КонецЕсли;	
			
				//запись строки документа
				СтрокаДокумента = ВыплатнойРеестр.СписокПенсионеров.Добавить();
				СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
				СтрокаДокумента.Участник = ТекСтрока.Участник;
				СтрокаДокумента.ДоверенноеЛицо = ТекСтрока.ДоверенноеЛицо;
				СтрокаДокумента.НомерСчета = ТекСтрока.ПС;
				СтрокаДокумента.Схема = ТекСтрока.Схема;
				СтрокаДокумента.ТипПенсии = ТекСтрока.ТипПенсии;
#Вставка
				СтрокаДокумента.ПенсионныйДоговор = ТекСтрока.ПСВладелец;
#КонецВставки
#Удаление
				СтрокаДокумента.ПенсионныйДоговор = ТекСтрока.ПС.Владелец;
#КонецУдаления
				СтрокаДокумента.НомерЛицевогоСчета = ТекСтрока.НомерЛицевогоСчета;
				СтрокаДокумента.Сумма = ТекСтрока.Сумма;
				//Если ТекСтрока.НДФЛ>0 Тогда
			СтрокаДокумента.НДФЛ = ТекСтрока.НДФЛ;
				//КонецЕсли;
				СтрокаДокумента.Выплата = ТекСтрока.Сумма-ТекСтрока.НДФЛ;
				СтрокаДокумента.НачалоПериодаНачисления = ТекСтрока.НачалоПериода;
				СтрокаДокумента.КонецПериодаНачисления =  ТекСтрока.КонецПериода;
				#Вставка
				// ХМНПФ+ 13.12.2021 ХлопцевБА // новый  хм_Удержание // №2787
				Если объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий  Тогда
					СтрокаДокумента.хм_Удержание = ТекСтрока.хм_Удержание;
					// ХМНПФ 19.03.2024 ПлыгунЮВ +
					СтрокаДокумента.хм_СуммаУдержания = ТекСтрока.хм_СуммаУдержания;
					СтрокаДокумента.Выплата = ТекСтрока.Сумма-ТекСтрока.НДФЛ - ТекСтрока.хм_СуммаУдержания;
					// ХМНПФ 19.03.2024 ПлыгунЮВ -
				КонецЕсли;
				// ХМНПФ+ 13.12.2021 ХлопцевБА // новый  хм_Удержание // №2787
				#КонецВставки
				ТУчастник = ТекСтрока.Участник; 
			
				Если Объект.ФормироватьОбщиеРеестры Тогда
					СтрокаДокумента.Получатель = ТекСтрока.ПолучательТЧ;
					СтрокаДокумента.РасчетныйСчет = ТекСтрока.РасчетныйСчетТЧ;
				КонецЕсли;	
			
			
				если Н = ТЗ.Количество()-1 тогда
					Если ЕстьИЛ Тогда
						ПересчитатьДокументПРСУчетомИЛ(ВыплатнойРеестр);
					КонецЕсли;
				
					Если Объект.ФормироватьОбщиеРеестры Тогда
						ВыплатнойРеестр.Реестр = ТЭтоРеестр;
					КонецЕсли;
				
					РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр, ТРКОпоШаблону);				
					#Вставка
					// +ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
					хм_РегистрацияСобытийПривелигирован.ОбновитьНумерацию();
					уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
					// -ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
					#КонецВставки
					
					ВыплатнойРеестр.Записать();
					НоваяВыплата = Объект.НовыеНачисления.Добавить();
					НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
					НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
					НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
					НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
				конецесли;
			конеццикла;	  
		#Вставка
		КонецЦикла; // По дням выплаты  
		#КонецВставки
	ИначеЕсли объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВзносов Тогда
		//сортировка по признакам
		ПризнакиСортировки = "РасчетныйСчетОрганизации";
		ПризнакиСортировки = ПризнакиСортировки+",ПодразделениеБУ,Участник";
		ТЗ.Сортировать(ПризнакиСортировки);
		
		ТПодразделение=""; ТУчастник=""; ТНачалоПериода=""; ВыплатнойРеестр="";
		ТРасчетныйСчетОрганизации = "";
		
		СчетчикСтрокВДокументе = 0;
		для Н=0 по ТЗ.Количество()-1 цикл
			ТекСтрока = ТЗ.Получить(Н);
			СоответствуетДокументу=Истина;
			
			если ТРасчетныйСчетОрганизации <> ТекСтрока.РасчетныйСчетОрганизации тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТПодразделение <> ТекСтрока.ПодразделениеБУ тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТУчастник <> ТекСтрока.Участник тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТНачалоПериода <> ТекСтрока.НачалоПериода тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			
			если (Н=0) или не СоответствуетДокументу тогда
				если Н>0 тогда
					РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
					#Вставка
					// +ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
					хм_РегистрацияСобытийПривелигирован.ОбновитьНумерацию();
					уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
					// -ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200 
					#КонецВставки
					ВыплатнойРеестр.Записать();
					НоваяВыплата = Объект.НовыеНачисления.Добавить();
					НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
					НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
					НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
					НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
				конецесли;
				
				ТПодразделение = ТекСтрока.ПодразделениеБУ;
				ТУчастник = ТекСтрока.Участник;
				ТНачалоПериода = ТекСтрока.НачалоПериода;
				ТРасчетныйСчетОрганизации = ТекСтрока.РасчетныйСчетОрганизации;
				
				ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
				ВыплатнойРеестр.Организация = объект.Организация;
				ВыплатнойРеестр.Дата = КонецДня(ТНачалоПериода);
				ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(ТНачалоПериода);
				ВыплатнойРеестр.ТипВыплаты = объект.ТипВыплаты;
				ВыплатнойРеестр.Модуль = Объект.Модуль;
				ВыплатнойРеестр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет;
				ВыплатнойРеестр.РасчетныйСчетОрганизации = ТРасчетныйСчетОрганизации;
				ВыплатнойРеестр.Получатель = ТУчастник;
				ВыплатнойРеестр.РасчетныйСчет = ТекСтрока.РасчетныйСчет;
				ВыплатнойРеестр.ОтражатьВБухгалтерскомУчете = Объект.ОтражатьВБухгалтерскомУчете;
				ВыплатнойРеестр.уп_ВидДеятельности = Объект.уп_ВидДеятельности;
				ВыплатнойРеестр.ПодразделениеОрганизации = ТПодразделение;
				ВыплатнойРеестр.Ответственный = Объект.Ответственный;
				СчетчикСтрокВДокументе = 0;
				
				СоответствиеДокументу = Новый Соответствие();
				СоответствиеДокументу.Вставить("Участник",ТекСтрока.Участник);
				СоответствиеДокументу.Вставить("НачалоПериода",ТекСтрока.НачалоПериода);
			конецесли;	
			
			//запись строки документа
			СтрокаДокумента = ВыплатнойРеестр.СписокПенсионеров.Добавить();
			СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
			СтрокаДокумента.НомерСчета = ТекСтрока.ПС;
			СтрокаДокумента.Схема = ТекСтрока.Схема;
			СтрокаДокумента.ПенсионныйДоговор = ТекСтрока.ПС.Владелец;
			СтрокаДокумента.Участник = ТекСтрока.Участник;
			СтрокаДокумента.Сумма = ТекСтрока.Сумма;
			СтрокаДокумента.ДокументРегистрации = ТекСтрока.ДокументРегистрации;
			//СтрокаДокумента.НачалоПериодаНачисления = ТекСтрока.НачалоПериода;
			//СтрокаДокумента.КонецПериодаНачисления =  ТекСтрока.КонецПериода;
			СтрокаДокумента.Выплата = ТекСтрока.Сумма;
			если Н = ТЗ.Количество()-1 тогда
				РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
				#Вставка
				// +ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
				хм_РегистрацияСобытийПривелигирован.ОбновитьНумерацию();
				уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
				// -ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
				#КонецВставки
				ВыплатнойРеестр.Записать();
				НоваяВыплата = Объект.НовыеНачисления.Добавить();
				НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
				НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
				НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
				НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
			конецесли;
		конеццикла;	
	ИначеЕсли объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатНаследникамНПО
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатРасторженцамНПО
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_НПО
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиНПО
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежРасторжениеНПО
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам Тогда   //расторженцы и наследники
		//сортировка по признакам
		ПризнакиСортировки = "ПереводНаСчет";
		ПризнакиСортировки = ПризнакиСортировки + ",ФормаВыплаты";
		ПризнакиСортировки = ПризнакиСортировки + ",РасчетныйСчетОрганизации";
		ПризнакиСортировки = ПризнакиСортировки + ",ЭтоРеестр";
		ПризнакиСортировки = ПризнакиСортировки + ",ДоговорЗаключен";
		ПризнакиСортировки = ПризнакиСортировки + ",ПодразделениеБУ,ПолучательВПлПор,РасчетныйСчет,РКОпоШаблону,Участник";   
		ТЗ.Сортировать(ПризнакиСортировки);
		
		ТФормаВыплаты=""; ТПодразделение=""; ТПолучатель=""; ТНачалоПериода=""; ТДоговорЗаключен=""; ТУчастник = ""; ВыплатнойРеестр=""; ТРасчетныйСчет = ""; ТРКОпоШаблону = "";
		ТЭтоРеестр=""; ТРасчетныйСчетОрганизации = "";
		
		ЕстьИЛ = Ложь;
		ТПереводНаСчет = Ложь;
		СчетчикСтрокВДокументе = 0;
		для Н=0 по ТЗ.Количество()-1 цикл
			ТекСтрока = ТЗ.Получить(Н);
			СоответствуетДокументу=Истина;
			если ТПереводНаСчет<>ТекСтрока.ПереводНаСчет Тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТРасчетныйСчетОрганизации <> ТекСтрока.РасчетныйСчетОрганизации тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТФормаВыплаты <> ТекСтрока.ФормаВыплаты тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			
			если ТЭтоРеестр <> ТекСтрока.ЭтоРеестр Тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			
			//если ТПолучатель <> ТекСтрока.Получатель тогда
			если ТПолучатель <> ТекСтрока.ПолучательВПлПор тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТРасчетныйСчет <> ТекСтрока.РасчетныйСчет тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТПодразделение <> ТекСтрока.ПодразделениеБУ тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТНачалоПериода <> КонецДня(ТекСтрока.НачалоПериода) тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если (ТДоговорЗаключен <> ТекСтрока.ДоговорЗаключен)
				или (Не ТекСтрока.ДоговорЗаключен)  Тогда
				Если (ТУчастник<>ТекСтрока.Участник) Тогда
					Если НЕ  ТПереводНаСчет Тогда
						СоответствуетДокументу=Ложь;
					КонецЕсли;
				КонецЕсли;
			конецесли;
			если ТРКОпоШаблону <> ТекСтрока.РКОпоШаблону тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			
			если (Н=0) или не СоответствуетДокументу тогда
				если Н>0 тогда
					Если ЕстьИЛ Тогда
						ПересчитатьДокументПРСУчетомИЛ(ВыплатнойРеестр);
					КонецЕсли;
					
					Если Объект.ФормироватьОбщиеРеестры Тогда
						ВыплатнойРеестр.Реестр = ТЭтоРеестр;
					КонецЕсли;
					
					РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр, ТРКОпоШаблону);					
					#Вставка
					// +ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
					хм_РегистрацияСобытийПривелигирован.ОбновитьНумерацию();
					уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
					// -ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
					#КонецВставки
					ВыплатнойРеестр.Записать();
					НоваяВыплата = Объект.НовыеНачисления.Добавить();
					НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
					НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
					НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
					НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
				конецесли;
				
				ТПодразделение = ТекСтрока.ПодразделениеБУ;
				//ТПолучатель = ТекСтрока.Получатель;
				ТПолучатель = ТекСтрока.ПолучательВПлПор;
				ТРасчетныйСчет = ТекСтрока.РасчетныйСчет;
				ТНачалоПериода = КонецДня(ТекСтрока.НачалоПериода);
				ТДоговорЗаключен = ТекСтрока.ДоговорЗаключен;
				ТУчастник = ТекСтрока.Участник;
				ТФормаВыплаты = ТекСтрока.ФормаВыплаты;
				ТПереводНаСчет = ТекСтрока.ПереводНаСчет;
				ТРКОпоШаблону = Текстрока.РКОпоШаблону; 
				ТЭтоРеестр = ТекСтрока.ЭтоРеестр;
				ТРасчетныйСчетОрганизации = ТекСтрока.РасчетныйСчетОрганизации;
				ЕстьИЛ = Ложь;
				
				ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
				ВыплатнойРеестр.Организация = объект.Организация;
				ВыплатнойРеестр.Дата = КонецДня(ТНачалоПериода);
				ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(ТНачалоПериода);
				ВыплатнойРеестр.ТипВыплаты = объект.ТипВыплаты;
				ВыплатнойРеестр.Модуль = Объект.Модуль;
				ВыплатнойРеестр.ПереводСредств =  ТПереводНаСчет;
				Если ВыплатнойРеестр.ПереводСредств Тогда
					ВыплатнойРеестр.Оплачено = Истина;
				КонецЕсли;	
				Если НЕ ТПереводНаСчет Тогда
					ВыплатнойРеестр.Получатель = ТПолучатель;
					ВыплатнойРеестр.РасчетныйСчет = ТРасчетныйСчет;
				КонецЕсли;
				ВыплатнойРеестр.ПодразделениеОрганизации = ТПодразделение;
				ВыплатнойРеестр.ФормаВыплаты = ТФормаВыплаты;
				Если НЕ ВыплатнойРеестр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Касса Тогда
					ВыплатнойРеестр.РасчетныйСчетОрганизации = ТРасчетныйСчетОрганизации;
				КонецЕсли;
				ВыплатнойРеестр.ОтражатьВБухгалтерскомУчете = Объект.ОтражатьВБухгалтерскомУчете;
				ВыплатнойРеестр.уп_ВидДеятельности = Объект.уп_ВидДеятельности;
				ВыплатнойРеестр.Ответственный = Объект.Ответственный;
				СчетчикСтрокВДокументе = 0;
				
				СоответствиеДокументу = Новый Соответствие();
				СоответствиеДокументу.Вставить("Получатель",ТекСтрока.ПолучательВПлПор);
				СоответствиеДокументу.Вставить("НачалоПериода",ТекСтрока.НачалоПериода);
			конецесли;	
			
			Если объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам Тогда
				//роверяем наличие исполнительных листов
				Если ТекСтрока.ЕстьИсполнительныйЛист>0 Тогда
					ЕстьИЛ = Истина;
				КонецЕсли;	
			КонецЕсли;	
			
			//запись строки документа
			СтрокаДокумента = ВыплатнойРеестр.СписокПенсионеров.Добавить();
			СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
			СтрокаДокумента.Участник = ТекСтрока.Участник;
			СтрокаДокумента.ДоверенноеЛицо = ТекСтрока.ДоверенноеЛицо;
			СтрокаДокумента.НомерСчета = ТекСтрока.ПС;
			СтрокаДокумента.Схема = ТекСтрока.Схема;
			СтрокаДокумента.ПенсионныйДоговор = ТекСтрока.ПС.Владелец;
			СтрокаДокумента.НомерЛицевогоСчета = ТекСтрока.НомерЛицевогоСчета;
			СтрокаДокумента.НомерСчетаПриемника = ТекСтрока.НомерСчетаПриемник;
			СтрокаДокумента.Сумма = ТекСтрока.Сумма;
			Если ТекСтрока.НДФЛ>0 Тогда
				СтрокаДокумента.НДФЛ = ТекСтрока.НДФЛ;
			КонецЕсли;
			СтрокаДокумента.Выплата = ТекСтрока.Сумма-?(ТекСтрока.НДФЛ>0, ТекСтрока.НДФЛ, 0);
			//СтрокаДокумента.НачалоПериодаНачисления = ТекСтрока.НачалоПериода;
			//СтрокаДокумента.КонецПериодаНачисления =  ТекСтрока.КонецПериода;
			Если Объект.ФормироватьОбщиеРеестры Тогда
				СтрокаДокумента.Получатель = ТекСтрока.ПолучательТЧ;
				СтрокаДокумента.РасчетныйСчет = ТекСтрока.РасчетныйСчетТЧ;
			КонецЕсли;	
			
			если Н = ТЗ.Количество()-1 тогда
				Если ЕстьИЛ Тогда
					ПересчитатьДокументПРСУчетомИЛ(ВыплатнойРеестр);
				КонецЕсли;
				
				Если Объект.ФормироватьОбщиеРеестры Тогда
					ВыплатнойРеестр.Реестр = ТЭтоРеестр;
				КонецЕсли;
				
				РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр, ТРКОпоШаблону);				
				#Вставка
				// +ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
				хм_РегистрацияСобытийПривелигирован.ОбновитьНумерацию();
				уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
				// -ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
				#КонецВставки
				ВыплатнойРеестр.Записать();
				НоваяВыплата = Объект.НовыеНачисления.Добавить();
				НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
				НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
				НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
				НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
			конецесли;
		конеццикла;
	ИначеЕсли объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойПФ
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.РазделениеСНИЛС Тогда
		КолЗаписейВДокументе = 50000;
		СчетчикСтрокВДокументе = 0;
		
		//сортировка по признакам
		ПризнакиСортировки = "ПричинаЗакрытия";
		ПризнакиСортировки = ПризнакиСортировки + ",ПодразделениеБУ,Участник,ПС";
		ТЗ.Сортировать(ПризнакиСортировки);
		
		ТПричинаЗакрытия = ""; ТПодразделение=""; ТУчастник=""; ТНачалоПериода=""; ВыплатнойРеестр=""; ТДоговорОПС = "";
		СчетчикСтрокВДокументе = 0;
		для Н=0 по ТЗ.Количество()-1 цикл
			ТекСтрока = ТЗ.Получить(Н);
			СоответствуетДокументу=Истина;
			СоответствуетСтроке = Истина;
			если ТПричинаЗакрытия <> ТекСтрока.ПричинаЗакрытия тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТПодразделение <> ТекСтрока.ПодразделениеБУ тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТУчастник <> ТекСтрока.Участник тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			//если ТНачалоПериода <> ТекСтрока.НачалоПериода тогда
			//	СоответствуетДокументу=Ложь;
			//конецесли;
			если СчетчикСтрокВДокументе >= КолЗаписейВДокументе  И ТДоговорОПС<>ТекСтрока.ПС тогда
				СоответствуетДокументу = Ложь;
			конецЕсли;	
			
			если (Н=0) или не СоответствуетДокументу тогда
				если Н>0 тогда
					//сворачиваем расшифровки и записываем таб часть договоры опс
					ТабДоговоров = ВыплатнойРеестр.РасшифровкаСуммы.Выгрузить();
					ТабДоговоров.Свернуть("ДоговорОПС","Сумма");
					Для Каждого стр из ТабДоговоров Цикл
						СтрокаДокумента = ВыплатнойРеестр.ДоговорыОПС.Добавить();
						СтрокаДокумента.ДоговорОПС = стр.ДоговорОПС;
						СтрокаДокумента.Участник = стр.ДоговорОПС.Участник;
						СтрокаДокумента.Сумма = стр.Сумма;
						#Вставка
						// +ХМНПФ 10.05.2018 КлименкоМИ // ЗаписатьДокументы() // №1568
						СтрокаДокумента.Выплата = стр.Сумма;
						// -ХМНПФ 10.05.2018 КлименкоМИ // ЗаписатьДокументы() // №1568 
						#КонецВставки
					КонецЦикла;
					РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
					#Вставка
					// +ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
					хм_РегистрацияСобытийПривелигирован.ОбновитьНумерацию();
					уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
					// -ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
					#КонецВставки
					ВыплатнойРеестр.Записать();
					НоваяВыплата = Объект.НовыеНачисления.Добавить();
					НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
					НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
					НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
					НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
				конецесли;
				
				ТПодразделение = ТекСтрока.ПодразделениеБУ;
				ТУчастник = ТекСтрока.Участник;
				ТНачалоПериода = ТекСтрока.НачалоПериода;
				ТПричинаЗакрытия = ТекСтрока.ПричинаЗакрытия;
				ТДоговорОПС = ТекСтрока.ПС;
				
				ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
				ВыплатнойРеестр.Организация = объект.Организация;
				ВыплатнойРеестр.Дата = КонецДня(ТНачалоПериода);
				ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(ТНачалоПериода);
				ВыплатнойРеестр.ТипВыплаты = объект.ТипВыплаты;
				ВыплатнойРеестр.Модуль = Объект.Модуль;
				ВыплатнойРеестр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет;
				//уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
				ВыплатнойРеестр.Получатель = ТУчастник;
				ВыплатнойРеестр.РасчетныйСчет = ТекСтрока.РасчетныйСчет;
				ВыплатнойРеестр.ПодразделениеОрганизации = ТПодразделение;
				ВыплатнойРеестр.ОтражатьВБухгалтерскомУчете = Объект.ОтражатьВБухгалтерскомУчете;
				ВыплатнойРеестр.уп_ВидДеятельности = Объект.уп_ВидДеятельности;
				ВыплатнойРеестр.ПричинаВыплаты = ТПричинаЗакрытия;
				//ВыплатнойРеестр.НомерОчереди = ТОчередностьВыплаты;
				ВыплатнойРеестр.Ответственный = Объект.Ответственный;
				ВыплатнойРеестр.Комментарий = ТПричинаЗакрытия;
				СчетчикСтрокВДокументе = 0;
				
				СоответствиеДокументу = Новый Соответствие();
				СоответствиеДокументу.Вставить("Участник",ТекСтрока.Участник);
				СоответствиеДокументу.Вставить("НачалоПериода",ТекСтрока.НачалоПериода);
			конецесли;	
			
			//запись строки документа
			
			//здесь должна быть запись расшифровки
			//а сама строка документа должна добавляться только при смене договора ОПС
			ТДоговорОПС = ТекСтрока.ПС;
			СтрокаДокумента = ВыплатнойРеестр.РасшифровкаСуммы.Добавить();
			СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
			СтрокаДокумента.ДоговорОПС = ТекСтрока.ПС;
			//СтрокаДокумента.Участник = ТекСтрока.ПС.Участник;
			СтрокаДокумента.ТипСуммы = ТекСтрока.ТипСуммы;
			СтрокаДокумента.Сумма = ТекСтрока.Сумма;
			СтрокаДокумента.СуммаКомпенсации = ТекСтрока.СуммаКомпенсации;
			СтрокаДокумента.СуммаВосполнения = ТекСтрока.СуммаВосполнения;
			СтрокаДокумента.СуммаВозмещения = ТекСтрока.СуммаВозмещения;
			Если объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.РазделениеСНИЛС Тогда
				СтрокаДокумента.ДокументРегистрации = ТекСтрока.ДокументРегистрации;
			КонецЕсли;	
			//СтрокаДокумента.НачалоПериодаНачисления = ТекСтрока.НачалоПериода;
			//СтрокаДокумента.КонецПериодаНачисления =  ТекСтрока.КонецПериода;
			
			если Н = ТЗ.Количество()-1 тогда
				//сворачиваем расшифровки и записываем таб часть договоры опс
				ТабДоговоров = ВыплатнойРеестр.РасшифровкаСуммы.Выгрузить();
				ТабДоговоров.Свернуть("ДоговорОПС","Сумма");
				Для Каждого стр из ТабДоговоров Цикл
					СтрокаДокумента = ВыплатнойРеестр.ДоговорыОПС.Добавить();
					СтрокаДокумента.ДоговорОПС = стр.ДоговорОПС;
					СтрокаДокумента.Участник = стр.ДоговорОПС.Участник;
					СтрокаДокумента.Сумма = стр.Сумма;
					СтрокаДокумента.Выплата = стр.Сумма;
				КонецЦикла;
				РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
				#Вставка
				// +ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
				хм_РегистрацияСобытийПривелигирован.ОбновитьНумерацию();
				уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
				// -ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
				#КонецВставки
				ВыплатнойРеестр.Записать();
				НоваяВыплата = Объект.НовыеНачисления.Добавить();
				НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
				НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
				НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
				НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
			конецесли;
		конеццикла;	
	ИначеЕсли объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатПравопреемникамОПС 
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиОПС Тогда
		//сортировка по признакам
		ПризнакиСортировки = "ФормаВыплаты";
		ПризнакиСортировки = ПризнакиСортировки + ",ЭтоРеестр";
		ПризнакиСортировки = ПризнакиСортировки + ",ДоговорЗаключен";
		ПризнакиСортировки = ПризнакиСортировки + ",ПодразделениеБУ,ПолучательВПлПор,РасчетныйСчет,Участник";   
		ТЗ.Сортировать(ПризнакиСортировки);
		
		//ТФормаВыплаты=""; ТПодразделение=""; ТПолучатель=""; ТНачалоПериода=""; ВыплатнойРеестр=""; ТРасчетныйСчет=""; ТУчастник="";
		ТФормаВыплаты=""; ТПодразделение=""; ТПолучатель=""; ТНачалоПериода=""; ВыплатнойРеестр=""; ТРасчетныйСчет=""; ТУчастник=""; ТДоговорЗаключен="";
		ТЭтоРеестр="";
		
		СчетчикСтрокВДокументе = 0;
		для Н=0 по ТЗ.Количество()-1 цикл
			ТекСтрока = ТЗ.Получить(Н);
			СоответствуетДокументу=Истина;
			
			если ТФормаВыплаты <> ТекСтрока.ФормаВыплаты тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			
			если ТЭтоРеестр <> ТекСтрока.ЭтоРеестр Тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			
			если ТПодразделение <> ТекСтрока.ПодразделениеБУ тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТПолучатель <> ТекСтрока.ПолучательВПлПор тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТРасчетныйСчет <> ТекСтрока.РасчетныйСчет тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если (ТДоговорЗаключен <> ТекСтрока.ДоговорЗаключен)
				или ((Не ТекСтрока.ДоговорЗаключен) и (ТУчастник<>ТекСтрока.Участник)) Тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			
			если (Н=0) или не СоответствуетДокументу тогда
				если Н>0 тогда
					
					Если Объект.ФормироватьОбщиеРеестры Тогда
						ВыплатнойРеестр.Реестр = ТЭтоРеестр;
					КонецЕсли;
					
					РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
					#Вставка
					// +ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
					хм_РегистрацияСобытийПривелигирован.ОбновитьНумерацию();
					уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
					// -ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
					#КонецВставки
					ВыплатнойРеестр.Записать();
					НоваяВыплата = Объект.НовыеНачисления.Добавить();
					НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
					НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
					НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
					НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
				конецесли;
				
				ТПодразделение = ТекСтрока.ПодразделениеБУ;
				//ТПолучатель = ТекСтрока.Получатель;
				ТПолучатель = ТекСтрока.ПолучательВПлПор;
				ТНачалоПериода = ТекСтрока.НачалоПериода;
				ТФормаВыплаты = ТекСтрока.ФормаВыплаты;
				ТРасчетныйСчет = ТекСтрока.РасчетныйСчет;
				ТУчастник = ТекСтрока.Участник;
				ТДоговорЗаключен = ТекСтрока.ДоговорЗаключен;
				ТЭтоРеестр = ТекСтрока.ЭтоРеестр;
				
				ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
				ВыплатнойРеестр.Организация = объект.Организация;
				ВыплатнойРеестр.Дата = КонецДня(ТНачалоПериода);
				ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(ТНачалоПериода);
				ВыплатнойРеестр.ТипВыплаты = объект.ТипВыплаты;
				ВыплатнойРеестр.Модуль = Объект.Модуль;
				//уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
				ВыплатнойРеестр.Получатель = ТПолучатель;
				ВыплатнойРеестр.ПодразделениеОрганизации = ТПодразделение;
				ВыплатнойРеестр.ОтражатьВБухгалтерскомУчете = Объект.ОтражатьВБухгалтерскомУчете;
				ВыплатнойРеестр.уп_ВидДеятельности = Объект.уп_ВидДеятельности;
				ВыплатнойРеестр.Ответственный = Объект.Ответственный;
				ВыплатнойРеестр.ФормаВыплаты = ТФормаВыплаты;
				ВыплатнойРеестр.РасчетныйСчет = ТРасчетныйСчет;
				
				СчетчикСтрокВДокументе = 0;
				
				СоответствиеДокументу = Новый Соответствие();
				СоответствиеДокументу.Вставить("Получатель",ТекСтрока.Получатель);
				СоответствиеДокументу.Вставить("НачалоПериода",ТекСтрока.НачалоПериода);
			конецесли;	
			
			//запись строки документа
			СтрокаДокумента = ВыплатнойРеестр.ДоговорыОПС.Добавить();
			СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
			СтрокаДокумента.ДоговорОПС = ТекСтрока.ПС;
			СтрокаДокумента.Участник = ТекСтрока.Участник;
			СтрокаДокумента.ДоверенноеЛицо = ТекСтрока.ДоверенноеЛицо;
			СтрокаДокумента.Сумма = ТекСтрока.Сумма;
			СтрокаДокумента.НДФЛ = ТекСтрока.НДФЛ;
			СтрокаДокумента.НомерЛицевогоСчета = ТекСтрока.НомерЛицевогоСчета;
			СтрокаДокумента.Выплата = ТекСтрока.Сумма-ТекСтрока.НДФЛ;
			#Вставка
			СтрокаДокумента.Сумма = ТекСтрока.Сумма;
			СтрокаДокумента.Выплата = ТекСтрока.Сумма-ТекСтрока.НДФЛ;
			#КонецВставки
			//СтрокаДокумента.НачалоПериодаНачисления = ТекСтрока.НачалоПериода;
			//СтрокаДокумента.КонецПериодаНачисления =  ТекСтрока.КонецПериода;
			Если Объект.ФормироватьОбщиеРеестры Тогда
				СтрокаДокумента.Получатель = ТекСтрока.ПолучательТЧ;
				СтрокаДокумента.РасчетныйСчет = ТекСтрока.РасчетныйСчетТЧ;
			КонецЕсли;	
			
			если Н = ТЗ.Количество()-1 тогда
				
				Если Объект.ФормироватьОбщиеРеестры Тогда
					ВыплатнойРеестр.Реестр = ТЭтоРеестр;
				КонецЕсли;
				
				РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
				#Вставка
				// +ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
				хм_РегистрацияСобытийПривелигирован.ОбновитьНумерацию();
				уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
				// -ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
				#КонецВставки
				ВыплатнойРеестр.Записать();
				НоваяВыплата = Объект.НовыеНачисления.Добавить();
				НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
				НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
				НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
				НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
			конецесли;
		конеццикла;
	ИначеЕсли объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратЕдиновременнойВыплатыОПС
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежЕВОПС Тогда
		//сортировка по признакам
		ПризнакиСортировки = "ФормаВыплаты";
		ПризнакиСортировки = ПризнакиСортировки + ",ЭтоРеестр";
		ПризнакиСортировки = ПризнакиСортировки + ",ДоговорЗаключен";
		ПризнакиСортировки = ПризнакиСортировки + ",ПодразделениеБУ,ПолучательВПлПор,РасчетныйСчет,Участник";
#Вставка
		//https://redmine.npf.com/issues/4560
		ПризнакиСортировки = ПризнакиСортировки + ",ПС";
#КонецВставки
		ТЗ.Сортировать(ПризнакиСортировки);
		
		ТФормаВыплаты=""; ТПодразделение=""; ТПолучатель=""; ТНачалоПериода=""; ВыплатнойРеестр=""; ТРасчетныйСчет=""; ТУчастник=""; ТДоговорЗаключен="";
		ТЭтоРеестр="";
		
		СчетчикСтрокВДокументе = 0;
		СтрокаДоговор = Неопределено;
		СуммаПоСтроке = 0;
		ЕстьИЛ = Ложь;
		для Н=0 по ТЗ.Количество()-1 цикл
			ТекСтрока = ТЗ.Получить(Н);
			СоответствуетДокументу=Истина;
			
			если ТФормаВыплаты <> ТекСтрока.ФормаВыплаты тогда
				СоответствуетДокументу=Ложь;
			конецесли; 
			
			если ТЭтоРеестр <> ТекСтрока.ЭтоРеестр Тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			
			если ТПодразделение <> ТекСтрока.ПодразделениеБУ тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТПолучатель <> ТекСтрока.ПолучательВПлПор тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТРасчетныйСчет <> ТекСтрока.РасчетныйСчет тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если (ТДоговорЗаключен <> ТекСтрока.ДоговорЗаключен)
				или ((Не ТекСтрока.ДоговорЗаключен) и (ТУчастник<>ТекСтрока.Участник)) Тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			
			если (Н=0) или не СоответствуетДокументу тогда
				если Н>0 тогда
					//ТабДоговоров = ВыплатнойРеестр.РасшифровкаСуммы.Выгрузить();
					//ТабДоговоров.Свернуть("ДоговорОПС","Сумма");
					//Для Каждого стр из ТабДоговоров Цикл
					//	СтрокаДокумента = ВыплатнойРеестр.ДоговорыОПС.Добавить();
					//	СтрокаДокумента.ДоговорОПС = стр.ДоговорОПС;
					//	СтрокаДокумента.Участник = стр.ДоговорОПС.Участник;
					//	СтрокаДокумента.Сумма = стр.Сумма;
					//	СтрокаДокумента.Выплата = стр.Сумма;
					//КонецЦикла;
					#Вставка
					// +ХМНПФ 03.08.2017 ШадринАВ // ЗаписатьДокументы() // №1117
					//						СтрокаДокумента.НомерЛицевогоСчета = ХМ_ПолучитьНомерЛС(стр.ДоговорОПС);
					// -ХМНПФ 03.08.2017 ШадринАВ // ЗаписатьДокументы() // №1117
					#КонецВставки
					СтрокаДоговор.Сумма = СуммаПоСтроке;
					СтрокаДоговор.Выплата = СуммаПоСтроке;
					
					Если ЕстьИЛ Тогда
						ПересчитатьДокументПНСУчетомИЛ(ВыплатнойРеестр);
					КонецЕсли;
					
					Если Объект.ФормироватьОбщиеРеестры Тогда
						ВыплатнойРеестр.Реестр = ТЭтоРеестр;
					КонецЕсли;
					
					РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
					#Вставка
					// +ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
					хм_РегистрацияСобытийПривелигирован.ОбновитьНумерацию();
					уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
					// -ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
					#КонецВставки
					ВыплатнойРеестр.Записать();
					НоваяВыплата = Объект.НовыеНачисления.Добавить();
					НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
					НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
					НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
					НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
				Иначе 
					СтрокаДоговор = Неопределено;
				конецесли;
				
				ТПодразделение = ТекСтрока.ПодразделениеБУ;
				ТПолучатель = ТекСтрока.ПолучательВПлПор;
				ТНачалоПериода = ТекСтрока.НачалоПериода;
				ТФормаВыплаты = ТекСтрока.ФормаВыплаты;
				ТРасчетныйСчет = ТекСтрока.РасчетныйСчет;
				ТУчастник = ТекСтрока.Участник;
				ТДоговорЗаключен = ТекСтрока.ДоговорЗаключен;
				ТЭтоРеестр = ТекСтрока.ЭтоРеестр;
				СтрокаДокумента = Неопределено;
				СуммаПоСтроке = 0;
				ЕстьИЛ = Ложь;
				
				ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
				ВыплатнойРеестр.Организация = объект.Организация;
				ВыплатнойРеестр.Дата = КонецДня(ТНачалоПериода);
				ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(ТНачалоПериода);
				ВыплатнойРеестр.ТипВыплаты = объект.ТипВыплаты;
				ВыплатнойРеестр.Модуль = Объект.Модуль;
				//уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
				ВыплатнойРеестр.Получатель = ТПолучатель;
				ВыплатнойРеестр.ПодразделениеОрганизации = ТПодразделение;
				ВыплатнойРеестр.ОтражатьВБухгалтерскомУчете = Объект.ОтражатьВБухгалтерскомУчете;
				ВыплатнойРеестр.уп_ВидДеятельности = Объект.уп_ВидДеятельности;
				ВыплатнойРеестр.Ответственный = Объект.Ответственный;
				ВыплатнойРеестр.ФормаВыплаты = ТФормаВыплаты;
				ВыплатнойРеестр.РасчетныйСчет = ТРасчетныйСчет;
				
				СчетчикСтрокВДокументе = 0;
				
				СтрокаДоговор = ВыплатнойРеестр.ДоговорыОПС.Добавить();
				СтрокаДоговор.ДоговорОПС = ТекСтрока.ПС;
				СтрокаДоговор.Участник = ТекСтрока.Участник;
				СтрокаДоговор.ДоверенноеЛицо = ТекСтрока.ДоверенноеЛицо;
				//СтрокаДокумента.Сумма = ТекСтрока.Сумма;
				СтрокаДоговор.НомерЛицевогоСчета = ТекСтрока.НомерЛицевогоСчета;
				//СтрокаДокумента.Выплата = ТекСтрока.Сумма;
				Если Объект.ФормироватьОбщиеРеестры Тогда
					СтрокаДоговор.Получатель = ТекСтрока.ПолучательТЧ;
					СтрокаДоговор.РасчетныйСчет = ТекСтрока.РасчетныйСчетТЧ;
				КонецЕсли;	
				
				
				СоответствиеДокументу = Новый Соответствие();
				СоответствиеДокументу.Вставить("Получатель",ТекСтрока.Получатель);
				СоответствиеДокументу.Вставить("НачалоПериода",ТекСтрока.НачалоПериода);
			конецесли;	
			
			//запись строки документа
			Если ТУчастник<>ТекСтрока.Участник  Тогда //добавляем строку документа
				Если СтрокаДоговор<>Неопределено Тогда  //запишем значения для предыдущей строки
					СтрокаДоговор.Сумма = СуммаПоСтроке;
					СтрокаДоговор.Выплата = СуммаПоСтроке;
					СуммаПоСтроке = 0;
				КонецЕсли;
				
				СтрокаДоговор = ВыплатнойРеестр.ДоговорыОПС.Добавить();
				СтрокаДоговор.ДоговорОПС = ТекСтрока.ПС;
				СтрокаДоговор.Участник = ТекСтрока.Участник;
				СтрокаДоговор.ДоверенноеЛицо = ТекСтрока.ДоверенноеЛицо;
				//СтрокаДокумента.Сумма = ТекСтрока.Сумма;
				СтрокаДоговор.НомерЛицевогоСчета = ТекСтрока.НомерЛицевогоСчета;
				//СтрокаДокумента.Выплата = ТекСтрока.Сумма;
				Если Объект.ФормироватьОбщиеРеестры Тогда
					СтрокаДоговор.Получатель = ТекСтрока.ПолучательТЧ;
					СтрокаДоговор.РасчетныйСчет = ТекСтрока.РасчетныйСчетТЧ;
				КонецЕсли;	
				
				ТУчастник = ТекСтрока.Участник;
			КонецЕсли;
			
			Если объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС Тогда
				//это новый участник, проверяем наличие исполнительных листов
				Если ТекСтрока.ЕстьИсполнительныйЛист>0 Тогда
					ЕстьИЛ = Истина;
				КонецЕсли;	
			КонецЕсли;	
			
			//здесь должна быть запись расшифровки
			//а сама строка документа должна добавляться только при смене договора ОПС
			ТДоговорОПС = ТекСтрока.ПС;
			СтрокаДокумента = ВыплатнойРеестр.РасшифровкаСуммы.Добавить();
			СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
			СтрокаДокумента.ДоговорОПС = ТекСтрока.ПС;
			//СтрокаДокумента.Участник = ТекСтрока.ПС.Участник;
			СтрокаДокумента.ТипСуммы = ТекСтрока.ТипСуммы;
			СтрокаДокумента.Сумма = ТекСтрока.Сумма;
			СтрокаДокумента.СуммаКомпенсации = ТекСтрока.СуммаКомпенсации;
			СтрокаДокумента.СуммаВосполнения = ТекСтрока.СуммаВосполнения;
			СтрокаДокумента.СуммаВозмещения = ТекСтрока.СуммаВозмещения;
			СуммаПоСтроке = СуммаПоСтроке+ТекСтрока.Сумма;
			
			если Н = ТЗ.Количество()-1 тогда
				Если СтрокаДоговор<>Неопределено Тогда  //запишем значения для последней строки
					СтрокаДоговор.Сумма = СуммаПоСтроке;
					СтрокаДоговор.Выплата = СуммаПоСтроке;
				КонецЕсли;
				
				////сворачиваем расшифровки и записываем таб часть договоры опс
				//ТабДоговоров = ВыплатнойРеестр.РасшифровкаСуммы.Выгрузить();
				//ТабДоговоров.Свернуть("ДоговорОПС","Сумма");
				//Для Каждого стр из ТабДоговоров Цикл
				//	СтрокаДокумента = ВыплатнойРеестр.ДоговорыОПС.Добавить();
				//	СтрокаДокумента.ДоговорОПС = стр.ДоговорОПС;
				//	СтрокаДокумента.Участник = стр.ДоговорОПС.Участник;
				//	СтрокаДокумента.Сумма = стр.Сумма;
				//	СтрокаДокумента.Выплата = стр.Сумма;
				#Вставка
				// +ХМНПФ 03.08.2017 ШадринАВ // ЗаписатьДокументы() // №1117
				//					СтрокаДокумента.НомерЛицевогоСчета = ХМ_ПолучитьНомерЛС(стр.ДоговорОПС);
				// -ХМНПФ 03.08.2017 ШадринАВ // ЗаписатьДокументы() // №1117
				#КонецВставки
				//КонецЦикла;
				Если ЕстьИЛ Тогда
					ПересчитатьДокументПНСУчетомИЛ(ВыплатнойРеестр);
				КонецЕсли;
				
				Если Объект.ФормироватьОбщиеРеестры Тогда
					ВыплатнойРеестр.Реестр = ТЭтоРеестр;
				КонецЕсли;
				
				РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
				ВыплатнойРеестр.Записать();
				НоваяВыплата = Объект.НовыеНачисления.Добавить();
				НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
				НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
				НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
				НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
			конецесли;
		конеццикла;
	ИначеЕсли объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратНакопительнойПенсииОПС
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратСрочнойПенсииОПС
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежНПОПС
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежСВОПС
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.СрочнаяПенсияОПС Тогда
		//сортировка по признакам
		ПризнакиСортировки = "ФормаВыплаты";
		ПризнакиСортировки = ПризнакиСортировки + ",ЭтоРеестр";
		ПризнакиСортировки = ПризнакиСортировки + ",ДоговорЗаключен";
		ПризнакиСортировки = ПризнакиСортировки + ",ПодразделениеБУ";
		ПризнакиСортировки = ПризнакиСортировки + ",ПолучательВПлПор";
		ПризнакиСортировки = ПризнакиСортировки + ",РасчетныйСчет";
		ПризнакиСортировки = ПризнакиСортировки + ",НомерОчереди";
		ПризнакиСортировки = ПризнакиСортировки + ",Участник";
		ТЗ.Сортировать(ПризнакиСортировки);
		
		ТФормаВыплаты=""; ТПодразделение=""; ТПолучатель=""; ТОчередностьВыплаты=""; ТДоговорЗаключен=""; ВыплатнойРеестр=""; ТУчастник = ""; ТРасчетныйСчет = "";
		ТЭтоРеестр="";
		
		СчетчикСтрокВДокументе = 0;
		ЕстьИЛ = Ложь;
		для Н=0 по ТЗ.Количество()-1 цикл
			ТекСтрока = ТЗ.Получить(Н);
			СоответствуетДокументу=Истина;
			если ТФормаВыплаты <> ТекСтрока.ФормаВыплаты тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			
			если ТЭтоРеестр <> ТекСтрока.ЭтоРеестр Тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			
			если ТПодразделение <> ТекСтрока.ПодразделениеБУ тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТПолучатель <> ТекСтрока.ПолучательВПлПор тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТРасчетныйСчет <> ТекСтрока.РасчетныйСчет тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТОчередностьВыплаты <> ТекСтрока.НомерОчереди тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если (ТДоговорЗаключен <> ТекСтрока.ДоговорЗаключен)
				или ((Не ТекСтрока.ДоговорЗаключен) и (ТУчастник<>ТекСтрока.Участник)) Тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			//с одной стороны удобно здесь всех, кто через кассу в один документ, но с другой - если
			//кому-то заплатить не удастся, как документ проводить?
			
			если (Н=0) или не СоответствуетДокументу тогда
				если Н>0 тогда
					Если ЕстьИЛ Тогда
						ПересчитатьДокументПНСУчетомИЛ(ВыплатнойРеестр);
					КонецЕсли;
					
					Если Объект.ФормироватьОбщиеРеестры Тогда
						ВыплатнойРеестр.Реестр = ТЭтоРеестр;
					КонецЕсли;
					
					РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
					#Вставка
					// +ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
					хм_РегистрацияСобытийПривелигирован.ОбновитьНумерацию();
					уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
					// -ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
					#КонецВставки
					ВыплатнойРеестр.Записать();
					НоваяВыплата = Объект.НовыеНачисления.Добавить();
					НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
					НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
					НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
					НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
				конецесли;
				
				ТПодразделение = ТекСтрока.ПодразделениеБУ;
				ТПолучатель = ТекСтрока.ПолучательВПлПор;
				ТОчередностьВыплаты = ТекСтрока.НомерОчереди;
				ТДоговорЗаключен = ТекСтрока.ДоговорЗаключен;
				ТФормаВыплаты = ТекСтрока.ФормаВыплаты;
				ТРасчетныйСчет = ТекСтрока.РасчетныйСчет;
				ТЭтоРеестр = ТекСтрока.ЭтоРеестр;
				ЕстьИЛ = Ложь;
				
				ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
				ВыплатнойРеестр.Организация = объект.Организация;
				ВыплатнойРеестр.ТипВыплаты = объект.ТипВыплаты;
				ВыплатнойРеестр.Модуль = Объект.Модуль;
				ВыплатнойРеестр.ОтражатьВБухгалтерскомУчете = Объект.ОтражатьВБухгалтерскомУчете;
				ВыплатнойРеестр.уп_ВидДеятельности = Объект.уп_ВидДеятельности;
				ВыплатнойРеестр.Ответственный = Объект.Ответственный;
				
				если Объект.ПереключательДатыФормированияДокументов = 0 тогда
					ЧислоЗаписи = РегистрыСведений.уп_ДатыОчередей.Получить(Новый Структура("НомерОчереди",ТОчередностьВыплаты)).ДатаВМесяце;
					если НЕ ЗначениеЗаполнено(ЧислоЗаписи) тогда
						ЧислоЗаписи = 1;
					конецесли;				
					МесяцЗаписи = Месяц(Объект.ДатаФормированияДокументов);
					ГодЗаписи = Год(Объект.ДатаФормированияДокументов);
					ДатаЗаписи = Дата(ГодЗаписи, МесяцЗаписи, ЧислоЗаписи); 
					ВыплатнойРеестр.Дата = КонецДня(ДатаЗаписи);
					ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(ДатаЗаписи);
				иначе
					ВыплатнойРеестр.Дата = КонецДня(Объект.ДатаФормированияДокументов);
					ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(Объект.ДатаФормированияДокументов);
				конецесли;
				
				//уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
				ВыплатнойРеестр.ПодразделениеОрганизации = ТПодразделение;
				ВыплатнойРеестр.Получатель = ТПолучатель;
				ВыплатнойРеестр.РасчетныйСчет = ТРасчетныйСчет;
				ВыплатнойРеестр.НомерОчереди = ТОчередностьВыплаты;
				ВыплатнойРеестр.ФормаВыплаты = ТФормаВыплаты;
				
				СчетчикСтрокВДокументе = 0;
				
				СоответствиеДокументу = Новый Соответствие();
				СоответствиеДокументу.Вставить("Получатель",ТекСтрока.ПолучательВПлПор);
				СоответствиеДокументу.Вставить("ОчередностьВыплаты",ТекСтрока.НомерОчереди);
				
				
			конецесли;	
			
			Если объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС
				или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.СрочнаяПенсияОПС Тогда
				//это новый участник, проверяем наличие исполнительных листов
				Если ТекСтрока.ЕстьИсполнительныйЛист>0 Тогда
					ЕстьИЛ = Истина;
				КонецЕсли;	
			КонецЕсли;	
			
			//запись строки документа
			СтрокаДокумента = ВыплатнойРеестр.ДоговорыОПС.Добавить();
			СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
			СтрокаДокумента.Участник = ТекСтрока.Участник;
			СтрокаДокумента.ДоверенноеЛицо = ТекСтрока.ДоверенноеЛицо;
			СтрокаДокумента.ДоговорОПС = ТекСтрока.ПС;
			СтрокаДокумента.НомерЛицевогоСчета = ТекСтрока.НомерЛицевогоСчета;
			СтрокаДокумента.Сумма = ТекСтрока.Сумма;
			СтрокаДокумента.НачалоПериодаНачисления = ТекСтрока.НачалоПериода;
			СтрокаДокумента.ТипПенсииОПС = ТекСтрока.ТипПенсии;
			СтрокаДокумента.Выплата = ТекСтрока.Сумма;
			#Вставка
			СтрокаДокумента.Сумма = ТекСтрока.Сумма;
			СтрокаДокумента.Выплата = ТекСтрока.Сумма;
			#КонецВставки
			Если Объект.ФормироватьОбщиеРеестры Тогда
				СтрокаДокумента.Получатель = ТекСтрока.ПолучательТЧ;
				СтрокаДокумента.РасчетныйСчет = ТекСтрока.РасчетныйСчетТЧ;
			КонецЕсли;	
			ТУчастник = ТекСтрока.Участник;
			
			если Н = ТЗ.Количество()-1 тогда
				Если ЕстьИЛ Тогда
					ПересчитатьДокументПНСУчетомИЛ(ВыплатнойРеестр);
				КонецЕсли;
				
				Если Объект.ФормироватьОбщиеРеестры Тогда
					ВыплатнойРеестр.Реестр = ТЭтоРеестр;
				КонецЕсли;
				
				РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
				ВыплатнойРеестр.Записать();
				НоваяВыплата = Объект.НовыеНачисления.Добавить();
				НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
				НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
				НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
				НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
			конецесли;
		конеццикла;	
	ИначеЕсли объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапитала
		ИЛИ объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапиталаПДС Тогда
		//сортировка по признакам
		//ПризнакиСортировки = "НачалоПериода";
		ПризнакиСортировки = "ПодразделениеБУ,Участник";
		ТЗ.Сортировать(ПризнакиСортировки);
		
		ТПодразделение=""; ТУчастник=""; ТНачалоПериода=""; ВыплатнойРеестр="";
		СчетчикСтрокВДокументе = 0;
		для Н=0 по ТЗ.Количество()-1 цикл
			ТекСтрока = ТЗ.Получить(Н);
			СоответствуетДокументу=Истина;
			если ТПодразделение <> ТекСтрока.ПодразделениеБУ тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТУчастник <> ТекСтрока.Участник тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			//если ТНачалоПериода <> ТекСтрока.НачалоПериода тогда
			//	СоответствуетДокументу=Ложь;
			//конецесли;
			
			если (Н=0) или не СоответствуетДокументу тогда
				если Н>0 тогда
					РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
					#Вставка
					// +ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
					хм_РегистрацияСобытийПривелигирован.ОбновитьНумерацию();
					уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
					// -ХМНПФ 27.05.2021 ХлопцевБА// Ошибка:Номер не уникальный // №3200
					#КонецВставки
					ВыплатнойРеестр.Записать();
					НоваяВыплата = Объект.НовыеНачисления.Добавить();
					НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
					НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
					НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
					НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
				конецесли;
				
				ТПодразделение = ТекСтрока.ПодразделениеБУ;
				ТУчастник = ТекСтрока.Участник;
				ТНачалоПериода = ТекСтрока.НачалоПериода;
				
				ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
				ВыплатнойРеестр.Организация = объект.Организация;
				ВыплатнойРеестр.Дата = КонецДня(ТНачалоПериода);
				ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(ТНачалоПериода);
				ВыплатнойРеестр.ТипВыплаты = объект.ТипВыплаты;
				ВыплатнойРеестр.Модуль = Объект.Модуль;
				ВыплатнойРеестр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет;
				//уп_ОсновнаяПоставкаСервер.УстановитьНомерДокумента(ВыплатнойРеестр);
				ВыплатнойРеестр.Получатель = ТУчастник;
				ВыплатнойРеестр.РасчетныйСчет = ТекСтрока.РасчетныйСчет;
				ВыплатнойРеестр.ПодразделениеОрганизации = ТПодразделение;
				ВыплатнойРеестр.ОтражатьВБухгалтерскомУчете = Объект.ОтражатьВБухгалтерскомУчете;
				ВыплатнойРеестр.уп_ВидДеятельности = Объект.уп_ВидДеятельности;
				//ВыплатнойРеестр.НомерОчереди = ТОчередностьВыплаты;
				ВыплатнойРеестр.Ответственный = Объект.Ответственный;
				СчетчикСтрокВДокументе = 0;
				
				СоответствиеДокументу = Новый Соответствие();
				СоответствиеДокументу.Вставить("Участник",ТекСтрока.Участник);
				СоответствиеДокументу.Вставить("НачалоПериода",ТекСтрока.НачалоПериода);
			конецесли;	
			
			//запись строки документа
			СтрокаДокумента = ВыплатнойРеестр.ДоговорыОПС.Добавить();
			СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
			СтрокаДокумента.ДоговорОПС = ТекСтрока.ПС;
			СтрокаДокумента.Участник = ТекСтрока.ПС.Участник;
			СтрокаДокумента.Сумма = ТекСтрока.Сумма;
			СтрокаДокумента.Выплата = ТекСтрока.Сумма;
			//СтрокаДокумента.ДокументРегистрации = ТекСтрока.ДокументРегистрации;
			//СтрокаДокумента.НачалоПериодаНачисления = ТекСтрока.НачалоПериода;
			//СтрокаДокумента.КонецПериодаНачисления =  ТекСтрока.КонецПериода;
			
			если Н = ТЗ.Количество()-1 тогда
				РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
				ВыплатнойРеестр.Записать();
				НоваяВыплата = Объект.НовыеНачисления.Добавить();
				НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
				НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
				НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
				НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
			конецесли;
		конеццикла;
		
	ИначеЕсли объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийПДС 
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияПДС
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратПенсииПДС Тогда
		//сортировка по признакам
		ПризнакиСортировки = "ФормаВыплаты";
		
		ПризнакиСортировки = ПризнакиСортировки + ",РасчетныйСчетОрганизации";
		ПризнакиСортировки = ПризнакиСортировки + ",ЭтоРеестр";
		ПризнакиСортировки = ПризнакиСортировки + ",ДоговорЗаключен";
		ПризнакиСортировки = ПризнакиСортировки + ",ПодразделениеБУ";
		ПризнакиСортировки = ПризнакиСортировки + ",ПолучательВПлПор";
		ПризнакиСортировки = ПризнакиСортировки + ",РасчетныйСчет";
		ПризнакиСортировки = ПризнакиСортировки + ",НомерОчереди";
		ПризнакиСортировки = ПризнакиСортировки + ",РКОПоШаблону";
		ПризнакиСортировки = ПризнакиСортировки + ",Участник"; 
		ТЗ.Сортировать(ПризнакиСортировки);
		
		ТФормаВыплаты = ""; ТПодразделение=""; ТПолучатель=""; ТОчередностьВыплаты=""; ТДоговорЗаключен=""; ВыплатнойРеестр=""; ТУчастник = ""; ТРасчетныйСчет=""; ТРКОПоШаблону = "";
		ТЭтоРеестр=""; ТРасчетныйСчетОрганизации = "";

		ЕстьИЛ = Ложь;
		СчетчикСтрокВДокументе = 0;
		для Н=0 по ТЗ.Количество()-1 цикл
			ТекСтрока = ТЗ.Получить(Н);
			СоответствуетДокументу=Истина;
			Если ТФормаВыплаты <> ТекСтрока.ФормаВыплаты тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли; 
			
			если ТРасчетныйСчетОрганизации<>ТекСтрока.РасчетныйСчетОрганизации тогда
				СоответствуетДокументу=Ложь;
			конецесли;			
			Если ТЭтоРеестр <> ТекСтрока.ЭтоРеестр Тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТПодразделение <> ТекСтрока.ПодразделениеБУ тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТПолучатель <> ТекСтрока.ПолучательВПлПор тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТРасчетныйСчет <> ТекСтрока.РасчетныйСчет тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если НЕ ТекСтрока.ЭтоРеестр Тогда
				Если ТОчередностьВыплаты <> ТекСтрока.НомерОчереди тогда
					СоответствуетДокументу=Ложь;
				КонецЕсли;
			КонецЕсли;
			Если (ТДоговорЗаключен <> ТекСтрока.ДоговорЗаключен)
				или ((Не ТекСтрока.ДоговорЗаключен) и (ТУчастник<>ТекСтрока.Участник)) Тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТРКОПоШаблону <> ТекСтрока.РКОПоШаблону тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			
			
			//с одной стороны удобно здесь всех, кто через кассу в один документ, но с другой - если
			//кому-то заплатить не удастся, как документ проводить?
			
			Если (Н=0) или не СоответствуетДокументу тогда
				Если Н>0 тогда
					Если ЕстьИЛ Тогда
						ПересчитатьДокументПДССУчетомИЛ(ВыплатнойРеестр);
					КонецЕсли;
					
					Если Объект.ФормироватьОбщиеРеестры Тогда
						ВыплатнойРеестр.Реестр = ТЭтоРеестр;
					КонецЕсли;	
					
					РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр, ТРКОпоШаблону);
					
					ВыплатнойРеестр.Записать();
					НоваяВыплата = Объект.НовыеНачисления.Добавить();
					НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
					НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
					НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
					НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
				КонецЕсли;
				
				ТПодразделение = ТекСтрока.ПодразделениеБУ;
				ТПолучатель = ТекСтрока.ПолучательВПлПор;
				ТОчередностьВыплаты = ТекСтрока.НомерОчереди;
				ТДоговорЗаключен = ТекСтрока.ДоговорЗаключен;
				ТФормаВыплаты = ТекСтрока.ФормаВыплаты;
				ТРасчетныйСчет = ТекСтрока.РасчетныйСчет;
				ТРКОпоШаблону = ТекСтрока.РКОПоШаблону;
				ТЭтоРеестр = ТекСтрока.ЭтоРеестр;
				ТРасчетныйСчетОрганизации = ТекСтрока.РасчетныйСчетОрганизации;
				ЕстьИЛ = Ложь;
				
				ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
				ВыплатнойРеестр.Организация = Объект.Организация;
				ВыплатнойРеестр.ТипВыплаты = объект.ТипВыплаты;
				ВыплатнойРеестр.Модуль = Объект.Модуль;
				ВыплатнойРеестр.ОтражатьВБухгалтерскомУчете = Объект.ОтражатьВБухгалтерскомУчете;
				ВыплатнойРеестр.уп_ВидДеятельности = Объект.уп_ВидДеятельности;
				ВыплатнойРеестр.Ответственный = Объект.Ответственный;
				
				Если Объект.ПереключательДатыФормированияДокументов = 0 тогда
					ЧислоЗаписи = РегистрыСведений.уп_ДатыОчередей.Получить(Новый Структура("НомерОчереди",ТОчередностьВыплаты)).ДатаВМесяце;
					Если НЕ ЗначениеЗаполнено(ЧислоЗаписи) тогда
						ЧислоЗаписи = 1;
					КонецЕсли;				
					МесяцЗаписи = Месяц(Объект.ДатаФормированияДокументов);
					ГодЗаписи = Год(Объект.ДатаФормированияДокументов);
					ДатаЗаписи = Дата(ГодЗаписи, МесяцЗаписи, ЧислоЗаписи); 
					ВыплатнойРеестр.Дата = КонецДня(ДатаЗаписи);
					ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(ДатаЗаписи);
				Иначе
					ВыплатнойРеестр.Дата = КонецДня(Объект.ДатаФормированияДокументов);
					ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(Объект.ДатаФормированияДокументов);
				КонецЕсли;
				
				ВыплатнойРеестр.ПодразделениеОрганизации = ТПодразделение;
				ВыплатнойРеестр.Получатель = ТПолучатель;
				Выплатнойреестр.РасчетныйСчет = ТРасчетныйСчет;
				ВыплатнойРеестр.НомерОчереди = ТОчередностьВыплаты;
				ВыплатнойРеестр.ФормаВыплаты = ТФормаВыплаты;
				Если НЕ ВыплатнойРеестр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Касса Тогда
					ВыплатнойРеестр.РасчетныйСчетОрганизации = ТРасчетныйСчетОрганизации;
				КонецЕсли;
				СчетчикСтрокВДокументе = 0;
				
				СоответствиеДокументу = Новый Соответствие();
				СоответствиеДокументу.Вставить("Получатель",ТекСтрока.ПолучательВПлПор);
				СоответствиеДокументу.Вставить("ОчередностьВыплаты",ТекСтрока.НомерОчереди);
			КонецЕсли;
			
			Если объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийПДС Тогда
				//это новый участник, проверяем наличие исполнительных листов
				Если ТекСтрока.ЕстьИсполнительныйЛист>0 Тогда
					ЕстьИЛ = Истина;
				КонецЕсли;	
			КонецЕсли;	
			
			//запись строки документа
			СтрокаДокумента = ВыплатнойРеестр.СписокПенсионеровПДС.Добавить();
			СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
			СтрокаДокумента.Участник = ТекСтрока.Участник;
			СтрокаДокумента.ДоверенноеЛицо = ТекСтрока.ДоверенноеЛицо;
			СтрокаДокумента.НомерСчета = ТекСтрока.ПС;
			СтрокаДокумента.ТипПенсии = ТекСтрока.ТипПенсии;
			СтрокаДокумента.ПенсионныйДоговор = ТекСтрока.ПС.Владелец;
			СтрокаДокумента.НомерЛицевогоСчета = ТекСтрока.НомерЛицевогоСчета;
			СтрокаДокумента.Сумма = ТекСтрока.Сумма;
			СтрокаДокумента.НДФЛ = ТекСтрока.НДФЛ;
			СтрокаДокумента.Выплата = ТекСтрока.Сумма-ТекСтрока.НДФЛ;
			СтрокаДокумента.НачалоПериодаНачисления = ТекСтрока.НачалоПериода; 
			СтрокаДокумента.КонецПериодаНачисления =  ТекСтрока.КонецПериода;
			ТУчастник = ТекСтрока.Участник; 
			
			Если Объект.ФормироватьОбщиеРеестры Тогда
				СтрокаДокумента.Получатель = ТекСтрока.ПолучательТЧ;
				СтрокаДокумента.РасчетныйСчет = ТекСтрока.РасчетныйСчетТЧ;
			КонецЕсли;	
			
			
			если Н = ТЗ.Количество()-1 тогда
				Если ЕстьИЛ Тогда
					ПересчитатьДокументПДССУчетомИЛ(ВыплатнойРеестр);
				КонецЕсли;	
				
				Если Объект.ФормироватьОбщиеРеестры Тогда
					ВыплатнойРеестр.Реестр = ТЭтоРеестр;
				КонецЕсли;
				
				РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр, ТРКОпоШаблону);
				
				ВыплатнойРеестр.Записать();
				НоваяВыплата = Объект.НовыеНачисления.Добавить();
				НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
				НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
				НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
				НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
			КонецЕсли;
		Конеццикла;
	ИначеЕсли объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВзносовПДС Тогда
		//сортировка по признакам
		ПризнакиСортировки = "РасчетныйСчетОрганизации";
		ПризнакиСортировки = ПризнакиСортировки+",ПодразделениеБУ,Участник";
		ТЗ.Сортировать(ПризнакиСортировки);
		
		ТПодразделение=""; ТУчастник=""; ТНачалоПериода=""; ВыплатнойРеестр="";
		ТРасчетныйСчетОрганизации = "";
		
		СчетчикСтрокВДокументе = 0;
		для Н=0 по ТЗ.Количество()-1 цикл
			ТекСтрока = ТЗ.Получить(Н);
			СоответствуетДокументу=Истина;
			
			если ТРасчетныйСчетОрганизации<>ТекСтрока.РасчетныйСчетОрганизации тогда
				СоответствуетДокументу=Ложь;
			конецесли;			
			если ТПодразделение <> ТекСтрока.ПодразделениеБУ тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТУчастник <> ТекСтрока.Участник тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			если ТНачалоПериода <> ТекСтрока.НачалоПериода тогда
				СоответствуетДокументу=Ложь;
			конецесли;
			
			если (Н=0) или не СоответствуетДокументу тогда
				если Н>0 тогда
					РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
					ВыплатнойРеестр.Записать();
					НоваяВыплата = Объект.НовыеНачисления.Добавить();
					НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
					НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
					НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
					НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
				конецесли;
				
				ТПодразделение = ТекСтрока.ПодразделениеБУ;
				ТУчастник = ТекСтрока.Участник;
				ТНачалоПериода = ТекСтрока.НачалоПериода;
				ТРасчетныйСчетОрганизации = ТекСтрока.РасчетныйСчетОрганизации;
				
				ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
				ВыплатнойРеестр.Организация = объект.Организация;
				ВыплатнойРеестр.Дата = КонецДня(ТНачалоПериода);
				ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(ТНачалоПериода);
				ВыплатнойРеестр.ТипВыплаты = объект.ТипВыплаты;
				ВыплатнойРеестр.Модуль = Объект.Модуль;
				ВыплатнойРеестр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет;
				ВыплатнойРеестр.РасчетныйСчетОрганизации = ТРасчетныйСчетОрганизации;
				ВыплатнойРеестр.Получатель = ТУчастник;
				ВыплатнойРеестр.РасчетныйСчет = ТекСтрока.РасчетныйСчет;
				ВыплатнойРеестр.ОтражатьВБухгалтерскомУчете = Объект.ОтражатьВБухгалтерскомУчете;
				ВыплатнойРеестр.уп_ВидДеятельности = Объект.уп_ВидДеятельности;
				ВыплатнойРеестр.ПодразделениеОрганизации = ТПодразделение;
				ВыплатнойРеестр.Ответственный = Объект.Ответственный;
				СчетчикСтрокВДокументе = 0;
				
				СоответствиеДокументу = Новый Соответствие();
				СоответствиеДокументу.Вставить("Участник",ТекСтрока.Участник);
				СоответствиеДокументу.Вставить("НачалоПериода",ТекСтрока.НачалоПериода);
			конецесли;	
			
			//запись строки документа
			СтрокаДокумента = ВыплатнойРеестр.СписокПенсионеровПДС.Добавить();
			СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
			СтрокаДокумента.НомерСчета = ТекСтрока.ПС;
			СтрокаДокумента.ПенсионныйДоговор = ТекСтрока.ПС.Владелец;
			СтрокаДокумента.Участник = ТекСтрока.Участник;
			СтрокаДокумента.Сумма = ТекСтрока.Сумма;
			СтрокаДокумента.ДокументРегистрации = ТекСтрока.ДокументРегистрации;
			//СтрокаДокумента.НачалоПериодаНачисления = ТекСтрока.НачалоПериода;
			//СтрокаДокумента.КонецПериодаНачисления =  ТекСтрока.КонецПериода;
			СтрокаДокумента.Выплата = ТекСтрока.Сумма;
			если Н = ТЗ.Количество()-1 тогда
				РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр);
				ВыплатнойРеестр.Записать();
				НоваяВыплата = Объект.НовыеНачисления.Добавить();
				НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
				НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
				НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
				НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
			конецесли;
		конеццикла;	
	ИначеЕсли объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаПДС 
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежЕВПДС
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратЕдиновременнаяВыплатаПДС Тогда
		//сортировка по признакам
		ПризнакиСортировки = "ФормаВыплаты";
		
		ПризнакиСортировки = ПризнакиСортировки + ",РасчетныйСчетОрганизации";
		ПризнакиСортировки = ПризнакиСортировки + ",ЭтоРеестр";
		ПризнакиСортировки = ПризнакиСортировки + ",ДоговорЗаключен";
		ПризнакиСортировки = ПризнакиСортировки + ",ПодразделениеБУ";
		ПризнакиСортировки = ПризнакиСортировки + ",ПолучательВПлПор";
		ПризнакиСортировки = ПризнакиСортировки + ",РасчетныйСчет";
		ПризнакиСортировки = ПризнакиСортировки + ",НомерОчереди";
		ПризнакиСортировки = ПризнакиСортировки + ",РКОПоШаблону";
		ПризнакиСортировки = ПризнакиСортировки + ",Участник"; 
		ТЗ.Сортировать(ПризнакиСортировки);
		
		ТФормаВыплаты = ""; ТПодразделение=""; ТПолучатель=""; ТОчередностьВыплаты=""; ТДоговорЗаключен=""; ВыплатнойРеестр=""; ТУчастник = ""; ТРасчетныйСчет=""; ТРКОПоШаблону = "";
		ТЭтоРеестр=""; ТРасчетныйСчетОрганизации = "";

		ЕстьИЛ = Ложь;
		СчетчикСтрокВДокументе = 0;
		для Н=0 по ТЗ.Количество()-1 цикл
			ТекСтрока = ТЗ.Получить(Н);
			СоответствуетДокументу=Истина;
			Если ТФормаВыплаты <> ТекСтрока.ФормаВыплаты тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли; 
			
			если ТРасчетныйСчетОрганизации<>ТекСтрока.РасчетныйСчетОрганизации тогда
				СоответствуетДокументу=Ложь;
			конецесли;			
			Если ТЭтоРеестр <> ТекСтрока.ЭтоРеестр Тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТПодразделение <> ТекСтрока.ПодразделениеБУ тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТПолучатель <> ТекСтрока.ПолучательВПлПор тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТРасчетныйСчет <> ТекСтрока.РасчетныйСчет тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если НЕ ТекСтрока.ЭтоРеестр Тогда
				Если ТОчередностьВыплаты <> ТекСтрока.НомерОчереди тогда
					СоответствуетДокументу=Ложь;
				КонецЕсли;
			КонецЕсли;
			Если (ТДоговорЗаключен <> ТекСтрока.ДоговорЗаключен)
				или ((Не ТекСтрока.ДоговорЗаключен) и (ТУчастник<>ТекСтрока.Участник)) Тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТРКОПоШаблону <> ТекСтрока.РКОПоШаблону тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			
			
			//с одной стороны удобно здесь всех, кто через кассу в один документ, но с другой - если
			//кому-то заплатить не удастся, как документ проводить?
			
			Если (Н=0) или не СоответствуетДокументу тогда
				Если Н>0 тогда
					Если ЕстьИЛ Тогда
						ПересчитатьДокументПДССУчетомИЛ(ВыплатнойРеестр);
					КонецЕсли;
					
					Если Объект.ФормироватьОбщиеРеестры Тогда
						ВыплатнойРеестр.Реестр = ТЭтоРеестр;
					КонецЕсли;	
					
					РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр, ТРКОпоШаблону);
					
					ВыплатнойРеестр.Записать();
					НоваяВыплата = Объект.НовыеНачисления.Добавить();
					НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
					НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
					НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
					НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
				КонецЕсли;
				
				ТПодразделение = ТекСтрока.ПодразделениеБУ;
				ТПолучатель = ТекСтрока.ПолучательВПлПор;
				ТОчередностьВыплаты = ТекСтрока.НомерОчереди;
				ТДоговорЗаключен = ТекСтрока.ДоговорЗаключен;
				ТФормаВыплаты = ТекСтрока.ФормаВыплаты;
				ТРасчетныйСчет = ТекСтрока.РасчетныйСчет;
				ТРКОпоШаблону = ТекСтрока.РКОПоШаблону;
				ТЭтоРеестр = ТекСтрока.ЭтоРеестр;
				ТРасчетныйСчетОрганизации = ТекСтрока.РасчетныйСчетОрганизации;
				ЕстьИЛ = Ложь;
				
				ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
				ВыплатнойРеестр.Организация = Объект.Организация;
				ВыплатнойРеестр.ТипВыплаты = объект.ТипВыплаты;
				ВыплатнойРеестр.Модуль = Объект.Модуль;
				ВыплатнойРеестр.ОтражатьВБухгалтерскомУчете = Объект.ОтражатьВБухгалтерскомУчете;
				ВыплатнойРеестр.уп_ВидДеятельности = Объект.уп_ВидДеятельности;
				ВыплатнойРеестр.Ответственный = Объект.Ответственный;
				
				Если Объект.ПереключательДатыФормированияДокументов = 0 тогда
					ЧислоЗаписи = РегистрыСведений.уп_ДатыОчередей.Получить(Новый Структура("НомерОчереди",ТОчередностьВыплаты)).ДатаВМесяце;
					Если НЕ ЗначениеЗаполнено(ЧислоЗаписи) тогда
						ЧислоЗаписи = 1;
					КонецЕсли;				
					МесяцЗаписи = Месяц(Объект.ДатаФормированияДокументов);
					ГодЗаписи = Год(Объект.ДатаФормированияДокументов);
					ДатаЗаписи = Дата(ГодЗаписи, МесяцЗаписи, ЧислоЗаписи); 
					ВыплатнойРеестр.Дата = КонецДня(ДатаЗаписи);
					ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(ДатаЗаписи);
				Иначе
					ВыплатнойРеестр.Дата = КонецДня(Объект.ДатаФормированияДокументов);
					ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(Объект.ДатаФормированияДокументов);
				КонецЕсли;
				
				ВыплатнойРеестр.ПодразделениеОрганизации = ТПодразделение;
				ВыплатнойРеестр.Получатель = ТПолучатель;
				Выплатнойреестр.РасчетныйСчет = ТРасчетныйСчет;
				ВыплатнойРеестр.НомерОчереди = ТОчередностьВыплаты;
				ВыплатнойРеестр.ФормаВыплаты = ТФормаВыплаты;
				Если НЕ ВыплатнойРеестр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Касса Тогда
					ВыплатнойРеестр.РасчетныйСчетОрганизации = ТРасчетныйСчетОрганизации;
				КонецЕсли;
				СчетчикСтрокВДокументе = 0;
				
				СоответствиеДокументу = Новый Соответствие();
				СоответствиеДокументу.Вставить("Получатель",ТекСтрока.ПолучательВПлПор);
				СоответствиеДокументу.Вставить("ОчередностьВыплаты",ТекСтрока.НомерОчереди);
			КонецЕсли;
			
			Если объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаПДС Тогда
				//это новый участник, проверяем наличие исполнительных листов
				Если ТекСтрока.ЕстьИсполнительныйЛист>0 Тогда
					ЕстьИЛ = Истина;
				КонецЕсли;	
			КонецЕсли;	
			
			//запись строки документа
			СтрокаДокумента = ВыплатнойРеестр.СписокПенсионеровПДС.Добавить();
			СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
			СтрокаДокумента.Участник = ТекСтрока.Участник;
			СтрокаДокумента.ДоверенноеЛицо = ТекСтрока.ДоверенноеЛицо;
			СтрокаДокумента.НомерСчета = ТекСтрока.ПС;
			СтрокаДокумента.ПенсионныйДоговор = ТекСтрока.ПС.Владелец;
			СтрокаДокумента.НомерЛицевогоСчета = ТекСтрока.НомерЛицевогоСчета;
			СтрокаДокумента.Сумма = ТекСтрока.Сумма;
			СтрокаДокумента.НДФЛ = ТекСтрока.НДФЛ;
			СтрокаДокумента.Выплата = ТекСтрока.Сумма-ТекСтрока.НДФЛ;
			СтрокаДокумента.НачалоПериодаНачисления = ТекСтрока.НачалоПериода;
			ТУчастник = ТекСтрока.Участник; 
			
			Если Объект.ФормироватьОбщиеРеестры Тогда
				СтрокаДокумента.Получатель = ТекСтрока.ПолучательТЧ;
				СтрокаДокумента.РасчетныйСчет = ТекСтрока.РасчетныйСчетТЧ;
			КонецЕсли;	
			
			
			если Н = ТЗ.Количество()-1 тогда
				Если ЕстьИЛ Тогда
					ПересчитатьДокументПДССУчетомИЛ(ВыплатнойРеестр);
				КонецЕсли;	
				
				Если Объект.ФормироватьОбщиеРеестры Тогда
					ВыплатнойРеестр.Реестр = ТЭтоРеестр;
				КонецЕсли;
				
				РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр, ТРКОпоШаблону);
				
				ВыплатнойРеестр.Записать();
				НоваяВыплата = Объект.НовыеНачисления.Добавить();
				НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
				НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
				НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
				НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
			КонецЕсли;
		Конеццикла;	
		
	ИначеЕсли объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыкупнаяСуммаПДС 
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежВыкупнаяСуммаПДС
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыкупнаяСуммаПДС Тогда
		//сортировка по признакам
		ПризнакиСортировки = "ФормаВыплаты";
		
		ПризнакиСортировки = ПризнакиСортировки + ",РасчетныйСчетОрганизации";
		ПризнакиСортировки = ПризнакиСортировки + ",ЭтоРеестр";
		ПризнакиСортировки = ПризнакиСортировки + ",ДоговорЗаключен";
		ПризнакиСортировки = ПризнакиСортировки + ",ПодразделениеБУ";
		ПризнакиСортировки = ПризнакиСортировки + ",ПолучательВПлПор";
		ПризнакиСортировки = ПризнакиСортировки + ",РасчетныйСчет";
		ПризнакиСортировки = ПризнакиСортировки + ",НомерОчереди";
		ПризнакиСортировки = ПризнакиСортировки + ",РКОПоШаблону";
		ПризнакиСортировки = ПризнакиСортировки + ",Участник"; 
		ТЗ.Сортировать(ПризнакиСортировки);
		
		ТФормаВыплаты = ""; ТПодразделение=""; ТПолучатель=""; ТОчередностьВыплаты=""; ТДоговорЗаключен=""; ВыплатнойРеестр=""; ТУчастник = ""; ТРасчетныйСчет=""; ТРКОПоШаблону = "";
		ТЭтоРеестр=""; ТРасчетныйСчетОрганизации = "";

		ЕстьИЛ = Ложь;
		СчетчикСтрокВДокументе = 0;
		для Н=0 по ТЗ.Количество()-1 цикл
			ТекСтрока = ТЗ.Получить(Н);
			СоответствуетДокументу=Истина;
			Если ТФормаВыплаты <> ТекСтрока.ФормаВыплаты тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли; 
			
			если ТРасчетныйСчетОрганизации<>ТекСтрока.РасчетныйСчетОрганизации тогда
				СоответствуетДокументу=Ложь;
			конецесли;			
			Если ТЭтоРеестр <> ТекСтрока.ЭтоРеестр Тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТПодразделение <> ТекСтрока.ПодразделениеБУ тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТПолучатель <> ТекСтрока.ПолучательВПлПор тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТРасчетныйСчет <> ТекСтрока.РасчетныйСчет тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если НЕ ТекСтрока.ЭтоРеестр Тогда
				Если ТОчередностьВыплаты <> ТекСтрока.НомерОчереди тогда
					СоответствуетДокументу=Ложь;
				КонецЕсли;
			КонецЕсли;
			Если (ТДоговорЗаключен <> ТекСтрока.ДоговорЗаключен)
				или ((Не ТекСтрока.ДоговорЗаключен) и (ТУчастник<>ТекСтрока.Участник)) Тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТРКОПоШаблону <> ТекСтрока.РКОПоШаблону тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			
			
			//с одной стороны удобно здесь всех, кто через кассу в один документ, но с другой - если
			//кому-то заплатить не удастся, как документ проводить?
			
			Если (Н=0) или не СоответствуетДокументу тогда
				Если Н>0 тогда
					Если ЕстьИЛ Тогда
						ПересчитатьДокументПДССУчетомИЛ(ВыплатнойРеестр);
					КонецЕсли;
					
					Если Объект.ФормироватьОбщиеРеестры Тогда
						ВыплатнойРеестр.Реестр = ТЭтоРеестр;
					КонецЕсли;	
					
					РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр, ТРКОпоШаблону);
					
					ВыплатнойРеестр.Записать();
					НоваяВыплата = Объект.НовыеНачисления.Добавить();
					НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
					НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
					НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
					НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
				КонецЕсли;
				
				ТПодразделение = ТекСтрока.ПодразделениеБУ;
				ТПолучатель = ТекСтрока.ПолучательВПлПор;
				ТОчередностьВыплаты = ТекСтрока.НомерОчереди;
				ТДоговорЗаключен = ТекСтрока.ДоговорЗаключен;
				ТФормаВыплаты = ТекСтрока.ФормаВыплаты;
				ТРасчетныйСчет = ТекСтрока.РасчетныйСчет;
				ТРКОпоШаблону = ТекСтрока.РКОПоШаблону;
				ТЭтоРеестр = ТекСтрока.ЭтоРеестр; 
				ТРасчетныйСчетОрганизации = ТекСтрока.РасчетныйСчетОрганизации;
				ЕстьИЛ = Ложь;
				
				ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
				ВыплатнойРеестр.Организация = Объект.Организация;
				ВыплатнойРеестр.ТипВыплаты = объект.ТипВыплаты;
				ВыплатнойРеестр.Модуль = Объект.Модуль;
				ВыплатнойРеестр.ОтражатьВБухгалтерскомУчете = Объект.ОтражатьВБухгалтерскомУчете;
				ВыплатнойРеестр.уп_ВидДеятельности = Объект.уп_ВидДеятельности;
				ВыплатнойРеестр.Ответственный = Объект.Ответственный;
				
				Если Объект.ПереключательДатыФормированияДокументов = 0 тогда
					ЧислоЗаписи = РегистрыСведений.уп_ДатыОчередей.Получить(Новый Структура("НомерОчереди",ТОчередностьВыплаты)).ДатаВМесяце;
					Если НЕ ЗначениеЗаполнено(ЧислоЗаписи) тогда
						ЧислоЗаписи = 1;
					КонецЕсли;				
					МесяцЗаписи = Месяц(Объект.ДатаФормированияДокументов);
					ГодЗаписи = Год(Объект.ДатаФормированияДокументов);
					ДатаЗаписи = Дата(ГодЗаписи, МесяцЗаписи, ЧислоЗаписи); 
					ВыплатнойРеестр.Дата = КонецДня(ДатаЗаписи);
					ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(ДатаЗаписи);
				Иначе
					ВыплатнойРеестр.Дата = КонецДня(Объект.ДатаФормированияДокументов);
					ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(Объект.ДатаФормированияДокументов);
				КонецЕсли;
				
				ВыплатнойРеестр.ПодразделениеОрганизации = ТПодразделение;
				ВыплатнойРеестр.Получатель = ТПолучатель;
				Выплатнойреестр.РасчетныйСчет = ТРасчетныйСчет;
				ВыплатнойРеестр.НомерОчереди = ТОчередностьВыплаты;
				ВыплатнойРеестр.ФормаВыплаты = ТФормаВыплаты;
				Если НЕ ВыплатнойРеестр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Касса Тогда
					ВыплатнойРеестр.РасчетныйСчетОрганизации = ТРасчетныйСчетОрганизации;
				КонецЕсли;
				СчетчикСтрокВДокументе = 0;
				
				СоответствиеДокументу = Новый Соответствие();
				СоответствиеДокументу.Вставить("Получатель",ТекСтрока.ПолучательВПлПор);
				СоответствиеДокументу.Вставить("ОчередностьВыплаты",ТекСтрока.НомерОчереди);
			КонецЕсли;
			
			Если объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыкупнаяСуммаПДС Тогда
				//это новый участник, проверяем наличие исполнительных листов
				Если ТекСтрока.ЕстьИсполнительныйЛист>0 Тогда
					ЕстьИЛ = Истина;
				КонецЕсли;	
			КонецЕсли;	
			
			//запись строки документа
			СтрокаДокумента = ВыплатнойРеестр.СписокПенсионеровПДС.Добавить();
			СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
			СтрокаДокумента.Участник = ТекСтрока.Участник;
			СтрокаДокумента.ДоверенноеЛицо = ТекСтрока.ДоверенноеЛицо;
			СтрокаДокумента.НомерСчета = ТекСтрока.ПС;
			СтрокаДокумента.ПенсионныйДоговор = ТекСтрока.ПС.Владелец;
			СтрокаДокумента.НомерЛицевогоСчета = ТекСтрока.НомерЛицевогоСчета;
			СтрокаДокумента.Сумма = ТекСтрока.Сумма;
			СтрокаДокумента.НДФЛ = ТекСтрока.НДФЛ;
			СтрокаДокумента.Выплата = ТекСтрока.Сумма-ТекСтрока.НДФЛ;
			СтрокаДокумента.НачалоПериодаНачисления = ТекСтрока.НачалоПериода;
			ТУчастник = ТекСтрока.Участник; 
			
			Если Объект.ФормироватьОбщиеРеестры Тогда
				СтрокаДокумента.Получатель = ТекСтрока.ПолучательТЧ;
				СтрокаДокумента.РасчетныйСчет = ТекСтрока.РасчетныйСчетТЧ;
			КонецЕсли;	
			
			
			если Н = ТЗ.Количество()-1 тогда
				Если ЕстьИЛ Тогда
					ПересчитатьДокументПДССУчетомИЛ(ВыплатнойРеестр);
				КонецЕсли;	
				
				Если Объект.ФормироватьОбщиеРеестры Тогда
					ВыплатнойРеестр.Реестр = ТЭтоРеестр;
				КонецЕсли;
				
				РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр, ТРКОпоШаблону);
				
				ВыплатнойРеестр.Записать();
				НоваяВыплата = Объект.НовыеНачисления.Добавить();
				НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
				НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
				НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
				НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
			КонецЕсли;
		Конеццикла;	
		
	ИначеЕсли объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПоОсобымОбстоятельствамПДС 
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежВыплатыПоОсобымОбстоятельствамПДС
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатыПоОсобымОбстоятельствамПДС Тогда
		//сортировка по признакам
		ПризнакиСортировки = "ФормаВыплаты";
		
		ПризнакиСортировки = ПризнакиСортировки + ",РасчетныйСчетОрганизации";
		ПризнакиСортировки = ПризнакиСортировки + ",ЭтоРеестр";
		ПризнакиСортировки = ПризнакиСортировки + ",ДоговорЗаключен";
		ПризнакиСортировки = ПризнакиСортировки + ",ПодразделениеБУ";
		ПризнакиСортировки = ПризнакиСортировки + ",ПолучательВПлПор";
		ПризнакиСортировки = ПризнакиСортировки + ",РасчетныйСчет";
		ПризнакиСортировки = ПризнакиСортировки + ",НомерОчереди";
		ПризнакиСортировки = ПризнакиСортировки + ",РКОПоШаблону";
		ПризнакиСортировки = ПризнакиСортировки + ",Участник"; 
		ТЗ.Сортировать(ПризнакиСортировки);
		
		ТФормаВыплаты = ""; ТПодразделение=""; ТПолучатель=""; ТОчередностьВыплаты=""; ТДоговорЗаключен=""; ВыплатнойРеестр=""; ТУчастник = ""; ТРасчетныйСчет=""; ТРКОПоШаблону = "";
		ТЭтоРеестр=""; ТРасчетныйСчетОрганизации = "";

		ЕстьИЛ = Ложь;
		СчетчикСтрокВДокументе = 0;
		для Н=0 по ТЗ.Количество()-1 цикл
			ТекСтрока = ТЗ.Получить(Н);
			СоответствуетДокументу=Истина;
			Если ТФормаВыплаты <> ТекСтрока.ФормаВыплаты тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли; 
			
			если ТРасчетныйСчетОрганизации<>ТекСтрока.РасчетныйСчетОрганизации тогда
				СоответствуетДокументу=Ложь;
			конецесли;			
			Если ТЭтоРеестр <> ТекСтрока.ЭтоРеестр Тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТПодразделение <> ТекСтрока.ПодразделениеБУ тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТПолучатель <> ТекСтрока.ПолучательВПлПор тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТРасчетныйСчет <> ТекСтрока.РасчетныйСчет тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если НЕ ТекСтрока.ЭтоРеестр Тогда
				Если ТОчередностьВыплаты <> ТекСтрока.НомерОчереди тогда
					СоответствуетДокументу=Ложь;
				КонецЕсли;
			КонецЕсли;
			Если (ТДоговорЗаключен <> ТекСтрока.ДоговорЗаключен)
				или ((Не ТекСтрока.ДоговорЗаключен) и (ТУчастник<>ТекСтрока.Участник)) Тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТРКОПоШаблону <> ТекСтрока.РКОПоШаблону тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			
			
			//с одной стороны удобно здесь всех, кто через кассу в один документ, но с другой - если
			//кому-то заплатить не удастся, как документ проводить?
			
			Если (Н=0) или не СоответствуетДокументу тогда
				Если Н>0 тогда
					Если ЕстьИЛ Тогда
						ПересчитатьДокументПДССУчетомИЛ(ВыплатнойРеестр);
					КонецЕсли;
					
					Если Объект.ФормироватьОбщиеРеестры Тогда
						ВыплатнойРеестр.Реестр = ТЭтоРеестр;
					КонецЕсли;	
					
					РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр, ТРКОпоШаблону);
					
					ВыплатнойРеестр.Записать();
					НоваяВыплата = Объект.НовыеНачисления.Добавить();
					НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
					НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
					НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
					НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
				КонецЕсли;
				
				ТПодразделение = ТекСтрока.ПодразделениеБУ;
				ТПолучатель = ТекСтрока.ПолучательВПлПор;
				ТОчередностьВыплаты = ТекСтрока.НомерОчереди;
				ТДоговорЗаключен = ТекСтрока.ДоговорЗаключен;
				ТФормаВыплаты = ТекСтрока.ФормаВыплаты;
				ТРасчетныйСчет = ТекСтрока.РасчетныйСчет;
				ТРКОпоШаблону = ТекСтрока.РКОПоШаблону;
				ТЭтоРеестр = ТекСтрока.ЭтоРеестр;
				ТРасчетныйСчетОрганизации = ТекСтрока.РасчетныйСчетОрганизации;
				ЕстьИЛ = Ложь;
				
				ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
				ВыплатнойРеестр.Организация = Объект.Организация;
				ВыплатнойРеестр.ТипВыплаты = объект.ТипВыплаты;
				ВыплатнойРеестр.Модуль = Объект.Модуль;
				ВыплатнойРеестр.ОтражатьВБухгалтерскомУчете = Объект.ОтражатьВБухгалтерскомУчете;
				ВыплатнойРеестр.уп_ВидДеятельности = Объект.уп_ВидДеятельности;
				ВыплатнойРеестр.Ответственный = Объект.Ответственный;
				
				Если Объект.ПереключательДатыФормированияДокументов = 0 тогда
					ЧислоЗаписи = РегистрыСведений.уп_ДатыОчередей.Получить(Новый Структура("НомерОчереди",ТОчередностьВыплаты)).ДатаВМесяце;
					Если НЕ ЗначениеЗаполнено(ЧислоЗаписи) тогда
						ЧислоЗаписи = 1;
					КонецЕсли;				
					МесяцЗаписи = Месяц(Объект.ДатаФормированияДокументов);
					ГодЗаписи = Год(Объект.ДатаФормированияДокументов);
					ДатаЗаписи = Дата(ГодЗаписи, МесяцЗаписи, ЧислоЗаписи); 
					ВыплатнойРеестр.Дата = КонецДня(ДатаЗаписи);
					ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(ДатаЗаписи);
				Иначе
					ВыплатнойРеестр.Дата = КонецДня(Объект.ДатаФормированияДокументов);
					ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(Объект.ДатаФормированияДокументов);
				КонецЕсли;
				
				ВыплатнойРеестр.ПодразделениеОрганизации = ТПодразделение;
				ВыплатнойРеестр.Получатель = ТПолучатель;
				Выплатнойреестр.РасчетныйСчет = ТРасчетныйСчет;
				ВыплатнойРеестр.НомерОчереди = ТОчередностьВыплаты;
				ВыплатнойРеестр.ФормаВыплаты = ТФормаВыплаты;
				Если НЕ ВыплатнойРеестр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Касса Тогда
					ВыплатнойРеестр.РасчетныйСчетОрганизации = ТРасчетныйСчетОрганизации;
				КонецЕсли;
				СчетчикСтрокВДокументе = 0;
				
				СоответствиеДокументу = Новый Соответствие();
				СоответствиеДокументу.Вставить("Получатель",ТекСтрока.ПолучательВПлПор);
				СоответствиеДокументу.Вставить("ОчередностьВыплаты",ТекСтрока.НомерОчереди);
			КонецЕсли;
			
			Если объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПоОсобымОбстоятельствамПДС Тогда
				//это новый участник, проверяем наличие исполнительных листов
				Если ТекСтрока.ЕстьИсполнительныйЛист>0 Тогда
					ЕстьИЛ = Истина;
				КонецЕсли;	
			КонецЕсли;	
			
			//запись строки документа
			СтрокаДокумента = ВыплатнойРеестр.СписокПенсионеровПДС.Добавить();
			СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
			СтрокаДокумента.Участник = ТекСтрока.Участник;
			СтрокаДокумента.ДоверенноеЛицо = ТекСтрока.ДоверенноеЛицо;
			СтрокаДокумента.НомерСчета = ТекСтрока.ПС;
			СтрокаДокумента.ПенсионныйДоговор = ТекСтрока.ПС.Владелец;
			СтрокаДокумента.НомерЛицевогоСчета = ТекСтрока.НомерЛицевогоСчета;
			СтрокаДокумента.Сумма = ТекСтрока.Сумма;
			СтрокаДокумента.НДФЛ = ТекСтрока.НДФЛ;
			СтрокаДокумента.Выплата = ТекСтрока.Сумма-ТекСтрока.НДФЛ;
			СтрокаДокумента.НачалоПериодаНачисления = ТекСтрока.НачалоПериода;
			ТУчастник = ТекСтрока.Участник; 
			
			Если Объект.ФормироватьОбщиеРеестры Тогда
				СтрокаДокумента.Получатель = ТекСтрока.ПолучательТЧ;
				СтрокаДокумента.РасчетныйСчет = ТекСтрока.РасчетныйСчетТЧ;
			КонецЕсли;	
			
			
			если Н = ТЗ.Количество()-1 тогда
				Если ЕстьИЛ Тогда
					ПересчитатьДокументПДССУчетомИЛ(ВыплатнойРеестр);
				КонецЕсли;	
				
				Если Объект.ФормироватьОбщиеРеестры Тогда
					ВыплатнойРеестр.Реестр = ТЭтоРеестр;
				КонецЕсли;
				
				РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр, ТРКОпоШаблону);
				
				ВыплатнойРеестр.Записать();
				НоваяВыплата = Объект.НовыеНачисления.Добавить();
				НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
				НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
				НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
				НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
			КонецЕсли;
		Конеццикла;	
		
	ИначеЕсли объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПравопреемникамПДС 
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиПДС
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатыПравопреемникамПДС 
		
		//ПЮ		
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_ПДС Тогда
		//сортировка по признакам
		ПризнакиСортировки = "ФормаВыплаты";
		
		ПризнакиСортировки = ПризнакиСортировки + ",РасчетныйСчетОрганизации";
		ПризнакиСортировки = ПризнакиСортировки + ",ЭтоРеестр";
		ПризнакиСортировки = ПризнакиСортировки + ",ДоговорЗаключен";
		ПризнакиСортировки = ПризнакиСортировки + ",ПодразделениеБУ";
		ПризнакиСортировки = ПризнакиСортировки + ",ПолучательВПлПор";
		ПризнакиСортировки = ПризнакиСортировки + ",РасчетныйСчет";
		ПризнакиСортировки = ПризнакиСортировки + ",НомерОчереди";
		ПризнакиСортировки = ПризнакиСортировки + ",РКОПоШаблону";
		ПризнакиСортировки = ПризнакиСортировки + ",Участник"; 
		ТЗ.Сортировать(ПризнакиСортировки);
		
		ТФормаВыплаты = ""; ТПодразделение=""; ТПолучатель=""; ТОчередностьВыплаты=""; ТДоговорЗаключен=""; ВыплатнойРеестр=""; ТУчастник = ""; ТРасчетныйСчет=""; ТРКОПоШаблону = "";
		ТЭтоРеестр=""; ТРасчетныйСчетОрганизации = "";

		ЕстьИЛ = Ложь;
		СчетчикСтрокВДокументе = 0;
		для Н=0 по ТЗ.Количество()-1 цикл
			ТекСтрока = ТЗ.Получить(Н);
			СоответствуетДокументу=Истина;
			Если ТФормаВыплаты <> ТекСтрока.ФормаВыплаты тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли; 
			
			если ТРасчетныйСчетОрганизации<>ТекСтрока.РасчетныйСчетОрганизации тогда
				СоответствуетДокументу=Ложь;
			конецесли;			
			Если ТЭтоРеестр <> ТекСтрока.ЭтоРеестр Тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТПодразделение <> ТекСтрока.ПодразделениеБУ тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТПолучатель <> ТекСтрока.ПолучательВПлПор тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТРасчетныйСчет <> ТекСтрока.РасчетныйСчет тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если НЕ ТекСтрока.ЭтоРеестр Тогда
				Если ТОчередностьВыплаты <> ТекСтрока.НомерОчереди тогда
					СоответствуетДокументу=Ложь;
				КонецЕсли;
			КонецЕсли;
			Если (ТДоговорЗаключен <> ТекСтрока.ДоговорЗаключен)
				или ((Не ТекСтрока.ДоговорЗаключен) и (ТУчастник<>ТекСтрока.Участник)) Тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			Если ТРКОПоШаблону <> ТекСтрока.РКОПоШаблону тогда
				СоответствуетДокументу=Ложь;
			КонецЕсли;
			
			
			//с одной стороны удобно здесь всех, кто через кассу в один документ, но с другой - если
			//кому-то заплатить не удастся, как документ проводить?
			
			Если (Н=0) или не СоответствуетДокументу тогда
				Если Н>0 тогда
					Если ЕстьИЛ Тогда
						ПересчитатьДокументПДССУчетомИЛ(ВыплатнойРеестр);
					КонецЕсли;
					
					Если Объект.ФормироватьОбщиеРеестры Тогда
						ВыплатнойРеестр.Реестр = ТЭтоРеестр;
					КонецЕсли;	
					
					РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр, ТРКОпоШаблону);
					
					ВыплатнойРеестр.Записать();
					НоваяВыплата = Объект.НовыеНачисления.Добавить();
					НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
					НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
					НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
					НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
				КонецЕсли;
				
				ТПодразделение = ТекСтрока.ПодразделениеБУ;
				ТПолучатель = ТекСтрока.ПолучательВПлПор;
				ТОчередностьВыплаты = ТекСтрока.НомерОчереди;
				ТДоговорЗаключен = ТекСтрока.ДоговорЗаключен;
				ТФормаВыплаты = ТекСтрока.ФормаВыплаты;
				ТРасчетныйСчет = ТекСтрока.РасчетныйСчет;
				ТРКОпоШаблону = ТекСтрока.РКОПоШаблону;
				ТЭтоРеестр = ТекСтрока.ЭтоРеестр;
				ТРасчетныйСчетОрганизации = ТекСтрока.РасчетныйСчетОрганизации;
				ЕстьИЛ = Ложь;
				
				ВыплатнойРеестр = Документы.уп_ВыплатныеРеестры.СоздатьДокумент();
				ВыплатнойРеестр.Организация = Объект.Организация;
				ВыплатнойРеестр.ТипВыплаты = объект.ТипВыплаты;
				ВыплатнойРеестр.Модуль = Объект.Модуль;
				ВыплатнойРеестр.ОтражатьВБухгалтерскомУчете = Объект.ОтражатьВБухгалтерскомУчете;
				ВыплатнойРеестр.уп_ВидДеятельности = Объект.уп_ВидДеятельности;
				ВыплатнойРеестр.Ответственный = Объект.Ответственный;
				
				Если Объект.ПереключательДатыФормированияДокументов = 0 тогда
					ЧислоЗаписи = РегистрыСведений.уп_ДатыОчередей.Получить(Новый Структура("НомерОчереди",ТОчередностьВыплаты)).ДатаВМесяце;
					Если НЕ ЗначениеЗаполнено(ЧислоЗаписи) тогда
						ЧислоЗаписи = 1;
					КонецЕсли;				
					МесяцЗаписи = Месяц(Объект.ДатаФормированияДокументов);
					ГодЗаписи = Год(Объект.ДатаФормированияДокументов);
					ДатаЗаписи = Дата(ГодЗаписи, МесяцЗаписи, ЧислоЗаписи); 
					ВыплатнойРеестр.Дата = КонецДня(ДатаЗаписи);
					ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(ДатаЗаписи);
				Иначе
					ВыплатнойРеестр.Дата = КонецДня(Объект.ДатаФормированияДокументов);
					ВыплатнойРеестр.ДатаФормированияДокумента = КонецДня(Объект.ДатаФормированияДокументов);
				КонецЕсли;
				
				ВыплатнойРеестр.ПодразделениеОрганизации = ТПодразделение;
				ВыплатнойРеестр.Получатель = ТПолучатель;
				Выплатнойреестр.РасчетныйСчет = ТРасчетныйСчет;
				ВыплатнойРеестр.НомерОчереди = ТОчередностьВыплаты;
				ВыплатнойРеестр.ФормаВыплаты = ТФормаВыплаты;
				Если НЕ ВыплатнойРеестр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Касса Тогда
					ВыплатнойРеестр.РасчетныйСчетОрганизации = ТРасчетныйСчетОрганизации;
				КонецЕсли;
				СчетчикСтрокВДокументе = 0;
				
				СоответствиеДокументу = Новый Соответствие();
				СоответствиеДокументу.Вставить("Получатель",ТекСтрока.ПолучательВПлПор);
				СоответствиеДокументу.Вставить("ОчередностьВыплаты",ТекСтрока.НомерОчереди);
			КонецЕсли;
						
			//запись строки документа
			СтрокаДокумента = ВыплатнойРеестр.СписокПенсионеровПДС.Добавить();
			СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
			СтрокаДокумента.Участник = ТекСтрока.Участник;
			СтрокаДокумента.ДоверенноеЛицо = ТекСтрока.ДоверенноеЛицо;
			СтрокаДокумента.НомерСчета = ТекСтрока.ПС;
			СтрокаДокумента.ПенсионныйДоговор = ТекСтрока.ПС.Владелец;
			СтрокаДокумента.НомерЛицевогоСчета = ТекСтрока.НомерЛицевогоСчета;
			СтрокаДокумента.Сумма = ТекСтрока.Сумма;
			СтрокаДокумента.НДФЛ = ТекСтрока.НДФЛ;
			СтрокаДокумента.Выплата = ТекСтрока.Сумма-ТекСтрока.НДФЛ;
			СтрокаДокумента.НачалоПериодаНачисления = ТекСтрока.НачалоПериода;
			ТУчастник = ТекСтрока.Участник; 
			
			Если Объект.ФормироватьОбщиеРеестры Тогда
				СтрокаДокумента.Получатель = ТекСтрока.ПолучательТЧ;
				СтрокаДокумента.РасчетныйСчет = ТекСтрока.РасчетныйСчетТЧ;
			КонецЕсли;	
			
			
			если Н = ТЗ.Количество()-1 тогда
				Если ЕстьИЛ Тогда
					ПересчитатьДокументПДССУчетомИЛ(ВыплатнойРеестр);
				КонецЕсли;	
				
				Если Объект.ФормироватьОбщиеРеестры Тогда
					ВыплатнойРеестр.Реестр = ТЭтоРеестр;
				КонецЕсли;
				
				РассчитатьРКО(объект.ТипВыплаты, ВыплатнойРеестр, ТРКОпоШаблону);
				
				ВыплатнойРеестр.Записать();
				НоваяВыплата = Объект.НовыеНачисления.Добавить();
				НоваяВыплата.Документ = ВыплатнойРеестр.Ссылка;
				НоваяВыплата.Получатель = ВыплатнойРеестр.Получатель;
				НоваяВыплата.ТипВыплаты = ВыплатнойРеестр.ТипВыплаты;
				НоваяВыплата.СуммаДокумента = ВыплатнойРеестр.СуммаДокумента;
			КонецЕсли;
		Конеццикла;	

	КонецЕсли;	
	#Вставка
	// +ХМНПФ 18.03.2016 ШадринАВ // ЗаписатьДокументы() // №280
	Если Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС
		ИЛИ Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС
		ИЛИ Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС
		ИЛИ Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.СрочнаяПенсияОПС
		ИЛИ Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапитала Тогда
		Для Каждого стр Из Объект.НовыеНачисления Цикл
			ВыплатнойРеестр = стр.Документ.ПолучитьОбъект();
			ВыплатнойРеестр.ХМ_ВыплатаПоВозвратам = ЭтотОбъект["ХМ_ВыплатаПоВозвратам"];
			// +ХМНПФ 07.09.2017 ШадринАВ // ЗаписатьДокументы() // №1159
			ХМ_Сдвиг = ?(ЭтотОбъект["ХМ_ВыплатаПоВозвратам"],1200,1800); // ХМНПФ 22.02.2018 КлименкоМИ // ЗаписатьДокументы() // №1367
			ВыплатнойРеестр.Дата = ВыплатнойРеестр.Дата - ХМ_Сдвиг;
			ВыплатнойРеестр.ДатаФормированияДокумента = ВыплатнойРеестр.ДатаФормированияДокумента - ХМ_Сдвиг;
			// -ХМНПФ 07.09.2017 ШадринАВ // ЗаписатьДокументы() // №1159
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(ВыплатнойРеестр);
		КонецЦикла;
	КонецЕсли;
	// -ХМНПФ 18.03.2016 ШадринАВ // ЗаписатьДокументы() // №280
	// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
	//		ЗафиксироватьТранзакцию();	
	//	Исключение
	//		ЗафиксироватьТранзакцию();
	//	КонецПопытки;
	#КонецВставки
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОтменитьНаСервере")
Процедура ХМОтменитьНаСервере()
	
	ТабУдаляемыхДок = Объект.НовыеНачисления.Выгрузить(,"Документ").ВыгрузитьКолонку("Документ");
	#Вставка
		// ХМНПФ 16.10.2025 ЛыткинАМ // http://redmine.npf.com/issues/4670
		ТабУдаляемыхДок = Новый Массив();
		для Н = 0 по Объект.НовыеНачисления.Количество()-1 цикл
			Док = Объект.НовыеНачисления[Н].Документ.Ссылка;
			Если Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий И Док.Проведен = Ложь Тогда
				ДокОбъект = Док.ПолучитьОбъект();
				ДокОбъект.ОбменДанными.Загрузка = Истина;
				ДокОбъект.Удалить();                
			Иначе
				ТабУдаляемыхДок.Добавить(Док);
			КонецЕсли;
		конеццикла;
	#КонецВставки
	//ТабУдаляемыхДок = Объект.НовыеНачисления.ВыгрузитьКолонку("Документ");
	уп_ОбработчикУдаления.УдалитьСозданныеДокументы(ТабУдаляемыхДок);
	//для Н = 0 по НовыеНачисления.Количество()-1 цикл
	//	Док = НовыеНачисления[Н].Документ.Ссылка;
	//	Док.ПолучитьОбъект().Удалить();
	//конеццикла;
КонецПроцедуры


&НаСервере
// ХМНПФ 30.10.2015 ШадринАВ // Новая ХМ_ПрименитьНаСервере() // №13
Процедура ХМ_ПрименитьНаСервере()
	ДокОбъект = Документы.ХМ_СводныйВыплатнойРеестр.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(ДокОбъект,Объект);
	ДокОбъект.НовыеНачисления.Загрузить(Объект.НовыеНачисления.Выгрузить());
	ДокОбъект.Дата = Объект.ДатаФормированияДокументов;
	ДокОбъект.Дата1 = Период.ДатаНачала;
	ДокОбъект.Дата2 = Период.ДатаОкончания;
	ДокОбъект.Записать();
КонецПроцедуры

&НаКлиенте
// ХМНПФ 30.10.2015 ШадринАВ // Новая ХМ_СводныйРеестрПриИзменении() // №13
Процедура ХМ_СводныйРеестрПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ЭтотОбъект["ХМ_СводныйРеестр"]) Тогда
		ХМ_СводныйРеестрПриИзмененииНаСервере();
		ХМ_Обновить(Неопределено);		
		Период.ДатаНачала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект["ХМ_СводныйРеестр"], "Дата1");
		Период.ДатаОкончания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект["ХМ_СводныйРеестр"], "Дата2");
		ЕстьНеутвержденныеДокументы = Ложь;
		Элементы.Отменить.Доступность = Ложь;
		Элементы.Применить.Доступность = Ложь;
		Элементы.Сформировать.Доступность = Ложь;
		Элементы.ХМ_Провести.Доступность = Ложь;
		Элементы.ХМ_СоздатьРСПоРазовымПП.Доступность = Ложь;
		Элементы.Группа9.ТекущаяСтраница = Элементы.Группа11;
	Иначе
		Объект.НовыеНачисления.Очистить();
		Объект.ДатаФормированияДокументов = ТекущаяДата();
		Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь(); //ПараметрыСеанса.ТекущийПользователь;
		Объект.ПереключательДатыФормированияДокументов = 1;
		Период.ДатаНачала = Началодня(ТекущаяДата());
		Период.ДатаОкончания = КонецДня(ТекущаяДата());
		ЕстьНеутвержденныеДокументы = Ложь;
		Элементы.Отменить.Доступность = Ложь;
		Элементы.Применить.Доступность = Ложь;
		Элементы.Сформировать.Доступность = Истина;
		Элементы.ХМ_Провести.Доступность = Ложь;
		Элементы.ХМ_СоздатьРСПоРазовымПП.Доступность = Ложь;
		Элементы.Группа9.ТекущаяСтраница = Элементы.Группа10;
	КонецЕсли;
	УправлениеСтраницами();
КонецПроцедуры

&НаСервере
// ХМНПФ 30.10.2015 ШадринАВ // Новая ХМ_СводныйРеестрПриИзмененииНаСервере() // №13
Процедура ХМ_СводныйРеестрПриИзмененииНаСервере()
	ЗаполнитьЗначенияСвойств(Объект,ЭтотОбъект["ХМ_СводныйРеестр"],,"НовыеНачисления");
	Объект.НовыеНачисления.Загрузить(ЭтотОбъект["ХМ_СводныйРеестр"].НовыеНачисления.Выгрузить());
КонецПроцедуры

&НаСервере
// ХМНПФ 15.01.2016 ЛыткинАМ // Новая ХМ_ОбработкатьТЗДокумента() // №0
Процедура ХМ_ОбработкатьТЗДокумента(ТЗДокумента)
	ТЗДокумента.Колонки.Удалить("ПодразделениеБУ");
	ТЗДокумента.Колонки.Добавить("ПодразделениеБУ");
	// +ХМНПФ 18.02.2016 ШадринАВ // ХМ_ОбработкатьТЗДокумента() // №219 // не актуально 30.05.2017
	//ТЗДокумента.Колонки.Добавить("ХМ_ЕстьДоговорСБанком");
	// -ХМНПФ 18.02.2016 ШадринАВ // ХМ_ОбработкатьТЗДокумента() // №219
	
	//+ХМНПФ 13.11.2023 ХлопцевБА//группировка счетов выплачиваемых на почту// №3706  
	////ТЗДокумента.Колонки.Добавить("ДоставочныйДень",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата)); 
	ТЗДокумента.Колонки.Добавить("ДоставочныйДень",ОбщегоНазначения.ОписаниеТипаЧисло(2));
	ФормаВыплатыПочта = Новый Массив;
	ФормаВыплатыПочта.Добавить(Перечисления.уп_ФормыВыплаты.Почта);  
	ФормаВыплатыПочта.Добавить(Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДом); 
	ФормаВыплатыПочта.Добавить(Перечисления.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением);  
	ФормаВыплатыПочта.Добавить(Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением);  
	//+ХМНПФ 13.11.2023 ХлопцевБА//группировка счетов выплачиваемых на почту// №3706 
		
	// +ХМНПФ 30.05.2017 ШадринАВ // ХМ_ОбработкатьТЗДокумента() // №1035
	Если ЗначениеЗаполнено(ЭтотОбъект["ХМ_ОтборДоговорОПС"]) Тогда
		ОтборПоДоговоруОПС = Новый Структура("ПС",ЭтотОбъект["ХМ_ОтборДоговорОПС"]);
		ТЗДокумента = ТЗДокумента.Скопировать(ОтборПоДоговоруОПС);
		ТЗДокумента.ЗаполнитьЗначения(Справочники.БанковскиеСчета.ПустаяСсылка(),"РасчетныйСчет");
	КонецЕсли;
	// -ХМНПФ 30.05.2017 ШадринАВ // ХМ_ОбработкатьТЗДокумента() // №1035
	// +ХМНПФ 23.01.2020 ШадринАВ // ХМ_ОбработкатьТЗДокумента() // №2632
	ХМ_ПрименитьПроцентУдержания(ТЗДокумента);
	// -ХМНПФ 23.01.2020 ШадринАВ // ХМ_ОбработкатьТЗДокумента() // №2632
	УстановитьНачалоПериода = Ложь;
	УстановитьПолучателя = Ложь;
	Если Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВзносов Тогда
		УстановитьНачалоПериода = Истина;
	ИначеЕсли Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам или Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам Тогда   //расторженцы и наследники
		УстановитьНачалоПериода = Истина;
	ИначеЕсли Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойПФ Тогда
		УстановитьНачалоПериода = Истина;
	ИначеЕсли Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
		УстановитьНачалоПериода = Истина;
		УстановитьПолучателя = Истина;
	ИначеЕсли Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС Тогда
		УстановитьНачалоПериода = Истина;
	ИначеЕсли Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапитала Тогда
		УстановитьНачалоПериода = Истина;
	КонецЕсли;
	
	//Если УстановитьНачалоПериода Тогда
	//	Для каждого СтрокаТЗ Из ТЗДокумента Цикл
	//		СтрокаТЗ.НачалоПериода = КонецДня(Объект.ДатаФормированияДокументов);
	//	КонецЦикла;
	//КонецЕсли;
	
	Если УстановитьПолучателя Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	уп_ПолучателиПоДоговорамОбслуживания.Получатель,
			|	уп_ПолучателиПоДоговорамОбслуживания.ПолучательВПлатежномПоручении,
			|	уп_ПолучателиПоДоговорамОбслуживания.РасчетныйСчет
			|ИЗ
			|	РегистрСведений.уп_ПолучателиПоДоговорамОбслуживания КАК уп_ПолучателиПоДоговорамОбслуживания";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТЗ_Маска = РезультатЗапроса.Выгрузить();
		ТЗ_Маска.Индексы.Добавить("Получатель");
		Для каждого СтрокаДокумент Из ТЗДокумента Цикл
	// +ХМНПФ 01.11.2016 ШадринАВ // ХМ_ОбработкатьТЗДокумента() // №621
			// СтрокиМаска = ТЗ_Маска.НайтиСтроки(Новый Структура("Получатель",СтрокаДокумент.Получатель));
			СтрокиМаска = ТЗ_Маска.НайтиСтроки(Новый Структура("Получатель",СтрокаДокумент.ПолучательВПлПор));
	// -ХМНПФ 01.11.2016 ШадринАВ // ХМ_ОбработкатьТЗДокумента() // №621
			Если СтрокиМаска.Количество()>0 Тогда
				Для каждого СтрокаМаска Из СтрокиМаска Цикл
					СтрокаДокумент.Получатель = СтрокаМаска.ПолучательВПлатежномПоручении;	
					СтрокаДокумент.РасчетныйСчет = СтрокаМаска.РасчетныйСчет;	
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХМ_ХМБ_Пластик.Получатель,
		|	ХМ_ХМБ_Пластик.Маска,
		|	ХМ_ХМБ_Пластик.РасчетныйСчет
		|ИЗ
		|	РегистрСведений.ХМ_ХМБ_Пластик КАК ХМ_ХМБ_Пластик";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_Маска = РезультатЗапроса.Выгрузить();
	ТЗ_Маска.Индексы.Добавить("Получатель");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	хм_ДоставочныеУчасткиУчастников.Участок КАК Участок,
		|	хм_ДоставочныеУчасткиУчастников.Участник КАК Участник,
		|	хм_ДоставочныеУчастки.ДоставочныйДень КАК ДоставочныйДень
		|ИЗ
		|	РегистрСведений.хм_ДоставочныеУчасткиУчастников КАК хм_ДоставочныеУчасткиУчастников
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.хм_ДоставочныеУчастки КАК хм_ДоставочныеУчастки
		|		ПО хм_ДоставочныеУчасткиУчастников.Участок = хм_ДоставочныеУчастки.Ссылка
		|ГДЕ
		|	хм_ДоставочныеУчасткиУчастников.Участник В(&Участники)";
	
	мНомерСчета = ТЗДокумента.ВыгрузитьКолонку("ПС");  
	мУчастники = Новый Массив;
	Для каждого текНомерСчета из мНомерСчета Цикл 
		мУчастники.Добавить(текНомерСчета.Участник);
	КонецЦикла;		
	Запрос.УстановитьПараметр("Участники", мУчастники);
	
	ДоставочныеУчастки = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаДокумент Из ТЗДокумента Цикл  
		
		Если УстановитьНачалоПериода Тогда
			//Для каждого СтрокаТЗ Из ТЗДокумента Цикл
			СтрокаДокумент.НачалоПериода = КонецДня(Объект.ДатаФормированияДокументов);
			//КонецЦикла;
		КонецЕсли; 
		
		//+ХМНПФ 13.11.2023 ХлопцевБА//группировка счетов выплачиваемых на почту// №3706
		Если Объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий Тогда 
			Если ФормаВыплатыПочта.Найти(СтрокаДокумент.ФормаВыплаты) <> Неопределено Тогда
				КлючПоиска = Новый Структура();
				КлючПоиска.Вставить("Участник",СтрокаДокумент.Участник);
				нСтрока = ДоставочныеУчастки.НайтиСтроки(КлючПоиска); 
				Если нСтрока.Количество() > 0 Тогда
					СтрокаДокумент.ДоставочныйДень	= нСтрока[0].ДоставочныйДень; 
				Иначе   
					СтрокаДокумент.ДоставочныйДень	= 0 
				КонецЕсли;   
			Иначе
				СтрокаДокумент.ДоставочныйДень	= 0 
			КонецЕсли;
		КонецЕсли;
		
		Если УстановитьПолучателя Тогда
			СтрокиМаска = ТЗ_Маска.НайтиСтроки(Новый Структура("Получатель",СтрокаДокумент.Получатель));
		Иначе
			СтрокиМаска = ТЗ_Маска.НайтиСтроки(Новый Структура("Получатель",СтрокаДокумент.ПолучательВПлПор));
		КонецЕсли;
		Если СтрокиМаска.Количество()>0 Тогда
			Для каждого СтрокаМаска Из СтрокиМаска Цикл
				Если Лев(СтрокаДокумент.НомерЛицевогоСчета,СтрДлина(СтрокаМаска.Маска)) = СтрокаМаска.Маска Тогда
					СтрокаДокумент.РасчетныйСчет = СтрокаМаска.РасчетныйСчет;	
				КонецЕсли;
			КонецЦикла;
			//ЛыткинАМ На случай, если не действует выплата по реестрам.
			Если СтрокаДокумент.ДоговорЗаключен = Ложь Тогда
				СтрокаДокумент.РасчетныйСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	// +ХМНПФ 18.02.2016 ШадринАВ // ХМ_ОбработкатьТЗДокумента() // №219 // не актуально 30.05.2017
		 //Попытка
		 //    Банк = СтрокаДокумент.РасчетныйСчет.Банк;
		 //Исключение
		 //    Банк = Справочники.Банки.ПустаяСсылка();
		 //КонецПопытки;
		 //СтрокаДокумент.ХМ_ЕстьДоговорСБанком = РегистрыСведений.уп_ДоговорыСБанками.Получить(Новый Структура("Организация,Банк",Объект.Организация,Банк)).ДоговорЗаключен;
	// -ХМНПФ 18.02.2016 ШадринАВ // ХМ_ОбработкатьТЗДокумента() // №219 // не актуально 30.05.2017
	// +ХМНПФ 30.05.2017 ШадринАВ // ХМ_ОбработкатьТЗДокумента() // №851
		Если ЭтотОбъект["ХМ_ВыплатаПоВозвратам"] И НЕ ЭтотОбъект["ХМ_ГруппироватьВыплатуВозвратовПоБанку"] Тогда
			СтрокаДокумент.ДоговорЗаключен = Ложь;
			СтрокаДокумент.РасчетныйСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
		КонецЕсли;
	// -ХМНПФ 30.05.2017 ШадринАВ // ХМ_ОбработкатьТЗДокумента() // №851
	КонецЦикла;
	
КонецПроцедуры

// ХМНПФ 18.01.2016 ЛыткинАМ // Новая ХМ_Провести() // №0
&НаКлиенте
Процедура ХМ_Провести(Команда)
	ХМ_ПровестиНаСервере();
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

// ХМНПФ 18.01.2016 ЛыткинАМ // Новая ХМ_ПровестиНаСервере() // №0
&НаСервере
Процедура ХМ_ПровестиНаСервере()
	Для каждого СтрокаНач Из Объект.НовыеНачисления Цикл
		ОбъектНач = СтрокаНач.Документ.ПолучитьОбъект();
		ОбъектНач.Оплачено = Истина;
		ОбъектНач.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
	КонецЦикла;
КонецПроцедуры

// ХМНПФ 18.01.2016 ЛыткинАМ // Новая ХМ_СоздатьРСПоРазовымПП() // №0
&НаКлиенте
Процедура ХМ_СоздатьРСПоРазовымПП(Команда)
	ХМ_СоздатьРСПоРазовымППНаСервере();
	ХМ_Обновить(Неопределено);
КонецПроцедуры

// ХМНПФ 18.01.2016 ЛыткинАМ // Новая ХМ_СоздатьРСПоРазовымППНаСервере() // №0
&НаСервере
Процедура ХМ_СоздатьРСПоРазовымППНаСервере()
	Для каждого СтрокаНач Из Объект.НовыеНачисления Цикл
		ОбъектНач = СтрокаНач.Документ.ПолучитьОбъект();
		Если Не ЗначениеЗаполнено(ОбъектНач.РасчетныйСчет) Тогда
			 ВыгрузкаТЧ = ОбъектНач.ДоговорыОПС.Выгрузить(,"Участник,НомерЛицевогоСчета");
			 ВыгрузкаТЧ.Свернуть("Участник,НомерЛицевогоСчета");
			 Если ВыгрузкаТЧ.Количество() = 1 Тогда
				 НомерЛицевогоСчета = ОбъектНач.ДоговорыОПС[0].НомерЛицевогоСчета;
				 Участник = ОбъектНач.ДоговорыОПС[0].Участник;
				 
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	Банки.Ссылка
					|ИЗ
					|	Справочник.Банки КАК Банки
					|ГДЕ
					|	Банки.ХМ_Контрагент = &ХМ_Контрагент";
				
				Запрос.УстановитьПараметр("ХМ_Контрагент", ОбъектНач.Получатель);
				
				РезультатЗапроса = Запрос.Выполнить();
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
					ВыборкаДетальныеЗаписи.Следующий();
					ПолучательБанк = ВыборкаДетальныеЗаписи.Ссылка;
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	БанковскиеСчета.Ссылка
						|ИЗ
						|	Справочник.БанковскиеСчета КАК БанковскиеСчета
						|ГДЕ
						|	БанковскиеСчета.Владелец = &Владелец
						|	И БанковскиеСчета.НомерСчета = &НомерСчета
						|	И БанковскиеСчета.Банк = &Банк";
					
					Запрос.УстановитьПараметр("Банк", ПолучательБанк);
					Запрос.УстановитьПараметр("Владелец", Участник);
					Запрос.УстановитьПараметр("НомерСчета", НомерЛицевогоСчета);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Если ВыборкаДетальныеЗаписи.Следующий() Тогда
						ОбъектНач.РасчетныйСчет = ВыборкаДетальныеЗаписи.Ссылка;
					Иначе
						БанковскийСчет = Справочники.БанковскиеСчета.СоздатьЭлемент();
						БанковскийСчет.Наименование = НомерЛицевогоСчета + ", " + ПолучательБанк.Наименование;
						БанковскийСчет.Владелец = Участник;
						БанковскийСчет.НомерСчета = НомерЛицевогоСчета;
						БанковскийСчет.Банк = ПолучательБанк;
						БанковскийСчет.ВалютаДенежныхСредств = Справочники.Валюты.НайтиПоНаименованию("руб.");
						БанковскийСчет.ВидСчета = "Расчетный";
						БанковскийСчет.Записать();
						ОбъектНач.РасчетныйСчет = БанковскийСчет.Ссылка;
					КонецЕсли;
					ОбъектНач.Получатель = Участник;
					ОбъектНач.Записать();
				КонецЕсли;
			 КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// ХМНПФ 18.01.2016 ЛыткинАМ // Новая ХМ_Обновить() // №0
&НаКлиенте
Процедура ХМ_Обновить(Команда)
// +ХМНПФ 10.04.2020 МилевскийАЮ // ХМ_ОбновитьНаСервере() // №2776
	//Для каждого ТекСтрока Из Объект.НовыеНачисления Цикл
	//	ТекСтрока.СуммаДокумента = ТекСтрока.Документ.СуммаДокумента;
	//	ТекСтрока.Получатель = ТекСтрока.Документ.Получатель;
	//	ТекСтрока.ТипВыплаты = ТекСтрока.Документ.ТипВыплаты;
	//	ТекСтрока.ХМ_Опл = ТекСтрока.Документ.Оплачено;
	//	ТекСтрока.ХМ_РасчетныйСчет = ТекСтрока.Документ.РасчетныйСчет;
	//	//попытаемся найти, если есть
	//	СписокДокументов = Новый СписокЗначений;
	//	СписокДокументов = ХМ_ФункцииОтчетов.НайтиПодчиненныйПлатежныйДокумент(ТекСтрока.Документ, "ПлатежноеПоручение", СписокДокументов);
	//	СсылкаПП = Неопределено;
	//	Если СписокДокументов.Количество()>0 Тогда
	//		СсылкаПП = СписокДокументов.Получить(0).Значение;
	//		ТекСтрока.ХМ_Платежка = СсылкаПП;
	//	КонецЕсли;
	//КонецЦикла;
	ХМ_ОбновитьНаСервере();
// -ХМНПФ 10.04.2020 МилевскийАЮ // ХМ_ОбновитьНаСервере() // №2776
КонецПроцедуры

// ХМНПФ 10.04.2020 МилевскийАЮ // Новая ХМ_ОбновитьНаСервере() // №2776
&НаСервере
Процедура ХМ_ОбновитьНаСервере()
	Для каждого ТекСтрока Из Объект.НовыеНачисления Цикл
		ТекСтрока.СуммаДокумента = ТекСтрока.Документ.СуммаДокумента;
		ТекСтрока.Получатель = ТекСтрока.Документ.Получатель;
		ТекСтрока.ТипВыплаты = ТекСтрока.Документ.ТипВыплаты;
		ТекСтрока.ХМ_Опл = ТекСтрока.Документ.Оплачено;
		ТекСтрока.ХМ_РасчетныйСчет = ТекСтрока.Документ.РасчетныйСчет;
		//попытаемся найти, если есть
		СписокДокументов = Новый СписокЗначений;
		СписокДокументов = ХМ_ФункцииОтчетов.НайтиПодчиненныйПлатежныйДокумент(ТекСтрока.Документ, "ПлатежноеПоручение", СписокДокументов);
		СсылкаПП = Неопределено;
		Если СписокДокументов.Количество()>0 Тогда
			СсылкаПП = СписокДокументов.Получить(0).Значение;
			ТекСтрока.ХМ_Платежка = СсылкаПП;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// ХМНПФ 23.01.2020 ШадринАВ // Новая ХМ_УдалитьСтрокиТЗ() // №2632
&НаСервереБезКонтекста
Процедура ХМ_УдалитьСтрокиТЗ(мСтрок, ТЗ)
	Для каждого СтрокаУдаление Из мСтрок Цикл
		ТЗ.Удалить(СтрокаУдаление);
	КонецЦикла;
КонецПроцедуры // ХМ_УдалитьСтрокиТЗ()

// ХМНПФ 03.08.2017 ШадринАВ // Новая ХМ_ПолучитьНомерЛС() // №1117
&НаСервере
Функция ХМ_ПолучитьНомерЛС(ДоговорОПС)
	Результат = "";
	МСтрок = ТЗ.НайтиСтроки(Новый Структура("ПС",ДоговорОПС));
	Если МСтрок.Количество() > 0 Тогда
		Результат = МСтрок[0].НомерЛицевогоСчета;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 30.10.2015 ШадринАВ // на форму добавлено поле ХМ_СводныйРеестр // №13
	// ХМНПФ 30.10.2015 ШадринАВ // Новая ХМ_СводныйРеестрПриИзменении() // №13
	// ХМНПФ 30.10.2015 ШадринАВ // Новая ХМ_СводныйРеестрПриИзмененииНаСервере() // №13
	// ХМНПФ 30.10.2015 ШадринАВ // Применить() // №13
	// ХМНПФ 30.10.2015 ШадринАВ // Новая ХМ_ПрименитьНаСервере() // №13
	// ХМНПФ 30.10.2015 ШадринАВ // СформироватьНаСервере() // №13
	// ХМНПФ 30.10.2015 ШадринАВ // Отменить() // №13
	// ХМНПФ 30.10.2015 ШадринАВ // Сформировать() // №13
	// ХМНПФ 15.01.2016 ЛыткинАМ // СформироватьНаСервере() // №0
	// ХМНПФ 15.01.2016 ЛыткинАМ // Новая ХМ_ОбработкатьТЗДокумента() // №0
	// ХМНПФ 18.01.2016 ЛыткинАМ // Новая ХМ_ПриОткрытии() // №0
	// ХМНПФ 18.01.2016 ЛыткинАМ // Новая ХМ_Провести() // №0
	// ХМНПФ 18.01.2016 ЛыткинАМ // Новая ХМ_ПровестиНаСервере() // №0
	// ХМНПФ 18.01.2016 ЛыткинАМ // Новая ХМ_СоздатьРСПоРазовымПП() // №0
	// ХМНПФ 18.01.2016 ЛыткинАМ // Новая ХМ_СоздатьРСПоРазовымППНаСервере() // №0
	// ХМНПФ 18.01.2016 ЛыткинАМ // Новая ХМ_Обновить() // №0
	// ХМНПФ 18.01.2016 ЛыткинАМ // добавлены кнопки: ХМ_Обновить, ХМ_СоздатьРСПоРазовымПП, ХМ_Провести // №0
	// ХМНПФ 18.01.2016 ЛыткинАМ // добавлены в НовыеНачисления сумма и колво в подвал, колонки: ХМ_Опл, ХМ_Платежка, ХМ_РасчетныйСчет // №0
	// ХМНПФ 18.03.2016 ШадринАВ // новые флаги ХМ_ВыплатаПоВозвратамПрочее и ХМ_ВыплатаПоВозвратамПенсии// №280
	// ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВыплатамНаследникамОПС() // №280
	// ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоЕдиновременнойВыплатеОПС() // №280
	// ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВыплатамПенсийОПС() // №280
	// ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВозвратамМатеринскогоКапитала() // №280
	// ХМНПФ 18.03.2016 ШадринАВ // ЗаписатьДокументы() // №280
	// ХМНПФ 19.10.2016 ШадринАВ // ЗаписатьДокументы() // №591
	// ХМНПФ 24.10.2016 ШадринАВ // УправлениеСтраницами() // №607
	// ХМНПФ 04.05.2017 ШадринАВ // СформироватьТЗДокументаПоВыплатамПенсийОПС() // №820
	// ХМНПФ 14.06.2017 ШадринАВ // на форму добавлено поле ХМ_ОтборДоговорОПС // №1035
	// ХМНПФ 03.08.2017 ШадринАВ // Новая ХМ_ПолучитьНомерЛС() // №1117
	// ХМНПФ 03.08.2017 ШадринАВ // ЗаписатьДокументы() // №1117
	// ХМНПФ 26.10.2017 ШадринАВ // СформироватьТЗДокументаПоЕдиновременнойВыплатеОПС() // №1198
	// ХМНПФ 10.05.2018 КлименкоМИ // ЗаписатьДокументы() // №1568
	// ХМНПФ 23.01.2020 ШадринАВ // Новая ХМ_ПрименитьПроцентУдержания() // №2632
	// ХМНПФ 23.01.2020 ШадринАВ // Новая ХМ_УдалитьСтрокиТЗ() // №2632
	// ХМНПФ 10.04.2020 МилевскийАЮ // Новая ХМ_ОбновитьНаСервере() // №2776
	// ХМНПФ 29.06.2020 ШадринАВ // Модуль // №2844
	// ХМНПФ 29.06.2020 ШадринАВ // Новая ХМ_ПриСозданииНаСервере() // №2844
	// ХМНПФ 29.06.2020 ШадринАВ // УправлениеСтраницами() // №2844
	// ХМНПФ 29.06.2020 ШадринАВ // СформироватьТЗДокументаПоВыплатамНаследникамОПС() // №2844
	// ХМНПФ 29.06.2020 ШадринАВ // новый реквизит формы для флага ХМ_ВыплатаПравопреемникамОПСизРОПС // №2844
	// ХМНПФ 05.04.2021 ШадринАВ // новый реквизит формы для флага ХМ_ГруппироватьВыплатуВозвратовПоБанку // №3164
КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	ХМДобавитьРеквизитыФормы();

	//ЛыткинАМ// 2024.10.30 // https://redmine.npf.com/issues/3949
	// +ХМНПФ 29.06.2020 ШадринАВ // Модуль // №2844 
	ХМ_РаботаСФормами.уп_ФормированиеВыплатныхРеестровПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка); 
	// -ХМНПФ 29.06.2020 ШадринАВ // Модуль // №2844
КонецПроцедуры

&НаКлиенте
Процедура ХМПриОткрытииПеред(Отказ)
	// +ХМНПФ 18.01.2016 ЛыткинАМ // ПриСозданииНаСервере()
	Элементы.ХМ_Провести.Доступность = Ложь;
	Элементы.ХМ_СоздатьРСПоРазовымПП.Доступность = Ложь;
	// -ХМНПФ 18.01.2016 ЛыткинАМ // ПриСозданииНаСервере()
КонецПроцедуры

Процедура ХМДобавитьРеквизитыФормы() 
	
	уп_ДинамическиеЭлементыСервер.ХМ_ДобавитьРеквизит(ЭтаФорма,"ХМ_ВыплатаПоВозвратам",Новый ОписаниеТипов("Булево"),,"Выплата по возвратам");
	уп_ДинамическиеЭлементыСервер.ХМ_ДобавитьРеквизит(ЭтаФорма,"ХМ_ВыплатаПравопреемникамОПСизРОПС",Новый ОписаниеТипов("Булево"),,"Выплата правопреемникам ОПС из РОПС");
	уп_ДинамическиеЭлементыСервер.ХМ_ДобавитьРеквизит(ЭтаФорма,"ХМ_ГруппироватьВыплатуВозвратовПоБанку",Новый ОписаниеТипов("Булево"),,"Группировать выплату возвратов по банк");
	уп_ДинамическиеЭлементыСервер.ХМ_ДобавитьРеквизит(ЭтаФорма,"ХМ_Опл",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(4)),"Объект.НовыеНачисления","Опл");
	уп_ДинамическиеЭлементыСервер.ХМ_ДобавитьРеквизит(ЭтаФорма,"ХМ_РасчетныйСчет",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(20)),"Объект.НовыеНачисления","Расчетный счет"); 
	уп_ДинамическиеЭлементыСервер.ХМ_ДобавитьРеквизит(ЭтаФорма,"ГоризонтОстатковПоНачислениям",Новый ОписаниеТипов("Дата"),,"Горизонт остатков по начислениям"); 
	уп_ДинамическиеЭлементыСервер.ХМ_ДобавитьРеквизит(ЭтаФорма,"ИспользоватьОтборПС",Новый ОписаниеТипов("Булево"),,"Использовать отбор"); 
	уп_ДинамическиеЭлементыСервер.ХМ_ДобавитьРеквизит(ЭтаФорма,"ИспользоватьОтборФормаВыплаты",Новый ОписаниеТипов("Булево"),,"Использовать отбор"); 
	уп_ДинамическиеЭлементыСервер.ХМ_ДобавитьРеквизит(ЭтаФорма,"ХМ_УстановитьВКачествеПолучателяУчастникаИЗаполнитьРС_НПО",Новый ОписаниеТипов("Булево"),,"Установить в качестве получателя участника и заполнить Р/С (НПО)"); 
    	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.ПлатежноеПоручение"));
	уп_ДинамическиеЭлементыСервер.ХМ_ДобавитьРеквизит(ЭтаФорма,"ХМ_Платежка",Новый ОписаниеТипов(МассивТипов),"Объект.НовыеНачисления","Платежка");	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.уп_ДоговорыОПС"));
	уп_ДинамическиеЭлементыСервер.ХМ_ДобавитьРеквизит(ЭтаФорма,"ХМ_ОтборДоговорОПС",Новый ОписаниеТипов(МассивТипов),,"Отбор по договору ОПС");
   	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.ХМ_СводныйВыплатнойРеестр"));
	уп_ДинамическиеЭлементыСервер.ХМ_ДобавитьРеквизит(ЭтаФорма,"ХМ_СводныйРеестр",Новый ОписаниеТипов(МассивТипов),,"Сводный выплатной реестр");	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.уп_ПенсионныеСчета"));
	уп_ДинамическиеЭлементыСервер.ХМ_ДобавитьРеквизит(ЭтаФорма,"хм_ОтборПС",Новый ОписаниеТипов(МассивТипов),,"Отбор пенс. счет");
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.уп_ФормыВыплаты"));
	уп_ДинамическиеЭлементыСервер.ХМ_ДобавитьРеквизит(ЭтаФорма,"хм_ОтборФормаВыплаты",Новый ОписаниеТипов(МассивТипов),,"Отбор форма выплаты");
   		
КонецПроцедуры

Процедура ХМДополнитьФорму() 
	
	СвойстваГруппы = Новый Структура();
	СвойстваГруппы.Вставить("Группировка",ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	СвойстваГруппы.Вставить("ОтображатьЗаголовок",Ложь);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьОбычнуюГруппу(ЭтаФорма,"ХМ_ГруппаВыплатаПоВозвратамПенсии",Элементы.Группа2,СвойстваГруппы);
	
	СвойстваГруппы = Новый Структура();
	СвойстваГруппы.Вставить("Отображение",ОтображениеОбычнойГруппы.СлабоеВыделение);
	СвойстваГруппы.Вставить("ОтображатьЗаголовок",Ложь);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьОбычнуюГруппу(ЭтаФорма,"ХМ_Группа12",ЭтаФорма,СвойстваГруппы);
	
	СвойстваГруппы = Новый Структура();
	СвойстваГруппы.Вставить("Вид",ВидГруппыФормы.Подменю); 
	СвойстваГруппы.Вставить("Заголовок","Создать Р/с"); 
	СвойстваГруппы.Вставить("ВставитьПередЭлементом", Элементы.Применить);  
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьОбычнуюГруппу(ЭтаФорма,"СоздатьРС",Элементы.ФормаКоманднаяПанель,СвойстваГруппы);
	
	СвойстваГруппы = Новый Структура();
	СвойстваГруппы.Вставить("ОтображатьЗаголовок",Ложь);
	СвойстваГруппы.Вставить("СквозноеВыравнивание",СквозноеВыравнивание.Использовать);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьОбычнуюГруппу(ЭтаФорма,"ГруппаПачки",Элементы.Группа6,СвойстваГруппы);	
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьОбычнуюГруппу(ЭтаФорма,"Группа15",Элементы.ГруппаОтборыНПОиОПС,СвойстваГруппы);	
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьОбычнуюГруппу(ЭтаФорма,"Группа16",Элементы.ГруппаОтборыНПОиОПС,СвойстваГруппы);	
		
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("Вид", ВидПоляФормы.ПолеФлажка);  
	СвойстваПоля.Вставить("ВставитьПередЭлементом", Элементы["ХМ_ГруппироватьВыплатуВозвратовПоБанку"]);  
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ВыплатаПоВозвратамПрочее",Элементы.ГруппаСтраницаНастройкиПрочее,"ХМ_ВыплатаПоВозвратам",СвойстваПоля);	
	
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("Вид", ВидПоляФормы.ПолеФлажка);  
	СвойстваПоля.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Право);  
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_УстановитьВКачествеПолучателяУчастникаИЗаполнитьРС_НПО",Элементы.ГруппаФормироватьОбщиеРеестры,"ХМ_УстановитьВКачествеПолучателяУчастникаИЗаполнитьРС_НПО");	
    	
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("Вид",ВидДекорацииФормы.Картинка); 
	СвойстваПоля.Вставить("Высота",1);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьДекорацию(ЭтаФорма,"Декорация3",Элементы["ХМ_ГруппаВыплатаПоВозвратамПенсии"],СвойстваПоля);
	
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("Вид", ВидПоляФормы.ПолеФлажка);  
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ВыплатаПоВозвратамПенсии",Элементы["ХМ_ГруппаВыплатаПоВозвратамПенсии"],"ХМ_ВыплатаПоВозвратам",СвойстваПоля);	
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ГоризонтОстатковПоНачислениям",Элементы["ХМ_ГруппаВыплатаПоВозвратамПенсии"],"ГоризонтОстатковПоНачислениям");	
	
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("Вид", ВидПоляФормы.ПолеФлажка);  
	СвойстваПоля.Вставить("Заголовок", "По пачкам не более");  
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ПоПачкам",Элементы["ГруппаПачки"],"Объект.ПоПачкам",СвойстваПоля);	
    СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Право);  
	СвойстваПоля.Вставить("Заголовок", "записей"); 
	СвойстваПоля.Вставить("КнопкаРегулирования", Истина);	
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"КоличествоВПачке",Элементы["ГруппаПачки"],"Объект.КоличествоВПачке",СвойстваПоля);	
	
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"хм_ОтборПС",Элементы["Группа15"],"хм_ОтборПС");	 
	уп_ДинамическиеЭлементыСервер.ХМ_УставноитьДействие(Элементы["хм_ОтборПС"],"ПриИзменении","НПФ_хм_ОтборПСПриИзменении");
	
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("Вид", ВидПоляФормы.ПолеФлажка);  
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ИспользоватьОтборПС",Элементы["Группа15"],"ИспользоватьОтборПС",СвойстваПоля);	
    
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"хм_ОтборФормаВыплаты",Элементы["Группа16"],"хм_ОтборФормаВыплаты");
	уп_ДинамическиеЭлементыСервер.ХМ_УставноитьДействие(Элементы["хм_ОтборФормаВыплаты"],"ПриИзменении","НПФ_хм_ОтборФормаВыплатыПриИзменении");
	
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("Вид", ВидПоляФормы.ПолеФлажка);  
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ИспользоватьОтборФормаВыплаты",Элементы["Группа16"],"ИспользоватьОтборФормаВыплаты",СвойстваПоля);    
	
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("Вид", ВидПоляФормы.ПолеФлажка);  
	СвойстваПоля.Вставить("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Право);  
	СвойстваПоля.Вставить("ВставитьПередЭлементом", Элементы.НовыеНачисленияДокумент);  
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_Опл",Элементы.НовыеНачисления,"Объект.НовыеНачисления.ХМ_Опл",СвойстваПоля);
	
	СвойстваПоля = Новый Структура();
	СвойстваПоля.Вставить("ВставитьПередЭлементом", Элементы.НовыеНачисленияТипВыплаты);  
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_РасчетныйСчет",Элементы.НовыеНачисления,"Объект.НовыеНачисления.ХМ_РасчетныйСчет",СвойстваПоля);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_Платежка",Элементы.НовыеНачисления,"Объект.НовыеНачисления.ХМ_Платежка");
	
    уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_ОтборДоговорОПС",Элементы["ХМ_Группа12"],"ХМ_ОтборДоговорОПС");
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_СводныйРеестр",Элементы["ХМ_Группа12"],"ХМ_СводныйРеестр");		
	уп_ДинамическиеЭлементыСервер.ХМ_УставноитьДействие(Элементы["ХМ_СводныйРеестр"],"ПриИзменении","ХМ_СводныйРеестрПриИзменении");

	
	СвойстваКоманды = Новый Структура();
	СвойстваКоманды.Вставить("ВставитьПередЭлементом",Элементы.Сформировать);
	СвойстваКоманды.Вставить("Отображение",ОтображениеКнопки.Картинка);
	СвойстваКоманды.Вставить("Картинка",БиблиотекаКартинок.Обновить);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьКомандуСКнопкой(ЭтаФорма,"ХМ_Обновить","Обновить",Элементы.ФормаКоманднаяПанель,СвойстваКоманды); 
	СвойстваКоманды = Новый Структура();
	СвойстваКоманды.Вставить("Картинка",БиблиотекаКартинок.ТОПомощникПодключения16);	
	СвойстваКоманды.Вставить("Отображение",ОтображениеКнопки.КартинкаИТекст);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьКомандуСКнопкой(ЭтаФорма,"ХМ_СоздатьРСПоРазовымПП","Создать Р/с (ОПС)",Элементы["СоздатьРС"],СвойстваКоманды);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьКомандуСКнопкой(ЭтаФорма,"ХМ_СоздатьРСПоРазовымПП_НПО","Создать Р/с (НПО)",Элементы["СоздатьРС"]);
	СвойстваКоманды = Новый Структура();
	СвойстваКоманды.Вставить("ВставитьПередЭлементом",Элементы.Применить);
	СвойстваКоманды.Вставить("Отображение",ОтображениеКнопки.КартинкаИТекст);
	СвойстваКоманды.Вставить("Картинка",БиблиотекаКартинок.ДебетКредит);
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьКомандуСКнопкой(ЭтаФорма,"ХМ_Провести","Провести",Элементы.ФормаКоманднаяПанель,СвойстваКоманды); 
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьКомандуСКнопкой(ЭтаФорма,"ХМНастроитьОплатуЧерезРеестр","Настроить оплату через реестр",Элементы.ФормаКоманднаяПанель);	
	
	Элементы.НовыеНачисления.Подвал = Истина;
	Элементы.НовыеНачисленияСуммаДокумента.ПутьКДаннымПодвала = "Объект.НовыеНачисления.ИтогСуммаДокумента";
КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("СформироватьНаСервере")
Процедура ХМСформироватьНаСервере()
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не указан ответственный.",,);
		Возврат;
	КонецЕсли;
	
	ТЗДокумента = Новый ТаблицаЗначений();
	ТЗДокумента.Колонки.Добавить("Участник", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	//ТЗДокумента.Колонки.Добавить("ПС"); 
	СписокТиповПС = Новый Массив; 
    СписокТиповПС.Добавить(Тип("СправочникСсылка.уп_ПенсионныеСчета")); 
    СписокТиповПС.Добавить(Тип("СправочникСсылка.уп_ДоговорыОПС")); 
    СписокТиповПС.Добавить(Тип("СправочникСсылка.пдс_ПенсионныеСчетаПДС"));
    ОписаниеСоставногоТипаПС = Новый ОписаниеТипов(СписокТиповПС);	
	ТЗДокумента.Колонки.Добавить("ПС", ОписаниеСоставногоТипаПС); 
	
	ТЗДокумента.Колонки.Добавить("Схема", Новый ОписаниеТипов("СправочникСсылка.уп_ПенсионныеСхемы"));
	ТЗДокумента.Колонки.Добавить("ФормаВыплаты", Новый ОписаниеТипов("ПеречислениеСсылка.уп_ФормыВыплаты"));
	ТЗДокумента.Колонки.Добавить("ТипЛицевогоСчета", Новый ОписаниеТипов("ПеречислениеСсылка.уп_ТипыЛицевыхСчетов"));
	ТЗДокумента.Колонки.Добавить("НомерЛицевогоСчета", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(30)));
	ТЗДокумента.Колонки.Добавить("ПереводНаСчет", Новый ОписаниеТипов("Булево"));
	ТЗДокумента.Колонки.Добавить("НомерСчетаПриемник", Новый ОписаниеТипов("СправочникСсылка.уп_ПенсионныеСчета"));
	ТЗДокумента.Колонки.Добавить("Получатель", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЗДокумента.Колонки.Добавить("ПолучательВПлПор", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЗДокумента.Колонки.Добавить("РасчетныйСчет", Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета"));
	ТЗДокумента.Колонки.Добавить("ДоговорЗаключен", Новый ОписаниеТипов("Булево"));
	ТЗДокумента.Колонки.Добавить("НомерОчереди", Новый ОписаниеТипов("Число"));
	ТЗДокумента.Колонки.Добавить("Периодичность", Новый ОписаниеТипов("ПеречислениеСсылка.уп_ПериодичностьВыплат"));
	ТЗДокумента.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТЗДокумента.Колонки.Добавить("СуммаКомпенсации", Новый ОписаниеТипов("Число"));
	ТЗДокумента.Колонки.Добавить("СуммаВосполнения", Новый ОписаниеТипов("Число"));
	ТЗДокумента.Колонки.Добавить("СуммаВозмещения", Новый ОписаниеТипов("Число"));
	ТЗДокумента.Колонки.Добавить("НДФЛ", Новый ОписаниеТипов("Число"));
	ТЗДокумента.Колонки.Добавить("НачалоПериода", Новый ОписаниеТипов("Дата"));
	ТЗДокумента.Колонки.Добавить("КонецПериода", Новый ОписаниеТипов("Дата"));
	ТЗДокумента.Колонки.Добавить("НДФЛ13", Новый ОписаниеТипов("Число"));
	ТЗДокумента.Колонки.Добавить("НДФЛ15", Новый ОписаниеТипов("Число"));
	ТЗДокумента.Колонки.Добавить("НДФЛ18", Новый ОписаниеТипов("Число"));
	ТЗДокумента.Колонки.Добавить("НДФЛ20", Новый ОписаниеТипов("Число"));
	ТЗДокумента.Колонки.Добавить("НДФЛ22", Новый ОписаниеТипов("Число"));

	СписокТиповДокументов = Новый Массив;
    СписокТиповДокументов.Добавить(Тип("ДокументСсылка.уп_ПоступлениеВзносов"));
    СписокТиповДокументов.Добавить(Тип("ДокументСсылка.уп_ДокументРегистрации")); 
    СписокТиповДокументов.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
    СписокТиповДокументов.Добавить(Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет"));
    ОписаниеСоставногоТипаДокументов = Новый ОписаниеТипов(СписокТиповДокументов);	
	ТЗДокумента.Колонки.Добавить("ДокументРегистрации", ОписаниеСоставногоТипаДокументов);
	
	ТЗДокумента.Колонки.Добавить("ДоверенноеЛицо", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЗДокумента.Колонки.Добавить("ПодразделениеБУ", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	
	СписокТиповСумм = Новый Массив;
    СписокТиповСумм.Добавить(Тип("СправочникСсылка.уп_ТипыСуммОПС"));
    СписокТиповСумм.Добавить(Тип("СправочникСсылка.уп_ТипыСумм"));
    СписокТиповСумм.Добавить(Тип("СправочникСсылка.пдс_ТипыСуммПДС"));
    ОписаниеСоставногоТипаСуммы = Новый ОписаниеТипов(СписокТиповСумм);	
	ТЗДокумента.Колонки.Добавить("ТипСуммы", ОписаниеСоставногоТипаСуммы); 
	
	СписокТиповПенсии = Новый Массив;
    СписокТиповПенсии.Добавить(Тип("ПеречислениеСсылка.уп_ТипыПенсийОПС"));
    СписокТиповПенсии.Добавить(Тип("ПеречислениеСсылка.уп_ТипыПенсионныхСхем"));
    ОписаниеСоставногоТипаПенсии = Новый ОписаниеТипов(СписокТиповПенсии);	
	ТЗДокумента.Колонки.Добавить("ТипПенсии", ОписаниеСоставногоТипаПенсии); 
	
	ТЗДокумента.Колонки.Добавить("ПричинаЗакрытия", Новый ОписаниеТипов("ПеречислениеСсылка.уп_ПричиныЗакрытияДоговораОПС"));
	ТЗДокумента.Колонки.Добавить("ЕстьИсполнительныйЛист", Новый ОписаниеТипов("Число"));
	
	СписокТиповРКО = Новый Массив;
    СписокТиповРКО.Добавить(Тип("Булево"));
    СписокТиповРКО.Добавить(Тип("NULL"));
    ОписаниеСоставногоТипаРКО = Новый ОписаниеТипов(СписокТиповРКО);	
	ТЗДокумента.Колонки.Добавить("РКОПоШаблону", ОписаниеСоставногоТипаРКО);
	
	ТЗДокумента.Колонки.Добавить("ПолучательТЧ", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЗДокумента.Колонки.Добавить("РасчетныйСчетТЧ", Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета"));
	ТЗДокумента.Колонки.Добавить("ЭтоРеестр", Новый ОписаниеТипов("Булево"));
	ТЗДокумента.Колонки.Добавить("РасчетныйСчетОрганизации", Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчета"));
	
	Если (Элементы.ТипВыплаты <> Перечисления.уп_ТипыВыплат.ВыплатыПенсий
		и Элементы.ТипВыплаты <> Перечисления.уп_ТипыВыплат.ВыплатыПенсийПДС
		и Элементы.ТипВыплаты <> Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС
		и Элементы.ТипВыплаты <> Перечисления.уп_ТипыВыплат.СрочнаяПенсияОПС)
		и (НЕ ЗначениеЗаполнено(Период.ДатаНачала) или НЕ ЗначениеЗаполнено(Период.ДатаОкончания)) Тогда
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Не указан временной интервал.",,);
	иначе
		
		СформироватьТЗДокумента(ТЗДокумента);
		
		Элементы.Сформировать.Доступность = Ложь;
		Элементы.Отменить.Доступность = Истина;
		Элементы.Применить.Доступность = Истина;
		//ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Провести.Доступность = Истина;
		ЕстьНеутвержденныеДокументы = Истина;
		Элементы.Группа9.ТекущаяСтраница = Элементы.Группа11;
		
		#Вставка
		// +ХМНПФ 30.10.2015 ШадринАВ // СформироватьНаСервере() // №13
		Элементы.ХМ_СводныйРеестр.Доступность = Ложь;
		Элементы.ХМ_Провести.Доступность = Истина;
		Элементы.ХМ_СоздатьРСПоРазовымПП.Доступность = Истина;
		// -ХМНПФ 30.10.2015 ШадринАВ // СформироватьНаСервере() // №13
		// +ХМНПФ 15.01.2016 ЛыткинАМ // СформироватьНаСервере() // №0
		ХМ_ОбработкатьТЗДокумента(ТЗДокумента);
		// -ХМНПФ 15.01.2016 ЛыткинАМ // СформироватьНаСервере() // №0 группировка по подразделениям не нужна
       	#КонецВставки
		ТЗ = ТЗДокумента.Скопировать();
		
		ЗаписатьДокументы();
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("Сформировать")
Процедура ХМСформировать(Команда)

	Если Объект.ФормироватьОбщиеРеестры И Элементы.ОткрытьПолучателиПоРеестрам.Заголовок = "Получатели для реестров (НЕ ЗАПОЛНЕНО)" Тогда
		ПоказатьПредупреждение(,"Не заданы получатели по реестрам");	
		Возврат;	
	КонецЕсли;

	СформироватьНаСервере();
	ОповеститьОбИзменении(Тип("ДокументСсылка.уп_ВыплатныеРеестры"));

	#Вставка
	// +ХМНПФ 30.10.2015 ШадринАВ // Сформировать() // №13
	ХМ_Обновить(Неопределено);
	// -ХМНПФ 30.10.2015 ШадринАВ // Сформировать() // №13
	#КонецВставки
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("Применить")
Процедура ХМПрименить(Команда)
	#Вставка
	// +ХМНПФ 30.10.2015 ШадринАВ // Применить() // №13
	ХМ_ПрименитьНаСервере();
	Элементы.ХМ_Провести.Доступность = Ложь;
	Элементы.ХМ_СоздатьРСПоРазовымПП.Доступность = Ложь;
	Элементы.ХМ_СводныйРеестр.Доступность = Истина;
	// -ХМНПФ 30.10.2015 ШадринАВ // Применить() // №13
	#КонецВставки
	ЕстьНеутвержденныеДокументы = Ложь;
	Элементы.Отменить.Доступность = Ложь;
	Элементы.Применить.Доступность = Ложь;
	//ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Провести.Доступность = Ложь;
	Элементы.Сформировать.Доступность = Истина;
	Объект.НовыеНачисления.Очистить();
	Элементы.Группа9.ТекущаяСтраница = Элементы.Группа10;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("Отменить")
Процедура ХМОтменить(Команда)

	ОтменитьНаСервере();
	Объект.НовыеНачисления.Очистить();	
	ЕстьНеутвержденныеДокументы = Ложь;
	Элементы.Отменить.Доступность = Ложь;
	Элементы.Применить.Доступность = Ложь;
	//ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Провести.Доступность = Ложь;
	Элементы.Сформировать.Доступность = Истина;
	Элементы.Группа9.ТекущаяСтраница = Элементы.Группа10;
	ОповеститьОбИзменении(Тип("ДокументСсылка.уп_ВыплатныеРеестры"));

	#Вставка
	// +ХМНПФ 30.10.2015 ШадринАВ // Отменить() // №13
	Элементы.ХМ_Провести.Доступность = Ложь;
	Элементы.ХМ_СоздатьРСПоРазовымПП.Доступность = Ложь;
	Элементы.ХМ_СводныйРеестр.Доступность = Истина;
	// -ХМНПФ 30.10.2015 ШадринАВ // Отменить() // №13
    #КонецВставки
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СформироватьТЗДокументаПоВозвратамМатеринскогоКапитала")
Процедура ХМСформироватьТЗДокументаПоВозвратамМатеринскогоКапитала(ТЗДокумента)
	ТекстОтбора = "";
	ТекстОтбора = ТекстОтбора + ?(объект.ИспользоватьОтборДоговорОПС," И ДоговорОПС В ИЕРАРХИИ (&ДоговорОПС)","");
	ТекстОтбора = ТекстОтбора + ?(объект.ИспользоватьОтборПодразделение," И ДоговорОПС.ПодразделениеБУ В ИЕРАРХИИ (&Подразделение)","");
	ТекстОтбора = ТекстОтбора + ?(объект.ИспользоватьОтборФилиал," И ДоговорОПС.Филиал В ИЕРАРХИИ (&Филиал)","");

	//сначала смотрим остатки на начало периода
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаНачальныйОстаток, 0) КАК НачОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКонечныйОстаток, 0) КАК КонОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаПриход, 0) КАК Приход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаРасход, 0) КАК Расход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКомпенсацииНачальныйОстаток, 0) КАК КомпенсацииНачОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКомпенсацииКонечныйОстаток, 0) КАК КомпенсацииКонОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКомпенсацииПриход, 0) КАК КомпенсацииПриход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКомпенсацииРасход, 0) КАК КомпенсацииРасход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВосполненияНачальныйОстаток, 0) КАК ВосполненияНачОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВосполненияКонечныйОстаток, 0) КАК ВосполненияКонОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВосполненияПриход, 0) КАК ВосполненияПриход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВосполненияРасход, 0) КАК ВосполненияРасход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВозмещенияНачальныйОстаток, 0) КАК ВозмещенияНачОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВозмещенияКонечныйОстаток, 0) КАК ВозмещенияКонОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВозмещенияПриход, 0) КАК ВозмещенияПриход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВозмещенияРасход, 0) КАК ВозмещенияРасход,
	|	ПрочиеНачисленияОПСОстаткиИОбороты.ДоговорОПС,
	|	ПрочиеНачисленияОПСОстаткиИОбороты.Участник
	|ИЗ
	|	РегистрНакопления.уп_ПрочиеНачисленияОПС.ОстаткиИОбороты(
	|			&Дата1,
	|			&Дата2,
	|			Период,
	|			,
	|			Организация = &Организация  "+ТекстОтбора+"
	#Вставка
	// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВозвратамМатеринскогоКапитала() // №280
	|				И ХМ_Возврат = &ХМ_ВыплатаПоВозвратам
	// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВозвратамМатеринскогоКапитала() // №280				   
	#КонецВставки
	|				И ТипВыплаты = &ТипВыплаты) КАК ПрочиеНачисленияОПСОстаткиИОбороты
	|ГДЕ
	|	ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКонечныйОстаток <> &СуммаНоль";


	#Вставка
	// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВозвратамМатеринскогоКапитала() // №280
	Запрос.УстановитьПараметр("ХМ_ВыплатаПоВозвратам",ЭтотОбъект["ХМ_ВыплатаПоВозвратам"]);
	// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВозвратамМатеринскогоКапитала() // №280
  	#КонецВставки	

	Запрос.УстановитьПараметр("Дата1",НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация",объект.Организация);
	Запрос.УстановитьПараметр("ТипВыплаты",объект.ТипВыплаты);
	Запрос.УстановитьПараметр("СуммаНоль",0);
	Запрос.УстановитьПараметр("Подразделение", объект.ОтборПодразделение);
	Запрос.УстановитьПараметр("Филиал", объект.ОтборФилиал);
	Запрос.УстановитьПараметр("ДоговорОПС", объект.ОтборДоговорОПС);

	ТЗОстатков = Запрос.Выполнить().Выгрузить();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПрочиеНачисленияОПСОбороты.Участник,
	|	ПрочиеНачисленияОПСОбороты.Период,
	|	ПрочиеНачисленияОПСОбороты.СуммаПриход,
	|	ПрочиеНачисленияОПСОбороты.СуммаКомпенсацииПриход,
	|	ПрочиеНачисленияОПСОбороты.СуммаВосполненияПриход,
	|	ПрочиеНачисленияОПСОбороты.СуммаВозмещенияПриход,
	|	ПрочиеНачисленияОПСОбороты.ДоговорОПС
	|ИЗ
	|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
	|			&Дата1,
	|			&Дата2,
	|			День,
	|			Организация = &Организация  "+ТекстОтбора+"
	#Вставка
	// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВозвратамМатеринскогоКапитала() // №280
	|				И ХМ_Возврат = &ХМ_ВыплатаПоВозвратам
	// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВозвратамМатеринскогоКапитала() // №280				   
	#КонецВставки
	|				И ТипВыплаты = &ТипВыплаты) КАК ПрочиеНачисленияОПСОбороты";

	#Вставка
	// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВозвратамМатеринскогоКапитала() // №280
	Запрос.УстановитьПараметр("ХМ_ВыплатаПоВозвратам",ЭтотОбъект["ХМ_ВыплатаПоВозвратам"]);
	// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВозвратамМатеринскогоКапитала() // №280
    #КонецВставки
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация",объект.Организация);
	Запрос.УстановитьПараметр("ТипВыплаты",объект.ТипВыплаты);
	Запрос.УстановитьПараметр("Подразделение", объект.ОтборПодразделение);
	Запрос.УстановитьПараметр("Филиал", объект.ОтборФилиал);
	Запрос.УстановитьПараметр("ДоговорОПС", объект.ОтборДоговорОПС);

	ТЗОборотов = Запрос.Выполнить().Выгрузить();

	Для каждого стр из ТЗОстатков Цикл
		Если стр.Расход = 0 Тогда //тогда по движениям
			НаборСтрок = ТЗОборотов.НайтиСтроки(Новый Структура("Участник,ДоговорОПС",стр.Участник,стр.ДоговорОПС));
			Для каждого СтрокаНабора из НаборСтрок Цикл
				НовСтр = ТЗДокумента.Добавить();
				НовСтр.ПС = СтрокаНабора.ДоговорОПС;
				НовСтр.ПодразделениеБУ = стр.ДоговорОПС.ПодразделениеБУ;
				НовСтр.Участник = СтрокаНабора.Участник;
				НовСтр.Сумма = СтрокаНабора.СуммаПриход;
				НовСтр.СуммаКомпенсации = СтрокаНабора.СуммаКомпенсацииПриход;
				НовСтр.СуммаВосполнения = СтрокаНабора.СуммаВосполненияПриход;
				НовСтр.СуммаВозмещения = СтрокаНабора.СуммаВозмещенияПриход;
				Если ЗначениеЗаполнено(Объект.ДатаФормированияДокументов) Тогда
					Если СтрокаНабора.Период>=КонецДня(Объект.ДатаФормированияДокументов) Тогда
						НовСтр.НачалоПериода = СтрокаНабора.Период;
					Иначе
						НовСтр.НачалоПериода = Объект.ДатаФормированияДокументов;
					КонецЕсли;
				Иначе
					НовСтр.НачалоПериода = СтрокаНабора.Период;
				КонецЕсли;
				НовСтр.Получатель = стр.Участник;
				НовСтр.РасчетныйСчет = стр.Участник.ОсновнойБанковскийСчет;
				НовСтр.ДоговорЗаключен = Ложь;
			КонецЦикла;
			// и если было начальное сальдо
			Если НЕ НеУчитыватьЗадолженность Тогда
				Если стр.НачОст>0 Тогда
					НовСтр = ТЗДокумента.Добавить();
					НовСтр.ПС = стр.ДоговорОПС;
					НовСтр.ПодразделениеБУ = стр.ДоговорОПС.ПодразделениеБУ;
					НовСтр.Участник = стр.Участник;
					НовСтр.Сумма = стр.НачОст;
					НовСтр.СуммаКомпенсации = стр.КомпенсацииНачОст;
					НовСтр.СуммаВосполнения = стр.ВосполненияНачОст;
					НовСтр.СуммаВозмещения = стр.ВозмещенияНачОст;
					Если ЗначениеЗаполнено(Объект.ДатаФормированияДокументов) Тогда
						НовСтр.НачалоПериода = Объект.ДатаФормированияДокументов;
					Иначе
						НовСтр.НачалоПериода = Период.ДатаНачала;
					КонецЕсли;
					НовСтр.Получатель = стр.Участник;
					НовСтр.РасчетныйСчет = стр.Участник.ОсновнойБанковскийСчет;
					НовСтр.ДоговорЗаключен = Ложь;
				КонецЕсли;	
			КонецЕсли;
		Иначе   //тогда по дате конца периода
			Если НЕ НеУчитыватьЗадолженность Тогда
				НовСтр = ТЗДокумента.Добавить();
				НовСтр.ПС = стр.ДоговорОПС;
				НовСтр.ПодразделениеБУ = стр.ДоговорОПС.ПодразделениеБУ;
				НовСтр.Участник = стр.Участник;
				НовСтр.Сумма = стр.КонОст;
				НовСтр.СуммаКомпенсации = стр.КомпенсацииКонОст;
				НовСтр.СуммаВосполнения = стр.ВосполненияКонОст;
				НовСтр.СуммаВозмещения = стр.ВозмещенияКонОст;
				Если ЗначениеЗаполнено(Объект.ДатаФормированияДокументов) Тогда
					НовСтр.НачалоПериода = Объект.ДатаФормированияДокументов;
				Иначе
					НовСтр.НачалоПериода = Период.ДатаОкончания;
				КонецЕсли;
				НовСтр.Получатель = стр.Участник;
				НовСтр.РасчетныйСчет = стр.Участник.ОсновнойБанковскийСчет;
				НовСтр.ДоговорЗаключен = Ложь;
			Иначе
				Если стр.КонОст>стр.НачОст Тогда   //были невыплаченные начисления за указанный период
					НовСтр = ТЗДокумента.Добавить();
					НовСтр.ПС = стр.ДоговорОПС;
					НовСтр.ПодразделениеБУ = стр.ДоговорОПС.ПодразделениеБУ;
					НовСтр.Участник = стр.Участник;
					НовСтр.Сумма = стр.КонОст - стр.НачОст;
					НовСтр.СуммаКомпенсации = стр.КомпенсацииКонОст - стр.КомпенсацииНачОст;
					НовСтр.СуммаВосполнения = стр.ВосполненияКонОст - стр.ВосполненияНачОст;
					НовСтр.СуммаВозмещения = стр.ВозмещенияКонОст - стр.ВозмещенияНачОст;
					Если ЗначениеЗаполнено(Объект.ДатаФормированияДокументов) Тогда
						НовСтр.НачалоПериода = Объект.ДатаФормированияДокументов;
					Иначе
						НовСтр.НачалоПериода = Период.ДатаОкончания;
					КонецЕсли;
					НовСтр.Получатель = стр.Участник;
					НовСтр.РасчетныйСчет = стр.Участник.ОсновнойБанковскийСчет;
					НовСтр.ДоговорЗаключен = Ложь;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СформироватьТЗДокументаПоВыплатамНаследникамОПС")
Процедура ХМСформироватьТЗДокументаПоВыплатамНаследникамОПС(ТЗДокумента)
	ТекстОтбора = "";
	ТекстОтбора = ТекстОтбора + ?(объект.ИспользоватьОтборДоговорОПС," И ДоговорОПС В ИЕРАРХИИ (&ДоговорОПС)","");
	ТекстОтбора = ТекстОтбора + ?(объект.ИспользоватьОтборПодразделение," И ДоговорОПС.ПодразделениеБУ В ИЕРАРХИИ (&Подразделение)","");
	ТекстОтбора = ТекстОтбора + ?(объект.ИспользоватьОтборФилиал," И ДоговорОПС.Филиал В ИЕРАРХИИ (&Филиал)","");
	
	//сначала смотрим остатки на начало периода
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаНачальныйОстаток, 0) КАК НачОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКонечныйОстаток, 0) КАК КонОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаПриход, 0) КАК Приход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаРасход, 0) КАК Расход,"+?(объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС,"
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКомпенсацииНачальныйОстаток, 0) КАК КомпенсацииНачОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКомпенсацииКонечныйОстаток, 0) КАК КомпенсацииКонОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКомпенсацииПриход, 0) КАК КомпенсацииПриход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКомпенсацииРасход, 0) КАК КомпенсацииРасход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВосполненияНачальныйОстаток, 0) КАК ВосполненияНачОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВосполненияКонечныйОстаток, 0) КАК ВосполненияКонОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВосполненияПриход, 0) КАК ВосполненияПриход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВосполненияРасход, 0) КАК ВосполненияРасход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВозмещенияНачальныйОстаток, 0) КАК ВозмещенияНачОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВозмещенияКонечныйОстаток, 0) КАК ВозмещенияКонОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВозмещенияПриход, 0) КАК ВозмещенияПриход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВозмещенияРасход, 0) КАК ВозмещенияРасход,","
	|    0 КАК КомпенсацииНачОст,
	|    0 КАК КомпенсацииКонОст,
	|    0 КАК КомпенсацииПриход,
	|    0 КАК КомпенсацииРасход,
	|    0 КАК ВосполненияНачОст,
	|    0 КАК ВосполненияКонОст,
	|    0 КАК ВосполненияПриход,
	|    0 КАК ВосполненияРасход,
	|    0 КАК ВозмещенияНачОст,
	|    0 КАК ВозмещенияКонОст,
	|    0 КАК ВозмещенияПриход,
	|    0 КАК ВозмещенияРасход,")+"
	|	ПрочиеНачисленияОПСОстаткиИОбороты.ДоговорОПС,
	|	ПрочиеНачисленияОПСОстаткиИОбороты.Участник,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.НалогНачальныйОстаток, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияНачальныйОстаток, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке18НачальныйОстаток, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке20НачальныйОстаток, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке22НачальныйОстаток, 0) КАК НалогНачОст,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.НалогКонечныйОстаток, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияКонечныйОстаток, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке18КонечныйОстаток, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке20КонечныйОстаток, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке22КонечныйОстаток, 0) КАК НалогКонОст,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.НалогПриход, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПриход, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке18Приход, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке20Приход, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке22Приход, 0) КАК НалогПриход,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.НалогРасход, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияРасход, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке18Расход, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке20Расход, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке22Расход, 0) КАК НалогРасход,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.НалогНачальныйОстаток, 0) КАК НДФЛ13НачОст,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияНачальныйОстаток, 0) КАК НДФЛ15НачОст,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке18НачальныйОстаток, 0) КАК НДФЛ18НачОст,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке20НачальныйОстаток, 0) КАК НДФЛ20НачОст,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке22НачальныйОстаток, 0) КАК НДФЛ22НачОст,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.НалогКонечныйОстаток, 0) КАК НДФЛ13КонОст,   
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияКонечныйОстаток, 0) КАК НДФЛ15КонОст, 
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке18КонечныйОстаток, 0) КАК НДФЛ18КонОст,   
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке20КонечныйОстаток, 0) КАК НДФЛ20КонОст,   
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке22КонечныйОстаток, 0) КАК НДФЛ22КонОст,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.НалогПриход, 0) КАК НДФЛ13Приход,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПриход, 0) КАК НДФЛ15Приход, 
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке18Приход, 0) КАК НДФЛ18Приход,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке20Приход, 0) КАК НДФЛ20Приход,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке22Приход, 0) КАК НДФЛ22Приход,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.НалогРасход, 0) КАК НДФЛ13Расход, 
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияРасход, 0) КАК НДФЛ15Расход, 
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке18Расход, 0) КАК НДФЛ18Расход, 
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке20Расход, 0) КАК НДФЛ20Расход, 
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.СуммаСПревышенияПоСтавке22Расход, 0) КАК НДФЛ22Расход, 
	|	ДоверенныеЛицаУчастниковСрезПоследних.ДоверенноеЛицо,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ФормаВыплаты КАК ФормаВыплаты,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.РасчетныйСчет,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ТипЛицевогоСчета,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.НомерЛицевогоСчета,
	|	уп_ПолучателиПоДоговорамОбслуживания.ПолучательВПлатежномПоручении,
	|	уп_ПолучателиПоДоговорамОбслуживания.РасчетныйСчет КАК РасчетныйСчетВПлатежномПоручении
	|ИЗ
	|	РегистрНакопления.уп_ПрочиеНачисленияОПС.ОстаткиИОбороты(
	|			&Дата1,
	|			&Дата2,
	|			Период,
	|			,
	|			Организация = &Организация  "+ТекстОтбора+"
	#Вставка 
	// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВыплатамНаследникамОПС() // №280
	|				И ХМ_Возврат = &ХМ_ВыплатаПоВозвратам
	// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВыплатамНаследникамОПС() // №280				 
	// +ХМНПФ 29.06.2020 ШадринАВ // СформироватьТЗДокументаПоВыплатамНаследникамОПС() // №2844
	|"+?(ЭтотОбъект["ХМ_ВыплатаПравопреемникамОПСизРОПС"],"И ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервОПС)","И НЕ ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервОПС)")+"
	// -ХМНПФ 29.06.2020 ШадринАВ // СформироватьТЗДокументаПоВыплатамНаследникамОПС() // №2844
	#КонецВставки
	|				И ТипВыплаты = &ТипВыплаты) КАК ПрочиеНачисленияОПСОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_НДФЛУчастниковРасчетыСБюджетом.ОстаткиИОбороты(&Дата1, &Дата2, Период, , Организация = &Организация и ВидРасчета = &ВидРасчета) КАК НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты
	|		ПО ПрочиеНачисленияОПСОстаткиИОбороты.ДоговорОПС = НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.НомерСчета
	|			И ПрочиеНачисленияОПСОстаткиИОбороты.Участник = НДФЛУчастниковРасчетыСБюджетомОстаткиИОбороты.Участник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ДоверенныеЛицаУчастников.СрезПоследних(&Дата2, ) КАК ДоверенныеЛицаУчастниковСрезПоследних
	|		ПО ПрочиеНачисленияОПСОстаткиИОбороты.Участник = ДоверенныеЛицаУчастниковСрезПоследних.Участник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ЛицевыеСчетаЗастрахованныхЛиц.СрезПоследних(&Дата2, ) КАК уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПолучателиПоДоговорамОбслуживания КАК уп_ПолучателиПоДоговорамОбслуживания
	|			ПО уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк = уп_ПолучателиПоДоговорамОбслуживания.Получатель
	|		ПО ПрочиеНачисленияОПСОстаткиИОбороты.ДоговорОПС = уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ДоговорОПС
	|			И ПрочиеНачисленияОПСОстаткиИОбороты.Участник = уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ЗастрахованноеЛицо
	|ГДЕ
	|	ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКонечныйОстаток <> &СуммаНоль
	//|    И  ЕстьNULL(уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.НеДействует,ЛОЖЬ)<> ИСТИНА";
	|	И ЕСТЬNULL(уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.НеДействует, ЛОЖЬ) <> ИСТИНА"+?(Объект.ИспользоватьОтборПолучатель ," 
	|	И (уп_ПолучателиПоДоговорамОбслуживания.ПолучательВПлатежномПоручении = &Получатель ИЛИ уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк = &Получатель)","")+"
	|";
    #Вставка 
	// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВыплатамНаследникамОПС() // №280
	Запрос.УстановитьПараметр("ХМ_ВыплатаПоВозвратам",ЭтотОбъект["ХМ_ВыплатаПоВозвратам"]);
	// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВыплатамНаследникамОПС() // №280
    #КонецВставки
	
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация",объект.Организация);
	Запрос.УстановитьПараметр("ТипВыплаты",объект.ТипВыплаты);
	Запрос.УстановитьПараметр("СуммаНоль",0);
	Запрос.УстановитьПараметр("ДатаНач",ДобавитьМесяц(НачалоДня(Период.ДатаНачала),-24));
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ВидРасчета",ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаПравопреемникамОПС);
	Запрос.УстановитьПараметр("Подразделение", объект.ОтборПодразделение);
	Запрос.УстановитьПараметр("Филиал", объект.ОтборФилиал);
	Запрос.УстановитьПараметр("ДоговорОПС", объект.ОтборДоговорОПС);
	Запрос.УстановитьПараметр("Получатель", объект.ОтборПолучатель);
	
	Если объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатПравопреемникамОПС Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "уп_ПрочиеНачисленияОПС", "уп_ВозвратыПрочихНачисленийОПС");
		Запрос.УстановитьПараметр("ТипВыплаты",Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС);
	КонецЕсли;	
	Запрос.Текст = ТекстЗапроса;
	ТЗОстатков = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПрочиеНачисленияОПСОбороты.Участник,
	|	ПрочиеНачисленияОПСОбороты.Период,
	|	ПрочиеНачисленияОПСОбороты.СуммаПриход,"+?(объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС,"
	|	ПрочиеНачисленияОПСОбороты.СуммаКомпенсацииПриход,
	|	ПрочиеНачисленияОПСОбороты.СуммаВосполненияПриход,
	|	ПрочиеНачисленияОПСОбороты.СуммаВозмещенияПриход,","
	|    0 КАК СуммаКомпенсацииПриход,
	|    0 КАК СуммаВосполненияПриход,
	|    0 КАК СуммаВозмещенияПриход,")+"
	|	ПрочиеНачисленияОПСОбороты.ДоговорОПС,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОбороты.НалогПриход, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОбороты.СуммаСПревышенияПриход, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОбороты.СуммаСПревышенияПоСтавке18Приход, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОбороты.СуммаСПревышенияПоСтавке20Приход, 0)+ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОбороты.СуммаСПревышенияПоСтавке22Приход, 0) КАК НалогПриход,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОбороты.НалогПриход, 0) КАК НДФЛ13Приход,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОбороты.СуммаСПревышенияПриход, 0) КАК НДФЛ15Приход, 
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОбороты.СуммаСПревышенияПоСтавке18Приход, 0) КАК НДФЛ18Приход,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОбороты.СуммаСПревышенияПоСтавке20Приход, 0) КАК НДФЛ20Приход,
	|	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОбороты.СуммаСПревышенияПоСтавке22Приход, 0) КАК НДФЛ22Приход,
	|	ДоверенныеЛицаУчастниковСрезПоследних.ДоверенноеЛицо,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ФормаВыплаты КАК ФормаВыплаты,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.РасчетныйСчет,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ТипЛицевогоСчета,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.НомерЛицевогоСчета
	|ИЗ
	|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
	|			&Дата1,
	|			&Дата2,
	|			День,
	|			Организация = &Организация  "+ТекстОтбора+"
	#Вставка
	// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВыплатамНаследникамОПС() // №280
	|				И ХМ_Возврат = &ХМ_ВыплатаПоВозвратам
	// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВыплатамНаследникамОПС() // №280				  
	// +ХМНПФ 29.06.2020 ШадринАВ // СформироватьТЗДокументаПоВыплатамНаследникамОПС() // №2844
	|"+?(ЭтотОбъект["ХМ_ВыплатаПравопреемникамОПСизРОПС"],"И ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервОПС)","И НЕ ТипРезерва = ЗНАЧЕНИЕ(Перечисление.уп_ТипыРезервовОПС.РезервОПС)")+"
	// -ХМНПФ 29.06.2020 ШадринАВ // СформироватьТЗДокументаПоВыплатамНаследникамОПС() // №2844
	#КонецВставки
	|				И ТипВыплаты = &ТипВыплаты) КАК ПрочиеНачисленияОПСОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_НДФЛУчастниковРасчетыСБюджетом.Обороты(&Дата1, &Дата2, День, Организация = &Организация и ВидРасчета = &ВидРасчета) КАК НДФЛУчастниковРасчетыСБюджетомОбороты
	|		ПО ПрочиеНачисленияОПСОбороты.ДоговорОПС = НДФЛУчастниковРасчетыСБюджетомОбороты.НомерСчета
	|			И ПрочиеНачисленияОПСОбороты.Участник = НДФЛУчастниковРасчетыСБюджетомОбороты.Участник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ДоверенныеЛицаУчастников.СрезПоследних(&Дата2, ) КАК ДоверенныеЛицаУчастниковСрезПоследних
	|		ПО ПрочиеНачисленияОПСОбороты.Участник = ДоверенныеЛицаУчастниковСрезПоследних.Участник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ЛицевыеСчетаЗастрахованныхЛиц.СрезПоследних(&Дата2, ) КАК уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних
	|		ПО ПрочиеНачисленияОПСОбороты.ДоговорОПС = уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ДоговорОПС
	|			И ПрочиеНачисленияОПСОбороты.Участник = уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ЗастрахованноеЛицо
	|ГДЕ
	|    ЕстьNULL(уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.НеДействует,ЛОЖЬ)<> ИСТИНА";
	
	#Вставка
	// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВыплатамНаследникамОПС() // №280
	Запрос.УстановитьПараметр("ХМ_ВыплатаПоВозвратам",ЭтотОбъект["ХМ_ВыплатаПоВозвратам"]);
	// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВыплатамНаследникамОПС() // №280
    #КонецВставки
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация",объект.Организация);
	Запрос.УстановитьПараметр("ТипВыплаты",объект.ТипВыплаты);
	Запрос.УстановитьПараметр("ДатаНач",ДобавитьМесяц(НачалоДня(Период.ДатаНачала),-24));
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ВидРасчета",ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаПравопреемникамОПС);
	Запрос.УстановитьПараметр("Подразделение", объект.ОтборПодразделение);
	Запрос.УстановитьПараметр("Филиал", объект.ОтборФилиал);
	Запрос.УстановитьПараметр("ДоговорОПС", объект.ОтборДоговорОПС);
	
	Если объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатПравопреемникамОПС Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "уп_ПрочиеНачисленияОПС", "уп_ВозвратыПрочихНачисленийОПС");
		Запрос.УстановитьПараметр("ТипВыплаты",Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС);
	КонецЕсли;	
	Запрос.Текст = ТекстЗапроса;
	ТЗОборотов = Запрос.Выполнить().Выгрузить();
	
	Почта = Константы.уп_КонтрагентВыплатЧерезПочту.Получить();
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Организация",Объект.Организация);
	ПараметрыОтбора.Вставить("ВидДеятельности",Объект.уп_ВидДеятельности);
	ПараметрыОтбора.Вставить("Подразделение",Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	СтруктураДанныхОсновная = РегистрыСведений.уп_ПолучателиДляВыплатныхРеестров.ПолучитьДанные(ПараметрыОтбора);	
	
	Для каждого стр из ТЗОстатков Цикл
		
		Если стр.Расход = 0 Тогда //тогда по движениям
			НаборСтрок = ТЗОборотов.НайтиСтроки(Новый Структура("Участник,ДоговорОПС",стр.Участник,стр.ДоговорОПС));
			Для каждого СтрокаНабора из НаборСтрок Цикл
				НовСтр = ТЗДокумента.Добавить();
				НовСтр.ПС = СтрокаНабора.ДоговорОПС;
				НовСтр.ПодразделениеБУ = стр.ДоговорОПС.ПодразделениеБУ;
				НовСтр.Участник = СтрокаНабора.Участник;
				НовСтр.Сумма = СтрокаНабора.СуммаПриход;
				НовСтр.СуммаКомпенсации = СтрокаНабора.СуммаКомпенсацииПриход;
				НовСтр.СуммаВосполнения = СтрокаНабора.СуммаВосполненияПриход;
				НовСтр.СуммаВозмещения = СтрокаНабора.СуммаВозмещенияПриход;
				НовСтр.НДФЛ = СтрокаНабора.НалогПриход; 
	#Вставка
				//ЛыткинАМ https://redmine.npf.com/issues/4751
				НовСтр.НДФЛ13 = СтрокаНабора.НДФЛ13Приход;
				НовСтр.НДФЛ15 = СтрокаНабора.НДФЛ15Приход;
				НовСтр.НДФЛ18 = СтрокаНабора.НДФЛ18Приход;
				НовСтр.НДФЛ20 = СтрокаНабора.НДФЛ20Приход;
				НовСтр.НДФЛ22 = СтрокаНабора.НДФЛ22Приход;
    #КонецВставки
	#Удаление
				НовСтр.НДФЛ13 = СтрокаНабора.НДФЛ13;
				НовСтр.НДФЛ15 = СтрокаНабора.НДФЛ15;
				НовСтр.НДФЛ18 = СтрокаНабора.НДФЛ18;
				НовСтр.НДФЛ20 = СтрокаНабора.НДФЛ20;
				НовСтр.НДФЛ22 = СтрокаНабора.НДФЛ22;
    #КонецУдаления
				НовСтр.НачалоПериода = СтрокаНабора.Период;
				НовСтр.ДоверенноеЛицо = СтрокаНабора.ДоверенноеЛицо;
				НовСтр.ТипЛицевогоСчета = СтрокаНабора.ТипЛицевогоСчета;
				НовСтр.НомерЛицевогосчета = СтрокаНабора.НомерЛицевогоСчета;
				НовСтр.ФормаВыплаты = СтрокаНабора.ФормаВыплаты;
				Если СтрокаНабора.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
					//НовСтр.Получатель = стр.Банк;
					//НовСтр.РасчетныйСчет = стр.РасчетныйСчет;
					Если стр.ПолучательВПлатежномПоручении<>Null Тогда
						НовСтр.ПолучательВПлПор = стр.ПолучательВПлатежномПоручении;
						НовСтр.РасчетныйСчет = стр.РасчетныйСчетВПлатежномПоручении;
					Иначе
						НовСтр.ПолучательВПлПор = стр.Банк;
						НовСтр.РасчетныйСчет = стр.РасчетныйСчет;
					КонецЕсли;
					Попытка
						Банк = НовСтр.РасчетныйСчет.Банк;
					Исключение
						//не указаны реквизиты получателя
						Банк = Справочники.Банки.ПустаяСсылка();
					КонецПопытки;
					ДоговорЗаключен = РегистрыСведений.уп_ДоговорыСБанками.Получить(Новый Структура("Организация,Банк",Объект.Организация,Банк)).ДоговорЗаключен;
					Если ДоговорЗаключен Тогда
						НовСтр.ДоговорЗаключен = Истина;
					Иначе
						НовСтр.ДоговорЗаключен = Ложь
					КонецЕсли;
					
				ИначеЕсли СтрокаНабора.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Касса Тогда
					//НовСтр.Получатель = Справочники.Контрагенты.ПустаяСсылка();
					НовСтр.ПолучательВПлПор = Справочники.Контрагенты.ПустаяСсылка();
					НовСтр.РасчетныйСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
					НовСтр.ДоговорЗаключен = Ложь;
				ИначеЕсли СтрокаНабора.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Почта 
					или СтрокаНабора.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДом
					или СтрокаНабора.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением
					или СтрокаНабора.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением Тогда
					//надо разобраться как платят через почту
				ИначеЕсли стр.Участник = Константы.уп_ПенсионныйФондРФ.Получить() Тогда	
					//НовСтр.Получатель = стр.Участник;
					НовСтр.ПолучательВПлПор = стр.Участник;
					НовСтр.РасчетныйСчет = стр.Участник.ОсновнойБанковскийСчет;
					НовСтр.ДоговорЗаключен = Истина;
				КонецЕсли;
				//НовСтр.ДоговорЗаключен = Ложь;
				Если СтрокаНабора.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Почта
					или СтрокаНабора.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДом
					или СтрокаНабора.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением
					или СтрокаНабора.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением Тогда
					//НовСтр.Получатель = Почта;
					НовСтр.ПолучательВПлПор = Почта;
					НовСтр.РасчетныйСчет = Почта.ОсновнойБанковскийСчет;
					НовСтр.ДоговорЗаключен = Истина;
				КонецЕсли;
				
				Если Объект.ФормироватьОбщиеРеестры И стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
					Если стр.Банк.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
						НовСтр.ЭтоРеестр = Истина; 
						НовСтр.ПолучательТЧ = НовСтр.ПолучательВПлПор;
						НовСтр.РасчетныйСчетТЧ = НовСтр.РасчетныйСчет;
						НовСтр.ДоговорЗаключен = Истина; 
						НовСтр.ПолучательВПлПор = СтруктураДанныхОсновная.Контрагент;
						НовСтр.РасчетныйСчет = СтруктураДанныхОсновная.РасчетныйСчет;
						
						Если НЕ НовСтр.ПодразделениеБУ = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
							ПараметрыОтбора = Новый Структура();
							ПараметрыОтбора.Вставить("Организация",Объект.Организация);
							ПараметрыОтбора.Вставить("ВидДеятельности",Объект.уп_ВидДеятельности);
							ПараметрыОтбора.Вставить("Подразделение",НовСтр.ПодразделениеБУ);
							СтруктураДанных = РегистрыСведений.уп_ПолучателиДляВыплатныхРеестров.ПолучитьДанные(ПараметрыОтбора);
							
							Если СтруктураДанных.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
							Иначе
								НовСтр.ПолучательВПлПор = СтруктураДанных.Контрагент;
								НовСтр.РасчетныйСчет = СтруктураДанных.РасчетныйСчет;
							КонецЕсли;
						КонецЕсли;	 
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			// и если было начальное сальдо
			Если НЕ НеУчитыватьЗадолженность Тогда
				Если стр.НачОст>0 Тогда
					НовСтр = ТЗДокумента.Добавить();
					НовСтр.ПС = стр.ДоговорОПС;
					НовСтр.ПодразделениеБУ = стр.ДоговорОПС.ПодразделениеБУ;
					НовСтр.Участник = стр.Участник;
					НовСтр.Сумма = стр.НачОст;
					НовСтр.СуммаКомпенсации = стр.КомпенсацииНачОст;
					НовСтр.СуммаВосполнения = стр.ВосполненияНачОст;
					НовСтр.СуммаВозмещения = стр.ВозмещенияНачОст;
					НовСтр.НДФЛ = стр.НалогНачОст; 
					НовСтр.НДФЛ13 = стр.НДФЛ13НачОст;
					НовСтр.НДФЛ15 = стр.НДФЛ15НачОст;
					НовСтр.НДФЛ18 = стр.НДФЛ18НачОст;
					НовСтр.НДФЛ20 = стр.НДФЛ20НачОст;
					НовСтр.НДФЛ22 = стр.НДФЛ22НачОст;
					НовСтр.НачалоПериода = Период.ДатаНачала;
					НовСтр.ФормаВыплаты = стр.ФормаВыплаты;
					Если стр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
						//НовСтр.Получатель = стр.Банк;
						//НовСтр.РасчетныйСчет = стр.РасчетныйСчет;
						
						Если стр.ПолучательВПлатежномПоручении<>Null Тогда
							НовСтр.ПолучательВПлПор = стр.ПолучательВПлатежномПоручении;
							НовСтр.РасчетныйСчет = стр.РасчетныйСчетВПлатежномПоручении;
						Иначе
							НовСтр.ПолучательВПлПор = стр.Банк;
							НовСтр.РасчетныйСчет = стр.РасчетныйСчет;
						КонецЕсли;
						Попытка
							Банк = НовСтр.РасчетныйСчет.Банк;
						Исключение
							//не указаны реквизиты получателя
							Банк = Справочники.Банки.ПустаяСсылка();
						КонецПопытки;
						ДоговорЗаключен = РегистрыСведений.уп_ДоговорыСБанками.Получить(Новый Структура("Организация,Банк",Объект.Организация,Банк)).ДоговорЗаключен;
						Если ДоговорЗаключен Тогда
							НовСтр.ДоговорЗаключен = Истина;
						Иначе
							НовСтр.ДоговорЗаключен = Ложь
						КонецЕсли;
						
					ИначеЕсли стр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Касса Тогда
						//НовСтр.Получатель = Справочники.Контрагенты.ПустаяСсылка();
						НовСтр.ПолучательВПлПор = Справочники.Контрагенты.ПустаяСсылка();
						НовСтр.РасчетныйСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
						НовСтр.ДоговорЗаключен = Ложь;
					ИначеЕсли стр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Почта Тогда
						//надо разобраться как платят через почту
					ИначеЕсли стр.Участник = Константы.уп_ПенсионныйФондРФ.Получить() Тогда	
						//НовСтр.Получатель = стр.Участник;
						НовСтр.ПолучательВПлПор = стр.Участник;
						НовСтр.РасчетныйСчет = стр.Участник.ОсновнойБанковскийСчет;
						НовСтр.ДоговорЗаключен = Истина;
					КонецЕсли;
					//НовСтр.ДоговорЗаключен = Ложь;
					Если стр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Почта
						или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДом
						или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением
						или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением Тогда
						//НовСтр.Получатель = Почта;
						НовСтр.ПолучательВПлПор = Почта;
						НовСтр.РасчетныйСчет = Почта.ОсновнойБанковскийСчет;
						НовСтр.ДоговорЗаключен = Истина;
					КонецЕсли;	
					Новстр.ДоверенноеЛицо = стр.ДоверенноеЛицо;
					НовСтр.ТипЛицевогоСчета = стр.ТипЛицевогоСчета;
					НовСтр.НомерЛицевогосчета = стр.НомерЛицевогоСчета;
					
					Если Объект.ФормироватьОбщиеРеестры И стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
						Если стр.Банк.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
							НовСтр.ЭтоРеестр = Истина; 
							НовСтр.ПолучательТЧ = НовСтр.ПолучательВПлПор;
							НовСтр.РасчетныйСчетТЧ = НовСтр.РасчетныйСчет;
							НовСтр.ДоговорЗаключен = Истина; 
							НовСтр.ПолучательВПлПор = СтруктураДанныхОсновная.Контрагент;
							НовСтр.РасчетныйСчет = СтруктураДанныхОсновная.РасчетныйСчет;
							
							Если НЕ НовСтр.ПодразделениеБУ = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
								ПараметрыОтбора = Новый Структура();
								ПараметрыОтбора.Вставить("Организация",Объект.Организация);
								ПараметрыОтбора.Вставить("ВидДеятельности",Объект.уп_ВидДеятельности);
								ПараметрыОтбора.Вставить("Подразделение",НовСтр.ПодразделениеБУ);
								СтруктураДанных = РегистрыСведений.уп_ПолучателиДляВыплатныхРеестров.ПолучитьДанные(ПараметрыОтбора);
								
								Если СтруктураДанных.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
								Иначе
									НовСтр.ПолучательВПлПор = СтруктураДанных.Контрагент;
									НовСтр.РасчетныйСчет = СтруктураДанных.РасчетныйСчет;
								КонецЕсли;
							КонецЕсли;	 
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;	
			КонецЕсли;
		Иначе   //тогда по дате конца периода
			Если НЕ НеУчитыватьЗадолженность Тогда
				НовСтр = ТЗДокумента.Добавить();
				НовСтр.ПС = стр.ДоговорОПС;
				НовСтр.ПодразделениеБУ = стр.ДоговорОПС.ПодразделениеБУ;
				НовСтр.Участник = стр.Участник;
				НовСтр.Сумма = стр.КонОст;
				НовСтр.СуммаКомпенсации = стр.КомпенсацииКонОст;
				НовСтр.СуммаВосполнения = стр.ВосполненияКонОст;
				НовСтр.СуммаВозмещения = стр.ВозмещенияКонОст;
				НовСтр.НДФЛ = стр.НалогКонОст; 
				НовСтр.НДФЛ13 = стр.НДФЛ13КонОст; 
				НовСтр.НДФЛ15 = стр.НДФЛ15КонОст; 
				НовСтр.НДФЛ18 = стр.НДФЛ18КонОст; 
				НовСтр.НДФЛ20 = стр.НДФЛ20КонОст; 
				НовСтр.НДФЛ22 = стр.НДФЛ22КонОст; 
				НовСтр.НачалоПериода = Период.ДатаОкончания;
				НовСтр.ФормаВыплаты = стр.ФормаВыплаты;
				Если стр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
					//НовСтр.Получатель = стр.Банк;
					//НовСтр.РасчетныйСчет = стр.РасчетныйСчет;
					
					Если стр.ПолучательВПлатежномПоручении<>Null Тогда
						НовСтр.ПолучательВПлПор = стр.ПолучательВПлатежномПоручении;
						НовСтр.РасчетныйСчет = стр.РасчетныйСчетВПлатежномПоручении;
					Иначе
						НовСтр.ПолучательВПлПор = стр.Банк;
						НовСтр.РасчетныйСчет = стр.РасчетныйСчет;
					КонецЕсли;
					Попытка
						Банк = НовСтр.РасчетныйСчет.Банк;
					Исключение
						//не указаны реквизиты получателя
						Банк = Справочники.Банки.ПустаяСсылка();
					КонецПопытки;
					ДоговорЗаключен = РегистрыСведений.уп_ДоговорыСБанками.Получить(Новый Структура("Организация,Банк",Объект.Организация,Банк)).ДоговорЗаключен;
					Если ДоговорЗаключен Тогда
						НовСтр.ДоговорЗаключен = Истина;
					Иначе
						НовСтр.ДоговорЗаключен = Ложь;
					КонецЕсли;
					
				ИначеЕсли стр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Касса Тогда
					//НовСтр.Получатель = Справочники.Контрагенты.ПустаяСсылка();
					НовСтр.ПолучательВПлПор = Справочники.Контрагенты.ПустаяСсылка();
					НовСтр.РасчетныйСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
					НовСтр.ДоговорЗаключен = Ложь;
				ИначеЕсли стр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Почта
					или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДом
					или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением
					или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением Тогда
					//надо разобраться как платят через почту
				ИначеЕсли стр.Участник = Константы.уп_ПенсионныйФондРФ.Получить() Тогда	
					//НовСтр.Получатель = стр.Участник;
					НовСтр.ПолучательВПлПор = стр.Участник;
					НовСтр.РасчетныйСчет = стр.Участник.ОсновнойБанковскийСчет;
					НовСтр.ДоговорЗаключен = Истина;
				КонецЕсли;
				//НовСтр.Получатель = стр.Участник;
				//НовСтр.ДоговорЗаключен = Ложь;
				Если стр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Почта
					или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДом
					или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением
					или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением Тогда
					//НовСтр.Получатель = Почта;
					НовСтр.ПолучательВПлПор = Почта;
					НовСтр.РасчетныйСчет = Почта.ОсновнойБанковскийСчет;
					НовСтр.ДоговорЗаключен = Истина;
				КонецЕсли;	
				НовСтр.ДоверенноеЛицо = стр.ДоверенноеЛицо;
				НовСтр.ТипЛицевогоСчета = стр.ТипЛицевогоСчета;
				НовСтр.НомерЛицевогосчета = стр.НомерЛицевогоСчета;
				
				Если Объект.ФормироватьОбщиеРеестры И стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
					Если стр.Банк.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
						НовСтр.ЭтоРеестр = Истина; 
						НовСтр.ПолучательТЧ = НовСтр.ПолучательВПлПор;
						НовСтр.РасчетныйСчетТЧ = НовСтр.РасчетныйСчет;
						НовСтр.ДоговорЗаключен = Истина; 
						НовСтр.ПолучательВПлПор = СтруктураДанныхОсновная.Контрагент;
						НовСтр.РасчетныйСчет = СтруктураДанныхОсновная.РасчетныйСчет;
						
						Если НЕ НовСтр.ПодразделениеБУ = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
							ПараметрыОтбора = Новый Структура();
							ПараметрыОтбора.Вставить("Организация",Объект.Организация);
							ПараметрыОтбора.Вставить("ВидДеятельности",Объект.уп_ВидДеятельности);
							ПараметрыОтбора.Вставить("Подразделение",НовСтр.ПодразделениеБУ);
							СтруктураДанных = РегистрыСведений.уп_ПолучателиДляВыплатныхРеестров.ПолучитьДанные(ПараметрыОтбора);
							
							Если СтруктураДанных.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
							Иначе
								НовСтр.ПолучательВПлПор = СтруктураДанных.Контрагент;
								НовСтр.РасчетныйСчет = СтруктураДанных.РасчетныйСчет;
							КонецЕсли;
						КонецЕсли;	 
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Если стр.КонОст>стр.НачОст Тогда   //были невыплаченные начисления за указанный период
					НовСтр = ТЗДокумента.Добавить();
					НовСтр.ПС = стр.ДоговорОПС;
					НовСтр.ПодразделениеБУ = стр.ДоговорОПС.ПодразделениеБУ;
					НовСтр.Участник = стр.Участник;
					НовСтр.Сумма = стр.КонОст - стр.НачОст;
					НовСтр.СуммаКомпенсации = стр.КомпенсацииКонОст - стр.КомпенсацииНачОст;
					НовСтр.СуммаВосполнения = стр.ВосполненияКонОст - стр.ВосполненияНачОст;
					НовСтр.СуммаВозмещения = стр.ВозмещенияКонОст - стр.ВозмещенияНачОст;
					НовСтр.НДФЛ = стр.НалогКонОст - стр.НалогНачОст; 
					НовСтр.НДФЛ13 = стр.НДФЛ13КонОст - стр.НДФЛ13НачОст;
					НовСтр.НДФЛ15 = стр.НДФЛ15КонОст - стр.НДФЛ15НачОст;
					НовСтр.НДФЛ18 = стр.НДФЛ18КонОст - стр.НДФЛ18НачОст;
					НовСтр.НДФЛ20 = стр.НДФЛ20КонОст - стр.НДФЛ20НачОст;
					НовСтр.НДФЛ22 = стр.НДФЛ22КонОст - стр.НДФЛ22НачОст;
					НовСтр.НачалоПериода = Период.ДатаОкончания;
					НовСтр.ФормаВыплаты = стр.ФормаВыплаты;
					Если стр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
						//НовСтр.Получатель = стр.Банк;
						//НовСтр.РасчетныйСчет = стр.РасчетныйСчет;
						
						Если стр.ПолучательВПлатежномПоручении<>Null Тогда
							НовСтр.ПолучательВПлПор = стр.ПолучательВПлатежномПоручении;
							НовСтр.РасчетныйСчет = стр.РасчетныйСчетВПлатежномПоручении;
						Иначе
							НовСтр.ПолучательВПлПор = стр.Банк;
							НовСтр.РасчетныйСчет = стр.РасчетныйСчет;
						КонецЕсли;
						Попытка
							Банк = НовСтр.РасчетныйСчет.Банк;
						Исключение
							//не указаны реквизиты получателя
							Банк = Справочники.Банки.ПустаяСсылка();
						КонецПопытки;
						ДоговорЗаключен = РегистрыСведений.уп_ДоговорыСБанками.Получить(Новый Структура("Организация,Банк",Объект.Организация,Банк)).ДоговорЗаключен;
						Если ДоговорЗаключен Тогда
							НовСтр.ДоговорЗаключен = Истина;
						Иначе
							НовСтр.ДоговорЗаключен = Ложь;
						КонецЕсли;
						
					ИначеЕсли стр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Касса Тогда
						//НовСтр.Получатель = Справочники.Контрагенты.ПустаяСсылка();
						НовСтр.ПолучательВПлПор = Справочники.Контрагенты.ПустаяСсылка();
						НовСтр.РасчетныйСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
						НовСтр.ДоговорЗаключен = Ложь;
					ИначеЕсли стр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Почта
						или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДом
						или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением
						или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением Тогда
						//надо разобраться как платят через почту
					ИначеЕсли стр.Участник = Константы.уп_ПенсионныйФондРФ.Получить() Тогда	
						//НовСтр.Получатель = стр.Участник;
						НовСтр.ПолучательВПлПор = стр.Участник;
						НовСтр.РасчетныйСчет = стр.Участник.ОсновнойБанковскийСчет;
						НовСтр.ДоговорЗаключен = Истина;
					КонецЕсли;
					//НовСтр.Получатель = стр.Участник;
					//НовСтр.ДоговорЗаключен = Ложь;
					Если стр.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Почта
						или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДом
						или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением
						или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением Тогда
						//НовСтр.Получатель = Почта;
						НовСтр.ПолучательВПлПор = Почта;
						НовСтр.РасчетныйСчет = Почта.ОсновнойБанковскийСчет;
						НовСтр.ДоговорЗаключен = Истина;
					КонецЕсли;	
					НовСтр.ДоверенноеЛицо = стр.ДоверенноеЛицо;
					НовСтр.ТипЛицевогоСчета = стр.ТипЛицевогоСчета;
					НовСтр.НомерЛицевогосчета = стр.НомерЛицевогоСчета;
					
					Если Объект.ФормироватьОбщиеРеестры И стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
						Если стр.Банк.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
							НовСтр.ЭтоРеестр = Истина; 
							НовСтр.ПолучательТЧ = НовСтр.ПолучательВПлПор;
							НовСтр.РасчетныйСчетТЧ = НовСтр.РасчетныйСчет;
							НовСтр.ДоговорЗаключен = Истина; 
							НовСтр.ПолучательВПлПор = СтруктураДанныхОсновная.Контрагент;
							НовСтр.РасчетныйСчет = СтруктураДанныхОсновная.РасчетныйСчет;
							
							Если НЕ НовСтр.ПодразделениеБУ = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
								ПараметрыОтбора = Новый Структура();
								ПараметрыОтбора.Вставить("Организация",Объект.Организация);
								ПараметрыОтбора.Вставить("ВидДеятельности",Объект.уп_ВидДеятельности);
								ПараметрыОтбора.Вставить("Подразделение",НовСтр.ПодразделениеБУ);
								СтруктураДанных = РегистрыСведений.уп_ПолучателиДляВыплатныхРеестров.ПолучитьДанные(ПараметрыОтбора);
								
								Если СтруктураДанных.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
								Иначе
									НовСтр.ПолучательВПлПор = СтруктураДанных.Контрагент;
									НовСтр.РасчетныйСчет = СтруктураДанных.РасчетныйСчет;
								КонецЕсли;
							КонецЕсли;	 
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СформироватьТЗДокументаПоВыплатамПенсийОПС")
Процедура ХМСформироватьТЗДокументаПоВыплатамПенсийОПС(ТЗДокумента)
	ТекстОтбора = "";
	ТекстОтбора = ТекстОтбора + ?(объект.ИспользоватьОтборДоговорОПС," И ДоговорОПС В ИЕРАРХИИ (&ДоговорОПС)","");
	ТекстОтбора = ТекстОтбора + ?(объект.ИспользоватьОтборПодразделение," И ДоговорОПС.ПодразделениеБУ В ИЕРАРХИИ (&Подразделение)","");
	ТекстОтбора = ТекстОтбора + ?(объект.ИспользоватьОтборФилиал," И ДоговорОПС.Филиал В ИЕРАРХИИ (&Филиал)","");

	ПенсионныеПравила = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Период.ДатаОкончания, Новый Структура("Организация", объект.Организация));
	ЛицевыеСчетаПоТипамВыплат = ПенсионныеПравила.ЛицевыеСчетаПоТипамВыплат;
	Если  ЛицевыеСчетаПоТипамВыплат Тогда
		ТекстУсловия = ?(Объект.ИспользоватьОтборОчередностьВыплаты," И уп_НомераОчередейОПССрезПоследних.НомерОчереди = &НомерОчереди ","");
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ
		|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ИсполнительныйЛист.Участник КАК Участник,
		|	СУММА(ВЫБОР
		|			КОГДА уп_ДействующиеИсполнительныеЛистыСрезПоследних.Действует
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ЕстьИсполнительныйЛист
		|ПОМЕСТИТЬ ИсполнительныеЛисты
		|ИЗ
		|	РегистрСведений.уп_ДействующиеИсполнительныеЛисты.СрезПоследних(&ДатаДок, ИсполнительныйЛист.Организация = &Организация) КАК уп_ДействующиеИсполнительныеЛистыСрезПоследних
		|ГДЕ
		|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.Действует = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ИсполнительныйЛист.Участник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоверенныеЛицаУчастниковСрезПоследних.ДоверенноеЛицо,
		|	ВЫБОР
		|		КОГДА уп_НачисленияПенсийОПСОстатки.ТипПенсии = &Пожизненная
		|			ТОГДА уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ФормаВыплаты
		|		ИНАЧЕ уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследнихСВ.ФормаВыплаты
		|	КОНЕЦ КАК ФормаВыплаты,
		|	ВЫБОР
		|		КОГДА уп_НачисленияПенсийОПСОстатки.ТипПенсии = &Пожизненная
		|			ТОГДА уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ТипЛицевогоСчета
		|		ИНАЧЕ уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследнихСВ.ТипЛицевогоСчета
		|	КОНЕЦ КАК ТипЛицевогоСчета,
		|	ВЫБОР
		|		КОГДА уп_НачисленияПенсийОПСОстатки.ТипПенсии = &Пожизненная
		|			ТОГДА уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.НомерЛицевогоСчета
		|		ИНАЧЕ уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследнихСВ.НомерЛицевогоСчета
		|	КОНЕЦ КАК НомерЛицевогоСчета,
		|	ВЫБОР
		|		КОГДА уп_НачисленияПенсийОПСОстатки.ТипПенсии = &Пожизненная
		|			ТОГДА уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк
		|		ИНАЧЕ уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследнихСВ.Банк
		|	КОНЕЦ КАК Банк,
		|	ВЫБОР
		|		КОГДА уп_НачисленияПенсийОПСОстатки.ТипПенсии = &Пожизненная
		|			ТОГДА уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.РасчетныйСчет
		|		ИНАЧЕ уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследнихСВ.РасчетныйСчет
		|	КОНЕЦ КАК РасчетныйСчет,
		|	ВЫБОР
		|		КОГДА уп_НачисленияПенсийОПСОстатки.ТипПенсии = &Пожизненная
		|			ТОГДА уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.НеДействует
		|		ИНАЧЕ уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследнихСВ.НеДействует
		|	КОНЕЦ КАК НеДействует,
		|	уп_НачисленияПенсийОПСОстатки.ДоговорОПС,
		|	уп_НачисленияПенсийОПСОстатки.НачПериода КАК НачПериода,
		|	уп_НачисленияПенсийОПСОстатки.ПериодичностьВыплат КАК Периодичность,
		|	уп_НачисленияПенсийОПСОстатки.СуммаОстаток КАК СуммаОстаток,"+?(объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС ИЛИ объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.СрочнаяПенсияОПС
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежНПОПС или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежСВОПС,"
		|	уп_НачисленияПенсийОПСОстатки.СуммаКомпенсацииОстаток КАК КомпенсацииСуммаОстаток,
		|	уп_НачисленияПенсийОПСОстатки.СуммаВосполненияОстаток КАК ВосполненияСуммаОстаток,
		|	уп_НачисленияПенсийОПСОстатки.СуммаВозмещенияОстаток КАК ВозмещенияСуммаОстаток,","
		|    0 КАК КомпенсацииСуммаОстаток, 
		|    0 КАК ВосполненияСуммаОстаток, 
		|    0 КАК ВозмещенияСуммаОстаток,")+" 
		|	уп_НомераОчередейОПССрезПоследних.НомерОчереди КАК НомерОчереди,
		|	уп_НачисленияПенсийОПСОстатки.ДоговорОПС.ПодразделениеБУ КАК ПодразделениеБУ,
		|	уп_НачисленияПенсийОПСОстатки.ДоговорОПС.Участник КАК Участник,
		|	уп_НачисленияПенсийОПСОстатки.ТипПенсии,
		|	ЕСТЬNULL(ИсполнительныеЛисты.ЕстьИсполнительныйЛист, 0) КАК ЕстьИсполнительныйЛист,
		|	уп_СостоянияДоговораОПССрезПоследних.Состояние
		|ПОМЕСТИТЬ ОснТаблица
		|ИЗ
		|	РегистрНакопления.уп_НачисленияПенсийОПС.Остатки(
		|			&ДатаДок,
		|			ДоговорОПС.Организация = &Организация  "+ТекстОтбора+"
		#Вставка
		// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВыплатамПенсийОПС() // №280
		|				И ХМ_Возврат = &ХМ_ВыплатаПоВозвратам
		// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВыплатамПенсийОПС() // №280				   
		#КонецВставки
		|				И ТипПенсии В (&СписокТиповПенсий)) КАК уп_НачисленияПенсийОПСОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_НомераОчередейОПС.СрезПоследних(&ДатаДок, ДоговорОПС.Организация = &Организация) КАК уп_НомераОчередейОПССрезПоследних
		|		ПО уп_НачисленияПенсийОПСОстатки.ДоговорОПС = уп_НомераОчередейОПССрезПоследних.ДоговорОПС
		|			И уп_НачисленияПенсийОПСОстатки.ТипПенсии = уп_НомераОчередейОПССрезПоследних.ТипПенсии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ДоверенныеЛицаУчастников.СрезПоследних(&ДатаДок, ) КАК ДоверенныеЛицаУчастниковСрезПоследних
		|		ПО уп_НачисленияПенсийОПСОстатки.ДоговорОПС.Участник = ДоверенныеЛицаУчастниковСрезПоследних.Участник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ЛицевыеСчетаЗастрахованныхЛиц.СрезПоследних(
		|				&ДатаДок,
		|				Организация = &Организация
		|					И ТипВыплат = &НП) КАК уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних
		|		ПО уп_НачисленияПенсийОПСОстатки.ДоговорОПС = уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ДоговорОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(&ДатаДок, ) КАК уп_СостоянияДоговораОПССрезПоследних
		|		ПО уп_НачисленияПенсийОПСОстатки.ДоговорОПС = уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ЛицевыеСчетаЗастрахованныхЛиц.СрезПоследних(
		|				&ДатаДок,
		|				Организация = &Организация
		|					И ТипВыплат = &СВ) КАК уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследнихСВ
		|		ПО уп_НачисленияПенсийОПСОстатки.ДоговорОПС = уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследнихСВ.ДоговорОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИсполнительныеЛисты КАК ИсполнительныеЛисты
		|		ПО уп_НачисленияПенсийОПСОстатки.ДоговорОПС.Участник = ИсполнительныеЛисты.Участник
		|ГДЕ
		|	уп_СостоянияДоговораОПССрезПоследних.Состояние <> &ПриостановкаВыплат "+ТекстУсловия+"
		#Вставка
		// +ХМНПФ 04.05.2017 ШадринАВ // СформироватьТЗДокументаПоВыплатамПенсийОПС() // №820
		|	И  ЕстьNULL(уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.НеДействует,ЛОЖЬ)<> ИСТИНА
		|	И  ЕстьNULL(уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследнихСВ.НеДействует,ЛОЖЬ)<> ИСТИНА
		// -ХМНПФ 04.05.2017 ШадринАВ // СформироватьТЗДокументаПоВыплатамПенсийОПС() // №820
		#КонецВставки
		|;				   
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ПолучателиПоДоговорамОбслуживания.ПолучательВПлатежномПоручении,
		|	уп_ПолучателиПоДоговорамОбслуживания.РасчетныйСчет КАК РасчетныйСчетПлПор,
		|	ОснТаблица.ДоверенноеЛицо,
		|	ОснТаблица.ФормаВыплаты,
		|	ОснТаблица.ТипЛицевогоСчета,
		|	ОснТаблица.НомерЛицевогоСчета,
		|	ОснТаблица.Банк,
		|	ОснТаблица.РасчетныйСчет КАК РасчетныйСчет,
		|	ОснТаблица.ДоговорОПС,
		|	ОснТаблица.НачПериода,
		|	ОснТаблица.Периодичность,
		|	ОснТаблица.СуммаОстаток,
		|	ОснТаблица.КомпенсацииСуммаОстаток,
		|	ОснТаблица.ВосполненияСуммаОстаток,
		|	ОснТаблица.ВозмещенияСуммаОстаток,
		|	ОснТаблица.НомерОчереди,
		|	ОснТаблица.ПодразделениеБУ,
		|	ОснТаблица.Участник,
		|	ОснТаблица.ТипПенсии,
		|	ОснТаблица.НеДействует,
		|	ОснТаблица.ЕстьИсполнительныйЛист КАК ЕстьИсполнительныйЛист,
		|	ОснТаблица.Состояние
		|ИЗ
		|	ОснТаблица КАК ОснТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПолучателиПоДоговорамОбслуживания КАК уп_ПолучателиПоДоговорамОбслуживания
		|		ПО ОснТаблица.Банк = уп_ПолучателиПоДоговорамОбслуживания.Получатель
		|ГДЕ
		|	ЕСТЬNULL(ОснТаблица.НеДействует, ЛОЖЬ) <> ИСТИНА"+?(Объект.ИспользоватьОтборПолучатель ," 
		|	И (уп_ПолучателиПоДоговорамОбслуживания.ПолучательВПлатежномПоручении = &Получатель ИЛИ ОснТаблица.Банк = &Получатель)","")+"
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФормаВыплаты,
		|	Участник,
		|	НомерОчереди,
		|	НачПериода";

	Иначе
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ
		|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ИсполнительныйЛист.Участник КАК Участник,
		|	СУММА(ВЫБОР
		|			КОГДА уп_ДействующиеИсполнительныеЛистыСрезПоследних.Действует
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ЕстьИсполнительныйЛист
		|ПОМЕСТИТЬ ИсполнительныеЛисты
		|ИЗ
		|	РегистрСведений.уп_ДействующиеИсполнительныеЛисты.СрезПоследних(&ДатаДок, ИсполнительныйЛист.Организация = &Организация) КАК уп_ДействующиеИсполнительныеЛистыСрезПоследних
		|ГДЕ
		|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.Действует = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ИсполнительныйЛист.Участник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПолучателиПоДоговорамОбслуживания.ПолучательВПлатежномПоручении,
		|	ДоверенныеЛицаУчастниковСрезПоследних.ДоверенноеЛицо,
		|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ФормаВыплаты КАК ФормаВыплаты,
		|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ТипЛицевогоСчета КАК ТипЛицевогоСчета,
		|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
		|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк КАК Банк,
		|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.РасчетныйСчет,
		|	уп_НачисленияПенсийОПСОстатки.ДоговорОПС,
		|	уп_НачисленияПенсийОПСОстатки.НачПериода КАК НачПериода,
		|	уп_НачисленияПенсийОПСОстатки.ПериодичностьВыплат КАК Периодичность,
		|	уп_НачисленияПенсийОПСОстатки.СуммаОстаток КАК СуммаОстаток,"+?(объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС ИЛИ объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.СрочнаяПенсияОПС
		или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежНПОПС или объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежСВОПС,"
		|	уп_НачисленияПенсийОПСОстатки.СуммаКомпенсацииОстаток КАК КомпенсацииСуммаОстаток,
		|	уп_НачисленияПенсийОПСОстатки.СуммаВосполненияОстаток КАК ВосполненияСуммаОстаток,
		|	уп_НачисленияПенсийОПСОстатки.СуммаВозмещенияОстаток КАК ВозмещенияСуммаОстаток,","
		|    0 КАК КомпенсацииСуммаОстаток, 
		|    0 КАК ВосполненияСуммаОстаток, 
		|    0 КАК ВозмещенияСуммаОстаток,")+" 
		|	уп_НомераОчередейОПССрезПоследних.НомерОчереди КАК НомерОчереди,
		|	уп_НачисленияПенсийОПСОстатки.ДоговорОПС.ПодразделениеБУ КАК ПодразделениеБУ,
		|	уп_НачисленияПенсийОПСОстатки.ДоговорОПС.Участник КАК Участник,
		|	ПолучателиПоДоговорамОбслуживания.РасчетныйСчет КАК РасчетныйСчетПлПор,
		|	уп_НачисленияПенсийОПСОстатки.ТипПенсии,
		|	ЕСТЬNULL(ИсполнительныеЛисты.ЕстьИсполнительныйЛист, 0) КАК ЕстьИсполнительныйЛист,
		|	уп_СостоянияДоговораОПССрезПоследних.Состояние
		|ИЗ
		|	РегистрНакопления.уп_НачисленияПенсийОПС.Остатки(
		|			&ДатаДок,
		|			ДоговорОПС.Организация = &Организация   "+ТекстОтбора+"
		#Вставка
		// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВыплатамПенсийОПС() // №280
		|				И ХМ_Возврат = &ХМ_ВыплатаПоВозвратам
		// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВыплатамПенсийОПС() // №280					
		#КонецВставки
		|				И ТипПенсии В (&СписокТиповПенсий)) КАК уп_НачисленияПенсийОПСОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_НомераОчередейОПС.СрезПоследних(&ДатаДок, ДоговорОПС.Организация = &Организация) КАК уп_НомераОчередейОПССрезПоследних
		|		ПО уп_НачисленияПенсийОПСОстатки.ДоговорОПС = уп_НомераОчередейОПССрезПоследних.ДоговорОПС
		|			И уп_НачисленияПенсийОПСОстатки.ТипПенсии = уп_НомераОчередейОПССрезПоследних.ТипПенсии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ДоверенныеЛицаУчастников.СрезПоследних(&ДатаДок, ) КАК ДоверенныеЛицаУчастниковСрезПоследних
		|		ПО уп_НачисленияПенсийОПСОстатки.ДоговорОПС.Участник = ДоверенныеЛицаУчастниковСрезПоследних.Участник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ЛицевыеСчетаЗастрахованныхЛиц.СрезПоследних(&ДатаДок, Организация = &Организация) КАК уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПолучателиПоДоговорамОбслуживания КАК ПолучателиПоДоговорамОбслуживания
		|			ПО уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк = ПолучателиПоДоговорамОбслуживания.Получатель
		|		ПО уп_НачисленияПенсийОПСОстатки.ДоговорОПС = уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ДоговорОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияДоговораОПС.СрезПоследних(&ДатаДок, ) КАК уп_СостоянияДоговораОПССрезПоследних
		|		ПО уп_НачисленияПенсийОПСОстатки.ДоговорОПС = уп_СостоянияДоговораОПССрезПоследних.ДоговорОПС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИсполнительныеЛисты КАК ИсполнительныеЛисты
		|		ПО уп_НачисленияПенсийОПСОстатки.ДоговорОПС.Участник = ИсполнительныеЛисты.Участник
		|ГДЕ
		|	уп_СостоянияДоговораОПССрезПоследних.Состояние <> &ПриостановкаВыплат
		#Вставка
		// +ХМНПФ 04.05.2017 ШадринАВ // СформироватьТЗДокументаПоВыплатамПенсийОПС() // №820
		|   И  ЕстьNULL(уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.НеДействует,ЛОЖЬ)<> ИСТИНА
		// -ХМНПФ 04.05.2017 ШадринАВ // СформироватьТЗДокументаПоВыплатамПенсийОПС() // №820
		#КонецВставки
		|"+?(Объект.ИспользоватьОтборОчередностьВыплаты," 
		|	И уп_НомераОчередейОПССрезПоследних.НомерОчереди = &НомерОчереди","")+?(Объект.ИспользоватьОтборПолучатель ,"
		|	И (ПолучателиПоДоговорамОбслуживания.ПолучательВПлатежномПоручении = &Получатель ИЛИ уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк = &Получатель)","")+"
		|	И ЕСТЬNULL(уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.НеДействует, ЛОЖЬ) <> ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФормаВыплаты,
		|	Участник,
		|	НомерОчереди,
		|	НачПериода";

	КонецЕсли;

	#Вставка
	// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВыплатамПенсийОПС() // №280
	Запрос.УстановитьПараметр("ХМ_ВыплатаПоВозвратам",ЭтотОбъект["ХМ_ВыплатаПоВозвратам"]);
	// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоВыплатамПенсийОПС() // №280
    #КонецВставки
	
	Запрос.УстановитьПараметр("ДатаДок", Новый Граница(КонецДня(Объект.ДатаФормированияДокументов),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", объект.Организация);
	Запрос.УстановитьПараметр("НомерОчереди", объект.ОтборОчередностьВыплаты);
	Запрос.УстановитьПараметр("Получатель", объект.ОтборПолучатель);
	Запрос.УстановитьПараметр("ПриостановкаВыплат", Перечисления.уп_СостоянияДоговоровОПС.ВыплатыПриостановлены);
	Запрос.УстановитьПараметр("Пожизненная", Перечисления.уп_ТипыПенсийОПС.Пожизненная);
	Запрос.УстановитьПараметр("НП", Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС);
	Запрос.УстановитьПараметр("СВ", Перечисления.уп_ТипыВыплат.СрочнаяПенсияОПС);
	СписокТиповПенсий = Новый СписокЗначений;
	Если Объект.Пожизненная Тогда
		СписокТиповПенсий.Добавить(Перечисления.уп_ТипыПенсийОПС.Пожизненная);
	КонецЕсли;
	Если Объект.Срочная Тогда
		СписокТиповПенсий.Добавить(Перечисления.уп_ТипыПенсийОПС.Срочная);
	КонецЕсли;
	Запрос.УстановитьПараметр("СписокТиповПенсий", СписокТиповПенсий);

	Если объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратНакопительнойПенсииОПС
		ИЛИ объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратСрочнойПенсииОПС Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "уп_НачисленияПенсийОПС", "уп_ВозвратыПенсийОПС");
	ИначеЕсли объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежНПОПС
		ИЛИ объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежСВОПС Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "уп_НачисленияПенсийОПС", "уп_ОтвергнутыеПлатежиПенсийОПС");	
	КонецЕсли;	
	Запрос.УстановитьПараметр("Подразделение", объект.ОтборПодразделение);
	Запрос.УстановитьПараметр("Филиал", объект.ОтборФилиал);
	Запрос.УстановитьПараметр("ДоговорОПС", объект.ОтборДоговорОПС);

	Запрос.Текст = ТекстЗапроса;

	Почта = Константы.уп_КонтрагентВыплатЧерезПочту.Получить();

	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Организация",Объект.Организация);
	ПараметрыОтбора.Вставить("ВидДеятельности",Объект.уп_ВидДеятельности);
	ПараметрыОтбора.Вставить("Подразделение",Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	СтруктураДанныхОсновная = РегистрыСведений.уп_ПолучателиДляВыплатныхРеестров.ПолучитьДанные(ПараметрыОтбора);	

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл 

		НовСтр = ТЗДокумента.Добавить();
		НовСтр.ПС = Выборка.ДоговорОПС;
		НовСтр.ПодразделениеБУ = Выборка.ПодразделениеБУ;
		НовСтр.Участник = Выборка.Участник;
		НовСтр.ФормаВыплаты = Выборка.ФормаВыплаты;
		НовСтр.НомерОчереди = Выборка.НомерОчереди;
		НовСтр.НачалоПериода = Выборка.НачПериода;
		НовСтр.Периодичность = Выборка.Периодичность;
		НовСтр.ДоверенноеЛицо = Выборка.ДоверенноеЛицо;
		НовСтр.ТипЛицевогоСчета = Выборка.ТипЛицевогоСчета;
		НовСтр.НомерЛицевогосчета = Выборка.НомерЛицевогоСчета;
		НовСтр.Получатель = Выборка.Банк;
		Если Выборка.РасчетныйСчетПлПор <> NULL Тогда
			НовСтр.РасчетныйСчет = Выборка.РасчетныйСчетПлПор;
		Иначе
			НовСтр.РасчетныйСчет = Выборка.РасчетныйСчет;
		КонецЕсли;	
		//ПолучательВПлПор = РегистрыСведений.ПолучателиПоДоговорамОбслуживания.Получить(Новый Стуртура("Получатель",Выборка.Банк)).ПолучательВПлатежномПоручении;
		Если Выборка.ПолучательВПлатежномПоручении<>Null Тогда
			НовСтр.ПолучательВПлПор = Выборка.ПолучательВПлатежномПоручении;
		Иначе
			НовСтр.ПолучательВПлПор = Выборка.Банк;
		КонецЕсли;
		Попытка
			Банк = НовСтр.РасчетныйСчет.Банк;
		Исключение
			//не указаны реквизиты получателя
			Банк = Справочники.Банки.ПустаяСсылка();
		КонецПопытки;
		ДоговорЗаключен = РегистрыСведений.уп_ДоговорыСБанками.Получить(Новый Структура("Организация,Банк",объект.Организация,Банк)).ДоговорЗаключен;
		Если ДоговорЗаключен Тогда
			НовСтр.ДоговорЗаключен = Истина;
		Иначе
			НовСтр.ДоговорЗаключен = Ложь
		КонецЕсли;
		Если Выборка.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.Почта
			или Выборка.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДом
			или Выборка.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением
			или Выборка.ФормаВыплаты = Перечисления.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением Тогда
			НовСтр.ПолучательВПлПор = Почта;
			НовСтр.РасчетныйСчет = Почта.ОсновнойБанковскийСчет;
			НовСтр.ДоговорЗаключен = Истина;
		КонецЕсли;	
		НовСтр.Сумма = Выборка.СуммаОстаток;
		НовСтр.СуммаКомпенсации = Выборка.КомпенсацииСуммаОстаток;
		НовСтр.СуммаВосполнения = Выборка.ВосполненияСуммаОстаток;
		НовСтр.СуммаВозмещения = Выборка.ВозмещенияСуммаОстаток;
		НовСтр.ТипПенсии = Выборка.ТипПенсии;
		НовСтр.ЕстьИсполнительныйЛист = Выборка.ЕстьИсполнительныйЛист;

		Если Объект.ФормироватьОбщиеРеестры И Выборка.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
			Если Выборка.Банк.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
				НовСтр.ЭтоРеестр = Истина; 
				НовСтр.ПолучательТЧ = НовСтр.ПолучательВПлПор;
				НовСтр.РасчетныйСчетТЧ = НовСтр.РасчетныйСчет;
				НовСтр.ДоговорЗаключен = Истина; 
				НовСтр.ПолучательВПлПор = СтруктураДанныхОсновная.Контрагент;
				НовСтр.РасчетныйСчет = СтруктураДанныхОсновная.РасчетныйСчет;

				Если НЕ Выборка.ПодразделениеБУ = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
					ПараметрыОтбора = Новый Структура();
					ПараметрыОтбора.Вставить("Организация",Объект.Организация);
					ПараметрыОтбора.Вставить("ВидДеятельности",Объект.уп_ВидДеятельности);
					ПараметрыОтбора.Вставить("Подразделение",Выборка.ПодразделениеБУ);
					СтруктураДанных = РегистрыСведений.уп_ПолучателиДляВыплатныхРеестров.ПолучитьДанные(ПараметрыОтбора);

					Если СтруктураДанных.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
					Иначе
						НовСтр.ПолучательВПлПор = СтруктураДанных.Контрагент;
						НовСтр.РасчетныйСчет = СтруктураДанных.РасчетныйСчет;
					КонецЕсли;
				КонецЕсли;	 
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("СформироватьТЗДокументаПоЕдиновременнойВыплатеОПС")
Процедура ХМСформироватьТЗДокументаПоЕдиновременнойВыплатеОПС(ТЗДокумента)
	ТекстОтбора = "";
	ТекстОтбора = ТекстОтбора + ?(объект.ИспользоватьОтборДоговорОПС," И ДоговорОПС В ИЕРАРХИИ (&ДоговорОПС)","");
	ТекстОтбора = ТекстОтбора + ?(объект.ИспользоватьОтборПодразделение," И ДоговорОПС.ПодразделениеБУ В ИЕРАРХИИ (&Подразделение)","");
	ТекстОтбора = ТекстОтбора + ?(объект.ИспользоватьОтборФилиал," И ДоговорОПС.Филиал В ИЕРАРХИИ (&Филиал)","");

	//сначала смотрим остатки на начало периода
	ПенсионныеПравила = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Период.ДатаОкончания, Новый Структура("Организация", объект.Организация));
	ЛицевыеСчетаПоТипамВыплат = ПенсионныеПравила.ЛицевыеСчетаПоТипамВыплат;

	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ИсполнительныйЛист.Участник КАК Участник,
	|	СУММА(ВЫБОР
	|			КОГДА уп_ДействующиеИсполнительныеЛистыСрезПоследних.Действует
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЕстьИсполнительныйЛист
	|ПОМЕСТИТЬ ИсполнительныеЛисты
	|ИЗ
	|	РегистрСведений.уп_ДействующиеИсполнительныеЛисты.СрезПоследних(&Дата2, ИсполнительныйЛист.Организация = &Организация) КАК уп_ДействующиеИсполнительныеЛистыСрезПоследних
	|ГДЕ
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.Действует = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_ДействующиеИсполнительныеЛистыСрезПоследних.ИсполнительныйЛист.Участник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаНачальныйОстаток, 0) КАК НачОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКонечныйОстаток, 0) КАК КонОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаПриход, 0) КАК Приход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаРасход, 0) КАК Расход,"+?(объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС,"
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКомпенсацииНачальныйОстаток, 0) КАК КомпенсацииНачОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКомпенсацииКонечныйОстаток, 0) КАК КомпенсацииКонОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКомпенсацииПриход, 0) КАК КомпенсацииПриход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКомпенсацииРасход, 0) КАК КомпенсацииРасход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВосполненияНачальныйОстаток, 0) КАК ВосполненияНачОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВосполненияКонечныйОстаток, 0) КАК ВосполненияКонОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВосполненияПриход, 0) КАК ВосполненияПриход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВосполненияРасход, 0) КАК ВосполненияРасход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВозмещенияНачальныйОстаток, 0) КАК ВозмещенияНачОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВозмещенияКонечныйОстаток, 0) КАК ВозмещенияКонОст,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВозмещенияПриход, 0) КАК ВозмещенияПриход,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстаткиИОбороты.СуммаВозмещенияРасход, 0) КАК ВозмещенияРасход,","
	|    0 КАК КомпенсацииНачОст,
	|    0 КАК КомпенсацииКонОст,
	|    0 КАК КомпенсацииПриход,
	|    0 КАК КомпенсацииРасход,
	|    0 КАК ВосполненияНачОст,
	|    0 КАК ВосполненияКонОст,
	|    0 КАК ВосполненияПриход,
	|    0 КАК ВосполненияРасход,
	|    0 КАК ВозмещенияНачОст,
	|    0 КАК ВозмещенияКонОст,
	|    0 КАК ВозмещенияПриход,
	|    0 КАК ВозмещенияРасход,")+"
	|	ПрочиеНачисленияОПСОстаткиИОбороты.ДоговорОПС,
	|	ПрочиеНачисленияОПСОстаткиИОбороты.Участник,
	|	ПрочиеНачисленияОПСОстаткиИОбороты.ТипСуммы,
	|	ДоверенныеЛицаУчастниковСрезПоследних.ДоверенноеЛицо,
	|	ЕСТЬNULL(ИсполнительныеЛисты.ЕстьИсполнительныйЛист, 0) КАК ЕстьИсполнительныйЛист,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ФормаВыплаты,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.РасчетныйСчет,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ТипЛицевогоСчета,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.НомерЛицевогоСчета,
	|	уп_ПолучателиПоДоговорамОбслуживания.ПолучательВПлатежномПоручении,
	|	уп_ПолучателиПоДоговорамОбслуживания.РасчетныйСчет КАК РасчетныйСчетВПлатежномПоручении
	|ИЗ
	|	РегистрНакопления.уп_ПрочиеНачисленияОПС.ОстаткиИОбороты(
	|			&Дата1,
	|			&Дата2,
	|			Период,
	|			,
	|			Организация = &Организация   "+ТекстОтбора+"
	#Вставка 
	// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоЕдиновременнойВыплатеОПС() // №280
	|				И ХМ_Возврат = &ХМ_ВыплатаПоВозвратам
	// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоЕдиновременнойВыплатеОПС() // №280				  
	#КонецВставки
	|				И ТипВыплаты = &ТипВыплаты) КАК ПрочиеНачисленияОПСОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ДоверенныеЛицаУчастников.СрезПоследних(&Дата2, ) КАК ДоверенныеЛицаУчастниковСрезПоследних
	|		ПО ПрочиеНачисленияОПСОстаткиИОбороты.Участник = ДоверенныеЛицаУчастниковСрезПоследних.Участник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ЛицевыеСчетаЗастрахованныхЛиц.СрезПоследних(&Дата2, "+?(ЛицевыеСчетаПоТипамВыплат, "ТипВыплат = &ТипВыплаты ","")+"
	|			) КАК уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПолучателиПоДоговорамОбслуживания КАК уп_ПолучателиПоДоговорамОбслуживания
	|			ПО уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк = уп_ПолучателиПоДоговорамОбслуживания.Получатель
	|		ПО ПрочиеНачисленияОПСОстаткиИОбороты.ДоговорОПС = уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ДоговорОПС
	|			И ПрочиеНачисленияОПСОстаткиИОбороты.Участник = уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ЗастрахованноеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсполнительныеЛисты КАК ИсполнительныеЛисты
	|		ПО ПрочиеНачисленияОПСОстаткиИОбороты.Участник = ИсполнительныеЛисты.Участник
	|ГДЕ
	|	ПрочиеНачисленияОПСОстаткиИОбороты.СуммаКонечныйОстаток <> &СуммаНоль
	//|	И ЕСТЬNULL(уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.НеДействует, ЛОЖЬ) <> ИСТИНА
	|	И ЕСТЬNULL(уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.НеДействует, ЛОЖЬ) <> ИСТИНА"+?(Объект.ИспользоватьОтборПолучатель ," 
	|	И (уп_ПолучателиПоДоговорамОбслуживания.ПолучательВПлатежномПоручении = &Получатель ИЛИ уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк = &Получатель)","")+"
	|";

	#Вставка 
	// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоЕдиновременнойВыплатеОПС() // №280
	Запрос.УстановитьПараметр("ХМ_ВыплатаПоВозвратам",ЭтотОбъект["ХМ_ВыплатаПоВозвратам"]);
	// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоЕдиновременнойВыплатеОПС() // №280
    #КонецВставки
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация",объект.Организация);
	Запрос.УстановитьПараметр("ТипВыплаты",объект.ТипВыплаты);
	Запрос.УстановитьПараметр("СуммаНоль",0);
	Запрос.УстановитьПараметр("ДатаНач",ДобавитьМесяц(НачалоДня(Период.ДатаНачала),-24));
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Подразделение", объект.ОтборПодразделение);
	Запрос.УстановитьПараметр("Филиал", объект.ОтборФилиал);
	Запрос.УстановитьПараметр("ДоговорОПС", объект.ОтборДоговорОПС);
	Запрос.УстановитьПараметр("Получатель", объект.ОтборПолучатель);

	Если объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратЕдиновременнойВыплатыОПС Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "уп_ПрочиеНачисленияОПС", "уп_ВозвратыПрочихНачисленийОПС");
		Запрос.УстановитьПараметр("ТипВыплаты",Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС);
	КонецЕсли;	
	Запрос.Текст = ТекстЗапроса;

	ТЗОстатков = Запрос.Выполнить().Выгрузить();

	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПрочиеНачисленияОПСОбороты.Участник,
	|	ПрочиеНачисленияОПСОбороты.Период,
	|	ПрочиеНачисленияОПСОбороты.СуммаПриход,"+?(объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС,"
	|	ПрочиеНачисленияОПСОбороты.СуммаКомпенсацииПриход,
	|	ПрочиеНачисленияОПСОбороты.СуммаВосполненияПриход,
	|	ПрочиеНачисленияОПСОбороты.СуммаВозмещенияПриход,","
	|    0 КАК СуммаКомпенсацииПриход,
	|    0 КАК СуммаВосполненияПриход,
	|    0 КАК СуммаВозмещенияПриход,")+"
	|	ПрочиеНачисленияОПСОбороты.ДоговорОПС,
	|	ПрочиеНачисленияОПСОбороты.ТипСуммы,
	|	ДоверенныеЛицаУчастниковСрезПоследних.ДоверенноеЛицо,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ФормаВыплаты,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.Банк,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.РасчетныйСчет,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ТипЛицевогоСчета,
	|	уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.НомерЛицевогоСчета
	|ИЗ
	|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Обороты(
	|			&Дата1,
	|			&Дата2,
	|			День,
	|			Организация = &Организация  "+ТекстОтбора+"
	#Вставка 
	// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоЕдиновременнойВыплатеОПС() // №280
	|				И ХМ_Возврат = &ХМ_ВыплатаПоВозвратам
	// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоЕдиновременнойВыплатеОПС() // №280				   
	#КонецВставки
	|				И ТипВыплаты = &ТипВыплаты) КАК ПрочиеНачисленияОПСОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ДоверенныеЛицаУчастников.СрезПоследних(&Дата2, ) КАК ДоверенныеЛицаУчастниковСрезПоследних
	|		ПО ПрочиеНачисленияОПСОбороты.Участник = ДоверенныеЛицаУчастниковСрезПоследних.Участник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ЛицевыеСчетаЗастрахованныхЛиц.СрезПоследних(&Дата2, "+?(ЛицевыеСчетаПоТипамВыплат, "ТипВыплат = &ТипВыплаты ","")+"
	|			) КАК уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних
	|		ПО ПрочиеНачисленияОПСОбороты.ДоговорОПС = уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ДоговорОПС
	|			И ПрочиеНачисленияОПСОбороты.Участник = уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.ЗастрахованноеЛицо
	|ГДЕ
	|    ЕстьNULL(уп_ЛицевыеСчетаЗастрахованныхЛицСрезПоследних.НеДействует,ЛОЖЬ)<> ИСТИНА";

	#Вставка 
	// +ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоЕдиновременнойВыплатеОПС() // №280
	Запрос.УстановитьПараметр("ХМ_ВыплатаПоВозвратам",ЭтотОбъект["ХМ_ВыплатаПоВозвратам"]);
	// -ХМНПФ 18.03.2016 ШадринАВ // СформироватьТЗДокументаПоЕдиновременнойВыплатеОПС() // №280
	#КонецВставки
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация",объект.Организация);
	Запрос.УстановитьПараметр("ТипВыплаты",объект.ТипВыплаты);
	Запрос.УстановитьПараметр("ДатаНач",ДобавитьМесяц(НачалоДня(Период.ДатаНачала),-24));
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Подразделение", объект.ОтборПодразделение);
	Запрос.УстановитьПараметр("Филиал", объект.ОтборФилиал);
	Запрос.УстановитьПараметр("ДоговорОПС", объект.ОтборДоговорОПС);

	Если объект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратЕдиновременнойВыплатыОПС Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "уп_ПрочиеНачисленияОПС", "уп_ВозвратыПрочихНачисленийОПС");
		Запрос.УстановитьПараметр("ТипВыплаты",Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС);
	КонецЕсли;	
	Запрос.Текст = ТекстЗапроса;

	ТЗОборотов = Запрос.Выполнить().Выгрузить();

	Почта = Константы.уп_КонтрагентВыплатЧерезПочту.Получить();

	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Организация",Объект.Организация);
	ПараметрыОтбора.Вставить("ВидДеятельности",Объект.уп_ВидДеятельности);
	ПараметрыОтбора.Вставить("Подразделение",Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	СтруктураДанныхОсновная = РегистрыСведений.уп_ПолучателиДляВыплатныхРеестров.ПолучитьДанные(ПараметрыОтбора);	

	Для каждого стр из ТЗОстатков Цикл

		Если стр.Расход = 0 Тогда //тогда по движениям
			НаборСтрок = ТЗОборотов.НайтиСтроки(Новый Структура("Участник,ДоговорОПС,ТипСуммы",стр.Участник,стр.ДоговорОПС,стр.ТипСуммы));
			Для каждого СтрокаНабора из НаборСтрок Цикл
				НовСтр = ТЗДокумента.Добавить();
				НовСтр.ПС = СтрокаНабора.ДоговорОПС;
				НовСтр.ПодразделениеБУ = стр.ДоговорОПС.ПодразделениеБУ;
				НовСтр.Участник = СтрокаНабора.Участник;
				НовСтр.Сумма = СтрокаНабора.СуммаПриход;
				НовСтр.СуммаКомпенсации = СтрокаНабора.СуммаКомпенсацииПриход;
				НовСтр.СуммаВосполнения = СтрокаНабора.СуммаВосполненияПриход;
				НовСтр.СуммаВозмещения = СтрокаНабора.СуммаВозмещенияПриход;
				НовСтр.ТипСуммы = СтрокаНабора.ТипСуммы;
				//НовСтр.НДФЛ = СтрокаНабора.НалогПриход;
				НовСтр.НачалоПериода = СтрокаНабора.Период;
				НовСтр.ДоверенноеЛицо = СтрокаНабора.ДоверенноеЛицо;
				НовСтр.ТипЛицевогоСчета = СтрокаНабора.ТипЛицевогоСчета;
				НовСтр.НомерЛицевогосчета = СтрокаНабора.НомерЛицевогоСчета;
				НовСтр.ФормаВыплаты = СтрокаНабора.ФормаВыплаты;

				Если стр.ПолучательВПлатежномПоручении<>Null Тогда
					НовСтр.ПолучательВПлПор = стр.ПолучательВПлатежномПоручении;
					НовСтр.РасчетныйСчет = стр.РасчетныйСчетВПлатежномПоручении;
				Иначе
					НовСтр.ПолучательВПлПор = стр.Банк;
					НовСтр.РасчетныйСчет = стр.РасчетныйСчет;
				КонецЕсли;
				Попытка
					Банк = НовСтр.РасчетныйСчет.Банк;
				Исключение
					//не указаны реквизиты получателя
					Банк = Справочники.Банки.ПустаяСсылка();
				КонецПопытки;
				ДоговорЗаключен = РегистрыСведений.уп_ДоговорыСБанками.Получить(Новый Структура("Организация,Банк",объект.Организация,Банк)).ДоговорЗаключен;
				Если ДоговорЗаключен Тогда
					НовСтр.ДоговорЗаключен = Истина;
				Иначе
					НовСтр.ДоговорЗаключен = Ложь
				КонецЕсли;

				Если  стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.Почта
					или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДом
					или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением
					или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением Тогда 
					НовСтр.ПолучательВПлПор = Почта;
					НовСтр.РасчетныйСчет = Почта.ОсновнойБанковскийСчет;
					Попытка
						Банк = НовСтр.РасчетныйСчет.Банк;
					Исключение
						//не указаны реквизиты получателя
						Банк = Справочники.Банки.ПустаяСсылка();
					КонецПопытки;
					НовСтр.ДоговорЗаключен = Истина;
				КонецЕсли; 
				НовСтр.ЕстьИсполнительныйЛист = стр.ЕстьИсполнительныйЛист;

				Если Объект.ФормироватьОбщиеРеестры И стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
					Если стр.Банк.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
						НовСтр.ЭтоРеестр = Истина; 
						НовСтр.ПолучательТЧ = НовСтр.ПолучательВПлПор;
						НовСтр.РасчетныйСчетТЧ = НовСтр.РасчетныйСчет;
						НовСтр.ДоговорЗаключен = Истина; 
						НовСтр.ПолучательВПлПор = СтруктураДанныхОсновная.Контрагент;
						НовСтр.РасчетныйСчет = СтруктураДанныхОсновная.РасчетныйСчет;

						Если НЕ НовСтр.ПодразделениеБУ = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
							ПараметрыОтбора = Новый Структура();
							ПараметрыОтбора.Вставить("Организация",Объект.Организация);
							ПараметрыОтбора.Вставить("ВидДеятельности",Объект.уп_ВидДеятельности);
							ПараметрыОтбора.Вставить("Подразделение",НовСтр.ПодразделениеБУ);
							СтруктураДанных = РегистрыСведений.уп_ПолучателиДляВыплатныхРеестров.ПолучитьДанные(ПараметрыОтбора);

							Если СтруктураДанных.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
							Иначе
								НовСтр.ПолучательВПлПор = СтруктураДанных.Контрагент;
								НовСтр.РасчетныйСчет = СтруктураДанных.РасчетныйСчет;
							КонецЕсли;
						КонецЕсли;	 
					КонецЕсли;
				КонецЕсли;

			КонецЦикла;
			// и если было начальное сальдо
			Если НЕ НеУчитыватьЗадолженность Тогда
				#Удаление 
				Если стр.НачОст>0 Тогда
				#КонецУдаления
				#Вставка 
				// ХМНПФ 26.10.2017 ШадринАВ // СформироватьТЗДокументаПоЕдиновременнойВыплатеОПС() // №1198
				Если стр.НачОст<>0 Тогда
				// ХМНПФ 26.10.2017 ШадринАВ // СформироватьТЗДокументаПоЕдиновременнойВыплатеОПС() // №1198
				#КонецВставки
					НовСтр = ТЗДокумента.Добавить();
					НовСтр.ПС = стр.ДоговорОПС;
					НовСтр.ПодразделениеБУ = стр.ДоговорОПС.ПодразделениеБУ;
					НовСтр.Участник = стр.Участник;
					НовСтр.Сумма = стр.НачОст;
					НовСтр.СуммаКомпенсации = стр.КомпенсацииНачОст;
					НовСтр.СуммаВосполнения = стр.ВосполненияНачОст;
					НовСтр.СуммаВозмещения = стр.ВозмещенияНачОст;
					НовСтр.ТипСуммы = стр.ТипСуммы;
					//НовСтр.НДФЛ = стр.НалогНачОст;
					НовСтр.НачалоПериода = Период.ДатаНачала;
					НовСтр.ФормаВыплаты = стр.ФормаВыплаты;
					//НовСтр.Получатель = стр.Банк;
					НовСтр.РасчетныйСчет = стр.РасчетныйСчет;
					//НовСтр.ДоговорЗаключен = Ложь;
					Новстр.ДоверенноеЛицо = стр.ДоверенноеЛицо;
					НовСтр.ТипЛицевогоСчета = стр.ТипЛицевогоСчета;
					НовСтр.НомерЛицевогосчета = стр.НомерЛицевогоСчета;

					Если стр.ПолучательВПлатежномПоручении<>Null Тогда
						НовСтр.ПолучательВПлПор = стр.ПолучательВПлатежномПоручении;
						НовСтр.РасчетныйСчет = стр.РасчетныйСчетВПлатежномПоручении;
					Иначе
						НовСтр.ПолучательВПлПор = стр.Банк;
						НовСтр.РасчетныйСчет = стр.РасчетныйСчет;
					КонецЕсли;
					Попытка
						Банк = НовСтр.РасчетныйСчет.Банк;
					Исключение
						//не указаны реквизиты получателя
						Банк = Справочники.Банки.ПустаяСсылка();
					КонецПопытки;
					ДоговорЗаключен = РегистрыСведений.уп_ДоговорыСБанками.Получить(Новый Структура("Организация,Банк",объект.Организация,Банк)).ДоговорЗаключен;
					Если ДоговорЗаключен Тогда
						НовСтр.ДоговорЗаключен = Истина;
					Иначе
						НовСтр.ДоговорЗаключен = Ложь
					КонецЕсли;

					Если  стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.Почта
						или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДом
						или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением
						или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением Тогда 
						НовСтр.ПолучательВПлПор = Почта;
						НовСтр.РасчетныйСчет = Почта.ОсновнойБанковскийСчет;
						Попытка
							Банк = НовСтр.РасчетныйСчет.Банк;
						Исключение
							//не указаны реквизиты получателя
							Банк = Справочники.Банки.ПустаяСсылка();
						КонецПопытки;
						НовСтр.ДоговорЗаключен = Истина;
					КонецЕсли; 
					НовСтр.ЕстьИсполнительныйЛист = стр.ЕстьИсполнительныйЛист; 

					Если Объект.ФормироватьОбщиеРеестры И стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
						Если стр.Банк.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
							НовСтр.ЭтоРеестр = Истина; 
							НовСтр.ПолучательТЧ = НовСтр.ПолучательВПлПор;
							НовСтр.РасчетныйСчетТЧ = НовСтр.РасчетныйСчет;
							НовСтр.ДоговорЗаключен = Истина; 
							НовСтр.ПолучательВПлПор = СтруктураДанныхОсновная.Контрагент;
							НовСтр.РасчетныйСчет = СтруктураДанныхОсновная.РасчетныйСчет;

							Если НЕ НовСтр.ПодразделениеБУ = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
								ПараметрыОтбора = Новый Структура();
								ПараметрыОтбора.Вставить("Организация",Объект.Организация);
								ПараметрыОтбора.Вставить("ВидДеятельности",Объект.уп_ВидДеятельности);
								ПараметрыОтбора.Вставить("Подразделение",НовСтр.ПодразделениеБУ);
								СтруктураДанных = РегистрыСведений.уп_ПолучателиДляВыплатныхРеестров.ПолучитьДанные(ПараметрыОтбора);

								Если СтруктураДанных.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
								Иначе
									НовСтр.ПолучательВПлПор = СтруктураДанных.Контрагент;
									НовСтр.РасчетныйСчет = СтруктураДанных.РасчетныйСчет;
								КонецЕсли;
							КонецЕсли;	 
						КонецЕсли;
					КонецЕсли;

				КонецЕсли;	
			КонецЕсли;
		Иначе   //тогда по дате конца периода
			Если НЕ НеУчитыватьЗадолженность Тогда
				НовСтр = ТЗДокумента.Добавить();
				НовСтр.ПС = стр.ДоговорОПС;
				НовСтр.ПодразделениеБУ = стр.ДоговорОПС.ПодразделениеБУ;
				НовСтр.Участник = стр.Участник;
				НовСтр.Сумма = стр.КонОст;
				НовСтр.СуммаКомпенсации = стр.КомпенсацииКонОст;
				НовСтр.СуммаВосполнения = стр.ВосполненияКонОст;
				НовСтр.СуммаВозмещения = стр.ВозмещенияКонОст;
				НовСтр.ТипСуммы = стр.ТипСуммы;
				//НовСтр.НДФЛ = стр.НалогКонОст;
				НовСтр.НачалоПериода = Период.ДатаОкончания;
				НовСтр.ФормаВыплаты = стр.ФормаВыплаты;
				НовСтр.ДоверенноеЛицо = стр.ДоверенноеЛицо;
				НовСтр.ТипЛицевогоСчета = стр.ТипЛицевогоСчета;
				НовСтр.НомерЛицевогосчета = стр.НомерЛицевогоСчета;

				Если стр.ПолучательВПлатежномПоручении<>Null Тогда
					НовСтр.ПолучательВПлПор = стр.ПолучательВПлатежномПоручении;
					НовСтр.РасчетныйСчет = стр.РасчетныйСчетВПлатежномПоручении;
				Иначе
					НовСтр.ПолучательВПлПор = стр.Банк;
					НовСтр.РасчетныйСчет = стр.РасчетныйСчет;
				КонецЕсли;
				Попытка
					Банк = НовСтр.РасчетныйСчет.Банк;
				Исключение
					//не указаны реквизиты получателя
					Банк = Справочники.Банки.ПустаяСсылка();
				КонецПопытки;
				ДоговорЗаключен = РегистрыСведений.уп_ДоговорыСБанками.Получить(Новый Структура("Организация,Банк",объект.Организация,Банк)).ДоговорЗаключен;
				Если ДоговорЗаключен Тогда
					НовСтр.ДоговорЗаключен = Истина;
				Иначе
					НовСтр.ДоговорЗаключен = Ложь
				КонецЕсли;

				Если  стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.Почта
					или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДом
					или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением
					или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением Тогда 
					НовСтр.ПолучательВПлПор = Почта;
					НовСтр.РасчетныйСчет = Почта.ОсновнойБанковскийСчет;
					Попытка
						Банк = НовСтр.РасчетныйСчет.Банк;
					Исключение
						//не указаны реквизиты получателя
						Банк = Справочники.Банки.ПустаяСсылка();
					КонецПопытки;
					НовСтр.ДоговорЗаключен = Истина;
				КонецЕсли; 
				НовСтр.ЕстьИсполнительныйЛист = стр.ЕстьИсполнительныйЛист;

				Если Объект.ФормироватьОбщиеРеестры И стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
					Если стр.Банк.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
						НовСтр.ЭтоРеестр = Истина; 
						НовСтр.ПолучательТЧ = НовСтр.ПолучательВПлПор;
						НовСтр.РасчетныйСчетТЧ = НовСтр.РасчетныйСчет;
						НовСтр.ДоговорЗаключен = Истина; 
						НовСтр.ПолучательВПлПор = СтруктураДанныхОсновная.Контрагент;
						НовСтр.РасчетныйСчет = СтруктураДанныхОсновная.РасчетныйСчет;

						Если НЕ НовСтр.ПодразделениеБУ = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
							ПараметрыОтбора = Новый Структура();
							ПараметрыОтбора.Вставить("Организация",Объект.Организация);
							ПараметрыОтбора.Вставить("ВидДеятельности",Объект.уп_ВидДеятельности);
							ПараметрыОтбора.Вставить("Подразделение",НовСтр.ПодразделениеБУ);
							СтруктураДанных = РегистрыСведений.уп_ПолучателиДляВыплатныхРеестров.ПолучитьДанные(ПараметрыОтбора);

							Если СтруктураДанных.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
							Иначе
								НовСтр.ПолучательВПлПор = СтруктураДанных.Контрагент;
								НовСтр.РасчетныйСчет = СтруктураДанных.РасчетныйСчет;
							КонецЕсли;
						КонецЕсли;	 
					КонецЕсли;
				КонецЕсли;

			Иначе
				Если стр.КонОст>стр.НачОст Тогда   //были невыплаченные начисления за указанный период
					НовСтр = ТЗДокумента.Добавить();
					НовСтр.ПС = стр.ДоговорОПС;
					НовСтр.ПодразделениеБУ = стр.ДоговорОПС.ПодразделениеБУ;
					НовСтр.Участник = стр.Участник;
					НовСтр.Сумма = стр.КонОст - стр.НачОст;
					НовСтр.СуммаКомпенсации = стр.КомпенсацииКонОст - стр.КомпенсацииНачОст;
					НовСтр.СуммаВосполнения = стр.ВосполненияКонОст - стр.ВосполненияНачОст;
					НовСтр.СуммаВозмещения = стр.ВозмещенияКонОст - стр.ВозмещенияНачОст;
					НовСтр.ТипСуммы = стр.ТипСуммы;
					//НовСтр.НДФЛ = стр.НалогКонОст - стр.НалогНачОст;
					НовСтр.НачалоПериода = Период.ДатаОкончания;
					НовСтр.ФормаВыплаты = стр.ФормаВыплаты;
					НовСтр.ДоверенноеЛицо = стр.ДоверенноеЛицо;
					НовСтр.ТипЛицевогоСчета = стр.ТипЛицевогоСчета;
					НовСтр.НомерЛицевогосчета = стр.НомерЛицевогоСчета;

					Если стр.ПолучательВПлатежномПоручении<>Null Тогда
						НовСтр.ПолучательВПлПор = стр.ПолучательВПлатежномПоручении;
						НовСтр.РасчетныйСчет = стр.РасчетныйСчетВПлатежномПоручении;
					Иначе
						НовСтр.ПолучательВПлПор = стр.Банк;
						НовСтр.РасчетныйСчет = стр.РасчетныйСчет;
					КонецЕсли;
					Попытка
						Банк = НовСтр.РасчетныйСчет.Банк;
					Исключение
						//не указаны реквизиты получателя
						Банк = Справочники.Банки.ПустаяСсылка();
					КонецПопытки;
					ДоговорЗаключен = РегистрыСведений.уп_ДоговорыСБанками.Получить(Новый Структура("Организация,Банк",объект.Организация,Банк)).ДоговорЗаключен;
					Если ДоговорЗаключен Тогда
						НовСтр.ДоговорЗаключен = Истина;
					Иначе
						НовСтр.ДоговорЗаключен = Ложь
					КонецЕсли;

					Если  стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.Почта
						или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДом
						или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтаСДоставкойНаДомУведомлением
						или стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.ПочтовыйПереводСУведомлением Тогда 
						НовСтр.ПолучательВПлПор = Почта;
						НовСтр.РасчетныйСчет = Почта.ОсновнойБанковскийСчет;
						Попытка
							Банк = НовСтр.РасчетныйСчет.Банк;
						Исключение
							//не указаны реквизиты получателя
							Банк = Справочники.Банки.ПустаяСсылка();
						КонецПопытки;
						НовСтр.ДоговорЗаключен = Истина;
					КонецЕсли;
					НовСтр.ЕстьИсполнительныйЛист = стр.ЕстьИсполнительныйЛист;

					Если Объект.ФормироватьОбщиеРеестры И стр.ФормаВыплаты=Перечисления.уп_ФормыВыплаты.РасчетныйСчет Тогда
						Если стр.Банк.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
							НовСтр.ЭтоРеестр = Истина; 
							НовСтр.ПолучательТЧ = НовСтр.ПолучательВПлПор;
							НовСтр.РасчетныйСчетТЧ = НовСтр.РасчетныйСчет;
							НовСтр.ДоговорЗаключен = Истина; 
							НовСтр.ПолучательВПлПор = СтруктураДанныхОсновная.Контрагент;
							НовСтр.РасчетныйСчет = СтруктураДанныхОсновная.РасчетныйСчет;

							Если НЕ НовСтр.ПодразделениеБУ = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
								ПараметрыОтбора = Новый Структура();
								ПараметрыОтбора.Вставить("Организация",Объект.Организация);
								ПараметрыОтбора.Вставить("ВидДеятельности",Объект.уп_ВидДеятельности);
								ПараметрыОтбора.Вставить("Подразделение",НовСтр.ПодразделениеБУ);
								СтруктураДанных = РегистрыСведений.уп_ПолучателиДляВыплатныхРеестров.ПолучитьДанные(ПараметрыОтбора);

								Если СтруктураДанных.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
								Иначе
									НовСтр.ПолучательВПлПор = СтруктураДанных.Контрагент;
									НовСтр.РасчетныйСчет = СтруктураДанных.РасчетныйСчет;
								КонецЕсли;
							КонецЕсли;	 
						КонецЕсли;
					КонецЕсли;

				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("УправлениеСтраницами")
Процедура ХМУправлениеСтраницами()
	Если объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПенсий") Тогда
		Элементы.ГруппаСтраницыНастройки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиПенсий;
		Элементы.Группа5.Видимость = Ложь;
		// //
		Элементы.ОтборДоговор.Видимость = Истина;
		Элементы.ИспользоватьОтборДоговор.Видимость = Истина;
	ИначеЕсли объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПенсийОПС") 
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.СрочнаяПенсияОПС") Тогда
		Элементы.ГруппаСтраницыНастройки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиПенсий;

		Элементы.ОтборДоговор.Видимость = Ложь;
		Элементы.ИспользоватьОтборДоговор.Видимость = Ложь;
		////
		Элементы.Группа5.Видимость = Истина;
	ИначеЕсли объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратМатеринскогоКапитала")
		ИЛИ объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратМатеринскогоКапиталаПДС") Тогда
		Элементы.ГруппаСтраницыНастройки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиПрочее;
		Элементы.ДатаФормированияДокументовВМК.Видимость = Истина;
		Элементы.Период.Видимость = Истина;
		Элементы.НеУчитыватьЗадолженность.Видимость = Истина;
	ИначеЕсли объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВзносов")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыНаследникам") 
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыРасторженцам")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ПереводВДругойНПФ_НПО")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыНаследникамОПС")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ПереводВДругойПФ") Тогда
		Элементы.ГруппаСтраницыНастройки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиПрочее;
		Элементы.ДатаФормированияДокументовВМК.Видимость = Ложь;
		Элементы.Период.Видимость = Истина;
		Элементы.НеУчитыватьЗадолженность.Видимость = Истина;
	ИначеЕсли объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПенсийПДС")
		Или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратПенсииПДС")Тогда
		Элементы.ГруппаСтраницыНастройки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиПенсий;
		Элементы.Группа5.Видимость = Истина;
		// //
		Элементы.ГруппаОтборДоговорПДС.Видимость = Истина;
	ИначеЕсли объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ЕдиновременнаяВыплатаПДС") 
		Или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВзносовПДС")
		Или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратЕдиновременнаяВыплатаПДС")
		Или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыкупнаяСуммаПДС")
		Или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВыкупнаяСуммаПДС")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПоОсобымОбстоятельствамПДС")		
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВыплатыПоОсобымОбстоятельствамПДС")		
		Или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПравопреемникамПДС")
		Или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВыплатыПравопреемникамПДС") Тогда

		Элементы.ГруппаСтраницыНастройки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиПрочее;
		Элементы.ДатаФормированияДокументовВМК.Видимость = Истина;
		Элементы.Период.Видимость = Истина;
		Элементы.НеУчитыватьЗадолженность.Видимость = Истина;
		// //
		Элементы.ГруппаОтборДоговорПДС.Видимость = Истина;
	Иначе //это возвраты и отвергнутые платежи - там только дата формирования документов
		Элементы.ГруппаСтраницыНастройки.ТекущаяСтраница = Элементы.ГруппаСтраницаНастройкиПрочее;
		Элементы.ДатаФормированияДокументовВМК.Видимость = Истина;
		Элементы.Период.Видимость = Ложь;
		Элементы.НеУчитыватьЗадолженность.Видимость = Ложь;
	КонецЕсли;

	Если объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВзносов")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВыплатНаследникамНПО")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВыплатРасторженцамНПО")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратПенсииНПО")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияНПО") 
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПенсий")		
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыНаследникам") 
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыРасторженцам")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиНПО") 
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежРасторжениеНПО")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ПереводВДругойНПФ_НПО") Тогда

		Элементы.Группа8.Видимость = Истина;   //это отбор договор
		Элементы.ГруппаОтборДоговорОПС.Видимость = Ложь;
		Элементы.ГруппаОтборДоговорПДС.Видимость = Ложь;
	ИначеЕсли объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПенсийПДС")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратПенсииПДС")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияПДС")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ЕдиновременнаяВыплатаПДС")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратЕдиновременнаяВыплатаПДС")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежЕВПДС")	
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыкупнаяСуммаПДС")	
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВыкупнаяСуммаПДС")	
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежВыкупнаяСуммаПДС")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПоОсобымОбстоятельствамПДС")		
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВыплатыПоОсобымОбстоятельствамПДС")		
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежВыплатыПоОсобымОбстоятельствамПДС")				
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПравопреемникамПДС")	
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВыплатыПравопреемникамПДС")	
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиПДС")	
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ПереводВДругойНПФ_ПДС") Тогда	
		Элементы.Группа8.Видимость = Ложь;   //это отбор договор
		Элементы.ГруппаОтборДоговорОПС.Видимость = Ложь;
		Элементы.ГруппаОтборДоговорПДС.Видимость = Истина;
	Иначе
		Элементы.Группа8.Видимость = Ложь;   //это отбор договор
		Элементы.ГруппаОтборДоговорОПС.Видимость = Истина;
		Элементы.ГруппаОтборДоговорПДС.Видимость = Ложь;
	КонецЕсли;	

	#Вставка
	// +ХМНПФ 29.06.2020 ШадринАВ // УправлениеСтраницами() // №2844
	Если объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыНаследникамОПС") Тогда
		Элементы["ХМ_ВыплатаПравопреемникамОПСизРОПС"].Видимость = Истина;
	Иначе Элементы["ХМ_ВыплатаПравопреемникамОПСизРОПС"].Видимость = Ложь;
	КонецЕсли;
	// -ХМНПФ 29.06.2020 ШадринАВ // УправлениеСтраницами() // №2844
	#КонецВставки

	Если Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВыплатНаследникамНПО")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВыплатРасторженцамНПО")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратПенсииНПО")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПенсий")		
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыНаследникам") 
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыРасторженцам")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияНПО") 
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиНПО") 
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежРасторжениеНПО")

		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПенсийПДС")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратПенсииПДС")
		или объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияПДС")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ЕдиновременнаяВыплатаПДС")		
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратЕдиновременнаяВыплатаПДС")		
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежЕВПДС")		
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыкупнаяСуммаПДС")		
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВыкупнаяСуммаПДС")		
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежВыкупнаяСуммаПДС")				
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПоОсобымОбстоятельствамПДС")		
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВыплатыПоОсобымОбстоятельствамПДС")		
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежВыплатыПоОсобымОбстоятельствамПДС")				
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПравопреемникамПДС")		
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВыплатыПравопреемникамПДС")		
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиПДС")		

		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыПенсийОПС")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.СрочнаяПенсияОПС")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВыплатыНаследникамОПС")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиОПС") 
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежНПОПС")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежСВОПС")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ОтвергнутыйПлатежЕВОПС")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратВыплатПравопреемникамОПС")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратЕдиновременнойВыплатыОПС")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратНакопительнойПенсииОПС")
		или Объект.ТипВыплаты = ПредопределенноеЗначение("Перечисление.уп_ТипыВыплат.ВозвратСрочнойПенсииОПС") Тогда

		Элементы.ГруппаОбщиеРеестры.Доступность = Истина;	
	Иначе
		Объект.ФормироватьОбщиеРеестры = Ложь;
		Элементы.ГруппаОбщиеРеестры.Доступность = Ложь;	
	КонецЕсли;


	Если Объект.ФормироватьОбщиеРеестры Тогда
		Элементы.ГруппаРеестрПолучательРасчетныйСчет.Видимость = Истина;
		Элементы.НовыеНачисленияДокументРеестр.Видимость = Истина;
	Иначе
		Элементы.ГруппаРеестрПолучательРасчетныйСчет.Видимость = Ложь;
		Элементы.НовыеНачисленияДокументРеестр.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму();
КонецПроцедуры
