
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура ХМОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		ЗарплатаКадры.ЗаполнитьПоОснованиюСотрудником(ЭтотОбъект, ДанныеЗаполнения, , Истина);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Увольнение") Тогда
		СтрокаДанныеУвольнения = "Организация, ФизическоеЛицо, ДатаУвольнения";
		ДанныеУвольнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, СтрокаДанныеУвольнения);
		Организация = ДанныеУвольнения["Организация"];
		Сотрудник = ДанныеУвольнения["ФизическоеЛицо"];
		НалоговыйПериод = Год(ДанныеУвольнения["ДатаУвольнения"]);
		СпособФормирования = Перечисления.ПорядокФормированияСправкиОДоходахФизическогоЛица.Сводно;
		Дата = ?(ЗначениеЗаполнено(ДанныеУвольнения["ДатаУвольнения"]), КонецДня(ДанныеУвольнения["ДатаУвольнения"]) + 1, ТекущаяДатаСеанса());
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда

		Если ДанныеЗаполнения.Свойство("Действие") И ДанныеЗаполнения.Действие = "ОбработкаЗапросаКабинетСотрудника" Тогда
			Сотрудник 			= ДанныеЗаполнения.Данные.ФизическоеЛицо;
			Организация 		= ДанныеЗаполнения.Данные.Организация;
			НалоговыйПериод 	= ДанныеЗаполнения.Данные.НалоговыйПериод;
			СпособФормирования 	= ДанныеЗаполнения.Данные.СпособФормирования;
		КонецЕсли;
	#Вставка
	//+02.06.2022 ХМНПФ Попов С.О.
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.хм_ЗаявлениеОВыдачеСправок") Тогда

		Сотрудник 			= ДанныеЗаполнения.Участник.уп_ФизЛицо;
		Организация 		= ДанныеЗаполнения.Организация;
		Справка = ДанныеЗаполнения.СписокСправок.Найти(Перечисления.хм_ТипСправки.Справка2НДФЛ, "Справка");
		НалоговыйПериод = ?(Справка = Неопределено, 0, Год(Справка.ПериодДатаНачала));
	//-02.06.2022 ХМНПФ Попов С.О.
	#КонецВставки
	КонецЕсли;

КонецПроцедуры 

&После("ОбработкаПроведения")
Процедура ХМОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр хм_ВыданныеСправки
	//Движения.хм_ВыданныеСправки.Записывать = Истина;
	//Движение = Движения.хм_ВыданныеСправки.Добавить();
	//Движение.Период = Дата;	
	//Движение.Справка = Перечисления.хм_ТипСправки.Справка2НДФЛ;
	//Движение.Участник = Сотрудник.уп_Контрагент;
	//Движение.Фамилия = Фамилия;
	//Движение.Имя = Имя;
	//Движение.Отчество = Отчество;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

