
// +ХМНПФ 18.10.2016 ХлопцевБА // ОбработкаПроведения() // №470
Процедура уп_ДополнительноеСоглашение(Источник, Отказ, РежимПроведения) Экспорт
	
	хм_МестоРаботы = Источник.хм_МестоРаботы;
	
	Если НЕ хм_МестоРаботы.Пустая() Тогда
		
		уп_МестаРаботыУчастников = Источник.Движения.уп_МестаРаботыУчастников;	
		
		Для Каждого Стр Из уп_МестаРаботыУчастников Цикл
			Стр.МестоРаботы = хм_МестоРаботы;
		КонецЦикла;
		
		уп_МестаРаботыУчастников.Записать();
		
	Иначе
		
		уп_МестаРаботыУчастников = Источник.Движения.уп_МестаРаботыУчастников;	
		уп_МестаРаботыУчастников.Очистить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_ДополнительноеСоглашениеСписокУчастников.ФизЛицо
		|ПОМЕСТИТЬ вт_ФизЛица
		|ИЗ
		|	Документ.уп_ДополнительноеСоглашение.СписокУчастников КАК уп_ДополнительноеСоглашениеСписокУчастников
		|ГДЕ
		|	уп_ДополнительноеСоглашениеСписокУчастников.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(вт_ФизЛица.ФизЛицо) КАК ФизЛицо,
		|	уп_МестаРаботыУчастниковСрезПоследних.МестоРаботы
		|ИЗ
		|	вт_ФизЛица КАК вт_ФизЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_МестаРаботыУчастников.СрезПоследних(
		|				&КонПериода,
		|				Участник В
		|						(ВЫБРАТЬ
		|							вт_ФизЛица.ФизЛицо
		|						ИЗ
		|							вт_ФизЛица КАК вт_ФизЛица)
		|					И Регистратор <> &Ссылка) КАК уп_МестаРаботыУчастниковСрезПоследних
		|		ПО вт_ФизЛица.ФизЛицо = уп_МестаРаботыУчастниковСрезПоследних.Участник";
		
		Запрос.УстановитьПараметр("КонПериода", Источник.Дата);
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.МестоРаботы = NULL Тогда
				Сообщить ("У участника " + Выборка.ФизЛицо + " не указано место работы...");
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;
	
	// +ХМНПФ 06.07.2021 ХлопцевБА // ИзменитьСхему // №3257
	Если Источник.ИзменитьСхему Тогда
		
		нз_ПараметрыПенсионногоДоговора = Источник.Движения.уп_ПараметрыПенсионногоДоговора;
		нз_СхемаСчета = Источник.Движения.уп_СхемаСчета;
		
		Для а = (нз_ПараметрыПенсионногоДоговора.Количество()-1)* (-1) По 0 Цикл
			Если нз_ПараметрыПенсионногоДоговора[а*(-1)].ПенсионныйДоговор = Источник.ПенсионныйДоговор Тогда
				нз_ПараметрыПенсионногоДоговора.Удалить(а*(-1));
			КонецЕсли;
		КонецЦикла;
		
		Для а = (нз_СхемаСчета.Количество()-1)* (-1) По 0 Цикл
			Если нз_СхемаСчета[а*(-1)].НомерСчета.ТипПенсионногоСчета <> Перечисления.уп_ТипыПенсионныхСчетов.ПенсионныйСчетУчастника Тогда
				нз_СхемаСчета.Удалить(а*(-1));
			КонецЕсли;
		КонецЦикла;
		
		нз_ПараметрыПенсионногоДоговора.Записать();
		нз_СхемаСчета.Записать();
		
	КонецЕсли;
	// -ХМНПФ 06.07.2021 ХлопцевБА // ИзменитьСхему // №3257
	
КонецПроцедуры
