
&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	ТипДокументаТипом = Строка(ТИПЗНЧ(Запись.ТипДокумента));
	ВидимостьЗаписиВЛюбомСлучае();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого Элемент Из Элементы.КоэффициентРезервыПриход.СписокВыбора Цикл
		Элементы.КоэффициентРезервыРасход.СписокВыбора.Добавить(Элемент.Значение,Элемент.Представление);
		Элементы.КоэффициентНачисленияРасход.СписокВыбора.Добавить(Элемент.Значение,Элемент.Представление);
		Элементы.КоэффициентНачисленияПриход.СписокВыбора.Добавить(Элемент.Значение,Элемент.Представление);
		Элементы.КоэффициентВыплаты.СписокВыбора.Добавить(Элемент.Значение,Элемент.Представление);
	КонецЦикла;
	ТипДокументаТипом = Строка(ТИПЗНЧ(Запись.ТипДокумента));
	Если Параметры.Свойство("РежимУточнения") Тогда 
		РежимУточнения = Истина;
    	Элементы.ТипДокументаТипом.Видимость = Ложь;
    	Элементы.ТипДокумента.Видимость = Ложь;
	   	Элементы.ТипВыплаты.Видимость = Ложь;
	   	Элементы.ТипРезерва.Видимость = Ложь;
	   	Элементы.ВидРучнойОперации.Видимость = Ложь;
		Элементы.ВидДеятельности.Видимость = Ложь;
		ПоляУточнения = Неопределено;
		Если Параметры.ДополнительныеПараметры.Свойство("ПоляУточнения",ПоляУточнения) Тогда 
	    	Элементы.flow_type_cd.Видимость = ПоляУточнения.Свойство("flow_type_cd");
	    	Элементы.payment_type_cd.Видимость = ПоляУточнения.Свойство("payment_type_cd");
	    	Элементы.ТипПлатежа.Видимость = ПоляУточнения.Свойство("ТипПлатежа");
	    	Элементы.ИсточникПотока.Видимость = ПоляУточнения.Свойство("ИсточникПотока");
	    	Элементы.ГруппаКоэффициенты.Видимость = ПоляУточнения.Свойство("ИсточникПотока"); 
	    	Элементы.Комментарий.Видимость = ПоляУточнения.Свойство("Комментарий");
			Элементы.ЗнакСуммы.Видимость = ПоляУточнения.Свойство("ЗнакСуммы");
			Элементы.ИсточникПлатежа.Видимость = ПоляУточнения.Свойство("ИсточникПлатежа");
			Элементы.ПриемникПлатежа.Видимость = ПоляУточнения.Свойство("ПриемникПлатежа");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры       

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокВыбораИсточниПотока(); 
	ВидимостьЗаписиВЛюбомСлучае();
КонецПроцедуры

&НаКлиенте
Процедура ИсточникПотокаПриИзменении(Элемент)

	Отбор = Новый Структура("ИсточникПотока",Запись.ИсточникПотока);
	НайденныеСтроки = ТаблицаКоэффициентов.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда 
		ЗаполнитьСписокВыбораИсточниПотока();
		Элементы.ИсточникПотока.СписокВыбора.Добавить(Запись.ИсточникПотока);
		Возврат;
	КонецЕсли;
	
	Запись.КоэффициентРезервыПриход = НайденныеСтроки[0].КоэффициентРезервыПриход; 
	Запись.КоэффициентРезервыРасход = НайденныеСтроки[0].КоэффициентРезервыРасход;
	Запись.КоэффициентНачисленияПриход = НайденныеСтроки[0].КоэффициентНачисленияПриход;
	Запись.КоэффициентНачисленияРасход = НайденныеСтроки[0].КоэффициентНачисленияРасход;
	Запись.КоэффициентВыплаты = НайденныеСтроки[0].КоэффициентВыплаты;	

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьТаблицуКоэффициентовНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	хм_МСФО_ОПС_МаппингДП.ИсточникПотока КАК ИсточникПотока,
	               |	МАКСИМУМ(хм_МСФО_ОПС_МаппингДП.КоэффициентРезервыПриход) КАК КоэффициентРезервыПриход,
	               |	МАКСИМУМ(хм_МСФО_ОПС_МаппингДП.КоэффициентРезервыРасход) КАК КоэффициентРезервыРасход,
	               |	МАКСИМУМ(хм_МСФО_ОПС_МаппингДП.КоэффициентНачисленияРасход) КАК КоэффициентНачисленияРасход,
	               |	МАКСИМУМ(хм_МСФО_ОПС_МаппингДП.КоэффициентНачисленияПриход) КАК КоэффициентНачисленияПриход,
				   |	МАКСИМУМ(хм_МСФО_ОПС_МаппингДП.КоэффициентВыплаты) КАК КоэффициентВыплаты
	               |ИЗ
	               |	РегистрСведений.хм_МСФО_ОПС_МаппингДП КАК хм_МСФО_ОПС_МаппингДП
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	хм_МСФО_ОПС_МаппингДП.ИсточникПотока
				   |УПОРЯДОЧИТЬ ПО 
				   |	хм_МСФО_ОПС_МаппингДП.ИсточникПотока";
	
	
	ТаблицаКоэффициентов.Загрузить(Запрос.Выполнить().Выгрузить()); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораИсточниПотока()
	
	ЗаполнитьТаблицуКоэффициентовНаСервере();
	
	Элементы.ИсточникПотока.СписокВыбора.Очистить(); 
	
	Для каждого Коэффициенты из ТаблицаКоэффициентов Цикл                          	
		Элементы.ИсточникПотока.СписокВыбора.Добавить(Коэффициенты.ИсточникПотока);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если РежимУточнения = Истина Тогда        
		ТребуемоеУтонение =  Новый Структура();
		ТребуемоеУтонение.Вставить("flow_type_cd",Запись.flow_type_cd);
		ТребуемоеУтонение.Вставить("payment_type_cd",Запись.payment_type_cd);
		ТребуемоеУтонение.Вставить("ТипПлатежа",Запись.ТипПлатежа);
		ТребуемоеУтонение.Вставить("ИсточникПотока",Запись.ИсточникПотока);
		ТребуемоеУтонение.Вставить("Статус",Запись.Статус);
		ТребуемоеУтонение.Вставить("Комментарий",Запись.Комментарий);
		ТребуемоеУтонение.Вставить("КоэффициентРезервыПриход",Запись.КоэффициентРезервыПриход);
		ТребуемоеУтонение.Вставить("КоэффициентРезервыРасход",Запись.КоэффициентРезервыРасход);
		ТребуемоеУтонение.Вставить("КоэффициентНачисленияРасход",Запись.КоэффициентНачисленияРасход);
		ТребуемоеУтонение.Вставить("КоэффициентНачисленияПриход",Запись.КоэффициентНачисленияПриход);
		ТребуемоеУтонение.Вставить("КоэффициентВыплаты",Запись.КоэффициентВыплаты);
		ТребуемоеУтонение.Вставить("ЗнакСуммы",Запись.ЗнакСуммы);
		ТребуемоеУтонение.Вставить("ИсточникПлатежа",Запись.ИсточникПлатежа);
		ТребуемоеУтонение.Вставить("ПриемникПлатежа",Запись.ПриемникПлатежа);
		ЭтаФорма.Закрыть(ТребуемоеУтонение);
		Отказ = Истина;
	КонецЕсли;
	Если НЕ Запись.ТипДокумента.Пустая() И НЕ ЗаписыватьВЛюбомСлучае И (ЗначениеЗаполнено(Запись.ТипРезерва) ИЛИ ЗначениеЗаполнено(Запись.ТипВыплаты)) Тогда	
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'При указании документа поле с типом резерва и типом выплаты должно быть пустое!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) 
	Если РежимУточнения = Истина Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЗаписиВЛюбомСлучае() 
	Если Запись.ТипДокумента = Неопределено Тогда
		Элементы.ДекорацияНеЗабудьПустые.Видимость = Ложь;
		Элементы.ЗаписыватьВЛюбомСлучае.Видимость = Ложь;
	Иначе
		Элементы.ДекорацияНеЗабудьПустые.Видимость = НЕ Запись.ТипДокумента.Пустая() и ЗаписыватьВЛюбомСлучае; 
		Элементы.ЗаписыватьВЛюбомСлучае.Видимость = НЕ Запись.ТипДокумента.Пустая(); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписыватьВЛюбомСлучаеПриИзменении(Элемент)
	ВидимостьЗаписиВЛюбомСлучае(); 
КонецПроцедуры
