// +ХМНПФ 11.01.2018 КлименкоМИ // уп_ВыплатныеРеестры() // №1278
Процедура уп_ВыплатныеРеестры(Источник, Отказ, РежимПроведения) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	// +ХМНПФ 23.01.2018 КлименкоМИ // уп_ВозвратПенсийОПС() // №1296
	//"ВЫБРАТЬ
	//|	уп_ВозвратПрочихНачисленийОПС.Ссылка,
	//|	уп_ВозвратПрочихНачисленийОПС.Дата
	//|ИЗ
	//|	Документ.уп_ВозвратПрочихНачисленийОПС КАК уп_ВозвратПрочихНачисленийОПС
	//|ГДЕ
	//|	уп_ВозвратПрочихНачисленийОПС.ДокументОснование = &ДокументОснования
	//|	И уп_ВозвратПрочихНачисленийОПС.Проведен = ИСТИНА";
	"ВЫБРАТЬ
	|	ПлатежноеПоручение.Ссылка КАК ПлатПоручение,
	|	ПлатежноеПоручение.ДокументОснование
	|ПОМЕСТИТЬ ПлатПоручениеСОснованием
	|ИЗ
	|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
	|ГДЕ
	|	ПлатежноеПоручение.ДокументОснование = &ДокументОснования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_ВозвратПрочихНачисленийОПС.Ссылка,
	|	уп_ВозвратПрочихНачисленийОПС.Дата,
	|	NULL КАК ПлатПоручение
	|ИЗ
	|	Документ.уп_ВозвратПрочихНачисленийОПС КАК уп_ВозвратПрочихНачисленийОПС
	|ГДЕ
	|	уп_ВозвратПрочихНачисленийОПС.ДокументОснование = &ДокументОснования
	|	И уп_ВозвратПрочихНачисленийОПС.Проведен = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уп_ВозвратПенсийОПС.Ссылка,
	|	уп_ВозвратПенсийОПС.Дата,
	|	ПлатПоручениеСОснованием.ПлатПоручение
	|ИЗ
	|	ПлатПоручениеСОснованием КАК ПлатПоручениеСОснованием
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.уп_ВозвратПенсийОПС КАК уп_ВозвратПенсийОПС
	|		ПО ПлатПоручениеСОснованием.ПлатПоручение = уп_ВозвратПенсийОПС.ХМ_ВозвратСПлатежногоПоручения
	|ГДЕ
	|	уп_ВозвратПенсийОПС.Проведен = ИСТИНА";
	// ХМНПФ 23.01.2018 КлименкоМИ // уп_ВозвратПенсийОПС() // №1296
	
	Запрос.УстановитьПараметр("ДокументОснования", Источник.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если  Источник.Дата >=  ВыборкаДетальныеЗаписи.Дата Тогда
			Сообщить("Дата документа возврата меньше даты документа выплаты. Неправильная последовательность документов!"  + Символы.ПС
			+ "Документ выплаты: " + Источник.Ссылка + Символы.ПС
			+ "Документ возврата: " + ВыборкаДетальныеЗаписи.Ссылка +  Символы.ПС
			+ "Проведение невозможно!");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // уп_ВыплатныеРеестры(Источник, Отказ, РежимПроведения)
