Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 18.03.2016 ШадринАВ // новый реквизит ХМ_ВыплатаПоВозвратам // №281
	// ХМНПФ 18.03.2016 ШадринАВ // ОбработкаПроведения() // №281
	// ХМНПФ+ 05.09.2016 ШадринАВ // длина номера изменена с 27 до 50 // №459
	// ХМНПФ 30.01.2017 ШадринАВ // ДвиженияПоНаследованиюОПС() // №782
	// ХМНПФ 23.10.2017 ШадринАВ // ПроверитьОстаткиПоЕдиновременнойВыплатеОПС() // №1198
	// ХМНПФ 10.01.2018 КлименкоМИ // ДвиженияПоНаследованиюОПС() // №1274
	// ХМНПФ 23.01.2020 ШадринАВ // ДвиженияПоВыплатеПенсийОПС() // №2632
	// ХМНПФ 31.03.2020 ШадринАВ // ДвиженияПоВыплатеПенсийОПС() // №2732
	// ХМНПФ 31.03.2020 ШадринАВ // Новая ХМ_ВключенМеханизмУдержанийПоДоговоруОПС() // №2732
	// ХМНПФ 17.04.2020 ШадринАВ // ПроверитьОстаткиПоНаследованиюОПС() // №2789
	// ХМНПФ 30.11.2020 ШадринАВ // ДвиженияПоЕдиновременнойВыплатеОПС() // №3010
	
	// ХМНПФ 07.06.2016 ШадринАВ // ДвиженияПоНаследованиюОПС() // №372 // не актуально
КонецПроцедуры

&ИзменениеИКонтроль("ПроверитьОстаткиПоЕдиновременнойВыплатеОПС")
Функция РасшОбщ_ПроверитьОстаткиПоЕдиновременнойВыплатеОПС()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уп_ВыплатныеРеестрыДоговорыОПС.ДоговорОПС,
	|	СУММА(уп_ВыплатныеРеестрыДоговорыОПС.Сумма) КАК Сумма,
	|	СУММА(уп_ВыплатныеРеестрыДоговорыОПС.РКО) КАК РКО,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.ДоговорОПС, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Невыплата
	|ПОМЕСТИТЬ СписокДоговоровОПС
	|ИЗ
	|	Документ.уп_ВыплатныеРеестры.ДоговорыОПС КАК уп_ВыплатныеРеестрыДоговорыОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ВыплатныеРеестры.НеисполненныеВыплаты КАК уп_ВыплатныеРеестрыНеисполненныеВыплаты
	|		ПО уп_ВыплатныеРеестрыДоговорыОПС.Ссылка = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Ссылка
	|			И уп_ВыплатныеРеестрыДоговорыОПС.ДоговорОПС = уп_ВыплатныеРеестрыНеисполненныеВыплаты.ДоговорОПС
	|			И уп_ВыплатныеРеестрыДоговорыОПС.Участник = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Участник
	|ГДЕ
	|	уп_ВыплатныеРеестрыДоговорыОПС.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_ВыплатныеРеестрыДоговорыОПС.ДоговорОПС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.ДоговорОПС, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_РезервыОПСОстатки.ДоговорОПС КАК ДоговорОПС,
	|	уп_РезервыОПСОстатки.ТипСуммы КАК ТипСуммы,
	|	уп_РезервыОПСОстатки.СуммаОстаток,
	|	уп_РезервыОПСОстатки.СуммаКомпенсацииОстаток,
	|	уп_РезервыОПСОстатки.СуммаВосполненияОстаток,
	|	уп_РезервыОПСОстатки.СуммаВозмещенияОстаток
	|ПОМЕСТИТЬ РезервыНачислений
	|ИЗ
	|	РегистрНакопления.уп_РезервыОПС.Остатки(
	|			&ДатаДок,
	|			ДоговорОПС В (&СписокДоговоров)
	|				И Организация = &Организация
	|				И ТипРезерва = &ТипРезерваНачисления) КАК уп_РезервыОПСОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС,
	|	ТипСуммы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрочиеНачисленияОПСОстатки.ДоговорОПС КАК ДоговорОПС,
	|	ПрочиеНачисленияОПСОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ПрочиеНачисленияОПСОстатки.Участник,
	|	ПрочиеНачисленияОПСОстатки.ДокументРегистрации,
	|	ПрочиеНачисленияОПСОстатки.ТипСуммы,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстатки.СуммаКомпенсацииОстаток, 0) КАК СуммаКомпенсации,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстатки.СуммаВосполненияОстаток, 0) КАК СуммаВосполнения,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстатки.СуммаВозмещенияОстаток, 0) КАК СуммаВозмещения,
	|	ЕСТЬNULL(РезервыНачислений.СуммаОстаток, 0) КАК СуммаВРезервеНачислений,
	|	ЕСТЬNULL(РезервыНачислений.СуммаКомпенсацииОстаток, 0) КАК СуммаКомпенсацииРН,
	|	ЕСТЬNULL(РезервыНачислений.СуммаВосполненияОстаток, 0) КАК СуммаВосполненияРН,
	|	ЕСТЬNULL(РезервыНачислений.СуммаВозмещенияОстаток, 0) КАК СуммаВозмещенияРН
	|ПОМЕСТИТЬ ДенежныеОстатки
	|ИЗ
	|	РегистрНакопления.уп_ПрочиеНачисленияОПС.Остатки(
	|			&ДатаДок,
	|			ДоговорОПС В (&СписокДоговоров)
	|				И Организация = &Организация
	|				И Участник В (&СписокЗЛ)
	|				И ТипВыплаты = &ЕдВыплата) КАК ПрочиеНачисленияОПСОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезервыНачислений КАК РезервыНачислений
	|		ПО ПрочиеНачисленияОПСОстатки.ДоговорОПС = РезервыНачислений.ДоговорОПС
	|			И ПрочиеНачисленияОПСОстатки.ТипСуммы = РезервыНачислений.ТипСуммы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокДоговоровОПС.ДоговорОПС КАК ДоговорОПС,
	|	СписокДоговоровОПС.Сумма КАК Сумма,
	|	ЕСТЬNULL(ДенежныеОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ДенежныеОстатки.Участник,
	|	ДенежныеОстатки.ДокументРегистрации,
	|	ЕСТЬNULL(ДенежныеОстатки.ТипСуммы, &ПустойТипСуммы) КАК ТипСуммы,
	|	ЕСТЬNULL(ДенежныеОстатки.СуммаКомпенсации, 0) КАК СуммаКомпенсации,
	|	ЕСТЬNULL(ДенежныеОстатки.СуммаВосполнения, 0) КАК СуммаВосполнения,
	|	ЕСТЬNULL(ДенежныеОстатки.СуммаВозмещения, 0) КАК СуммаВозмещения,
	|	ЕСТЬNULL(ДенежныеОстатки.СуммаВРезервеНачислений, 0) КАК СуммаВРезервеНачислений,
	|	ЕСТЬNULL(ДенежныеОстатки.СуммаКомпенсацииРН, 0) КАК СуммаКомпенсацииРН,
	|	ЕСТЬNULL(ДенежныеОстатки.СуммаВосполненияРН, 0) КАК СуммаВосполненияРН,
	|	ЕСТЬNULL(ДенежныеОстатки.СуммаВозмещенияРН, 0) КАК СуммаВозмещенияРН,
	|	СписокДоговоровОПС.РКО КАК РКО,
	|	СписокДоговоровОПС.Невыплата КАК Невыплата
	|ИЗ
	|	СписокДоговоровОПС КАК СписокДоговоровОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДенежныеОстатки КАК ДенежныеОстатки
	|		ПО СписокДоговоровОПС.ДоговорОПС = ДенежныеОстатки.ДоговорОПС
	#Вставка
	// +ХМНПФ 23.10.2017 ШадринАВ // ПроверитьОстаткиПоЕдиновременнойВыплатеОПС() // №1198
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорОПС,
	|	СуммаОстаток
	// -ХМНПФ 23.10.2017 ШадринАВ // ПроверитьОстаткиПоЕдиновременнойВыплатеОПС() // №1198
	#КонецВставки
	|ИТОГИ
	|	МАКСИМУМ(Сумма),
	|	СУММА(СуммаОстаток),
	|	СУММА(СуммаКомпенсации),
	|	СУММА(СуммаВосполнения),
	|	СУММА(СуммаВозмещения),
	|	СУММА(СуммаВРезервеНачислений),
	|	СУММА(СуммаКомпенсацииРН),
	|	СУММА(СуммаВосполненияРН),
	|	СУММА(СуммаВозмещенияРН),
	|	МАКСИМУМ(РКО),
	|	СУММА(Невыплата)
	|ПО
	|	ДоговорОПС";
	
	Запрос.УстановитьПараметр("ДатаДок", КонецДня(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокДоговоров", ДоговорыОПС.ВыгрузитьКолонку("ДоговорОПС"));
	Запрос.УстановитьПараметр("СписокЗЛ", ДоговорыОПС.ВыгрузитьКолонку("Участник"));
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ЕдВыплата", Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС);
	Запрос.УстановитьПараметр("ТипРезерваНачисления", Перечисления.уп_ТипыРезервовОПС.РезервНачисленийЕВ);
	Запрос.УстановитьПараметр("ПустойТипСуммы", Справочники.уп_ТипыСуммОПС.ПустаяСсылка());
	//Результат = Запрос.Выполнить().Выгрузить();
	Результат = Запрос.Выполнить();
	Возврат Результат;
КонецФункции	

&ИзменениеИКонтроль("ПроверитьОстаткиПоНаследованиюОПС") 
Функция РасшОбщ_ПроверитьОстаткиПоНаследованиюОПС()
	//добавить сюда остатки по резервам начисления
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уп_ВыплатныеРеестрыДоговорыОПС.ДоговорОПС КАК ДоговорОПС,
	|	СУММА(уп_ВыплатныеРеестрыДоговорыОПС.Сумма) КАК Сумма,
	|	СУММА(уп_ВыплатныеРеестрыДоговорыОПС.РКО) КАК РКО,
	|	уп_ВыплатныеРеестрыДоговорыОПС.Участник КАК Участник,
	|	уп_ВыплатныеРеестрыДоговорыОПС.НДФЛ КАК НДФЛ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.ДоговорОПС, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Невыплата
	|ПОМЕСТИТЬ СписокДоговоровОПС
	|ИЗ
	|	Документ.уп_ВыплатныеРеестры.ДоговорыОПС КАК уп_ВыплатныеРеестрыДоговорыОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ВыплатныеРеестры.НеисполненныеВыплаты КАК уп_ВыплатныеРеестрыНеисполненныеВыплаты
	|		ПО уп_ВыплатныеРеестрыДоговорыОПС.Ссылка = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Ссылка
	|			И уп_ВыплатныеРеестрыДоговорыОПС.ДоговорОПС = уп_ВыплатныеРеестрыНеисполненныеВыплаты.ДоговорОПС
	|			И уп_ВыплатныеРеестрыДоговорыОПС.Участник = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Участник
	|ГДЕ
	|	уп_ВыплатныеРеестрыДоговорыОПС.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_ВыплатныеРеестрыДоговорыОПС.ДоговорОПС,
	|	уп_ВыплатныеРеестрыДоговорыОПС.Участник,
	|	уп_ВыплатныеРеестрыДоговорыОПС.НДФЛ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.ДоговорОПС, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокДоговоровОПС.ДоговорОПС КАК ДоговорОПС,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ПрочиеНачисленияОПСОстатки.ДокументРегистрации КАК ДокументРегистрации,
	|	СписокДоговоровОПС.Участник КАК Участник,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстатки.НалоговаяБазаПоНДФЛОстаток, 0) КАК НалоговаяБазаПоНДФЛОстаток,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстатки.ТипРезерва, &ПустойТипРезерва) КАК ТипРезерва,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстатки.ТипСуммы, &ПустойТипСуммы) КАК ТипСуммы,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстатки.СуммаКомпенсацииОстаток, 0) КАК СуммаКомпенсацииОстаток,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстатки.СуммаВосполненияОстаток, 0) КАК СуммаВосполненияОстаток,
	|	ЕСТЬNULL(ПрочиеНачисленияОПСОстатки.СуммаВозмещенияОстаток, 0) КАК СуммаВозмещенияОстаток,
	|	СписокДоговоровОПС.РКО КАК РКО,
	|	СписокДоговоровОПС.Сумма КАК Сумма,
	|	СписокДоговоровОПС.НДФЛ КАК НДФЛ,
	|	СписокДоговоровОПС.Невыплата КАК Невыплата,
	|	ПрочиеНачисленияОПСОстатки.Решение КАК Решение
	|ИЗ
	|	СписокДоговоровОПС КАК СписокДоговоровОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_ПрочиеНачисленияОПС.Остатки(
	|				&ДатаДок,
	|				ДоговорОПС В (&СписокДоговоров)
	|					И Организация = &Организация
	|					И Участник В (&СписокПравопреемников)
	#Вставка
	// +ХМНПФ 17.04.2020 ШадринАВ // ПроверитьОстаткиПоНаследованиюОПС() // №2789
	|					И ХМ_Возврат = &ХМ_ВыплатаПоВозвратам
	// -ХМНПФ 17.04.2020 ШадринАВ // ПроверитьОстаткиПоНаследованиюОПС() // №2789
	#КонецВставки
	|					И ТипВыплаты = &Наследник) КАК ПрочиеНачисленияОПСОстатки
	|		ПО СписокДоговоровОПС.ДоговорОПС = ПрочиеНачисленияОПСОстатки.ДоговорОПС
	|			И СписокДоговоровОПС.Участник = ПрочиеНачисленияОПСОстатки.Участник
	|ИТОГИ
	|	СУММА(СуммаОстаток),
	|	СУММА(НалоговаяБазаПоНДФЛОстаток),
	|	СУММА(СуммаКомпенсацииОстаток),
	|	СУММА(СуммаВосполненияОстаток),
	|	СУММА(СуммаВозмещенияОстаток),
	|	МАКСИМУМ(РКО),
	|	МАКСИМУМ(Сумма),
	|	МАКСИМУМ(НДФЛ),
	|	СУММА(Невыплата)
	|ПО
	|	Участник,
	|	ДоговорОПС";
	#Вставка
	// +ХМНПФ 17.04.2020 ШадринАВ // ПроверитьОстаткиПоНаследованиюОПС() // №2789
	Запрос.УстановитьПараметр("ХМ_ВыплатаПоВозвратам", ЭтотОбъект.ХМ_ВыплатаПоВозвратам);
	// -ХМНПФ 17.04.2020 ШадринАВ // ПроверитьОстаткиПоНаследованиюОПС() // №2789
	#КонецВставки
	//Запрос.УстановитьПараметр("ДатаДок", КонецДня(Дата));
	Запрос.УстановитьПараметр("ДатаДок", Новый 	Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокДоговоров", ДоговорыОПС.ВыгрузитьКолонку("ДоговорОПС"));
	Запрос.УстановитьПараметр("СписокПравопреемников", ДоговорыОПС.ВыгрузитьКолонку("Участник"));
	Запрос.УстановитьПараметр("Наследник", Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ПустойТипРезерва", Перечисления.уп_ТипыРезервовОПС.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойТипСуммы", Справочники.уп_ТипыСуммОПС.ПустаяСсылка());
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
КонецФункции	

&ИзменениеИКонтроль("ДвиженияПоВыплатеПенсийОПС")
Процедура РасшОбщ_ДвиженияПоВыплатеПенсийОПС(Отказ,Заголовок)
	
	РезультатЗапроса = ПроверитьОстаткиПоНачислениюПенсийОПС();
	
	ТабНачислений = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_НачисленияПенсийОПС");
	ТабРезервов = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_РезервыОПС");
	ТабВыплат = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ВыплатыОПС");
	ТабОтвергнутых = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ОтвергнутыеПлатежиПенсийОПС");
	
	ТаблицаСписания = Новый ТаблицаЗначений;
	ТаблицаСписания.Колонки.Добавить("ДоговорОПС", Новый ОписаниеТипов("СправочникСсылка.уп_ДоговорыОПС"));
	ТаблицаСписания.Колонки.Добавить("ТипСуммы", Новый ОписаниеТипов("СправочникСсылка.уп_ТипыСуммОПС"));
	ТаблицаСписания.Колонки.Добавить("ТипРезерва", Новый ОписаниеТипов("ПеречислениеСсылка.уп_ТипыРезервовОПС"));
	ТаблицаСписания.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаСписания.Колонки.Добавить("СуммаКомпенсации", Новый ОписаниеТипов("Число"));
	ТаблицаСписания.Колонки.Добавить("СуммаВосполнения", Новый ОписаниеТипов("Число"));
	ТаблицаСписания.Колонки.Добавить("СуммаВозмещения", Новый ОписаниеТипов("Число"));
	
	ВыборкаДоговоров = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДоговоров.Следующий() Цикл
		Если ВыборкаДоговоров.Невыплата = 0 или ФормироватьОтвергнутыеПлатежи Тогда
			//Для Каждого стр из ДоговорыОПС Цикл
			//НаборСтрок = ТаблицаОстатков.НайтиСтроки(Новый Структура("ДоговорОПС, НачалоПериодаНачисления, ТипПенсии",стр.ДоговорОПС,стр.НачалоПериодаНачисления, стр.ТипПенсииОПС));
			ВыборкаТиповПенсии = ВыборкаДоговоров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаТиповПенсии.Следующий() Цикл
				ВыборкаПериодов = ВыборкаТиповПенсии.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПериодов.Следующий() Цикл
					Выборка = ВыборкаПериодов.Выбрать();
					Если Выборка.Количество()>0 Тогда
						ОсталосьСписать = ВыборкаПериодов.Сумма;
						ОсталосьРКО = ВыборкаПериодов.РКО;
						//Для каждого СтрокаНабора из НаборСтрок Цикл
						Пока Выборка.Следующий() Цикл
							СуммаКСписанию = Мин(Выборка.СуммаОстаток, ОсталосьСписать);
							//проверяем
							Если СуммаКСписанию>Выборка.СуммаОстаток-Выборка.СуммаКомпенсацииОстаток-Выборка.СуммаВосполненияОстаток-Выборка.СуммаВозмещенияОстаток Тогда
								СуммаКСписаниюБезКомпенсаций = Выборка.СуммаОстаток-Выборка.СуммаКомпенсацииОстаток-Выборка.СуммаВосполненияОстаток-Выборка.СуммаВозмещенияОстаток;
								СуммаОстаткаКСписанию = СуммаКСписанию-СуммаКСписаниюБезКомпенсаций;
								
								СуммаКомпенсацииКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаКомпенсацииОстаток);
								СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
								
								СуммаВосполненияКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаВосполненияОстаток);
								СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВосполненияКСписанию;
								
								СуммаВозмещенияКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаВозмещенияОстаток);
								СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВозмещенияКСписанию;
							Иначе
								СуммаКомпенсацииКСписанию = 0;
								СуммаВосполненияКСписанию = 0;
								СуммаВозмещенияКСписанию = 0;
							КонецЕсли;
							#Вставка
							// +ХМНПФ 31.03.2020 ШадринАВ // ДвиженияПоВыплатеПенсийОПС() // №2732
							ХМ_НомерДоговора = СокрЛП(ВыборкаПериодов.ДоговорОПС.Наименование);
							Если (ХМ_НомерДоговора = "0706-ПС-07198" ИЛИ ХМ_НомерДоговора = "0706-ПС-06012" ИЛИ ХМ_НомерДоговора = "0613-ПС-01259") И Выборка.СуммаОстаток<0 И ОсталосьСписать<0 
								И ХМ_ВключенМеханизмУдержанийПоДоговоруОПС(ВыборкаПериодов.ДоговорОПС) Тогда
								СуммаКСписанию = Макс(Выборка.СуммаОстаток, ОсталосьСписать);
							КонецЕсли;
							// -ХМНПФ 31.03.2020 ШадринАВ // ДвиженияПоВыплатеПенсийОПС() // №2732
							#КонецВставки
							
							РКОКСписанию = Мин(СуммаКСписанию, ОсталосьРКО);
							Если РКОКСписанию<=0 Тогда
								РКОКСписанию = 0;
							КонецЕсли;	
							
							Движение = ТабНачислений.Добавить();
							Движение.Активность = Истина;
							Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
							//Движение = Движения.уп_НачисленияПенсийОПС.ДобавитьРасход();
							Движение.ДоговорОПС = Выборка.ДоговорОПС;
							Движение.Период = Дата;
							Движение.НачПериода = Выборка.НачалоПериодаНачисления;
							Движение.ТипПенсии = Выборка.ТипПенсии;
							Движение.ПериодичностьВыплат = Выборка.ПериодичностьВыплат;
							Движение.ТипСуммы = Выборка.ТипСуммы;
							Движение.Сумма = СуммаКСписанию;
							Движение.СуммаКомпенсации = СуммаКомпенсацииКСписанию;
							Движение.СуммаВосполнения = СуммаВосполненияКСписанию;
							Движение.СуммаВозмещения = СуммаВозмещенияКСписанию;
							
							Если ВыборкаДоговоров.Невыплата > 0 и ФормироватьОтвергнутыеПлатежи Тогда
								Движение = ТабОтвергнутых.Добавить();
								Движение.Активность = Истина;
								Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
								Движение.Организация = Организация;
								Движение.ДоговорОПС = Выборка.ДоговорОПС;
								Движение.Период = Дата;
								Движение.НачПериода = Выборка.НачалоПериодаНачисления;
								Движение.ТипПенсии = Выборка.ТипПенсии;
								Движение.ПериодичностьВыплат = Выборка.ПериодичностьВыплат;
								Движение.ТипСуммы = Выборка.ТипСуммы;
								Движение.Сумма = СуммаКСписанию;
								Движение.СуммаКомпенсации = СуммаКомпенсацииКСписанию;
								Движение.СуммаВосполнения = СуммаВосполненияКСписанию;
								Движение.СуммаВозмещения = СуммаВозмещенияКСписанию;
								Движение.ДокументВыплаты = Ссылка;
								Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.Возврат;
							КонецЕсли;
							
							Если  ВыборкаДоговоров.Невыплата = 0 Тогда
								НовСтрТабСписания = ТаблицаСписания.Добавить();
								НовСтрТабСписания.ДоговорОПС = Выборка.ДоговорОПС;
								НовСтрТабСписания.ТипСуммы = Выборка.ТипСуммы;
								Если Выборка.ТипПенсии = Перечисления.уп_ТипыПенсийОПС.Пожизненная Тогда
									НовСтрТабСписания.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНП;
								Иначе
									НовСтрТабСписания.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийСВ;
								КонецЕсли;
								НовСтрТабСписания.Сумма = СуммаКСписанию;
								
								Движение = ТабВыплат.Добавить();
								Движение.Активность = Истина;
								//Движение = Движения.уп_ВыплатыОПС.Добавить();
								Движение.ДоговорОПС = Выборка.ДоговорОПС;
								Движение.Организация = Организация;
								Движение.Период = Дата;
								Если ПоИсполнительномуЛисту Тогда
									Движение.Участник = Получатель;
								Иначе
									Движение.Участник = Выборка.Участник;
								КонецЕсли;
								Если Выборка.ТипПенсии = Перечисления.уп_ТипыПенсийОПС.Пожизненная Тогда
									Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС;
									ВидДвижения = Перечисления.уп_ВидыДвижений.НачислениеПенсийОПС;
								Иначе
									Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.СрочнаяПенсияОПС;
									ВидДвижения = Перечисления.уп_ВидыДвижений.НачислениеСрочнойПенсииОПС;
								КонецЕсли;
								Движение.ТипСуммы = Выборка.ТипСуммы;
								Движение.Сумма = СуммаКСписанию;
								Движение.РКО = РКОКСписанию;
								Движение.Выплата = СуммаКСписанию-РКОКСписанию;
							КонецЕсли;
							
							ОсталосьСписать = ОсталосьСписать-СуммакСписанию;
							ОсталосьРКО = ОсталосьРКО-РКОКСписанию;
							Если НЕ ПроводкиПоНачислению Тогда
								Если  ВыборкаДоговоров.Невыплата = 0 Тогда
									ДвиженияПоБухУчету(Дата, ВидДвижения, Выборка.Участник, Выборка.ДоговорОПС.ДоговорКонтрагента, 
									Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получатель, Получатель.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, СуммаКСписанию);
								КонецЕсли;
							КонецЕсли;
							Если ОсталосьСписать = 0 Тогда
								//еще РКО
								Если РКОВСумме Тогда
									Если ВыборкаПериодов.ТипПенсии = Перечисления.уп_ТипыПенсийОПС.Пожизненная Тогда
										ПризнакДт = Истина;
									Иначе
										ПризнакДт = Ложь;
									КонецЕсли;	
									ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.РКО, Получатель, Получатель.ОсновнойДоговорКонтрагента, 
									Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), ПризнакДт, Получатель, Получатель.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Выборка.РКО);
								КонецЕсли;	
								Прервать;
							КонецЕсли;
						КонецЦикла;
						Если ОсталосьСписать<>0 Тогда
							уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору ОПС №"+ВыборкаПериодов.ДоговорОПС.Код+" застрахованному лицу "+ВыборкаПериодов.ДоговорОПС.Участник+" сумма к выплате "+ВыборкаПериодов.Сумма+" превышает сумму начисленную на "+ОсталосьСписать+".",,Заголовок);
							отказ = Истина;
						КонецЕсли;
					Иначе
						уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору ОПС №"+ВыборкаТиповПенсии.ДоговорОПС.Код+" застрахованному лицу "+ВыборкаТиповПенсии.ДоговорОПС.Участник+" не обнаружено начислений.",,Заголовок);
						отказ = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	//списываем резерв начислений
	ТаблицаСписания.Свернуть("ДоговорОПС, ТипРезерва, ТипСуммы", "Сумма, СуммаКомпенсации, СуммаВосполнения, СуммаВозмещения");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабСписания.ДоговорОПС КАК ДоговорОПС,
	|	ТабСписания.ТипРезерва КАК ТипРезерва,
	|	ТабСписания.ТипСуммы КАК ТипСуммы,
	|	ТабСписания.Сумма,
	|	ТабСписания.СуммаКомпенсации,
	|	ТабСписания.СуммаВосполнения,
	|	ТабСписания.СуммаВозмещения
	|ПОМЕСТИТЬ ТабСписания
	|ИЗ
	|	&ТабСписания КАК ТабСписания
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДоговорОПС,
	|	ТипРезерва,
	|	ТипСуммы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_РезервыОПСОстатки.ДоговорОПС,
	|	уп_РезервыОПСОстатки.ТипСуммы,
	|	уп_РезервыОПСОстатки.ТипРезерва,
	|	уп_РезервыОПСОстатки.СуммаОстаток,
	|	уп_РезервыОПСОстатки.СуммаКомпенсацииОстаток,
	|	уп_РезервыОПСОстатки.СуммаВосполненияОстаток,
	|	уп_РезервыОПСОстатки.СуммаВозмещенияОстаток
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.уп_РезервыОПС.Остатки(
	|			&ДатаДок,
	|			ДоговорОПС В
	|					(ВЫБРАТЬ
	|						ТабСписания.ДоговорОПС
	|					ИЗ
	|						ТабСписания)
	|				И Организация = &Организация
	|				И ТипРезерва В (&ТипыРезервовНачислений)) КАК уп_РезервыОПСОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСписания.ДоговорОПС,
	|	ТабСписания.ТипРезерва,
	|	ТабСписания.ТипСуммы,
	|	ТабСписания.Сумма,
	|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ТабСписания.СуммаКомпенсации,
	|	ТабСписания.СуммаВосполнения,
	|	ТабСписания.СуммаВозмещения,
	#Вставка
	// +ХМНПФ 23.01.2020 ШадринАВ // ДвиженияПоВыплатеПенсийОПС() // №2632
	|	ЕСТЬNULL(ХМ_ПроцентУдержанияИзВыплатыОПС.ЗадолженностьПогашена, ИСТИНА) КАК ХМ_ЗадолженностьПогашена,
	// -ХМНПФ 23.01.2020 ШадринАВ // ДвиженияПоВыплатеПенсийОПС() // №2632
	#КонецВставки
	|	ЕСТЬNULL(Остатки.СуммаКомпенсацииОстаток, 0) КАК СуммаКомпенсацииОстаток,
	|	ЕСТЬNULL(Остатки.СуммаВосполненияОстаток, 0) КАК СуммаВосполненияОстаток,
	|	ЕСТЬNULL(Остатки.СуммаВозмещенияОстаток, 0) КАК СуммаВозмещенияОстаток
	|ИЗ
	|	ТабСписания КАК ТабСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ТабСписания.ДоговорОПС = Остатки.ДоговорОПС
	|			И ТабСписания.ТипРезерва = Остатки.ТипРезерва
	#Удаление
	|			И ТабСписания.ТипСуммы = Остатки.ТипСуммы";
	#КонецУдаления
	#Вставка
	// +ХМНПФ 23.01.2020 ШадринАВ // ДвиженияПоВыплатеПенсийОПС() // №2632
	//|			И ТабСписания.ТипСуммы = Остатки.ТипСуммы";
	|			И ТабСписания.ТипСуммы = Остатки.ТипСуммы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХМ_ПроцентУдержанияИзВыплатыОПС.СрезПоследних(&ДатаДок, ТипВыплат = &ТипВыплат) КАК ХМ_ПроцентУдержанияИзВыплатыОПС
	|		ПО ТабСписания.ДоговорОПС = ХМ_ПроцентУдержанияИзВыплатыОПС.ДоговорОПС";
	
	// +ХМНПФ 03.07.2025 ЛыткинАМ //Досписание	
	Запрос.Текст = Запрос.Текст + " 
	|УПОРЯДОЧИТЬ ПО
	|	ТабСписания.ДоговорОПС,
	|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) - ТабСписания.Сумма";
	// -ХМНПФ 03.07.2025 ЛыткинАМ //Досписание	
	
	Запрос.УстановитьПараметр("ТипВыплат", ТипВыплаты);
	// -ХМНПФ 23.01.2020 ШадринАВ // ДвиженияПоВыплатеПенсийОПС() // №2632
	#КонецВставки
	
	Запрос.УстановитьПараметр("ТабСписания", ТаблицаСписания);
	Запрос.УстановитьПараметр("ДатаДок", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", Организация);
	ТипыРезервовНачислений = Новый СписокЗначений;
	ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНП);
	ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийСВ);
	Запрос.УстановитьПараметр("ТипыРезервовНачислений", ТипыРезервовНачислений);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	#Вставка
	// +ХМНПФ 04.07.2025 КопыткоАА Досписание
	ДоговорДосписания = "";
	Досписание = 0;
	// -ХМНПФ 04.07.2025 КопыткоАА Досписание
	#КонецВставки
	Пока Выборка.Следующий() Цикл
		#Вставка
		// +ХМНПФ 15.04.2020 ШадринАВ // ДвиженияПоВыплатеПенсийОПС() // №2785
		Если ХМ_ВыплатаПоВозвратам Тогда Прервать; КонецЕсли;
		// -ХМНПФ 15.04.2020 ШадринАВ // ДвиженияПоВыплатеПенсийОПС() // №2785
		#КонецВставки
		Если Выборка.СуммаОстаток<>0 Тогда
			#Вставка
			// +ХМНПФ 04.07.2025 КопыткоАА Досписание
			Если НЕ ДоговорДосписания = Выборка.ДоговорОПС Тогда
				ДоговорДосписания = Выборка.ДоговорОПС;	
				Досписание = 0;
			КонецЕсли;
			// -ХМНПФ 04.07.2025 КопыткоАА Досписание
			#КонецВставки
			Движение = ТабРезервов.Добавить();
			Движение.Активность = Истина;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			//Движение = Движения.уп_РезервыОПС.ДобавитьРасход();
			Движение.ДоговорОПС = Выборка.ДоговорОПС;
			Движение.Организация = Организация;
			Движение.Период = Дата;
			Движение.ТипРезерва = Выборка.ТипРезерва;
			Движение.ТипСуммы = Выборка.ТипСуммы;
			#Удаление
			Движение.Сумма = Мин(Выборка.СуммаОстаток,Выборка.Сумма);
			#КонецУдаления
			#Вставка
			// +ХМНПФ 03.07.2025 ЛыткинАМ //Досписание
			Движение.Сумма = Мин(Выборка.СуммаОстаток,Выборка.Сумма + Макс(Досписание,0));
			// -ХМНПФ 03.07.2025 ЛыткинАМ //Досписание
			// +ХМНПФ 081.10.2024 ЛыткинАМ // ДвиженияПоВыплатеПенсийОПС() // №2732
			Если Выборка.Сумма < 0 Тогда
				// +ХМНПФ 03.07.2025 ЛыткинАМ //Досписание
				Движение.Сумма = Макс(Выборка.СуммаОстаток,Выборка.Сумма + Макс(Досписание,0));
				// -ХМНПФ 03.07.2025 ЛыткинАМ //Досписание
			КонецЕсли;
			// +ХМНПФ 03.07.2025 ЛыткинАМ //Досписание
			Досписание = Досписание +  Выборка.Сумма - Движение.Сумма;
			// -ХМНПФ 03.07.2025 ЛыткинАМ //Досписание
			// -ХМНПФ 081.10.2024 ЛыткинАМ // ДвиженияПоВыплатеПенсийОПС() // №2732
			#КонецВставки
			Движение.СуммаКомпенсации = Мин(Выборка.СуммаКомпенсацииОстаток,Выборка.СуммаКомпенсации);
			Движение.СуммаВосполнения = Мин(Выборка.СуммаВосполненияОстаток,Выборка.СуммаВосполнения);
			Движение.СуммаВозмещения = Мин(Выборка.СуммаВозмещенияОстаток,Выборка.СуммаВозмещения);
			#Вставка
			// +ХМНПФ 23.01.2020 ШадринАВ // ДвиженияПоВыплатеПенсийОПС() // №2632
			Если НЕ Выборка.ХМ_ЗадолженностьПогашена Тогда
				Движение.Сумма = Выборка.Сумма;
				Движение.СуммаКомпенсации = Выборка.СуммаКомпенсации;
				Движение.СуммаВосполнения = Выборка.СуммаВосполнения;
				Движение.СуммаВозмещения = Выборка.СуммаВозмещения;
			КонецЕсли;
			// -ХМНПФ 23.01.2020 ШадринАВ // ДвиженияПоВыплатеПенсийОПС() // №2632
			#КонецВставки
		КонецЕсли;	
	КонецЦикла;	
	
	Если ПоИсполнительномуЛисту Тогда
		Для Каждого стр из ДоговорыОПС Цикл
			Движение = Движения.уп_ВыплатыПоИсполнительнымЛистам.Добавить();
			Движение.Период = Дата;
			Движение.ИсполнительныйЛист = ИсполнительныйЛист;
			Движение.Организация = Организация;
			Движение.Участник = стр.Участник;
			Движение.Сумма = стр.Выплата;
		КонецЦикла;	
	КонецЕсли;	
	
	Если НЕ Отказ Тогда
		Движения.уп_НачисленияПенсийОПС.Загрузить(ТабНачислений);
		Движения.уп_РезервыОПС.Загрузить(ТабРезервов);
		Движения.уп_ВыплатыОПС.Загрузить(ТабВыплат);
		Движения.уп_ОтвергнутыеПлатежиПенсийОПС.Загрузить(ТабОтвергнутых);
		
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС Тогда
			Если СуммаРКО<>0 Тогда
				//еще РКО - проверим источник
				ИзРОПС = РегистрыСведений.уп_ПорядокРасчетаРКО.ПолучитьПоследнее(Дата, Новый Структура("Организация, ТипВыплаты", Организация, ТипВыплаты)).ЗаСчетРезервов;
				Если ИзРОПС Тогда
					Движение = Движения.уп_РезервыОПС.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Организация = Организация;
					Движение.Период = Дата;
					Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС;
					Движение.Движение = Перечисления.уп_ВидыДвижений.РКО;
					Движение.Сумма = СуммаРКО;
				КонецЕсли;	
				//движений по БУ делать не будем, т.к. не ясно с начислением работают или сразу на расходы кидают
			КонецЕсли;
		КонецЕсли;				
	КонецЕсли;	
КонецПроцедуры	

&ИзменениеИКонтроль("ДвиженияПоЕдиновременнойВыплатеОПС")
Процедура РасшОбщ_ДвиженияПоЕдиновременнойВыплатеОПС(Отказ,Заголовок)
	СтарыйАлгоритм = ?(РасшифровкаСуммы.Количество() = 0, Истина, Ложь);
	
	ТабНачислений = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ПрочиеНачисленияОПС");
	ТабРезервов = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_РезервыОПС");
	ТабВыплат = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ВыплатыОПС");
	ТабОтвергнутых = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ОтвергнутыеПлатежиПрочиеНачисленияОПС");
	
	Если  СтарыйАлгоритм Тогда
		РезультатЗапроса = ПроверитьОстаткиПоЕдиновременнойВыплатеОПС();
		ВыборкаДоговоров = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДоговоров.Следующий() Цикл
			Если ВыборкаДоговоров.Невыплата = 0 Тогда
				//Для Каждого стр из ДоговорыОПС Цикл
				//НаборСтрок = ТаблицаОстатков.НайтиСтроки(Новый Структура("Участник,ДоговорОПС",стр.Участник,стр.ДоговорОПС));
				Выборка = ВыборкаДоговоров.Выбрать();
				Если Выборка.Количество()>0 Тогда
					ОсталосьСписать = ВыборкаДоговоров.Сумма;
					ОсталосьРКО = ВыборкаДоговоров.РКО;
					//Для каждого СтрокаНабора из НаборСтрок Цикл
					Пока Выборка.Следующий() Цикл
						СуммаКСписанию = Мин(Выборка.СуммаОстаток, ОсталосьСписать);
						Если СуммаКСписанию<>0 Тогда
							Движение = ТабНачислений.Добавить();
							Движение.Активность = Истина;
							Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
							//Движение = Движения.уп_ПрочиеНачисленияОПС.ДобавитьРасход();
							Движение.ДоговорОПС = Выборка.ДоговорОПС;
							Движение.Организация = Организация;
							Движение.ДокументРегистрации = Выборка.ДокументРегистрации;
							Движение.Период = Дата;
							Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС;
							Движение.Участник = Выборка.Участник;
							Движение.ТипСуммы = Выборка.ТипСуммы;
							Движение.Сумма = СуммаКСписанию;
							Движение.СуммаКомпенсации = Выборка.СуммаКомпенсации;
							Движение.СуммаВосполнения = Выборка.СуммаВосполнения;
							Движение.СуммаВозмещения = Выборка.СуммаВозмещения;
							ОсталосьСписать = ОсталосьСписать-СуммакСписанию;
							
							Движение = ТабВыплат.Добавить();
							Движение.Активность = Истина;
							//Движение = Движения.уп_ВыплатыОПС.Добавить();
							Движение.ДоговорОПС = Выборка.ДоговорОПС;
							Движение.Организация = Организация;
							Движение.Период = Дата;
							Если ПоИсполнительномуЛисту Тогда
								Движение.Участник = Получатель;
							Иначе
								Движение.Участник = Выборка.Участник;
							КонецЕсли;	
							Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС;
							Движение.ТипСуммы = Выборка.ТипСуммы;
							Движение.Сумма = СуммаКСписанию;
							ТекСуммаРКО = Мин(ОсталосьРКО,СуммаКСписанию);
							Если РКОВСумме Тогда
								Движение.РКО = ТекСуммаРКО;
								ТекСуммаВыплаты = СуммаКСписанию - ТекСуммаРКО;
								ОсталосьРКО = ОсталосьРКО-ТекСуммаРКО;
							Иначе
								ТекСуммаВыплаты = СуммаКСписанию;
							КонецЕсли;	
							Движение.Выплата = ТекСуммаВыплаты;
							
							Если Выборка.СуммаВРезервеНачислений<>0 Тогда
								Движение = ТабРезервов.Добавить();
								Движение.Активность = Истина;
								Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
								//Движение = Движения.уп_РезервыОПС.ДобавитьРасход();
								Движение.ДоговорОПС = Выборка.ДоговорОПС;
								Движение.Организация = Организация;
								Движение.Период = Дата;
								Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийЕВ;
								Движение.ТипСуммы = Выборка.ТипСуммы;
								Движение.Сумма = Мин(Выборка.СуммаВРезервеНачислений,СуммаКСписанию);
								Движение.СуммаКомпенсации = Мин(Выборка.СуммаКомпенсацииРН,Выборка.СуммаКомпенсации);
								Движение.СуммаВосполнения = Мин(Выборка.СуммаВосполненияРН,Выборка.СуммаВосполнения);
								Движение.СуммаВозмещения = Мин(Выборка.СуммаВозмещенияРН,Выборка.СуммаВозмещения);
							КонецЕсли;
							
							Если НЕ ПроводкиПоНачислению Тогда
								ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.ЕдиновременнаяВыплатаОПС, Выборка.Участник, Выборка.ДоговорОПС.ДоговорКонтрагента, 
								Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получатель, Получатель.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, СуммаКСписанию);
							КонецЕсли;
							Если ОсталосьСписать = 0 Тогда
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					Если ОсталосьСписать<>0 Тогда
						уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору ОПС №"+ВыборкаДоговоров.ДоговорОПС.Код+" застрахованному лицу "+ВыборкаДоговоров.ДоговорОПС.Участник+" сумма к выплате "+ВыборкаДоговоров.Сумма+" превышает сумму начисленную на "+ОсталосьСписать+".",,Заголовок);
						отказ = Истина;
					КонецЕсли;
					
					//еще РКО
					Если РКОВСумме Тогда
						ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.РКО, Получатель, Получатель.ОсновнойДоговорКонтрагента, 
						Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получатель, Получатель.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ВыборкаДоговоров.РКО);
					КонецЕсли;
				Иначе
					уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору ОПС №"+ВыборкаДоговоров.ДоговорОПС.Код+" застрахованному лицу "+ВыборкаДоговоров.ДоговорОПС.Участник+" не обнаружено начислений.",,Заголовок);
					отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		РезультатЗапроса = ПроверитьОстаткиПоЕВСРасшифровкойОПС();
		ВыборкаДоговоров = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ТабСписанныхНачислений = Новый ТаблицаЗначений;
		ТабСписанныхНачислений.Колонки.Добавить("ДоговорОПС", Новый ОписаниеТипов("СправочникСсылка.уп_ДоговорыОПС"));
		ТабСписанныхНачислений.Колонки.Добавить("ТипСуммы", Новый ОписаниеТипов("СправочникСсылка.уп_ТипыСуммОПС"));
		ТабСписанныхНачислений.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
		ТабСписанныхНачислений.Колонки.Добавить("СуммаКомпенсации", Новый ОписаниеТипов("Число"));
		ТабСписанныхНачислений.Колонки.Добавить("СуммаВозмещения", Новый ОписаниеТипов("Число"));
		ТабСписанныхНачислений.Колонки.Добавить("СуммаВосполнения", Новый ОписаниеТипов("Число"));
		Пока ВыборкаДоговоров.Следующий() Цикл
			Если ВыборкаДоговоров.Невыплата = 0 или ФормироватьОтвергнутыеПлатежи Тогда
				//Для Каждого стр из ДоговорыОПС Цикл
				//НаборСтрок = ТаблицаОстатков.НайтиСтроки(Новый Структура("Участник,ДоговорОПС",стр.Участник,стр.ДоговорОПС));
				ОсталосьСписать = ВыборкаДоговоров.Сумма;
				ОсталосьРКО = ВыборкаДоговоров.РКО;
				
				ВыборкаТиповСумм = ВыборкаДоговоров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Если ВыборкаТиповСумм.Количество()>0 Тогда
					Пока ВыборкаТиповСумм.Следующий() Цикл
						ОсталосьСписатьПоТипуСуммы = ВыборкаТиповСумм.СуммаВТЧПоТипу;
						Выборка = ВыборкаТиповСумм.Выбрать();
						//Для каждого СтрокаНабора из НаборСтрок Цикл
						Пока Выборка.Следующий() Цикл
							Если Выборка.СуммаВТЧПоТипу>=0 Тогда
								СуммаКСписанию = Мин(Выборка.СуммаОстаток, Выборка.СуммаВТЧПоТипу);
							Иначе
								СуммаКСписанию = Макс(Выборка.СуммаОстаток, Выборка.СуммаВТЧПоТипу);
							КонецЕсли;	
							Если СуммаКСписанию<>0 Тогда
								Движение = ТабНачислений.Добавить();
								Движение.Активность = Истина;
								Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
								//Движение = Движения.уп_ПрочиеНачисленияОПС.ДобавитьРасход();
								Движение.ДоговорОПС = Выборка.ДоговорОПС;
								Движение.Организация = Организация;
								Движение.ДокументРегистрации = Выборка.ДокументРегистрации;
								Движение.Период = Дата;
								Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС;
								Движение.Участник = Выборка.Участник;
								Движение.ТипСуммы = Выборка.ТипСуммы;
								Движение.Решение = Выборка.Решение;
								Движение.Сумма = СуммаКСписанию;
								Движение.СуммаКомпенсации = Выборка.СуммаКомпенсации;
								Движение.СуммаВосполнения = Выборка.СуммаВосполнения;
								Движение.СуммаВозмещения = Выборка.СуммаВозмещения;
								ОсталосьСписать = ОсталосьСписать-СуммакСписанию;
								ОсталосьСписатьПоТипуСуммы = ОсталосьСписатьПоТипуСуммы-СуммаКСписанию;
								
								Если ВыборкаДоговоров.Невыплата > 0 и ФормироватьОтвергнутыеПлатежи Тогда
									Движение = ТабОтвергнутых.Добавить();
									Движение.Активность = Истина;
									Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
									Движение.ДоговорОПС = Выборка.ДоговорОПС;
									Движение.Организация = Организация;
									//Движение.ДокументРегистрации = Выборка.ДокументРегистрации;
									Движение.Период = Дата;
									Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС;
									Движение.Участник = Выборка.Участник;
									Движение.ТипСуммы = Выборка.ТипСуммы;
									Движение.Решение = Выборка.Решение;
									Движение.Сумма = СуммаКСписанию;
									Движение.СуммаКомпенсации = Выборка.СуммаКомпенсации;
									Движение.СуммаВосполнения = Выборка.СуммаВосполнения;
									Движение.СуммаВозмещения = Выборка.СуммаВозмещения;
									Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.Возврат;
									Движение.ДокументВыплаты = Ссылка;
								КонецЕсли;
								
								Если ВыборкаДоговоров.Невыплата = 0 Тогда
									НовСтрНачислений = ТабСписанныхНачислений.Добавить();
									НовСтрНачислений.ДоговорОПС = Выборка.ДоговорОПС;
									НовСтрНачислений.ТипСуммы = Выборка.ТипСуммы;
									НовСтрНачислений.Сумма = СуммаКСписанию;
									НовСтрНачислений.СуммаКомпенсации = Выборка.СуммаКомпенсации;
									НовСтрНачислений.СуммаВосполнения = Выборка.СуммаВосполнения;
									НовСтрНачислений.СуммаВозмещения = Выборка.СуммаВозмещения;
									
									Движение = ТабВыплат.Добавить();
									Движение.Активность = Истина;
									//Движение = Движения.уп_ВыплатыОПС.Добавить();
									Движение.ДоговорОПС = Выборка.ДоговорОПС;
									Движение.Организация = Организация;
									Движение.Период = Дата;
									Если ПоИсполнительномуЛисту Тогда
										Движение.Участник = Получатель;
									Иначе
										Движение.Участник = Выборка.Участник;
									КонецЕсли;	
									Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС;
									Движение.ТипСуммы = Выборка.ТипСуммы;
									Движение.Решение = Выборка.Решение;
									Движение.Сумма = СуммаКСписанию;
									Если СуммаКСписанию>0 Тогда
										ТекСуммаРКО = Мин(ОсталосьРКО,СуммаКСписанию);
									Иначе
										ТекСуммаРКО = 0;
									КонецЕсли;
									Если РКОВСумме Тогда
										Движение.РКО = ТекСуммаРКО;
										ТекСуммаВыплаты = СуммаКСписанию - ТекСуммаРКО;
										ОсталосьРКО = ОсталосьРКО-ТекСуммаРКО;
									Иначе
										ТекСуммаВыплаты = СуммаКСписанию;
									КонецЕсли;	
									Движение.Выплата = ТекСуммаВыплаты;
									
									Если НЕ ПроводкиПоНачислению Тогда
										ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.ЕдиновременнаяВыплатаОПС, Выборка.Участник, Выборка.ДоговорОПС.ДоговорКонтрагента, 
										Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получатель, Получатель.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, СуммаКСписанию);
									КонецЕсли;
								КонецЕсли;
								Если ОсталосьСписатьПоТипуСуммы = 0 Тогда
									Прервать;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЦикла;
					Если ОсталосьСписать<>0 Тогда
						уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору ОПС №"+ВыборкаДоговоров.ДоговорОПС.Код+" застрахованному лицу "+ВыборкаДоговоров.ДоговорОПС.Участник+" сумма к выплате "+ВыборкаДоговоров.Сумма+" превышает сумму начисленную на "+ОсталосьСписать+".",,Заголовок);
						отказ = Истина;
					КонецЕсли;
					
					//еще РКО
					Если РКОВСумме Тогда
						ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.РКО, Получатель, Получатель.ОсновнойДоговорКонтрагента, 
						Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получатель, Получатель.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ВыборкаДоговоров.РКО);
					КонецЕсли;
				Иначе
					уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору ОПС №"+ВыборкаДоговоров.ДоговорОПС.Код+" застрахованному лицу "+ВыборкаДоговоров.ДоговорОПС.Участник+" не обнаружено начислений.",,Заголовок);
					отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ТабРезервовНачислений = ЗапросПоРезервамНачисленийЕВ(ТабСписанныхНачислений);
		Выборка = ТабРезервовНачислений.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СуммаКСписанию = Мин(Выборка.Сумма, Выборка.СуммаВРезервеНачислений);
			#Вставка
			// +ХМНПФ 30.11.2020 ШадринАВ // ДвиженияПоЕдиновременнойВыплатеОПС() // №3010
			Если Выборка.Сумма<0 И Выборка.СуммаВРезервеНачислений<0 Тогда
				СуммаКСписанию = Макс(Выборка.Сумма, Выборка.СуммаВРезервеНачислений);
			КонецЕсли;
			// -ХМНПФ 30.11.2020 ШадринАВ // ДвиженияПоЕдиновременнойВыплатеОПС() // №3010
			#КонецВставки
			СуммаКомпенсации = Мин(Выборка.СуммаКомпенсации, Выборка.СуммаКомпенсацииРН);
			СуммаВосполнения = Мин(Выборка.СуммаВосполнения, Выборка.СуммаВосполненияРН);
			СуммаВозмещения = Мин(Выборка.СуммаВозмещения, Выборка.СуммаВозмещенияРН);
			Если СуммаКСписанию<>0 или СуммаКомпенсации<>0 
				или СуммаВосполнения<>0 или СуммаВозмещения<>0 Тогда
				Движение = ТабРезервов.Добавить();
				Движение.Активность = Истина;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				//Движение = Движения.уп_РезервыОПС.ДобавитьРасход();
				Движение.ДоговорОПС = Выборка.ДоговорОПС;
				Движение.Организация = Организация;
				Движение.Период = Дата;
				Движение.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийЕВ;
				Движение.ТипСуммы = Выборка.ТипСуммы;
				Если Выборка.Сумма>=0 Тогда
					Движение.Сумма = Мин(Выборка.СуммаВРезервеНачислений,СуммаКСписанию);
				Иначе
					Движение.Сумма = Макс(Выборка.СуммаВРезервеНачислений,СуммаКСписанию);
				КонецЕсли;
				Движение.СуммаКомпенсации = Мин(Выборка.СуммаКомпенсацииРН,Выборка.СуммаКомпенсации);
				Движение.СуммаВосполнения = Мин(Выборка.СуммаВосполненияРН,Выборка.СуммаВосполнения);
				Движение.СуммаВозмещения = Мин(Выборка.СуммаВозмещенияРН,Выборка.СуммаВозмещения);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ПоИсполнительномуЛисту Тогда
		Для Каждого стр из ДоговорыОПС Цикл
			Движение = Движения.уп_ВыплатыПоИсполнительнымЛистам.Добавить();
			Движение.Период = Дата;
			Движение.ИсполнительныйЛист = ИсполнительныйЛист;
			Движение.Организация = Организация;
			Движение.Участник = стр.Участник;
			Движение.Сумма = стр.Выплата;
		КонецЦикла;	
	КонецЕсли;	
	
	
	Если НЕ Отказ Тогда
		Движения.уп_ПрочиеНачисленияОПС.Загрузить(ТабНачислений);
		Движения.уп_РезервыОПС.Загрузить(ТабРезервов);
		Движения.уп_ВыплатыОПС.Загрузить(ТабВыплат);
		Движения.уп_ОтвергнутыеПлатежиПрочиеНачисленияОПС.Загрузить(ТабОтвергнутых);
	КонецЕсли;	
КонецПроцедуры	

&ИзменениеИКонтроль("ДвиженияПоНаследованиюОПС")
Процедура РасшОбщ_ДвиженияПоНаследованиюОПС(Отказ,Заголовок)
	РезультатЗапроса = ПроверитьОстаткиПоНаследованиюОПС();
	
	ТабНачислений = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ПрочиеНачисленияОПС");
	ТабРезервов = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_РезервыОПС");
	ТабВыплат = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ВыплатыОПС"); 
	ТабОтвергнутых = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ОтвергнутыеПлатежиПрочиеНачисленияОПС");
	
	ТаблицаСписания = Новый ТаблицаЗначений;
	ТаблицаСписания.Колонки.Добавить("ДоговорОПС", Новый ОписаниеТипов("СправочникСсылка.уп_ДоговорыОПС"));
	ТаблицаСписания.Колонки.Добавить("ТипСуммы", Новый ОписаниеТипов("СправочникСсылка.уп_ТипыСуммОПС"));
	ТаблицаСписания.Колонки.Добавить("ТипРезерва", Новый ОписаниеТипов("ПеречислениеСсылка.уп_ТипыРезервовОПС"));
	ТаблицаСписания.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаСписания.Колонки.Добавить("СуммаКомпенсации", Новый ОписаниеТипов("Число"));
	ТаблицаСписания.Колонки.Добавить("СуммаВосполнения", Новый ОписаниеТипов("Число"));
	ТаблицаСписания.Колонки.Добавить("СуммаВозмещения", Новый ОписаниеТипов("Число"));
	
	ТаблицаСписанияМСК = Новый ТаблицаЗначений;
	ТаблицаСписанияМСК.Колонки.Добавить("ДоговорОПС", Новый ОписаниеТипов("СправочникСсылка.уп_ДоговорыОПС"));
	ТаблицаСписанияМСК.Колонки.Добавить("ТипСуммы", Новый ОписаниеТипов("СправочникСсылка.уп_ТипыСуммОПС"));
	ТаблицаСписанияМСК.Колонки.Добавить("ТипРезерва", Новый ОписаниеТипов("ПеречислениеСсылка.уп_ТипыРезервовОПС"));
	ТаблицаСписанияМСК.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаСписанияМСК.Колонки.Добавить("СуммаКомпенсации", Новый ОписаниеТипов("Число"));
	ТаблицаСписанияМСК.Колонки.Добавить("СуммаВосполнения", Новый ОписаниеТипов("Число"));
	ТаблицаСписанияМСК.Колонки.Добавить("СуммаВозмещения", Новый ОписаниеТипов("Число"));
	
	ЕстьРазбивкаПоТипамСумм = Ложь;
	
	ВыборкаНаследников = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНаследников.Следующий() Цикл
		Если ВыборкаНаследников.Невыплата = 0 или ФормироватьОтвергнутыеПлатежи Тогда
			//Для Каждого стр из ДоговорыОПС Цикл
			//НаборСтрок = ТаблицаОстатков.НайтиСтроки(Новый Структура("Участник,ДоговорОПС",стр.Участник,стр.ДоговорОПС));
			//теперь выборка договоров
			ВыборкаДоговоров = ВыборкаНаследников.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДоговоров.Следующий() Цикл   
				ТабРешений = Новый ТаблицаЗначений;
				ТабРешений.Колонки.Добавить("Решение");
				ТабРешений.Колонки.Добавить("Сумма");
				ТабРешений.Колонки.Добавить("НДФЛ");
				ТабРешений.Колонки.Добавить("РКО");
				
				ОсталосьСписать = ВыборкаДоговоров.Сумма;
				Выборка = ВыборкаДоговоров.Выбрать();
				Если Выборка.Количество()>0 Тогда
					//Для каждого СтрокаНабора из НаборСтрок Цикл
					Пока Выборка.Следующий() Цикл
						СуммаКСписанию = Мин(Выборка.СуммаОстаток, ОсталосьСписать);
						НовСтрТабРешений = ТабРешений.Добавить();
						НовСтрТабРешений.Решение = Выборка.Решение;
						НовСтрТабРешений.Сумма = СуммаКСписанию; 
						Если СуммаКСписанию<>0 Тогда
							Движение = ТабНачислений.Добавить();
							Движение.Активность = Истина;
							Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
							//Движение = Движения.уп_ПрочиеНачисленияОПС.ДобавитьРасход();
							Движение.ДоговорОПС = Выборка.ДоговорОПС;
							Движение.Организация = Организация;
							Движение.ДокументРегистрации = Выборка.ДокументРегистрации;
							Движение.Период = Дата;
							Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС;
							Движение.Участник = Выборка.Участник;
							Движение.ТипРезерва = Выборка.ТипРезерва;
							Движение.ТипСуммы = Выборка.ТипСуммы;
							Движение.Решение = Выборка.Решение;
							Движение.Сумма = СуммаКСписанию;
							Движение.НалоговаяБазаПоНДФЛ = Выборка.НалоговаяБазаПоНДФЛОстаток;
							ОсталосьСписать = ОсталосьСписать-СуммакСписанию;
							
							СуммаКомпенсацииКСписанию = 0;
							СуммаВосполненияКСписанию = 0;
							СуммаВозмещенияКСписанию = 0;
							Если СуммаКСписанию>Выборка.СуммаОстаток-Выборка.СуммаКомпенсацииОстаток-Выборка.СуммаВосполненияОстаток-Выборка.СуммаВозмещенияОстаток Тогда
								СуммаКСписаниюБезКомпенсаций = Выборка.СуммаОстаток-Выборка.СуммаКомпенсацииОстаток-Выборка.СуммаВосполненияОстаток-Выборка.СуммаВозмещенияОстаток;
								СуммаОстаткаКСписанию = СуммаКСписанию-СуммаКСписаниюБезКомпенсаций;
								
								СуммаКомпенсацииКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаКомпенсацииОстаток);
								СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
								СуммаКомпенсацииОстаток = Выборка.СуммаКомпенсацииОстаток-СуммаКомпенсацииКСписанию;
								
								СуммаВосполненияКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаВосполненияОстаток);
								Если СуммаВосполненияКСписанию>0 Тогда
									
									СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаВосполненияКСписанию;
									СуммаВосполненияОстаток = Выборка.СуммаВосполненияОстаток-СуммаВосполненияКСписанию;
								КонецЕсли;
								
								СуммаВозмещенияКСписанию = Мин(СуммаОстаткаКСписанию, Выборка.СуммаВозмещенияОстаток);
								Если СуммаВозмещенияКСписанию>0 Тогда
									
									СуммаОстаткаКСписанию = СуммаОстаткаКСписанию-СуммаКомпенсацииКСписанию;
									СуммаВозмещенияОстаток = Выборка.СуммаВозмещенияОстаток-СуммаВозмещенияКСписанию;
								КонецЕсли;
							КонецЕсли;
							Движение.СуммаКомпенсации = СуммаКомпенсацииКСписанию;
							Движение.СуммаВосполнения = СуммаВосполненияКСписанию;
							Движение.СуммаВозмещения = СуммаВозмещенияКСписанию;
							
							Если  ВыборкаНаследников.Невыплата > 0 и ФормироватьОтвергнутыеПлатежи Тогда
								Движение = ТабОтвергнутых.Добавить();
								Движение.Активность = Истина;
								Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
								Движение.ДоговорОПС = Выборка.ДоговорОПС;
								Движение.Организация = Организация;
								Движение.Период = Дата;
								Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС;
								Движение.Участник = Выборка.Участник;
								Движение.ТипРезерва = Выборка.ТипРезерва;
								Движение.ТипСуммы = Выборка.ТипСуммы;
								Движение.Решение = Выборка.Решение;
								Движение.Сумма = СуммаКСписанию;
								Движение.НалоговаяБазаПоНДФЛ = Выборка.НалоговаяБазаПоНДФЛОстаток;
								Движение.СуммаКомпенсации = СуммаКомпенсацииКСписанию;
								Движение.СуммаВосполнения = СуммаВосполненияКСписанию;
								Движение.СуммаВозмещения = СуммаВозмещенияКСписанию;
								Движение.ДокументВыплаты = Ссылка;
								Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.Возврат;
							КонецЕсли;	
							
							Если  ВыборкаНаследников.Невыплата = 0 Тогда
								ЕстьРазбивкаПоТипамСумм = Ложь;
								Если Выборка.ТипСуммы = Справочники.уп_ТипыСуммОПС.МатКапитал ИЛИ Выборка.ТипСуммы = Справочники.уп_ТипыСуммОПС.ИДМатКапитал Тогда
									НовСтрТабСписания = ТаблицаСписанияМСК.Добавить();
								Иначе
									НовСтрТабСписания = ТаблицаСписания.Добавить();
									Если ЗначениеЗаполнено(Выборка.ТипСуммы) Тогда
										ЕстьРазбивкаПоТипамСумм = Истина;
									КонецЕсли;	
									//Если НЕ ЗначениеЗаполнено(СтрокаНабора.ТипСуммы) ИЛИ СтрокаНабора.ТипСуммы <>Тогда
									//	НовСтрТабСписания = ТаблицаСписания.Добавить();
									//Иначе //это МСК
									//	НовСтрТабСписания = ТаблицаСписанияМСК.Добавить();
								КонецЕсли;
								НовСтрТабСписания.ДоговорОПС = Выборка.ДоговорОПС;
								Если Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений
									или Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН Тогда
									НовСтрТабСписания.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРПН;
								ИначеЕсли Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты 
									или Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ Тогда
									НовСтрТабСписания.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРСВ;
								Иначе  //это резерв ОПС
									НовСтрТабСписания.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРОПС;
								КонецЕсли;	
								НовСтрТабСписания.ТипСуммы = Выборка.ТипСуммы;
								НовСтрТабСписания.Сумма = СуммаКСписанию;
								НовСтрТабСписания.СуммаКомпенсации = СуммаКомпенсацииКСписанию;
								НовСтрТабСписания.СуммаВосполнения = СуммаВосполненияКСписанию;
								НовСтрТабСписания.СуммаВозмещения = СуммаВозмещенияКСписанию;
								Если Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты Тогда
									ВидДвижения = Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамРСВОПС;
								ИначеЕсли Выборка.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервОПС Тогда
									ВидДвижения = Перечисления.уп_ВидыДвижений.ВыплатаИзРезерваОПС;
								Иначе
									ВидДвижения = Перечисления.уп_ВидыДвижений.НачислениеПравопреемникамОПС;
								КонецЕсли;	
								Если НЕ ПроводкиПоНачислению Тогда
									ДвиженияПоБухУчету(Дата, ВидДвижения, Выборка.ДоговорОПС.Участник, Выборка.ДоговорОПС.ДоговорКонтрагента, 
									Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получатель, Получатель.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, СуммаКСписанию);
								КонецЕсли;
							КонецЕсли;
							
							Если ОсталосьСписать = 0 Тогда
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					Если ОсталосьСписать<>0 Тогда
						уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору ОПС №"+ВыборкаДоговоров.ДоговорОПС.Код+" правопреемнику "+ВыборкаДоговоров.Участник+" сумма к выплате "+ВыборкаДоговоров.Сумма+" превышает сумму начисленную на "+ОсталосьСписать+".",,Заголовок);
						отказ = Истина;
					КонецЕсли;
					Если  ВыборкаНаследников.Невыплата = 0 Тогда
						ТабРешений.Свернуть("Решение", "Сумма");
						ТабРешений.Сортировать("Сумма Убыв");
						Для а = 1 По ТабРешений.Количество() Цикл
							стрРешений = ТабРешений.Получить(а-1);
							Движение = ТабВыплат.Добавить();
							Движение.Активность = Истина;
							//Движение = Движения.уп_ВыплатыОПС.Добавить();
							Движение.ДоговорОПС = ВыборкаДоговоров.ДоговорОПС;
							Движение.Организация = Организация;
							Движение.Период = Дата;
							Движение.Участник = ВыборкаДоговоров.Участник;
							Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС;
							Движение.Решение = стрРешений.Решение;
							Если ТабРешений.Количество() = 1 Тогда
								Движение.Сумма = ВыборкаДоговоров.Сумма;
								Движение.НДФЛ = ВыборкаДоговоров.НДФЛ;
								Если РКОВСумме Тогда
									Движение.РКО = ВыборкаДоговоров.РКО;
									ТекСуммаВыплаты =  ВыборкаДоговоров.Сумма - ВыборкаДоговоров.НДФЛ - ВыборкаДоговоров.РКО;
								Иначе
									ТекСуммаВыплаты =  ВыборкаДоговоров.Сумма - ВыборкаДоговоров.НДФЛ;
								КонецЕсли;
							Иначе
								Если а = 1 Тогда
									Движение.Сумма = стрРешений.Сумма;
									Движение.НДФЛ = ВыборкаДоговоров.НДФЛ;
									Если РКОВСумме Тогда
										Движение.РКО = ВыборкаДоговоров.РКО;
										ТекСуммаВыплаты =  стрРешений.Сумма - ВыборкаДоговоров.НДФЛ - ВыборкаДоговоров.РКО;
									Иначе
										ТекСуммаВыплаты =  стрРешений.Сумма - ВыборкаДоговоров.НДФЛ;
									КонецЕсли;
								Иначе
									Движение.Сумма = стрРешений.Сумма;
									ТекСуммаВыплаты =  стрРешений.Сумма;
								КонецЕсли;	
							КонецЕсли;
							Движение.Выплата = ТекСуммаВыплаты;
						КонецЦикла;
						
						//еще РКО
						ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.РКО, Получатель, Получатель.ОсновнойДоговорКонтрагента, 
						Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получатель, Получатель.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ВыборкаДоговоров.РКО);
					КонецЕсли;
				Иначе
					уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По договору ОПС №"+ВыборкаДоговоров.ДоговорОПС.Код+" правопреемнику "+ВыборкаДоговоров.Участник+" не обнаружено начислений.",,Заголовок);
					отказ = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
	
	//списываем резервы начислений
	// если есть МСК
	Если ТаблицаСписанияМСК.Итог("Сумма")<>0 Тогда
		ТаблицаСписанияМСК.Свернуть("ДоговорОПС, ТипРезерва, ТипСуммы", "Сумма, СуммаКомпенсации, СуммаВосполнения, СуммаВозмещения");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТабСписания.ДоговорОПС КАК ДоговорОПС,
		|	ТабСписания.ТипРезерва КАК ТипРезерва,
		|	ТабСписания.ТипСуммы КАК ТипСуммы,
		|	ТабСписания.Сумма,
		|	ТабСписания.СуммаКомпенсации,
		|	ТабСписания.СуммаВосполнения,
		|	ТабСписания.СуммаВозмещения
		|ПОМЕСТИТЬ ТабСписания
		|ИЗ
		|	&ТабСписания КАК ТабСписания
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС,
		|	ТипРезерва,
		|	ТипСуммы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РезервыОПСОстатки.ДоговорОПС,
		|	уп_РезервыОПСОстатки.ТипСуммы,
		|	уп_РезервыОПСОстатки.ТипРезерва,
		|	уп_РезервыОПСОстатки.СуммаОстаток,
		|	уп_РезервыОПСОстатки.СуммаКомпенсацииОстаток,
		|	уп_РезервыОПСОстатки.СуммаВосполненияОстаток,
		|	уп_РезервыОПСОстатки.СуммаВозмещенияОстаток
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.уп_РезервыОПС.Остатки(
		|			&ДатаДок,
		|			ДоговорОПС В
		|					(ВЫБРАТЬ
		|						ТабСписания.ДоговорОПС
		|					ИЗ
		|						ТабСписания)
		|				И Организация = &Организация
		|				И ТипРезерва В (&ТипыРезервовНачислений)
		|				И ТипСуммы В (&ТипыСуммаМСК)) КАК уп_РезервыОПСОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабСписания.ДоговорОПС,
		|	ТабСписания.ТипРезерва,
		|	ТабСписания.ТипСуммы,
		|	ТабСписания.Сумма,
		|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ТабСписания.СуммаКомпенсации,
		|	ТабСписания.СуммаВосполнения,
		|	ТабСписания.СуммаВозмещения,
		|	ЕСТЬNULL(Остатки.СуммаКомпенсацииОстаток, 0) КАК СуммаКомпенсацииОстаток,
		|	ЕСТЬNULL(Остатки.СуммаВосполненияОстаток, 0) КАК СуммаВосполненияОстаток,
		|	ЕСТЬNULL(Остатки.СуммаВозмещенияОстаток, 0) КАК СуммаВозмещенияОстаток
		|ИЗ
		|	ТабСписания КАК ТабСписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
		|		ПО ТабСписания.ДоговорОПС = Остатки.ДоговорОПС
		|			И ТабСписания.ТипРезерва = Остатки.ТипРезерва
		|			И ТабСписания.ТипСуммы = Остатки.ТипСуммы";
		
		Запрос.УстановитьПараметр("ТабСписания", ТаблицаСписанияМСК);
		Запрос.УстановитьПараметр("ДатаДок", Новый 	Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
		//Запрос.УстановитьПараметр("ДатаДок", КонецДня(Дата+1));
		Запрос.УстановитьПараметр("Организация", Организация);
		ТипыРезервовНачислений = Новый СписокЗначений;
		ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРСВ);
		ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРПН);
		ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРОПС);
		Запрос.УстановитьПараметр("ТипыРезервовНачислений", ТипыРезервовНачислений);
		ТипыСуммаМСК = Новый СписокЗначений;
		ТипыСуммаМСК.Добавить(Справочники.уп_ТипыСуммОПС.МатКапитал);
		ТипыСуммаМСК.Добавить(Справочники.уп_ТипыСуммОПС.ИДМатКапитал);
		Запрос.УстановитьПараметр("ТипыСуммаМСК", ТипыСуммаМСК);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.СуммаОстаток<>0 Тогда
				Движение = ТабРезервов.Добавить();
				Движение.Активность = Истина;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				//Движение = Движения.уп_РезервыОПС.ДобавитьРасход();
				Движение.ДоговорОПС = Выборка.ДоговорОПС;
				Движение.Организация = Организация;
				Движение.Период = Дата;
				Движение.ТипРезерва = Выборка.ТипРезерва;
				Движение.ТипСуммы = Выборка.ТипСуммы;
				Движение.Сумма = Мин(Выборка.СуммаОстаток,Выборка.Сумма);
				Движение.СуммаКомпенсации = Мин(Выборка.СуммаКомпенсацииОстаток,Выборка.СуммаКомпенсации);
				Движение.СуммаВосполнения = Мин(Выборка.СуммаВосполненияОстаток,Выборка.СуммаВосполнения);
				Движение.СуммаВозмещения = Мин(Выборка.СуммаВозмещенияОстаток,Выборка.СуммаВозмещения);
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	
	//все остальное
	ТаблицаСписания.Свернуть("ДоговорОПС, ТипРезерва, ТипСуммы", "Сумма, СуммаКомпенсации, СуммаВосполнения, СуммаВозмещения");
	Если ЕстьРазбивкаПоТипамСумм Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТабСписания.ДоговорОПС КАК ДоговорОПС,
		|	ТабСписания.ТипРезерва КАК ТипРезерва,
		|	ТабСписания.Сумма,
		|	ТабСписания.СуммаКомпенсации,
		|	ТабСписания.СуммаВосполнения,
		|	ТабСписания.СуммаВозмещения,
		|	ТабСписания.ТипСуммы
		|ПОМЕСТИТЬ ТабСписания
		|ИЗ
		|	&ТабСписания КАК ТабСписания
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС,
		|	ТипРезерва
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РезервыОПСОстатки.ДоговорОПС,
		|	уп_РезервыОПСОстатки.ТипРезерва,
		|	уп_РезервыОПСОстатки.СуммаОстаток,
		|	уп_РезервыОПСОстатки.ТипСуммы,
		|	уп_РезервыОПСОстатки.СуммаКомпенсацииОстаток,
		|	уп_РезервыОПСОстатки.СуммаВосполненияОстаток,
		|	уп_РезервыОПСОстатки.СуммаВозмещенияОстаток
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.уп_РезервыОПС.Остатки(
		|			&ДатаДок,
		|			ДоговорОПС В
		|					(ВЫБРАТЬ
		|						ТабСписания.ДоговорОПС
		|					ИЗ
		|						ТабСписания)
		|				И Организация = &Организация
		|				И ТипРезерва В (&ТипыРезервовНачислений)
		|				И НЕ ТипСуммы В (&ТипыСуммаМСК)) КАК уп_РезервыОПСОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабСписания.ДоговорОПС КАК ДоговорОПС,
		|	ТабСписания.ТипРезерва КАК ТипРезерва,
		|	ТабСписания.Сумма КАК Сумма,
		|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	Остатки.ТипСуммы,
		|	ЕСТЬNULL(Остатки.СуммаКомпенсацииОстаток, 0) КАК СуммаКомпенсацииОстаток,
		|	ЕСТЬNULL(Остатки.СуммаВосполненияОстаток, 0) КАК СуммаВосполненияОстаток,
		|	ЕСТЬNULL(Остатки.СуммаВозмещенияОстаток, 0) КАК СуммаВозмещенияОстаток,
		|	ТабСписания.СуммаКомпенсации,
		|	ТабСписания.СуммаВосполнения,
		|	ТабСписания.СуммаВозмещения
		|ИЗ
		|	ТабСписания КАК ТабСписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
		|		ПО ТабСписания.ДоговорОПС = Остатки.ДоговорОПС
		|			И ТабСписания.ТипРезерва = Остатки.ТипРезерва
		|			И ТабСписания.ТипСуммы = Остатки.ТипСуммы
		|ИТОГИ
		|	СУММА(Сумма),
		|	СУММА(СуммаОстаток)
		|ПО
		|	ДоговорОПС,
		|	ТипРезерва";
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТабСписания.ДоговорОПС КАК ДоговорОПС,
		|	ТабСписания.ТипРезерва КАК ТипРезерва,
		|	ТабСписания.СуммаКомпенсации,
		|	ТабСписания.СуммаВосполнения,
		|	ТабСписания.СуммаВозмещения,
		|	ТабСписания.Сумма
		|ПОМЕСТИТЬ ТабСписания
		|ИЗ
		|	&ТабСписания КАК ТабСписания
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорОПС,
		|	ТипРезерва
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РезервыОПСОстатки.ДоговорОПС,
		|	уп_РезервыОПСОстатки.ТипРезерва,
		|	уп_РезервыОПСОстатки.СуммаОстаток,
		|	уп_РезервыОПСОстатки.ТипСуммы,
		|	уп_РезервыОПСОстатки.СуммаКомпенсацииОстаток,
		|	уп_РезервыОПСОстатки.СуммаВосполненияОстаток,
		|	уп_РезервыОПСОстатки.СуммаВозмещенияОстаток
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.уп_РезервыОПС.Остатки(
		|			&ДатаДок,
		|			ДоговорОПС В
		|					(ВЫБРАТЬ
		|						ТабСписания.ДоговорОПС
		|					ИЗ
		|						ТабСписания)
		|				И Организация = &Организация
		|				И ТипРезерва В (&ТипыРезервовНачислений)
		|				И НЕ ТипСуммы В (&ТипыСуммаМСК)) КАК уп_РезервыОПСОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабСписания.ДоговорОПС КАК ДоговорОПС,
		|	ТабСписания.ТипРезерва КАК ТипРезерва,
		|	ТабСписания.Сумма КАК Сумма,
		|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	Остатки.ТипСуммы,
		|	Остатки.СуммаКомпенсацииОстаток КАК СуммаКомпенсацииОстаток,
		|	Остатки.СуммаВосполненияОстаток КАК СуммаВосполненияОстаток,
		|	Остатки.СуммаВозмещенияОстаток КАК СуммаВозмещенияОстаток,
		|	ТабСписания.СуммаКомпенсации КАК СуммаКомпенсации,
		|	ТабСписания.СуммаВосполнения КАК СуммаВосполнения,
		|	ТабСписания.СуммаВозмещения КАК СуммаВозмещения
		|ИЗ
		|	ТабСписания КАК ТабСписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
		|		ПО ТабСписания.ДоговорОПС = Остатки.ДоговорОПС
		|			И ТабСписания.ТипРезерва = Остатки.ТипРезерва
		|ИТОГИ
		|	МАКСИМУМ(Сумма),
		|	СУММА(СуммаОстаток),
		|	СУММА(СуммаКомпенсацииОстаток),
		|	СУММА(СуммаВосполненияОстаток),
		|	СУММА(СуммаВозмещенияОстаток),
		|	МАКСИМУМ(СуммаКомпенсации),
		|	МАКСИМУМ(СуммаВосполнения),
		|	МАКСИМУМ(СуммаВозмещения)
		|ПО
		|	ДоговорОПС,
		|	ТипРезерва";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТабСписания", ТаблицаСписания);
	Запрос.УстановитьПараметр("ДатаДок", Новый 	Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
	//Запрос.УстановитьПараметр("ДатаДок", КонецДня(Дата+1));
	Запрос.УстановитьПараметр("Организация", Организация);
	ТипыРезервовНачислений = Новый СписокЗначений;
	ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРСВ);
	ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРПН);
	ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНачисленийНаследованиеРОПС);
	Запрос.УстановитьПараметр("ТипыРезервовНачислений", ТипыРезервовНачислений);
	ТипыСуммаМСК = Новый СписокЗначений;
	ТипыСуммаМСК.Добавить(Справочники.уп_ТипыСуммОПС.МатКапитал);
	ТипыСуммаМСК.Добавить(Справочники.уп_ТипыСуммОПС.ИДМатКапитал);
	Запрос.УстановитьПараметр("ТипыСуммаМСК", ТипыСуммаМСК);
	
	Результат = Запрос.Выполнить();
	ВыборкаДоговоров = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДоговоров.Следующий() Цикл
		Если ВыборкаДоговоров.СуммаОстаток<>0 Тогда
			ВыборкаТиповРезерва = ВыборкаДоговоров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаТиповРезерва.Следующий() Цикл
				Выборка = ВыборкаТиповРезерва.Выбрать();
				ОсталосьСписать = мин(ВыборкаТиповРезерва.Сумма,ВыборкаТиповРезерва.СуммаОстаток);
				Пока Выборка.Следующий() Цикл
					//+ АДаниленко 14.09.2017 
					СуммаКСписанию = Мин(Выборка.Сумма, ОсталосьСписать);
					//СуммаКСписанию = Мин(Выборка.СуммаОстаток, ОсталосьСписать);
					//- АДаниленко 14.09.2017
					Если СуммаКСписанию<>0 Тогда
						Движение = ТабРезервов.Добавить();
						Движение.Активность = Истина;
						Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
						//Движение = Движения.уп_РезервыОПС.ДобавитьРасход();
						Движение.ДоговорОПС = Выборка.ДоговорОПС;
						Движение.Организация = Организация;
						Движение.Период = Дата;
						Движение.ТипРезерва = Выборка.ТипРезерва;                               
						Движение.ТипСуммы = Выборка.ТипСуммы;
						#Удаление
						Движение.Сумма = Мин(Выборка.СуммаОстаток,СуммаКСписанию);
						#КонецУдаления
						#Вставка
						// +ХМНПФ 30.01.2017 ШадринАВ // ДвиженияПоНаследованиюОПС() // №782
						СуммаКСписанию = Мин(Выборка.Сумма,Выборка.СуммаОстаток,СуммаКСписанию);
						Движение.Сумма = СуммаКСписанию;
						// -ХМНПФ 30.01.2017 ШадринАВ // ДвиженияПоНаследованиюОПС() // №782
						#КонецВставки
						Движение.СуммаКомпенсации = Мин(Выборка.СуммаКомпенсацииОстаток,Выборка.СуммаКомпенсации);
						Движение.СуммаВосполнения = Мин(Выборка.СуммаВосполненияОстаток,Выборка.СуммаВосполнения);
						Движение.СуммаВозмещения = Мин(Выборка.СуммаВозмещенияОстаток,Выборка.СуммаВозмещения);
						ОсталосьСписать = ОсталосьСписать-СуммаКСписанию;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;	
	Если НЕ Отказ Тогда
		Движения.уп_ПрочиеНачисленияОПС.Загрузить(ТабНачислений);
		Движения.уп_РезервыОПС.Загрузить(ТабРезервов);
		Движения.уп_ВыплатыОПС.Загрузить(ТабВыплат);
		Движения.уп_ОтвергнутыеПлатежиПрочиеНачисленияОПС.Загрузить(ТабОтвергнутых);
	КонецЕсли;	
КонецПроцедуры	

&После("ОбработкаПроведения")
Процедура РасшОбщ_ОбработкаПроведения(Отказ, Режим) Экспорт
	Если Оплачено и не Отказ Тогда
		//#Вставка
		// +ХМНПФ 18.03.2016 ШадринАВ // ОбработкаПроведения() // №281
		Если ХМ_ВыплатаПоВозвратам Тогда
			Для Каждого Движение Из Движения.уп_НачисленияПенсийОПС Цикл
				Если Движение.ВидДвижения = ВидДвиженияНакопления.Расход Тогда Движение.ХМ_Возврат = Истина; КонецЕсли;
			КонецЦикла;
			Для Каждого Движение Из Движения.уп_ПрочиеНачисленияОПС Цикл
				Если Движение.ВидДвижения = ВидДвиженияНакопления.Расход Тогда Движение.ХМ_Возврат = Истина; КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// -ХМНПФ 18.03.2016 ШадринАВ // ОбработкаПроведения() // №281
		//#КонецВставки
		
	КонецЕсли;     
	// ХМНПФ 22.11.2023 ХлопцевБА // ДвижениеУп_Резервы // №3699 //№3719
	ДвижениеУп_Резервы();
	// ХМНПФ 22.11.2023 ХлопцевБА // ДвижениеУп_Резервы // №3699 //№3719
	
	// ХМНПФ 11.03.2024 ПлыгунЮВ // +
	Движениехм_УчетУдержанийНПО();
	// ХМНПФ 11.03.2024 ПлыгунЮВ // -  
	
	// +ХМНПФ 02.07.2025 КопыткоАА // ОбработкаПроведения() // №4381
	Если не Отказ  Тогда
		Отказ = ХМПроверкаПослеПроведенияНеПройдена();
	КОнецЕсли;
	// -ХМНПФ 04.07.2025 КопыткоАА // ОбработкаПроведения() // №4381
	
	Если Отказ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Документы.уп_ВыплатныеРеестры.уп_ВыплатныеРеестры(ЭтотОбъект, Отказ, Режим); 	
	
КонецПроцедуры

&ИзменениеИКонтроль("СформироватьДокументыВозврата")
Процедура РасшОбщ_СформироватьДокументыВозврата() Экспорт
	
	Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС 
		ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.СрочнаяПенсияОПС
		ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратНакопительнойПенсииОПС 
		ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратСрочнойПенсииОПС
		ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежНПОПС
		ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежСВОПС Тогда
		ЕстьДокумент = ЛОЖЬ;
		
		ДокОбъект = Документы.уп_ВозвратПенсийОПС.СоздатьДокумент();
		ДокОбъект.Организация = Организация;
		ДокОбъект.Дата = МИН(Дата+3600, КонецДня(Дата));
		ДокОбъект.ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.НеисполненнаяВыплата;
		ДокОбъект.НекорректныеРеквизиты = Истина;
		
		Для Каждого ТекСтрока Из НеисполненныеВыплаты Цикл
			Если ЗначениеЗаполнено(ТекСтрока.ДокументВозврата) Тогда
			Иначе
				
				Для Каждого ТекСтрокаДоговоры Из ДоговорыОПС Цикл
					Если ТекСтрока.ДоговорОПС = ТекСтрокаДоговоры.ДоговорОПС Тогда
						НоваяСтрока = ДокОбъект.ДоговорыОПС.Добавить();
						НоваяСтрока.ДоговорОПС = ТекСтрока.ДоговорОПС;
						НоваяСтрока.Участник = ТекСтрока.Участник;
						НоваяСтрока.ТипПенсии = ТекСтрокаДоговоры.ТипПенсииОПС;
						НоваяСтрока.ДатаПериода = ТекСтрокаДоговоры.НачалоПериодаНачисления;
						НоваяСтрока.Сумма = ТекСтрокаДоговоры.Сумма;
						НоваяСтрока.ДокументВыплаты = Ссылка;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
		Если ДокОбъект.ДоговорыОПС.Количество() > 0 Тогда
			ДокОбъект.уп_ВидДеятельности = уп_ВидДеятельности;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ЕстьДокумент = Истина;
		КонецЕсли;
		
		Если ЕстьДокумент Тогда
			Для Каждого ТекСтрока Из НеисполненныеВыплаты Цикл
				Если ЗначениеЗаполнено(ТекСтрока.ДокументВозврата) Тогда
				Иначе
					ТекСтрока.ДокументВозврата = ДокОбъект.Ссылка;	
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС 
		ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС 
		ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратЕдиновременнойВыплатыОПС
		ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатПравопреемникамОПС
		ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежЕВОПС
		ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиОПС Тогда
		
		Для Каждого ТекСтрока Из НеисполненныеВыплаты Цикл
			Если ЗначениеЗаполнено(ТекСтрока.ДокументВозврата) Тогда
			Иначе
				ДокОбъект = Документы.уп_ВозвратПрочихНачисленийОПС.СоздатьДокумент();
				ДокОбъект.Организация = Организация;
				ДокОбъект.Дата = МИН(Дата+3600, КонецДня(Дата));
				//ДокОбъект.ТипВыплаты = ТипВыплаты;
				ДокОбъект.ВидОперации = Перечисления.уп_ВидыОперацийВозвратПрочихНачисленийОПС.НеисполненнаяВыплата;
				ДокОбъект.ДоговорОПС = ТекСтрока.ДоговорОПС;
				ДокОбъект.Участник = ДокОбъект.ДоговорОПС.Участник;
				Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС
					или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатПравопреемникамОПС
					или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиОПС Тогда
					ДокОбъект.Правопреемник = ТекСтрока.Участник;
					ДокОбъект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС;
				Иначе
					ДокОбъект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС;
				КонецЕсли;
				ДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
				ДокОбъект.ДокументОснование = Ссылка;
				ДокОбъект.НайтиРешение();
				
				ДокОбъект.РассчитатьДокумент();
				
				ДокОбъект.уп_ВидДеятельности = уп_ВидДеятельности;
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				ТекСтрока.ДокументВозврата = ДокОбъект.Ссылка;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий 
		или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратПенсииНПО
		или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияНПО Тогда
		ЕстьДокумент = ЛОЖЬ;
		
		ПенсионныеПравила = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
		НДФЛУдержанВБюджет = ПенсионныеПравила.НДФЛУдержанВБюджет;
		
		ДокОбъект = Документы.уп_ВозвратПенсий.СоздатьДокумент();
		ДокОбъект.Организация = Организация;
		ДокОбъект.Дата = МИН(Дата+3600, КонецДня(Дата));
		ДокОбъект.ВидОперации = Перечисления.уп_ВидыОперацийВозвратПенсий.НеисполненнаяВыплата;
		ДокОбъект.НекорректныеРеквизиты = Истина; 
		
		Для Каждого ТекСтрока Из НеисполненныеВыплаты Цикл
			Если ЗначениеЗаполнено(ТекСтрока.ДокументВозврата) Тогда
			Иначе
				Для Каждого ТекСтрокаДоговоры Из СписокПенсионеров Цикл
					Если ТекСтрока.НомерСчета = ТекСтрокаДоговоры.НомерСчета Тогда
						НоваяСтрока = ДокОбъект.СписокСчетов.Добавить();
						НоваяСтрока.НомерСчета = ТекСтрока.НомерСчета;
						НоваяСтрока.Участник = ТекСтрока.Участник;
						НоваяСтрока.ПенсионныйДоговор = ТекСтрокаДоговоры.ПенсионныйДоговор;
						НоваяСтрока.ДатаНачалаПериода = ТекСтрокаДоговоры.НачалоПериодаНачисления;
						НоваяСтрока.ДатаКонцаПериода = ТекСтрокаДоговоры.КонецПериодаНачисления;
						НоваяСтрока.Схема = ТекСтрокаДоговоры.Схема;
						
						Если НДФЛУдержанВБюджет Тогда
							НоваяСтрока.Сумма = ТекСтрокаДоговоры.Сумма - ТекСтрокаДоговоры.НДФЛ;
							НоваяСтрока.НДФЛ = 0;
						Иначе
							НоваяСтрока.Сумма = ТекСтрокаДоговоры.Сумма-ТекСтрокаДоговоры.НДФЛ;
							НоваяСтрока.НДФЛ = ТекСтрокаДоговоры.НДФЛ;
						КонецЕсли;
						НоваяСтрока.ДокументВыплаты = Ссылка;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Если ДокОбъект.СписокСчетов.Количество() > 0 Тогда
			ДокОбъект.РасчетНБ();
			ДокОбъект.уп_ВидДеятельности = уп_ВидДеятельности;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ЕстьДокумент = Истина;
		КонецЕсли;
		
		Если ЕстьДокумент Тогда
			Для Каждого ТекСтрока Из НеисполненныеВыплаты Цикл
				Если ЗначениеЗаполнено(ТекСтрока.ДокументВозврата) Тогда
				Иначе
					ТекСтрока.ДокументВозврата = ДокОбъект.Ссылка;	
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам
		или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатРасторженцамНПО
		или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежРасторжениеНПО Тогда
		
		Для Каждого ТекСтрока Из НеисполненныеВыплаты Цикл
			Если ЗначениеЗаполнено(ТекСтрока.ДокументВозврата) Тогда
			Иначе
				ДокОбъект = Документы.уп_ВозвратПрочихНачисленийНПО.СоздатьДокумент();
				ДокОбъект.Организация = Организация;
				ДокОбъект.Дата = МИН(Дата+3600, КонецДня(Дата));
				ДокОбъект.ТипВыплаты = ТипВыплаты;
				ДокОбъект.ВидОперации = Перечисления.уп_ВидыОперацийВозвратПенсий.НеисполненнаяВыплата;
				ДокОбъект.Участник = ТекСтрока.НомерСчета.Участник;
				Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам Тогда
					ДокОбъект.Правопреемник = ТекСтрока.Участник;
				КонецЕсли;
				ДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
				ДокОбъект.ДокументВыплаты = Ссылка;
				
				ДокОбъект.СписокСчетов.Очистить();
				Документы.уп_ВозвратПрочихНачисленийНПО.РасчетПоДокументуВыплатыОбщий(ДокОбъект);
				
				ДокОбъект.уп_ВидДеятельности = уп_ВидДеятельности;
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				ТекСтрока.ДокументВозврата = ДокОбъект.Ссылка;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам 
		или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатНаследникамНПО 
		или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиНПО Тогда
		ТЗНеисполненныеВыплаты = НеисполненныеВыплаты.Выгрузить(,"НомерСчета,Участник,ДокументВозврата");
		ТЗНеисполненныеВыплаты.Колонки.Добавить("УчастникПС");
		Для Каждого ТекСтрока Из ТЗНеисполненныеВыплаты Цикл
			ТекСтрока.УчастникПС = ТекСтрока.НомерСчета.Участник;	
		КонецЦикла;
		
		ТЗНеисполненныеВыплаты.Свернуть("УчастникПС,Участник,ДокументВозврата");
		ТЗНеисполненныеВыплаты.Сортировать("Участник,УчастникПС");
		ДокОбъект = Неопределено;
		ТекУчастникПС = "";
		ТекНаследник = "";
		Для Каждого ТекСтрока Из ТЗНеисполненныеВыплаты Цикл
			Если ЗначениеЗаполнено(ТекСтрока.ДокументВозврата) Тогда
			Иначе
				Если ТекНаследник <> ТекСтрока.Участник И ТекУчастникПС <> ТекСтрока.УчастникПС Тогда
					ДокОбъект = Документы.уп_ВозвратПрочихНачисленийНПО.СоздатьДокумент();
					ДокОбъект.Организация = Организация;
					ДокОбъект.Дата = МИН(Дата+3600, КонецДня(Дата));
					ДокОбъект.ТипВыплаты = ТипВыплаты;
					ДокОбъект.ВидОперации = Перечисления.уп_ВидыОперацийВозвратПенсий.НеисполненнаяВыплата;
					ДокОбъект.Правопреемник = ТекСтрока.Участник;
					ДокОбъект.Участник = ТекСтрока.УчастникПС;
					ДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
					ДокОбъект.ДокументВыплаты = Ссылка;
					
					ДокОбъект.СписокСчетов.Очистить();
					Документы.уп_ВозвратПрочихНачисленийНПО.РасчетПоДокументуВыплатыОбщий(ДокОбъект);
					
					ДокОбъект.уп_ВидДеятельности = уп_ВидДеятельности;
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
					ТекСтрока.ДокументВозврата = ДокОбъект.Ссылка;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекСтрока Из ТЗНеисполненныеВыплаты Цикл
			Для Каждого ТекСтрокаНевыплаты Из НеисполненныеВыплаты Цикл
				Если ТекСтрока.Участник = ТекСтрокаНевыплаты.Участник 
					И ТекСтрока.УчастникПС = ТекСтрокаНевыплаты.НомерСчета.Участник Тогда
					Если ЗначениеЗаполнено(ТекСтрокаНевыплаты.ДокументВозврата) Тогда
					Иначе
						ТекСтрокаНевыплаты.ДокументВозврата = ТекСтрока.ДокументВозврата;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;		
		
	ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийПДС 
		или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратПенсииПДС
		или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияПДС Тогда
		ЕстьДокумент = ЛОЖЬ;
		
		ПенсионныеПравила = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
		НДФЛУдержанВБюджет = ПенсионныеПравила.НДФЛУдержанВБюджет;
		
		ДокОбъект = Документы.пдс_ВозвратПенсийПДС.СоздатьДокумент();
		ДокОбъект.Организация = Организация;
		ДокОбъект.Дата = МИН(Дата+3600, КонецДня(Дата));
		ДокОбъект.ВидОперации = Перечисления.уп_ВидыОперацийВозвратПенсий.НеисполненнаяВыплата;
		ДокОбъект.НекорректныеРеквизиты = Истина; 
		
		Для Каждого ТекСтрока Из НеисполненныеВыплаты Цикл
			Если ЗначениеЗаполнено(ТекСтрока.ДокументВозврата) Тогда
			Иначе
				Для Каждого ТекСтрокаДоговоры Из СписокПенсионеровПДС Цикл
					Если ТекСтрока.НомерСчетаПДС = ТекСтрокаДоговоры.НомерСчета Тогда
						НоваяСтрока = ДокОбъект.СписокСчетов.Добавить();
						НоваяСтрока.НомерСчета = ТекСтрока.НомерСчетаПДС;
						НоваяСтрока.Участник = ТекСтрока.Участник;
						НоваяСтрока.ПенсионныйДоговор = ТекСтрокаДоговоры.ПенсионныйДоговор;
						НоваяСтрока.ДатаНачалаПериода = ТекСтрокаДоговоры.НачалоПериодаНачисления;
						//НоваяСтрока.ДатаКонцаПериода = ТекСтрокаДоговоры.КонецПериодаНачисления;
						
						Если НДФЛУдержанВБюджет Тогда
							НоваяСтрока.Сумма = ТекСтрокаДоговоры.Сумма - ТекСтрокаДоговоры.НДФЛ;
							НоваяСтрока.НДФЛ = 0;
						Иначе
							НоваяСтрока.Сумма = ТекСтрокаДоговоры.Сумма-ТекСтрокаДоговоры.НДФЛ;
							НоваяСтрока.НДФЛ = ТекСтрокаДоговоры.НДФЛ;
						КонецЕсли;
						НоваяСтрока.ДокументВыплаты = Ссылка;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Если ДокОбъект.СписокСчетов.Количество() > 0 Тогда
			ДокОбъект.РасчетНБ();
			ДокОбъект.уп_ВидДеятельности = уп_ВидДеятельности;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ЕстьДокумент = Истина;
		КонецЕсли;
		
		Если ЕстьДокумент Тогда
			Для Каждого ТекСтрока Из НеисполненныеВыплаты Цикл
				Если ЗначениеЗаполнено(ТекСтрока.ДокументВозврата) Тогда
				Иначе
					ТекСтрока.ДокументВозврата = ДокОбъект.Ссылка;	
					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыкупнаяСуммаПДС
		или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыкупнаяСуммаПДС
		или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежВыкупнаяСуммаПДС
		ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПоОсобымОбстоятельствамПДС 
		ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатыПоОсобымОбстоятельствамПДС 
		ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежВыплатыПоОсобымОбстоятельствамПДС
		ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПравопреемникамПДС 
		ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатыПравопреемникамПДС 
		ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиПДС
		или ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаПДС 
		или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратЕдиновременнаяВыплатаПДС 
		или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежЕВПДС Тогда
		
		Для Каждого ТекСтрока Из НеисполненныеВыплаты Цикл
			Если ЗначениеЗаполнено(ТекСтрока.ДокументВозврата) Тогда
			Иначе
				ДокОбъект = Документы.пдс_ВозвратПрочихНачисленийПДС.СоздатьДокумент();
				ДокОбъект.Организация = Организация;
				ДокОбъект.Дата = МИН(Дата+3600, КонецДня(Дата));
				Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыкупнаяСуммаПДС
					или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыкупнаяСуммаПДС
					или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежВыкупнаяСуммаПДС Тогда
					ДокОбъект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыкупнаяСуммаПДС;
				ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПоОсобымОбстоятельствамПДС
					или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатыПоОсобымОбстоятельствамПДС
					или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежВыплатыПоОсобымОбстоятельствамПДС Тогда
					ДокОбъект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПоОсобымОбстоятельствамПДС;
				ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПравопреемникамПДС
					или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатыПравопреемникамПДС
					или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиПДС Тогда
					ДокОбъект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПравопреемникамПДС;
				Иначе
					ДокОбъект.ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаПДС; 
				КонецЕсли;
				ДокОбъект.ВидОперации = Перечисления.уп_ВидыОперацийВозвратПенсий.НеисполненнаяВыплата;
				ДокОбъект.Участник = ТекСтрока.НомерСчетаПДС.Участник;
				ДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
				ДокОбъект.ДокументВыплаты = Ссылка;
				
				ДокОбъект.СписокСчетов.Очистить();
				Документы.пдс_ВозвратПрочихНачисленийПДС.РасчетПоДокументуВыплатыОбщий(ДокОбъект);
				
				ДокОбъект.уп_ВидДеятельности = уп_ВидДеятельности;
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				ТекСтрока.ДокументВозврата = ДокОбъект.Ссылка;
			КонецЕсли;
		КонецЦикла;
		
		
	КонецЕсли;	
	
КонецПроцедуры

// ХМНПФ 31.03.2020 ШадринАВ // Новая ХМ_ВключенМеханизмУдержанийПоДоговоруОПС() // №2732
Функция ХМ_ВключенМеханизмУдержанийПоДоговоруОПС(ДоговорОПС)
	ВключенМеханизм = Ложь;
	СтруктураРесурсов = РегистрыСведений.ХМ_ПроцентУдержанияИзВыплатыОПС.ПолучитьПоследнее(Дата, Новый Структура("ДоговорОПС,ТипВыплат",ДоговорОПС,ТипВыплаты));
	ВключенМеханизм = НЕ СтруктураРесурсов.НетЗаявления И НЕ СтруктураРесурсов.ЗадолженностьПогашена;
	Возврат ВключенМеханизм;
КонецФункции // ХМ_ВключенМеханизмУдержанийПоДоговоруОПС()

// ХМНПФ 22.11.2023 ХлопцевБА // ДвижениеУп_Резервы // №3699 //№3719
Процедура ДвижениеУп_Резервы()
	
	ТабРезервы  = Движения.уп_Резервы.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчета КАК НомерСчета,
	|	уп_ВыплатныеРеестрыСписокПенсионеров.ПенсионныйДоговор КАК ПенсионныйДоговор,
	|	уп_ВыплатныеРеестрыСписокПенсионеров.Схема КАК Схема,
	|	уп_ВыплатныеРеестрыСписокПенсионеров.Участник КАК Участник,
	|	уп_ВыплатныеРеестрыСписокПенсионеров.Сумма КАК Сумма,
	|	уп_ВыплатныеРеестрыСписокПенсионеров.НДФЛ КАК НДФЛ,
	|	уп_ВыплатныеРеестрыСписокПенсионеров.ТипПенсии КАК ТипПенсии,
	|	уп_ВыплатныеРеестрыСписокПенсионеров.хм_Удержание КАК хм_Удержание,
	// ХМНПФ 12.03.2024 ПлыгунЮВ // +
	|	уп_ВыплатныеРеестрыСписокПенсионеров.хм_СуммаУдержания КАК хм_СуммаУдержания
	// ХМНПФ 12.03.2024 ПлыгунЮВ // -
	|ПОМЕСТИТЬ втУдержания
	|ИЗ
	|	Документ.уп_ВыплатныеРеестры.СписокПенсионеров КАК уп_ВыплатныеРеестрыСписокПенсионеров 
	|ГДЕ
	|	уп_ВыплатныеРеестрыСписокПенсионеров.Ссылка = &Ссылка
	|	И уп_ВыплатныеРеестрыСписокПенсионеров.хм_СуммаУдержания <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних.НомерСчета КАК ПС,
	|	хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних.ВариантВозвратаИзлишнеВыплаченныхСумм КАК ВариантВозвратаИзлишнеВыплаченныхСумм,
	|	хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних.ПроцентУдержания КАК ПроцентУдержания,
	|	хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних.ЗадолженностьПогашена КАК ЗадолженностьПогашена,
	|	хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних.ПенсионныйДоговор КАК ПенсионныйДоговор,
	|	хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних.ВозвращатьНаСчетДоговора КАК ВозвращатьНаСчетДоговора
	|ПОМЕСТИТЬ втПроцентУдержания
	|ИЗ
	|	РегистрСведений.хм_ПроцентУдержанияИзВыплатыНПО.СрезПоследних(
	|			&ДатаФормирования,
	// ХМНПФ 12.03.2024 ПлыгунЮВ // +
	|			//НЕ ЗадолженностьПогашена
	|	        ВариантВозвратаИзлишнеВыплаченныхСумм = ЗНАЧЕНИЕ(Перечисление.хм_ВариантВозвратаИзлишнеВыплаченныхСуммНПО.ПроцентОтПенсии)
	// ХМНПФ 12.03.2024 ПлыгунЮВ // -	
	|				И НомерСчета В
	|					(ВЫБРАТЬ
	|						втУдержания.НомерСчета КАК НомерСчета
	|					ИЗ
	|						втУдержания КАК втУдержания)) КАК хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних
	// ХМНПФ 12.03.2024 ПлыгунЮВ // +
	|   ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.хм_УчетУдержанийНПО.Остатки(
	|			&ДатаФормирования,
	|			НомерСчета В
	|					(ВЫБРАТЬ
	|						втУдержания.НомерСчета КАК НомерСчета
	|					ИЗ
	|						втУдержания КАК втУдержания)) КАК хм_УчетУдержанийНПООстатки
	|	ПО хм_ПроцентУдержанияИзВыплатыНПОСрезПоследних.НомерСчета = хм_УчетУдержанийНПООстатки.НомерСчета
	// ХМНПФ 12.03.2024 ПлыгунЮВ // -
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втУдержания.НомерСчета КАК НомерСчета,
	|	втУдержания.ПенсионныйДоговор КАК ПенсионныйДоговор,
	|	втУдержания.Схема КАК Схема,
	|	втУдержания.Участник КАК Участник,
	|	втУдержания.Сумма КАК Сумма,
	|	втУдержания.НДФЛ КАК НДФЛ,
	|	втУдержания.ТипПенсии КАК ТипПенсии,
	|	втУдержания.хм_Удержание КАК хм_Удержание,
	|	втПроцентУдержания.ВозвращатьНаСчетДоговора КАК ВозвращатьНаСчетДоговора,
	|	втПроцентУдержания.ПенсионныйДоговор КАК ПенсионныйДоговорСПС,
	|	втПроцентУдержания.ПС КАК ПС,
	|	втПроцентУдержания.ПенсионныйДоговор.ПенсионныйСчет КАК ПенсионныйСчетСПС,
	// ХМНПФ 12.03.2024 ПлыгунЮВ // +
	|	втУдержания.хм_СуммаУдержания КАК хм_СуммаУдержания
	// ХМНПФ 12.03.2024 ПлыгунЮВ // -
	|ИЗ
	|	втУдержания КАК втУдержания
	// ХМНПФ 12.03.2024 ПлыгунЮВ // +	
	|		//ПОЛНОЕ СОЕДИНЕНИЕ втПроцентУдержания КАК втПроцентУдержания 
	|        ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПроцентУдержания КАК втПроцентУдержания
	// ХМНПФ 12.03.2024 ПлыгунЮВ // -
	|		ПО втУдержания.НомерСчета = втПроцентУдержания.ПС";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаФормирования", Ссылка.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = ТабРезервы.Добавить();
		Движение.Активность = Истина;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Если Выборка.ВозвращатьНаСчетДоговора Тогда
			Движение.НомерСчета = Выборка.ПенсионныйСчетСПС;
			Движение.ТипРезерва = Перечисления.уп_ТипыРезерва.СПС;
			Движение.ТипСуммы = Справочники.уп_ТипыСумм.ВзносыЮр;
			Движение.ПенсионныйСчетИсточник = Выборка.НомерСчета;
		Иначе
			Движение.НомерСчета = Выборка.НомерСчета;
			Движение.ТипРезерва = Перечисления.уп_ТипыРезерва.ИПС;
			Движение.ТипСуммы = Справочники.уп_ТипыСумм.ВзносыЮр;
		КонецЕсли;     
		Движение.ПенсионныйСчетИсточник = Выборка.НомерСчета;
		// ХМНПФ 12.03.2024 ПлыгунЮВ // +		
		//Движение.Сумма = (Выборка.Сумма)* (-1);
		Движение.Сумма = Выборка.хм_СуммаУдержания;
		// ХМНПФ 12.03.2024 ПлыгунЮВ // -		
		Движение.Движение = Перечисления.уп_ВидыДвижений.хм_УдержаниеЗадолженности;
		Движение.Схема  = Выборка.Схема;
	КонецЦикла;
	
	Движения.уп_Резервы.Загрузить(ТабРезервы);
	Движения.уп_Резервы.Записать();
	
КонецПроцедуры
// ХМНПФ 22.11.2023 ХлопцевБА // ДвижениеУп_Резервы // №3699 //№3719

// ХМНПФ 12.03.2024 ПлыгунЮВ // +
Процедура Движениехм_УчетУдержанийНПО()
	//Счета для удержаний
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уп_ВыплатныеРеестрыСписокПенсионеров.Ссылка КАК Ссылка,
	|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчета КАК НомерСчета,
	|	уп_ВыплатныеРеестрыСписокПенсионеров.ПенсионныйДоговор КАК ПенсионныйДоговор,
	|	уп_ВыплатныеРеестрыСписокПенсионеров.Схема КАК Схема,
	|	уп_ВыплатныеРеестрыСписокПенсионеров.Сумма КАК Сумма,
	|	уп_ВыплатныеРеестрыСписокПенсионеров.НДФЛ КАК НДФЛ,
	|	уп_ВыплатныеРеестрыСписокПенсионеров.РКО КАК РКО,
	|	уп_ВыплатныеРеестрыСписокПенсионеров.Выплата КАК Выплата,
	|	уп_ВыплатныеРеестрыСписокПенсионеров.хм_Удержание КАК хм_Удержание,
	|	уп_ВыплатныеРеестрыСписокПенсионеров.хм_СуммаУдержания КАК хм_СуммаУдержания
	|ИЗ
	|	Документ.уп_ВыплатныеРеестры.СписокПенсионеров КАК уп_ВыплатныеРеестрыСписокПенсионеров
	|ГДЕ
	|	уп_ВыплатныеРеестрыСписокПенсионеров.Ссылка = &Ссылка
	|	И уп_ВыплатныеРеестрыСписокПенсионеров.хм_СуммаУдержания > 0";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СчетаУдержаний = РезультатЗапроса.Выбрать();
	
	Пока СчетаУдержаний.Следующий() Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	хм_УчетУдержанийНПООбороты.НомерСчета КАК НомерСчета,
		|	хм_УчетУдержанийНПООбороты.ПериодУдержания КАК ПериодУдержания,
		|	хм_УчетУдержанийНПООбороты.СуммаОборот КАК Сумма
		|ИЗ
		|	РегистрНакопления.хм_УчетУдержанийНПО.Обороты(, &ДатаФормирования, , НомерСчета = &НомерСчета) КАК хм_УчетУдержанийНПООбороты
		|ГДЕ
		|	хм_УчетУдержанийНПООбороты.НомерСчета = &НомерСчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодУдержания,
		|	Сумма";
		
		Запрос.УстановитьПараметр("НомерСчета", СчетаУдержаний.НомерСчета);
		Запрос.УстановитьПараметр("ДатаФормирования", Ссылка.Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ПериодыЗадолженности = РезультатЗапроса.Выбрать();
		
		СуммаУдержания = СчетаУдержаний.хм_СуммаУдержания;
		СуммаУдержанияОстаток = СуммаУдержания;
		Пока ПериодыЗадолженности.Следующий() И СуммаУдержанияОстаток > 0 Цикл
			
			ТекСуммаУдержания = Мин(СуммаУдержанияОстаток, ПериодыЗадолженности.Сумма);
			
			Движение = Движения.хм_УчетУдержанийНПО.ДобавитьРасход();
			Движение.Период = Ссылка.Дата; 
			Движение.НомерСчета = СчетаУдержаний.НомерСчета;
			Движение.ПериодУдержания = ПериодыЗадолженности.ПериодУдержания;
			Движение.Сумма = ТекСуммаУдержания;	
			
			СуммаУдержанияОстаток = СуммаУдержанияОстаток - ТекСуммаУдержания
			
		КонецЦикла;
		
		Движения.хм_УчетУдержанийНПО.Записать();
		
	КонецЦикла;
	
КонецПроцедуры	 
// -ХМНПФ 02.07.2025 КопыткоАА // №4381

Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, РежимПроведения, СтрокаТЗ, СтруктураТЧ) Экспорт
	Если СтрокаТЗ.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий Тогда
		Возврат;
	КонецЕсли;
	
	// +ХМНПФ 26.01.2017 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №777
	Если СтрокаТЗ.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам
		ИЛИ СтрокаТЗ.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам ИЛИ СтрокаТЗ.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВзносов Тогда
		ЭтотОбъект.ОбменДанными.Загрузка = Ложь;
		ЭтотОбъект.Записать(?(ПРОВЕДЕН,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.ОтменаПроведения),РежимПроведенияДокумента.Неоперативный);
		ЭтотОбъект.ОбменДанными.Загрузка = Истина;
		Возврат;
	КонецЕсли;
	// -ХМНПФ 26.01.2017 ШадринАВ // ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №777
	
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПрочиеНачисленияОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_НачисленияПенсийОПС);
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ВыплатыОПС);
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	//Правоприемник
	//ТипРезерва
	//СуммаКСписанию
	//ТипСуммы
	ЕдиновременнаяВыплатаОПС = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС;
	Ежемесячно = Перечисления.уп_ПериодичностьВыплат.Ежемесячно;
	Структура_ТЗ = СтруктураТЧ.РасшифровкаСуммы;	
	СтрокиНаДобавление = Структура_ТЗ.ТЗ.НайтиСтроки(Новый Структура(Структура_ТЗ.Узел.Каспер_поле,СтрокаТЗ[Структура_ТЗ.Узел.Каспер_поле]));
	Для Каждого СтрокаТЗ Из СтрокиНаДобавление Цикл
		Если СтрокаТЗ.ТипВыплаты = ЕдиновременнаяВыплатаОПС Тогда
			Движение = Движения.уп_ПрочиеНачисленияОПС.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = СтрокаТЗ.ДатаВыплаты;
			Движение.Организация = Организация;
			Движение.Участник = СтрокаТЗ.Участник;
			Движение.ДоговорОПС = СтрокаТЗ.ДоговорОПС;
			Движение.ТипВыплаты = СтрокаТЗ.ТипВыплаты;
			//Движение.ТипРезерва = СтрокаТЗ.ТипРезерва;//!!!
			Движение.ТипСуммы = СтрокаТЗ.ТипСуммы;
			Движение.Сумма = СтрокаТЗ.Сумма;
//ЛыткинАМ https://redmine.npf.com/issues/4739
//			Движение.Решение = СтрокаТЗ.Решение; 
		Иначе
			Движение = Движения.уп_НачисленияПенсийОПС.ДобавитьРасход();
			Движение.Период = СтрокаТЗ.ДатаВыплаты;
			Движение.ДоговорОПС = СтрокаТЗ.ДоговорОПС;
			Движение.ТипПенсии = СтрокаТЗ.ТипПенсии;
			Движение.НачПериода = СтрокаТЗ.ПериодНачисления;
			Движение.ПериодичностьВыплат = Ежемесячно;
			Движение.ТипСуммы = СтрокаТЗ.ТипСуммы;
			Движение.Сумма = СтрокаТЗ.Сумма;
		КонецЕсли;
		
		Движение = Движения.уп_ВыплатыОПС.Добавить();
		Движение.ДоговорОПС = СтрокаТЗ.ДоговорОПС;
		Движение.Организация = Организация;
		Движение.Период = СтрокаТЗ.ДатаВыплаты;
		Движение.Участник = СтрокаТЗ.Участник;
		Движение.ТипВыплаты = СтрокаТЗ.ТипВыплаты;
		Движение.ТипСуммы = СтрокаТЗ.ТипСуммы;
		Движение.Сумма = СтрокаТЗ.Сумма;
		Движение.Выплата = СтрокаТЗ.Сумма;
	КонецЦикла;	
	
	#Если Сервер Тогда
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ПрочиеНачисленияОПС);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_НачисленияПенсийОПС);
		ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ВыплатыОПС);
	#КонецЕсли
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура ХМОбработкаПроведения(Отказ, Режим)
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки
	Если уп_ОсновнаяПоставкаСервер.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект, Ложь) Тогда
		Возврат
	КонецЕсли;
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Организация, Ответственный");
	уп_ОсновнаяПоставкаСервер.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ТабБухУчет = уп_ОбщегоНазначенияУчетРезервов.СформироватьСтруктуруТаблицыБУ();
	ПроводкиПоНачислению = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация)).ПроводкиПоНачислению;
	ДатаНачалаВеденияУчетаПоСхемам = Константы.уп_УчетРезерваНПОвРазрезеСхем.Получить();
	Если ЗначениеЗаполнено(ДатаНачалаВеденияУчетаПоСхемам) И ДатаНачалаВеденияУчетаПоСхемам<=Дата Тогда
		ВестиУчетПоСхемам = Истина;
	Иначе
		ВестиУчетПоСхемам = Ложь;
	КонецЕсли;
	ТОКАТО = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация.РегистрацияВНалоговомОргане, "КодПоОКТМО"));
	Если СтрДлина(ТОКАТО) > 0 Тогда
		Пока СтрДлина(ТОКАТО)< 11 Цикл
			ТОКАТО = ТОКАТО + "0";
		КонецЦикла;
	КонецЕсли;
	//ТОКАТО = СокрЛП(Организация.КодПоОКАТО);
	ТКПП = СокрЛП(Организация.КПП);
	//СтрОКАТОКПП = ТОКАТО+"/"+ТКПП;
	ТОКТМО = Организация.РегистрацияВНалоговомОргане.КодПоОКТМО;
	СтрОКАТОКПП = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(СокрЛП(ТОКАТО), 11, " ", 1) + "/" + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(СокрЛП(ТКПП), 9, " ", 1);
	СтрОКТМОКПП = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(СокрЛП(ТОКТМО), 11, " ", 1) + "/" + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(СокрЛП(ТКПП), 9, " ", 1);
	ФормироватьОтвергнутыеПлатежи = уп_ОПС.ИспользуютсяОтвергнутые(Дата);
	Если ПодразделениеОрганизации.ОбособленноеПодразделение Тогда
		//РегистрацияВНалоговомОргане = ПодразделениеОрганизации.РегистрацияВНалоговомОргане;
		РегистрацияВНалоговомОргане = ЗарплатаКадры.РегистрацияВНалоговомОргане(ПодразделениеОрганизации, Дата);
	Иначе
		РегистрацияВНалоговомОргане = ЗарплатаКадры.РегистрацияВНалоговомОргане(Организация, Дата);
	КонецЕсли;
	
	//ОПА НПО 2018.05.25 +
	ПенсионныеПравила = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
	НДФЛУдержанВБюджет = ПенсионныеПравила.НДФЛУдержанВБюджет;
	//ОПА НПО 2018.05.25 -
	
	Если НеисполненныеВыплаты.Количество()>0 Тогда
		ПроверитьСоставНеисполненнойВыплаты(Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	
	Если не Оплачено Тогда
		
		уп_ОсновнаяПоставкаСервер.ОшибкаПриПроведении("Выплатной реестр может быть проведен только если он оплачено(флаг ""Оплачено"")."+Символы.ПС+
		"До установки признака оплаты документ можно только записать.",Отказ,Заголовок);
		
	Иначе
		
		если не ВсеРеквизитыЗаполнены(Заголовок) тогда
			Отказ=Истина;
			Возврат;
		конецесли;
		
	КонецЕсли;
	
	ТекстСообщения = "";
	Если Оплачено и не Отказ Тогда
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий
			ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратПенсииНПО
			ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияНПО Тогда
			ПроверитьЗаполнениеТЧ_Пенсии(Отказ);
			Если Отказ Тогда
				Возврат;
			КонецЕсли;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий  Тогда
				ТабНачислений     = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_НачисленияПенсий");
				ТабОтвергнутых    = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ОтвергнутыеПлатежиПенсийНПО");
				ТабТрансляции     = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_НачисленияПенсий");
			ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияНПО Тогда
				ТабНачислений     = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ОтвергнутыеПлатежиПенсийНПО");
				ТабТрансляции     = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ОтвергнутыеПлатежиПенсийНПО");
			Иначе
				ТабНачислений     = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ВозвратыПенсийНПО");
				ТабОтвергнутых    = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ОтвергнутыеПлатежиПенсийНПО");
			КонецЕсли;
			ТабНДФЛУчастников = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_НДФЛУчастниковРасчетыСБюджетом");
			ТабНДФЛ           = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("РасчетыНалогоплательщиковСБюджетомПоНДФЛ");
			ТабНДФЛ_НА        = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("РасчетыНалоговыхАгентовСБюджетомПоНДФЛ");
			ТабВыплат         = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_Выплаты");
			
			ТаблицаНалоговойБазыБезНДФЛ = Новый ТаблицаЗначений;
			ТаблицаНалоговойБазыБезНДФЛ.Колонки.Добавить("ФизическоеЛицо");
			ТаблицаНалоговойБазыБезНДФЛ.Колонки.Добавить("МесяцНалоговогоПериода");
			ТаблицаНалоговойБазыБезНДФЛ.Колонки.Добавить("СуммаВыплаченногоДохода");
			
			СписокСчетовПенсионеров = СписокПенсионеров.ВыгрузитьКолонку("НомерСчета");
			ДатаНачалаУчетаРезервовНачисления = Константы.уп_ДатаНачалаВеденияРезервовНачисленияНПО.Получить();
			Если ЗначениеЗаполнено(ДатаНачалаУчетаРезервовНачисления) И Дата>=ДатаНачалаУчетаРезервовНачисления Тогда
				лУчетРезервовНачисленияНПО = Истина;	
			Иначе
				лУчетРезервовНачисленияНПО = Ложь;	
			КонецЕсли;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий Тогда
				//списываем начисленные пенсии
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ВыплатныеРеестрыСписокПенсионеров.НомерСчета КАК НомерСчета,
				|	ВыплатныеРеестрыСписокПенсионеров.Участник КАК Участник,
				|	ВыплатныеРеестрыСписокПенсионеров.Сумма КАК Сумма,
				|	ВыплатныеРеестрыСписокПенсионеров.Схема КАК Схема,
				|	ВыплатныеРеестрыСписокПенсионеров.ТипПенсии КАК ТипПенсии,
				|	ПРЕДСТАВЛЕНИЕ(ВыплатныеРеестрыСписокПенсионеров.НомерСчета) КАК НомерСчетаТекст,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета, 0) = 0
				|			ТОГДА 0
				|		ИНАЧЕ 1
				|	КОНЕЦ КАК Невыплата,
				|	ВыплатныеРеестрыСписокПенсионеров.НачалоПериодаНачисления КАК НачалоПериодаНачисления,
				|	ВыплатныеРеестрыСписокПенсионеров.НДФЛ КАК НДФЛ,
				|	ВыплатныеРеестрыСписокПенсионеров.Выплата КАК Выплата,
				|	ВыплатныеРеестрыСписокПенсионеров.КонецПериодаНачисления КАК КонецПериодаНачисления
				|ПОМЕСТИТЬ СписокПенсионеров
				|ИЗ
				|	Документ.уп_ВыплатныеРеестры.СписокПенсионеров КАК ВыплатныеРеестрыСписокПенсионеров
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ВыплатныеРеестры.НеисполненныеВыплаты КАК уп_ВыплатныеРеестрыНеисполненныеВыплаты
				|		ПО ВыплатныеРеестрыСписокПенсионеров.Ссылка = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Ссылка
				|			И ВыплатныеРеестрыСписокПенсионеров.НомерСчета = уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета
				|			И ВыплатныеРеестрыСписокПенсионеров.Участник = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Участник
				|ГДЕ
				|	ВыплатныеРеестрыСписокПенсионеров.Ссылка = &Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	НачисленияПенсийОстатки.НачПериода КАК НачПериода,
				|	НачисленияПенсийОстатки.КонПериода КАК КонПериода,
				|	НачисленияПенсийОстатки.ТипСуммы КАК ТипСуммы,
				|	НачисленияПенсийОстатки.ТипРезерва КАК ТипРезерва,
				|	ЕСТЬNULL(НачисленияПенсийОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
				|	ЕСТЬNULL(НачисленияПенсийОстатки.НалоговаяБазаПоНДФЛОстаток, 0) КАК НалоговаяБазаПоНДФЛОстаток,
				|	НачисленияПенсийОстатки.ДнейВПериодеОстаток КАК ДнейВПериодеОстаток,
				|	СписокПенсионеров.Сумма КАК Сумма,
				|	СписокПенсионеров.НомерСчета КАК НомерСчета,
				|	СписокПенсионеров.Участник КАК Участник,
				|	СписокПенсионеров.Схема КАК Схема,
				|	СписокПенсионеров.ТипПенсии КАК ТипПенсии,
				|	СписокПенсионеров.НомерСчетаТекст КАК НомерСчетаТекст,
				|	СписокПенсионеров.Невыплата КАК Невыплата,
				|	СписокПенсионеров.НДФЛ КАК НДФЛ,
				|	СписокПенсионеров.Выплата КАК Выплата
				|ИЗ
				|	СписокПенсионеров КАК СписокПенсионеров
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_НачисленияПенсий.Остатки(&ДатаДок, НомерСчета В (&СписокСчетов)) КАК НачисленияПенсийОстатки
				|		ПО (СписокПенсионеров.НомерСчета = НачисленияПенсийОстатки.НомерСчета)
				|			И НачисленияПенсийОстатки.НачПериода >= СписокПенсионеров.НачалоПериодаНачисления
				|			И НачисленияПенсийОстатки.КонПериода <= СписокПенсионеров.КонецПериодаНачисления
				|
				|УПОРЯДОЧИТЬ ПО
				|	НомерСчета,
				|	НачПериода
				#Вставка 
				//ЛыткинАМ //Возможность списать минусовые начисления
				|,СуммаОстаток
				#КонецВставки
				|ИТОГИ
				|	СУММА(СуммаОстаток),
				|	СУММА(НалоговаяБазаПоНДФЛОстаток),
				|	МАКСИМУМ(Сумма),
				|	СУММА(Невыплата),
				|	МАКСИМУМ(НДФЛ),
				|	МАКСИМУМ(Выплата)
				|ПО
				|	НомерСчета";
				
				//Если НЕ лУчетРезервовНачисленияНПО Тогда
				//	Запрос.Текст = СтрЗаменить(Запрос.Текст, 
				//		"И НачисленияПенсийОстатки.НачПериода = СписокПенсионеров.НачалоПериодаНачисления", "");
				//КонецЕсли;
				
				Запрос.УстановитьПараметр("Организация", Организация);
				Запрос.УстановитьПараметр("ДатаДок", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
				//Запрос.УстановитьПараметр("СписокСчетов", СписокПенсионеров.ВыгрузитьКолонку("НомерСчета"));
				Запрос.УстановитьПараметр("СписокСчетов", СписокСчетовПенсионеров);
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НомерСчета");
				
				Пока Выборка.Следующий() Цикл
					Если Выборка.Невыплата = 0 или ФормироватьОтвергнутыеПлатежи Тогда
						Если Выборка.Сумма>Выборка.СуммаОстаток Тогда
							//ТекстСообщения = ТекстСообщения+
							//"|По счету "+Выборка.НомерСчета.Код+" "+Выборка.НомерСчета.Участник.Наименование+" попытка выплатить "+Выборка.Сумма+", а начислено "+Выборка.СуммаОстаток;
							уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По счету "+Выборка.НомерСчетаТекст+" "+Выборка.НомерСчета.Участник.Наименование+" попытка выплатить "+Выборка.Сумма+", а начислено "+Выборка.СуммаОстаток,,Заголовок);
							Отказ = Истина;
							продолжить;
						КонецЕсли;
						ВыборкаНачислений = Выборка.Выбрать();
						ОсталосьСписать = Выборка.Сумма;
						НадоСписатьНДФЛ = Выборка.НДФЛ;
						НадоСписатьНБ = Выборка.НалоговаяБазаПоНДФЛОстаток;
						
						Если НадоСписатьНДФЛ = 0 и НадоСписатьНБ>0 И Выборка.Невыплата = 0 И Дата<'20201231' Тогда
							ОтражатьВыплатуВРегистреРасчетов = Истина;
						Иначе
							ОтражатьВыплатуВРегистреРасчетов = Ложь;
						КонецЕсли;	
						
						Пока ОсталосьСписать>0 и ВыборкаНачислений.Следующий() Цикл
							СуммаКСписанию = Мин(ОсталосьСписать, ВыборкаНачислений.СуммаОстаток);
							
							//регистр Начислениепенсии
							Движение = ТабНачислений.Добавить();
							Движение.Активность = Истина;
							Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
							//Движение = Движения.уп_НачисленияПенсий.ДобавитьРасход();
							Движение.НомерСчета = ВыборкаНачислений.НомерСчета;
							Движение.Период = Дата;
							Движение.Регистратор = Ссылка;
							Движение.НачПериода = ВыборкаНачислений.НачПериода;
							Движение.КонПериода = ВыборкаНачислений.КонПериода;
							
							Движение.ТипРезерва = ВыборкаНачислений.ТипРезерва;
							Движение.ТипСуммы = ВыборкаНачислений.ТипСуммы;
							
							Движение.Сумма = СуммаКСписанию;
							Если Не ПоИсполнительномуЛисту Тогда
								Движение.ДнейВПериоде = ВыборкаНачислений.ДнейВПериодеОстаток;
								Движение.НалоговаяБазаПоНДФЛ = ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток;
								Если ОтражатьВыплатуВРегистреРасчетов И Движение.НалоговаяБазаПоНДФЛ>0 Тогда
									НовСтрТабНБ = ТаблицаНалоговойБазыБезНДФЛ.Добавить();
									НовСтрТабНБ.ФизическоеЛицо = ВыборкаНачислений.Участник.уп_ФизЛицо;
									НовСтрТабНБ.МесяцНалоговогоПериода = НачалоМесяца(Дата);
									НовСтрТабНБ.СуммаВыплаченногоДохода = Движение.НалоговаяБазаПоНДФЛ;
								КонецЕсли;	
							КонецЕсли;
							Движение.Схема        = ВыборкаНачислений.Схема;
							Движение.ТипПенсии   = ВыборкаНачислений.ТипПенсии;
							ОсталосьСписать = ОсталосьСписать-СуммаКСписанию;
							
							Если Выборка.Невыплата = 0 Тогда
								СтрокаТабТрансляции = ТабТрансляции.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаТабТрансляции,Движение);
							КонецЕсли;	
							
							Если Выборка.Невыплата > 0 и ФормироватьОтвергнутыеПлатежи Тогда
								Если Выборка.НалоговаяБазаПоНДФЛОстаток>0 Тогда
									Если ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток>0 И ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток = НадоСписатьНБ Тогда
										СписываемНДФЛ = НадоСписатьНДФЛ;
									ИначеЕсли Выборка.НалоговаяБазаПоНДФЛОстаток>0 Тогда
										СписываемНДФЛ = Окр(ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток*НадоСписатьНДФЛ/Выборка.НалоговаяБазаПоНДФЛОстаток,2);
									ИначеЕсли НадосписатьНБ = 0 Тогда
										СписываемНДФЛ = НадоСписатьНДФЛ;
									КонецЕсли;	
								Иначе
									СписываемНДФЛ = НадоСписатьНДФЛ;
								КонецЕсли;	
								//формируем регистр отвергнутых платежей
								//то же, что и в начислениях, но еще НДФЛ
								Движение = ТабОтвергнутых.Добавить();
								Движение.Активность = Истина;
								Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
								Движение.Организация = Организация;
								Движение.НомерСчета = ВыборкаНачислений.НомерСчета;
								Движение.Период = Дата;
								Движение.Регистратор = Ссылка;
								Движение.НачПериода = ВыборкаНачислений.НачПериода;
								Движение.КонПериода = ВыборкаНачислений.КонПериода;
								
								Движение.ТипРезерва = ВыборкаНачислений.ТипРезерва;
								Движение.ТипСуммы = ВыборкаНачислений.ТипСуммы;
								
								Движение.Сумма = СуммаКСписанию-СписываемНДФЛ;  
								Движение.НалоговаяБазаПоНДФЛ = ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток;
								Если НДФЛУдержанВБюджет Тогда
									Движение.НДФЛ = 0; //он перечислен
								Иначе
									Движение.НДФЛ = СписываемНДФЛ; //это, если НДФЛ не перечисляем
								КонецЕсли;
								Движение.Схема        = ВыборкаНачислений.Схема;
								Движение.ТипПенсии   = ВыборкаНачислений.ТипПенсии;
								Движение.ДокументВыплаты = Ссылка;
								Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.Возврат;
								
								НадоСписатьНДФЛ = НадоСписатьНДФЛ-СписываемНДФЛ;
								НадоСписатьНБ = НадоСписатьНБ-ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				ТабРезервовНПО = ДвиженияПоРезервамНПО(ТабТрансляции);
				
			ИначеЕсли  ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратПенсииНПО Тогда
				//списываем остатки с возвратов
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ВыплатныеРеестрыСписокПенсионеров.НомерСчета КАК НомерСчета,
				|	ВыплатныеРеестрыСписокПенсионеров.Участник КАК Участник,
				|	ВыплатныеРеестрыСписокПенсионеров.Сумма КАК Сумма,
				|	ВыплатныеРеестрыСписокПенсионеров.Схема КАК Схема,
				|	ВыплатныеРеестрыСписокПенсионеров.ТипПенсии КАК ТипПенсии,
				|	ПРЕДСТАВЛЕНИЕ(ВыплатныеРеестрыСписокПенсионеров.НомерСчета) КАК НомерСчетаТекст,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета, 0) = 0
				|			ТОГДА 0
				|		ИНАЧЕ 1
				|	КОНЕЦ КАК Невыплата,
				|	ВыплатныеРеестрыСписокПенсионеров.НачалоПериодаНачисления КАК НачалоПериодаНачисления,
				|	ВыплатныеРеестрыСписокПенсионеров.НДФЛ КАК НДФЛ,
				|	ВыплатныеРеестрыСписокПенсионеров.Выплата КАК Выплата,
				|	ВыплатныеРеестрыСписокПенсионеров.КонецПериодаНачисления КАК КонецПериодаНачисления
				|ПОМЕСТИТЬ СписокПенсионеров
				|ИЗ
				|	Документ.уп_ВыплатныеРеестры.СписокПенсионеров КАК ВыплатныеРеестрыСписокПенсионеров
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ВыплатныеРеестры.НеисполненныеВыплаты КАК уп_ВыплатныеРеестрыНеисполненныеВыплаты
				|		ПО ВыплатныеРеестрыСписокПенсионеров.Ссылка = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Ссылка
				|			И ВыплатныеРеестрыСписокПенсионеров.НомерСчета = уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета
				|			И ВыплатныеРеестрыСписокПенсионеров.Участник = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Участник
				|ГДЕ
				|	ВыплатныеРеестрыСписокПенсионеров.Ссылка = &Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	НачисленияПенсийОстатки.НачПериода КАК НачПериода,
				|	НачисленияПенсийОстатки.КонПериода КАК КонПериода,
				|	ЕСТЬNULL(НачисленияПенсийОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
				|	ЕСТЬNULL(НачисленияПенсийОстатки.НалоговаяБазаПоНДФЛОстаток, 0) КАК НалоговаяБазаПоНДФЛОстаток,
				|	НачисленияПенсийОстатки.ТипРезерва КАК ТипРезерва,
				|	НачисленияПенсийОстатки.ТипСуммы КАК ТипСуммы,
				|	СписокПенсионеров.Сумма КАК Сумма,
				|	СписокПенсионеров.НомерСчета КАК НомерСчета,
				|	СписокПенсионеров.Участник КАК Участник,
				|	СписокПенсионеров.Схема КАК Схема,
				|	СписокПенсионеров.ТипПенсии КАК ТипПенсии,
				|	СписокПенсионеров.Невыплата КАК Невыплата,
				|	СписокПенсионеров.НомерСчетаТекст КАК НомерСчетаТекст,
				|	СписокПенсионеров.НДФЛ КАК НДФЛ,
				|	СписокПенсионеров.Выплата КАК Выплата
				|ИЗ
				|	СписокПенсионеров КАК СписокПенсионеров
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_ВозвратыПенсийНПО.Остатки(&ДатаДок, НомерСчета В (&СписокСчетов)) КАК НачисленияПенсийОстатки
				|		ПО (СписокПенсионеров.НомерСчета = НачисленияПенсийОстатки.НомерСчета)
				|			И НачисленияПенсийОстатки.НачПериода >= СписокПенсионеров.НачалоПериодаНачисления
				|			И НачисленияПенсийОстатки.КонПериода <= СписокПенсионеров.КонецПериодаНачисления
				|
				|УПОРЯДОЧИТЬ ПО
				|	НомерСчета,
				|	НачПериода
				|ИТОГИ
				|	СУММА(СуммаОстаток),
				|	СУММА(НалоговаяБазаПоНДФЛОстаток),
				|	МАКСИМУМ(Сумма),
				|	СУММА(Невыплата),
				|	МАКСИМУМ(НДФЛ),
				|	МАКСИМУМ(Выплата)
				|ПО
				|	НомерСчета";
				
				Запрос.УстановитьПараметр("Организация", Организация);
				Запрос.УстановитьПараметр("ДатаДок", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
				//Запрос.УстановитьПараметр("СписокСчетов", СписокПенсионеров.ВыгрузитьКолонку("НомерСчета"));
				Запрос.УстановитьПараметр("СписокСчетов", СписокСчетовПенсионеров);
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НомерСчета");
				
				Пока Выборка.Следующий() Цикл
					Если Выборка.Невыплата = 0 или ФормироватьОтвергнутыеПлатежи Тогда
						Если Выборка.Сумма>Выборка.СуммаОстаток Тогда
							//ТекстСообщения = ТекстСообщения+
							//"|По счету "+Выборка.НомерСчета.Код+" "+Выборка.НомерСчета.Участник.Наименование+" попытка выплатить "+Выборка.Сумма+", а начислено "+Выборка.СуммаОстаток;
							уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По счету "+Выборка.НомерСчетаТекст+" "+Выборка.НомерСчета.Участник.Наименование+" попытка выплатить "+Выборка.Сумма+", а начислено "+Выборка.СуммаОстаток,,Заголовок);
							Отказ = Истина;
							продолжить;
						КонецЕсли;
						ВыборкаНачислений = Выборка.Выбрать();
						ОсталосьСписать = Выборка.Сумма;
						НадоСписатьНДФЛ = Выборка.НДФЛ;
						НадоСписатьНБ = Выборка.НалоговаяБазаПоНДФЛОстаток;
						
						Пока ОсталосьСписать>0 и ВыборкаНачислений.Следующий() Цикл
							СуммаКСписанию = Мин(ОсталосьСписать, ВыборкаНачислений.СуммаОстаток);
							
							//регистр Начислениепенсии
							Движение = ТабНачислений.Добавить();
							Движение.Активность = Истина;
							Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
							Движение.Организация = Организация;
							Движение.НомерСчета = ВыборкаНачислений.НомерСчета;
							Движение.Период = Дата;
							Движение.Регистратор = Ссылка;
							Движение.НачПериода = ВыборкаНачислений.НачПериода;
							Движение.КонПериода = ВыборкаНачислений.КонПериода;
							Движение.ТипРезерва = ВыборкаНачислений.ТипРезерва;
							Движение.ТипСуммы = ВыборкаНачислений.ТипСуммы;
							Движение.Сумма = СуммаКСписанию;
							Движение.НалоговаяБазаПоНДФЛ = ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток;
							Движение.Схема        = ВыборкаНачислений.Схема;
							Движение.ТипПенсии   = ВыборкаНачислений.ТипПенсии;
							Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.Выплата;
							ОсталосьСписать = ОсталосьСписать-СуммаКСписанию;
							
							Если Выборка.Невыплата > 0 и ФормироватьОтвергнутыеПлатежи Тогда
								Если Выборка.НалоговаяБазаПоНДФЛОстаток>0 Тогда
									Если ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток>0 И ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток = НадоСписатьНБ Тогда
										СписываемНДФЛ = НадоСписатьНДФЛ;
									ИначеЕсли ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток>0 Тогда
										СписываемНДФЛ = Окр(ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток*НадоСписатьНДФЛ/НадоСписатьНБ,2);
									ИначеЕсли НадосписатьНБ = 0 Тогда
										СписываемНДФЛ = НадоСписатьНДФЛ;
									КонецЕсли;	
								Иначе
									СписываемНДФЛ = НадоСписатьНДФЛ;
								КонецЕсли;	
								//формируем регистр отвергнутых платежей
								//то же, что и в начислениях, но еще НДФЛ
								Движение = ТабОтвергнутых.Добавить();
								Движение.Активность = Истина;
								Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
								Движение.Организация = Организация;
								Движение.НомерСчета = ВыборкаНачислений.НомерСчета;
								Движение.Период = Дата;
								Движение.Регистратор = Ссылка;
								Движение.НачПериода = ВыборкаНачислений.НачПериода;
								Движение.КонПериода = ВыборкаНачислений.КонПериода;
								Движение.ТипРезерва = ВыборкаНачислений.ТипРезерва;
								Движение.ТипСуммы = ВыборкаНачислений.ТипСуммы;
								Движение.Сумма = СуммаКСписанию-СписываемНДФЛ;  
								Движение.НалоговаяБазаПоНДФЛ = ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток;
								Если НДФЛУдержанВБюджет Тогда
									Движение.НДФЛ = 0;
								Иначе
									Движение.НДФЛ = СписываемНДФЛ; //это, если НДФЛ не перечисляем
								КонецЕсли;
								Движение.Схема        = ВыборкаНачислений.Схема;
								Движение.ТипПенсии   = ВыборкаНачислений.ТипПенсии;
								Движение.ДокументВыплаты = Ссылка;
								Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.Возврат;
								
								НадоСписатьНДФЛ = НадоСписатьНДФЛ-СписываемНДФЛ;
								НадоСписатьНБ = НадоСписатьНБ-ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли  ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияНПО Тогда
				//списываем остатки с отвергнутых платежей
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ВыплатныеРеестрыСписокПенсионеров.НомерСчета КАК НомерСчета,
				|	ВыплатныеРеестрыСписокПенсионеров.Участник КАК Участник,
				|	ВыплатныеРеестрыСписокПенсионеров.Сумма - ВыплатныеРеестрыСписокПенсионеров.НДФЛ КАК Сумма,
				|	ВыплатныеРеестрыСписокПенсионеров.Схема КАК Схема,
				|	ВыплатныеРеестрыСписокПенсионеров.ТипПенсии КАК ТипПенсии,
				|	ПРЕДСТАВЛЕНИЕ(ВыплатныеРеестрыСписокПенсионеров.НомерСчета) КАК НомерСчетаТекст,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета, 0) = 0
				|			ТОГДА 0
				|		ИНАЧЕ 1
				|	КОНЕЦ КАК Невыплата,
				|	ВыплатныеРеестрыСписокПенсионеров.НачалоПериодаНачисления КАК НачалоПериодаНачисления,
				|	ВыплатныеРеестрыСписокПенсионеров.НДФЛ КАК НДФЛ,
				|	ВыплатныеРеестрыСписокПенсионеров.Выплата КАК Выплата,
				|	ВыплатныеРеестрыСписокПенсионеров.КонецПериодаНачисления КАК КонецПериодаНачисления
				|ПОМЕСТИТЬ СписокПенсионеров
				|ИЗ
				|	Документ.уп_ВыплатныеРеестры.СписокПенсионеров КАК ВыплатныеРеестрыСписокПенсионеров
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ВыплатныеРеестры.НеисполненныеВыплаты КАК уп_ВыплатныеРеестрыНеисполненныеВыплаты
				|		ПО ВыплатныеРеестрыСписокПенсионеров.Ссылка = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Ссылка
				|			И ВыплатныеРеестрыСписокПенсионеров.НомерСчета = уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета
				|			И ВыплатныеРеестрыСписокПенсионеров.Участник = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Участник
				|ГДЕ
				|	ВыплатныеРеестрыСписокПенсионеров.Ссылка = &Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	НачисленияПенсийОстатки.НачПериода КАК НачПериода,
				|	НачисленияПенсийОстатки.КонПериода КАК КонПериода,
				|	ЕСТЬNULL(НачисленияПенсийОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
				|	ЕСТЬNULL(НачисленияПенсийОстатки.НалоговаяБазаПоНДФЛОстаток, 0) КАК НалоговаяБазаПоНДФЛОстаток,
				|	СписокПенсионеров.Сумма КАК Сумма,
				|	СписокПенсионеров.НомерСчета КАК НомерСчета,
				|	СписокПенсионеров.Участник КАК Участник,
				|	СписокПенсионеров.Схема КАК Схема,
				|	СписокПенсионеров.ТипПенсии КАК ТипПенсии,
				|	СписокПенсионеров.Невыплата КАК Невыплата,
				|	СписокПенсионеров.НомерСчетаТекст КАК НомерСчетаТекст,
				|	НачисленияПенсийОстатки.НДФЛОстаток КАК НДФЛОстаток,
				|	СписокПенсионеров.НДФЛ КАК НДФЛ,
				|	СписокПенсионеров.Выплата КАК Выплата,
				|	НачисленияПенсийОстатки.ТипРезерва КАК ТипРезерва,
				|	НачисленияПенсийОстатки.ТипСуммы КАК ТипСуммы
				|ИЗ
				|	СписокПенсионеров КАК СписокПенсионеров
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_ОтвергнутыеПлатежиПенсийНПО.Остатки(&ДатаДок, НомерСчета В (&СписокСчетов)) КАК НачисленияПенсийОстатки
				|		ПО (СписокПенсионеров.НомерСчета = НачисленияПенсийОстатки.НомерСчета)
				|			И НачисленияПенсийОстатки.НачПериода >= СписокПенсионеров.НачалоПериодаНачисления
				|			И НачисленияПенсийОстатки.КонПериода <= СписокПенсионеров.КонецПериодаНачисления
				|
				|УПОРЯДОЧИТЬ ПО
				|	НомерСчета,
				|	НачПериода
				|ИТОГИ
				|	СУММА(СуммаОстаток),
				|	МАКСИМУМ(Сумма),
				|	СУММА(Невыплата),
				|	МАКСИМУМ(НДФЛ),
				|	МАКСИМУМ(Выплата)
				|ПО
				|	НомерСчета";
				
				Запрос.УстановитьПараметр("Организация", Организация);
				Запрос.УстановитьПараметр("ДатаДок", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
				//Запрос.УстановитьПараметр("СписокСчетов", СписокПенсионеров.ВыгрузитьКолонку("НомерСчета"));
				Запрос.УстановитьПараметр("СписокСчетов", СписокСчетовПенсионеров);
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НомерСчета");
				
				Пока Выборка.Следующий() Цикл
					Если Выборка.Невыплата = 0  или ФормироватьОтвергнутыеПлатежи Тогда
						Если Выборка.Сумма>Выборка.СуммаОстаток Тогда
							//ТекстСообщения = ТекстСообщения+
							//"|По счету "+Выборка.НомерСчета.Код+" "+Выборка.НомерСчета.Участник.Наименование+" попытка выплатить "+Выборка.Сумма+", а начислено "+Выборка.СуммаОстаток;
							уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По счету "+Выборка.НомерСчетаТекст+" "+Выборка.НомерСчета.Участник.Наименование+" попытка выплатить "+Выборка.Сумма+", а начислено "+Выборка.СуммаОстаток,,Заголовок);
							Отказ = Истина;
							продолжить;
						КонецЕсли;
						ВыборкаНачислений = Выборка.Выбрать();
						ОсталосьСписать = Выборка.Выплата;
						
						Пока ОсталосьСписать>0 и ВыборкаНачислений.Следующий() Цикл
							СуммаКСписанию = Мин(ОсталосьСписать, ВыборкаНачислений.СуммаОстаток);
							
							//регистр Начислениепенсии
							Движение = ТабНачислений.Добавить();
							Движение.Активность = Истина;
							Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
							Движение.Организация = Организация;
							Движение.НомерСчета = ВыборкаНачислений.НомерСчета;
							Движение.Период = Дата;
							Движение.Регистратор = Ссылка;
							Движение.НачПериода = ВыборкаНачислений.НачПериода;
							Движение.КонПериода = ВыборкаНачислений.КонПериода;
							Движение.ТипРезерва = ВыборкаНачислений.ТипРезерва;
							Движение.ТипСуммы   = ВыборкаНачислений.ТипСуммы;
							Движение.Сумма = СуммаКСписанию;
							Движение.НДФЛ = ВыборкаНачислений.НДФЛОстаток;
							Движение.НалоговаяБазаПоНДФЛ = ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток;
							Движение.Схема        = ВыборкаНачислений.Схема;
							Движение.ТипПенсии   = ВыборкаНачислений.ТипПенсии;
							Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.Выплата;
							ОсталосьСписать = ОсталосьСписать-СуммаКСписанию;
							
							Если Выборка.Невыплата = 0 Тогда
								СтрокаТабТрансляции = ТабТрансляции.Добавить();
								ЗаполнитьЗначенияСвойств(СтрокаТабТрансляции,Движение);
								СтрокаТабТрансляции.Сумма = СуммаКСписанию+ВыборкаНачислений.НДФЛОстаток;
							КонецЕсли;	
							
							Если Выборка.Невыплата > 0  и ФормироватьОтвергнутыеПлатежи Тогда
								//формируем приход в регистр отвергнутых платежей
								Движение = ТабНачислений.Добавить();
								Движение.Активность = Истина;
								Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
								Движение.Организация = Организация;
								Движение.НомерСчета = ВыборкаНачислений.НомерСчета;
								Движение.Период = Дата;
								Движение.Регистратор = Ссылка;
								Движение.НачПериода = ВыборкаНачислений.НачПериода;
								Движение.КонПериода = ВыборкаНачислений.КонПериода;
								Движение.ТипРезерва = ВыборкаНачислений.ТипРезерва;
								Движение.ТипСуммы   = ВыборкаНачислений.ТипСуммы;
								Движение.Сумма = СуммаКСписанию;
								Если НДФЛУдержанВБюджет Тогда
									Движение.НДФЛ = 0;
								Иначе
									Движение.НДФЛ = ВыборкаНачислений.НДФЛОстаток; //это,если НДФЛ не перечисляем
								КонецЕсли;
								Движение.НалоговаяБазаПоНДФЛ = ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток;
								Движение.Схема        = ВыборкаНачислений.Схема;
								Движение.ТипПенсии   = ВыборкаНачислений.ТипПенсии;
							КонецЕсли;	
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				ТабРезервовНПО = ДвиженияПоРезервамНПО(ТабТрансляции);
				
			КонецЕсли;
			
			Если НЕ ПоИсполнительномуЛисту Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	ВыплатныеРеестрыСписокПенсионеров.Участник КАК Участник,
				               |	СУММА(ВыплатныеРеестрыСписокПенсионеров.НДФЛ) КАК НДФЛ,
				               |	ВыплатныеРеестрыСписокПенсионеров.НомерСчета КАК НомерСчета,
				               |	ВыплатныеРеестрыСписокПенсионеров.Участник.уп_ФизЛицо КАК уп_ФизЛицо,
				               |	ВЫБОР
				               |		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета, 0) = 0
				               |			ТОГДА 0
				               |		ИНАЧЕ 1
				               |	КОНЕЦ КАК Невыплата
				               |ПОМЕСТИТЬ СписокУчастниковНДФЛ
				               |ИЗ
				               |	Документ.уп_ВыплатныеРеестры.СписокПенсионеров КАК ВыплатныеРеестрыСписокПенсионеров
				               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ВыплатныеРеестры.НеисполненныеВыплаты КАК уп_ВыплатныеРеестрыНеисполненныеВыплаты
				               |		ПО ВыплатныеРеестрыСписокПенсионеров.Ссылка = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Ссылка
				               |			И ВыплатныеРеестрыСписокПенсионеров.НомерСчета = уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета
				               |			И ВыплатныеРеестрыСписокПенсионеров.Участник = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Участник
				               |ГДЕ
				               |	ВыплатныеРеестрыСписокПенсионеров.Ссылка = &Ссылка
				               |
				               |СГРУППИРОВАТЬ ПО
				               |	ВыплатныеРеестрыСписокПенсионеров.Участник,
				               |	ВыплатныеРеестрыСписокПенсионеров.НомерСчета,
				               |	ВыплатныеРеестрыСписокПенсионеров.Участник.уп_ФизЛицо,
				               |	ВЫБОР
				               |		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета, 0) = 0
				               |			ТОГДА 0
				               |		ИНАЧЕ 1
				               |	КОНЕЦ
				               |;
				               |
				               |////////////////////////////////////////////////////////////////////////////////
				               |ВЫБРАТЬ
				               |	СписокУчастниковНДФЛ.Участник КАК Участник,
				               |	СписокУчастниковНДФЛ.Участник.уп_ФизЛицо КАК ФизЛицо,
				               |	СписокУчастниковНДФЛ.НДФЛ КАК НДФЛ,
				               |	НДФЛУчастниковРасчетыСБюджетомОстатки.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
				               |	НДФЛУчастниковРасчетыСБюджетомОстатки.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
				               |	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.НалогОстаток, 0) КАК НДФЛОстаток,
				               |	СтатусФизЛицКакНалогоплательщиковНДФЛСрезПоследних.Статус КАК Статус,
				               |	СписокУчастниковНДФЛ.НомерСчета КАК НомерСчета,
				               |	СписокУчастниковНДФЛ.Невыплата КАК Невыплата,
				               |	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияОстаток, 0) КАК СуммаСПревышенияОстаток,
				               |	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке18Остаток, 0) КАК СуммаСПревышенияПоСтавке18Остаток,
				               |	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке20Остаток, 0) КАК СуммаСПревышенияПоСтавке20Остаток,
				               |	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке22Остаток, 0) КАК СуммаСПревышенияПоСтавке22Остаток,
				               |	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.НалогОстаток, 0) + ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияОстаток, 0) + ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке18Остаток, 0) + ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке20Остаток, 0) + ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке22Остаток, 0) КАК НалогОстаток
				               |ИЗ
				               |	СписокУчастниковНДФЛ КАК СписокУчастниковНДФЛ
				               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ.СрезПоследних(
				               |				&ДатаДок,
				               |				ФизическоеЛицо В
				               |					(ВЫБРАТЬ
				               |						СписокУчастниковНДФЛ.уп_ФизЛицо
				               |					ИЗ
				               |						СписокУчастниковНДФЛ)) КАК СтатусФизЛицКакНалогоплательщиковНДФЛСрезПоследних
				               |		ПО СписокУчастниковНДФЛ.уп_ФизЛицо = СтатусФизЛицКакНалогоплательщиковНДФЛСрезПоследних.ФизическоеЛицо
				               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_НДФЛУчастниковРасчетыСБюджетом.Остатки(
				               |				&ДатаДок,
				               |				Организация = &Организация
				               |					И НомерСчета В (&СписокСчетов)
				               |					И ВидРасчета = &ВидРасчета) КАК НДФЛУчастниковРасчетыСБюджетомОстатки
				               |		ПО СписокУчастниковНДФЛ.НомерСчета = НДФЛУчастниковРасчетыСБюджетомОстатки.НомерСчета
				               |			И СписокУчастниковНДФЛ.Участник = НДФЛУчастниковРасчетыСБюджетомОстатки.Участник
				               |
				               |УПОРЯДОЧИТЬ ПО
				               |	Участник,
				               |	НомерСчета,
				#Вставка 
				//ЛыткинАМ //Возможность списать минусовые начисления
				|НалогОстаток > 0,
				#КонецВставки
				               |	МесяцНалоговогоПериода
				               |ИТОГИ
				               |	МАКСИМУМ(НДФЛ),
				               |	СУММА(Невыплата),
				               |	СУММА(НалогОстаток)
				               |ПО
				               |	НомерСчета";
				
				Запрос.УстановитьПараметр("Организация", Организация);
				Запрос.УстановитьПараметр("ДатаДок", КонецДня(Дата));
				//Запрос.УстановитьПараметр("СписокСчетов", СписокПенсионеров.ВыгрузитьКолонку("НомерСчета"));
				//Запрос.УстановитьПараметр("СписокУчастников", СписокПенсионеров.ВыгрузитьКолонку("Участник"));
				Запрос.УстановитьПараметр("СписокСчетов", СписокСчетовПенсионеров);
				Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
				Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.Начисления.уп_Пенсия);
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НомерСчета");
				
				Пока Выборка.Следующий() Цикл
					Если Выборка.Невыплата = 0 или НДФЛУдержанВБюджет Тогда
						Если (Выборка.НДФЛ>Выборка.НалогОстаток) и (Выборка.НДФЛ>0) Тогда
							//ТекстСообщения = ТекстСообщения+
							//"|По Участнику "+Выборка.Участник.Код+" "+Выборка.Участник.Наименование+" попытка вычесть НДФЛ "+Выборка.НДФЛ+", а начислено "+Выборка.НалогОстаток;
							уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По Участнику "+Выборка.НомерСчета.Участник.Код+" "+Выборка.НомерСчета.Участник.Наименование+" попытка вычесть НДФЛ "+Выборка.НДФЛ+", а начислено "+Выборка.НалогОстаток,,Заголовок);
							Отказ = Истина;
							продолжить;
							//ИначеЕсли (Выборка.НДФЛ<Выборка.НалогОстаток) и (Выборка.НДФЛ<0) Тогда
							//	Сообщить("По Участнику "+Выборка.Участник.Код+" "+Выборка.Участник.Наименование+" попытка вернуть НДФЛ "+Выборка.НДФЛ+", а начислено "+Выборка.НалогОстаток);
							//	Отказ = Истина;
							//	продолжить;
						КонецЕсли;
						ВыборкаНачислений = Выборка.Выбрать();
						ОсталосьСписать = Выборка.НДФЛ;
						//ОсталосьВычетЛичный = Выборка.ПримененныйВычетЛичныйОстаток;
						//ОсталосьВычетНаДетей = Выборка.ПримененныйВычетНаДетейОстаток;
						КатегорияДохода = ПланыВидовРасчета.Начисления.уп_Пенсия.КатегорияДохода;
						Пока (ОсталосьСписать<>0)  и (ВыборкаНачислений.Следующий()) Цикл
							//Пока (ОсталосьСписать>0 и ВыборкаНачислений.Следующий()) или ((Выборка.НДФЛ = 0) и ((ОсталосьВычетЛичный<>0) или (ОсталосьВычетНаДетей<>0))и ВыборкаНачислений.Следующий()) Цикл	
							Если (ОсталосьСписать>0) Тогда 
								СуммаКСписанию = Мин(ОсталосьСписать, ВыборкаНачислений.НалогОстаток);
								Если СуммаКСписанию<0 Тогда
									СуммаКСписанию = 0;
								КонецЕсли;	
							//ИначеЕсли (ОсталосьСписать<0) Тогда   //ситуация не обслуживается на текущий момент
							//	СуммаКСписанию = Макс(ОсталосьСписать, ВыборкаНачислений.НалогОстаток); 
							//	Если СуммаКСписанию>0 Тогда
							//		СуммаКСписанию = 0;
							//	КонецЕсли;	
							КонецЕсли;
							Если СуммаКСписанию>0 Тогда
								//еще надо по налоговым ставкам раскидать
								СписатьПоСтроке = СуммаКСписанию;
								Если ВыборкаНачислений.СуммаСПревышенияПоСтавке22Остаток>0 Тогда
									Налог22 = Мин(СписатьПоСтроке, ВыборкаНачислений.СуммаСПревышенияПоСтавке22Остаток);
								Иначе
									Налог22 = 0;
								КонецЕсли;
								СписатьПоСтроке = СписатьПоСтроке-Налог22;
								
								Если ВыборкаНачислений.СуммаСПревышенияПоСтавке20Остаток>0 И СписатьПоСтроке>0 Тогда
									Налог20 = Мин(СписатьПоСтроке, ВыборкаНачислений.СуммаСПревышенияПоСтавке20Остаток);
								Иначе
									Налог20 = 0;
								КонецЕсли;
								СписатьПоСтроке = СписатьПоСтроке-Налог20; 
								
								Если ВыборкаНачислений.СуммаСПревышенияПоСтавке18Остаток>0 И СписатьПоСтроке>0 Тогда
									Налог18 = Мин(СписатьПоСтроке, ВыборкаНачислений.СуммаСПревышенияПоСтавке18Остаток);
								Иначе
									Налог18 = 0;
								КонецЕсли;
								СписатьПоСтроке = СписатьПоСтроке-Налог18;
								
								Если ВыборкаНачислений.СуммаСПревышенияОстаток>0 И СписатьПоСтроке>0 Тогда
									Налог15 = Мин(СписатьПоСтроке, ВыборкаНачислений.СуммаСПревышенияОстаток);
								Иначе
									Налог15 = 0;
								КонецЕсли;
								СписатьПоСтроке = СписатьПоСтроке-Налог15; 
								
								Если ВыборкаНачислений.НДФЛОстаток>0 И СписатьПоСтроке>0 Тогда
									Налог13 = Мин(СписатьПоСтроке, ВыборкаНачислений.НДФЛОстаток);
								Иначе
									Налог13 = 0;
								КонецЕсли;
								
								
								//регистр НДФЛРасчеты с бюджетом
								Движение = ТабНДФЛУчастников.Добавить();
								Движение.Активность = Истина;
								Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
								//Движение = Движения.уп_НДФЛУчастниковРасчетыСБюджетом.ДобавитьРасход();
								Движение.Участник = ВыборкаНачислений.Участник;
								Движение.НомерСчета = ВыборкаНачислений.НомерСчета;
								Движение.Период = Дата;
								Движение.Регистратор = Ссылка;
								Движение.МесяцНалоговогоПериода = ВыборкаНачислений.МесяцНалоговогоПериода;
								Движение.Организация = Организация;
								Движение.СтавкаНалогообложенияРезидента = ВыборкаНачислений.СтавкаНалогообложенияРезидента;
								Движение.Налог = Налог13; 
								Движение.СуммаСПревышения = Налог15;
								Движение.СуммаСПревышенияПоСтавке18 = Налог18;
								Движение.СуммаСПревышенияПоСтавке20 = Налог20;
								Движение.СуммаСПревышенияПоСтавке22 = Налог22;
								Движение.ВидСтроки = Перечисления.УдалитьНДФЛРасчетыСБюджетомВидСтроки.Удержание;
								Движение.ВидРасчета = ПланыВидовРасчета.Начисления.уп_Пенсия; 
								
								ОсталосьСписать = ОсталосьСписать-СуммаКСписанию;
								
								Движение = ТабНДФЛ.Добавить();
								Движение.Активность = Истина;
								Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
								//Движение = Движения.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДобавитьРасход();
								Движение.ФизическоеЛицо = ВыборкаНачислений.ФизЛицо;
								Движение.Период = Дата;
								Движение.Регистратор = Ссылка;
								Движение.МесяцНалоговогоПериода = ВыборкаНачислений.МесяцНалоговогоПериода;;
								Если НЕ ЗначениеЗаполнено(Организация.ГоловнаяОрганизация) Тогда
									Движение.ГоловнаяОрганизация = Организация;
								Иначе
									Движение.ГоловнаяОрганизация = Организация.ГоловнаяОрганизация;
								КонецЕсли;
								Движение.РегистрацияВНалоговомОргане = РегистрацияВНалоговомОргане;
								Движение.СтавкаНалогообложенияРезидента = ВыборкаНачислений.СтавкаНалогообложенияРезидента;
								Движение.Подразделение = ПодразделениеОрганизации;
								Движение.Сумма = Налог13; 
								Движение.СуммаСПревышения = Налог15; 
								Движение.СуммаСПревышенияПоСтавке18 = Налог18; 
								Движение.СуммаСПревышенияПоСтавке20 = Налог20; 
								Движение.СуммаСПревышенияПоСтавке22 = Налог22; 
								Движение.КатегорияДохода = КатегорияДохода;
								//Магера Д.В. 
								Движение.ВариантУдержания = Перечисления.ВариантыУдержанияНДФЛ.Удержано; 
								Движение.Организация = Организация;
								
								
								//регистр РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
								СтруктураСуммНДФЛ = Новый Структура("Сумма13, Сумма15, Сумма18, Сумма20, Сумма22, Сумма30", ?(ВыборкаНачислений.Статус = Справочники.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент,0,Налог13), Налог15, Налог18, Налог20, Налог22, ?(ВыборкаНачислений.Статус = Справочники.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент,Налог13,0));
								ТаблицаРаспределения = уп_ОбщегоНазначенияСервер.СформироватьТаблицуНДФЛПоСтавкам(СтруктураСуммНДФЛ);
								Для Каждого стрСтавка из ТаблицаРаспределения Цикл
									Движение = ТабНДФЛ_НА.Добавить();
									Движение.Активность = Истина;
									Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
									//Движение = Движения.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ДобавитьПриход();
									Движение.ФизическоеЛицо = ВыборкаНачислений.ФизЛицо;
									Движение.Период = Дата;
									Движение.МесяцНалоговогоПериода = ВыборкаНачислений.МесяцНалоговогоПериода;
									Движение.Регистратор = Ссылка;
									Если НЕ ЗначениеЗаполнено(Организация.ГоловнаяОрганизация) Тогда
										Движение.Организация = Организация;
									Иначе
										Движение.Организация = Организация.ГоловнаяОрганизация;
									КонецЕсли; 
									Движение.Ставка = стрСтавка.Ставка;
									Движение.Сумма = стрСтавка.Сумма;
									//Если ВыборкаНачислений.Статус = Справочники.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент Тогда
									//	Движение.Ставка = Перечисления.НДФЛСтавки.Ставка30;
									//Иначе
									//	Движение.Ставка = Перечисления.НДФЛСтавки.Ставка13;
									//КонецЕсли;
									//Движение.РегистрацияВНалоговомОргане = РегистрацияВНалоговомОргане;
									////Движение.ОКАТО_КПП = СтрОКАТОКПП;
									////Движение.ОКТМО_КПП = СтрОКТМОКПП;
									//Движение.Сумма = СуммаКСписанию;
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
						Если ОсталосьСписать<>0 Тогда
							//ТекстСообщения = ТекстСообщения+
							//"|Списание НДФЛ по Участнику "+ВыборкаНачислений.Участник.Код+"выполнена некорректно. Сообщите разработчику.";					
							уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Списание НДФЛ по Участнику "+Выборка.НомерСчета.Участник.Код+"выполнено некорректно. Сообщите разработчику.",,Заголовок);
							Отказ = Истина;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				Для Каждого СтрТабНБ из ТаблицаНалоговойБазыБезНДФЛ Цикл
					Движение = ТабНДФЛ.Добавить();
					Движение.Активность = Истина;
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.ФизическоеЛицо = СтрТабНБ.ФизическоеЛицо;
					Движение.Период = Дата;
					Движение.Регистратор = Ссылка;
					Движение.МесяцНалоговогоПериода = СтрТабНБ.МесяцНалоговогоПериода;
					Если НЕ ЗначениеЗаполнено(Организация.ГоловнаяОрганизация) Тогда
						Движение.ГоловнаяОрганизация = Организация;
					Иначе
						Движение.ГоловнаяОрганизация = Организация.ГоловнаяОрганизация;
					КонецЕсли;
					Движение.РегистрацияВНалоговомОргане = РегистрацияВНалоговомОргане;
					Движение.СтавкаНалогообложенияРезидента = Перечисления.НДФЛСтавкиНалогообложенияРезидента.Ставка13;
					Движение.Подразделение = ПодразделениеОрганизации;
					Движение.Сумма = 0;  
					Движение.КатегорияДохода = ПланыВидовРасчета.Начисления.уп_Пенсия.КатегорияДохода;
					Движение.ВариантУдержания = Перечисления.ВариантыУдержанияНДФЛ.Удержано; 
					Движение.Организация = Организация;
					Движение.СуммаВыплаченногоДохода = СтрТабНБ.СуммаВыплаченногоДохода;
					Движение.СрокПеречисления = Перечисления.СрокиПеречисляемогоНалога.ПрочиеДоходы;
					Движение.УчитыватьВыплаченныйДоходВ6НДФЛ = Истина;
				КонецЦикла;	
			КонецЕсли;
			
			//создадим таблицу схем
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	уп_ВыплатныеРеестрыСписокПенсионеров.Схема КАК Схема,
			|	уп_ВыплатныеРеестрыСписокПенсионеров.Схема.ТипПенсионнойСхемы КАК ТипПенсионнойСхемы,
			|	уп_ВыплатныеРеестрыСписокПенсионеров.ТипПенсии КАК ТипПенсии,
			|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчета КАК НомерСчета,
			|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСтроки КАК НомерСтроки,
			|	уп_ВыплатныеРеестрыСписокПенсионеров.ПенсионныйДоговор КАК ПенсионныйДоговор, 
			|	уп_ВыплатныеРеестрыСписокПенсионеров.ПенсионныйДоговор.Вкладчик КАК Вкладчик, 
			|	уп_ВыплатныеРеестрыСписокПенсионеров.ПенсионныйДоговор.ДоговорКонтрагента КАК ДоговорКонтрагента, 
			|	уп_ВыплатныеРеестрыСписокПенсионеров.Участник КАК Участник,
			|	уп_ВыплатныеРеестрыСписокПенсионеров.Сумма КАК Сумма,
			|	уп_ВыплатныеРеестрыСписокПенсионеров.НДФЛ КАК НДФЛ,
			|	уп_ВыплатныеРеестрыСписокПенсионеров.НачалоПериодаНачисления КАК НачалоПериодаНачисления,
			|	уп_ВыплатныеРеестрыСписокПенсионеров.КонецПериодаНачисления КАК КонецПериодаНачисления,
			|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
			|	уп_ВыплатныеРеестрыСписокПенсионеров.ДоверенноеЛицо КАК ДоверенноеЛицо,
			|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчетаПриемника КАК НомерСчетаПриемника,
			|	уп_ВыплатныеРеестрыСписокПенсионеров.РКО КАК РКО,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета, 0) = 0
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК Невыплата
			|ПОМЕСТИТЬ СхемыВТЧ
			|ИЗ
			|	Документ.уп_ВыплатныеРеестры.СписокПенсионеров КАК уп_ВыплатныеРеестрыСписокПенсионеров
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ВыплатныеРеестры.НеисполненныеВыплаты КАК уп_ВыплатныеРеестрыНеисполненныеВыплаты
			|		ПО уп_ВыплатныеРеестрыСписокПенсионеров.Ссылка = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Ссылка
			|			И уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчета = уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета
			|			И уп_ВыплатныеРеестрыСписокПенсионеров.Участник = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Участник
			|ГДЕ
			|	уп_ВыплатныеРеестрыСписокПенсионеров.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_СхемаСчетаСрезПоследних.НомерСчета КАК НомерСчета,
			|	уп_СхемаСчетаСрезПоследних.Схема КАК Схема,
			|	уп_СхемаСчетаСрезПоследних.Схема.ТипПенсионнойСхемы КАК СхемаТипПенсионнойСхемы,
			|	уп_СхемаСчетаСрезПоследних.ТипПенсии КАК ТипПенсии
			|ПОМЕСТИТЬ СхемыВРегистре
			|ИЗ
			|	РегистрСведений.уп_СхемаСчета.СрезПоследних(&ДатаДок, НомерСчета В (&СписокСчетов)) КАК уп_СхемаСчетаСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СхемыВТЧ.Схема КАК Схема,
			|	уп_ПравилаВеденияРезерваПожизненныхВыплатСрезПоследних.Правило КАК Правило,
			|	СхемыВТЧ.Схема.ТипПенсионнойСхемы КАК ТипПенсионнойСхемы,
			|	СхемыВТЧ.НомерСчета КАК НомерСчета,
			|	СхемыВТЧ.НомерСтроки КАК НомерСтроки,
			|	СхемыВТЧ.ПенсионныйДоговор КАК ПенсионныйДоговор, 
			|	СхемыВТЧ.Вкладчик КАК Вкладчик, 
			|	СхемыВТЧ.ДоговорКонтрагента КАК ДоговорКонтрагента, 
			|	СхемыВТЧ.Участник КАК Участник,
			|	СхемыВТЧ.Сумма КАК Сумма,
			|	СхемыВТЧ.НДФЛ КАК НДФЛ,
			|	СхемыВТЧ.НачалоПериодаНачисления КАК НачалоПериодаНачисления,
			|	СхемыВТЧ.КонецПериодаНачисления КАК КонецПериодаНачисления,
			|	СхемыВТЧ.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
			|	СхемыВТЧ.ДоверенноеЛицо КАК ДоверенноеЛицо,
			|	СхемыВТЧ.НомерСчетаПриемника КАК НомерСчетаПриемника,
			|	СхемыВТЧ.РКО КАК РКО,
			|	СхемыВРегистре.Схема КАК СхемаРегистр,
			|	СхемыВРегистре.СхемаТипПенсионнойСхемы КАК СхемаТипПенсионнойСхемы,
			|	СхемыВТЧ.Невыплата КАК Невыплата,
			|	СхемыВТЧ.ТипПенсии КАК ТипПенсии
			|ИЗ
			|	СхемыВТЧ КАК СхемыВТЧ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПравилаВеденияРезерваПожизненныхВыплат.СрезПоследних(&ДатаДок, ) КАК уп_ПравилаВеденияРезерваПожизненныхВыплатСрезПоследних
			|		ПО СхемыВТЧ.Схема = уп_ПравилаВеденияРезерваПожизненныхВыплатСрезПоследних.Схема
			|		ЛЕВОЕ СОЕДИНЕНИЕ СхемыВРегистре КАК СхемыВРегистре
			|		ПО СхемыВТЧ.НомерСчета = СхемыВРегистре.НомерСчета
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			
			Запрос.УстановитьПараметр("ДатаДок", Дата);
			//Запрос.УстановитьПараметр("СписокСчетов", СписокПенсионеров.ВыгрузитьКолонку("НомерСчета"));
			Запрос.УстановитьПараметр("СписокСчетов", СписокСчетовПенсионеров);
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			
			ТабСхем = Запрос.Выполнить();
			ТекСтрокаСписокПенсионеров = ТабСхем.Выбрать();
			
			//Для Каждого ТекСтрокаСписокПенсионеров Из СписокПенсионеров Цикл
			Пока ТекСтрокаСписокПенсионеров.Следующий() Цикл 
				Если ТекСтрокаСписокПенсионеров.Невыплата = 0 Тогда
					// регистр Выплаты
					Движение = ТабВыплат.Добавить();
					Движение.Активность = Истина;
					//Движение = Движения.уп_Выплаты.Добавить();
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Если ПоИсполнительномуЛисту Тогда
						Движение.Участник = Получатель;
					Иначе
						Движение.Участник = ТекСтрокаСписокПенсионеров.Участник;
					КонецЕсли;
					Движение.НомерСчета = ТекСтрокаСписокПенсионеров.НомерСчета;
					Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияНПО
						или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратПенсииНПО Тогда
						Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий;
					Иначе
						Движение.ТипВыплаты = ТипВыплаты;
					КонецЕсли;
					// КОНЕЦ 15.02.2018 golnev@orticongroup.ru
					Движение.Сумма = ТекСтрокаСписокПенсионеров.Сумма;
					Движение.НДФЛ = ТекСтрокаСписокПенсионеров.НДФЛ;
					Движение.Схема = ТекСтрокаСписокПенсионеров.Схема;
					Движение.ТипПенсии = ТекСтрокаСписокПенсионеров.ТипПенсии;
					Если РКОВСумме Тогда
						Движение.РКО = ТекСтрокаСписокПенсионеров.РКО;
						ТекСуммаВыплаты = ТекСтрокаСписокПенсионеров.Сумма - ТекСтрокаСписокПенсионеров.НДФЛ - ТекСтрокаСписокПенсионеров.РКО;
					Иначе
						ТекСуммаВыплаты = ТекСтрокаСписокПенсионеров.Сумма - ТекСтрокаСписокПенсионеров.НДФЛ;
					КонецЕсли;
					Движение.Выплата = ТекСуммаВыплаты;
					
					КонтрагентДт = ТекСтрокаСписокПенсионеров.Вкладчик;
					ДоговорДт = ТекСтрокаСписокПенсионеров.ДоговорКонтрагента;
					ТипПенсСхемы = ТекСтрокаСписокПенсионеров.СхемаТипПенсионнойСхемы;
					Если ТипПенсСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат
						ИЛИ ТекСтрокаСписокПенсионеров.ТипПенсии = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
						ПризнакДт = Истина;
						Если ТекСтрокаСписокПенсионеров.Правило = Перечисления.уп_РезервПожизненныхВыплат.БезАналитики Тогда
							КонтрагентДт = Справочники.Контрагенты.ПустаяСсылка();
							ДоговорДт = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
						КонецЕсли;	
					Иначе
						ПризнакДт = Ложь;
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(Получатель) Тогда //через кассу
						Получ = ТекСтрокаСписокПенсионеров.Участник;
						ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
					Иначе
						Если Реестр Тогда 
							Получ = ТекСтрокаСписокПенсионеров.Участник;
							ДоговорКонтрагента = ТекСтрокаСписокПенсионеров.ДоговорКонтрагента;
						Иначе
							Получ = Получатель;
							ДоговорКонтрагента = Получатель.ОсновнойДоговорКонтрагента;
						КонецЕсли;
					КонецЕсли;
					
					Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий Тогда
						Если НЕ ПроводкиПоНачислению Тогда
							ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.Начисление, КонтрагентДт, ДоговорДт, 
							ТекСтрокаСписокПенсионеров.СхемаРегистр, ПризнакДт, Получ, ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ТекСтрокаСписокПенсионеров.Сумма);
							//еще НДФЛ
							ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.НДФЛПенсионеров, Получ, ДоговорКонтрагента, 
							Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Справочники.Контрагенты.ПустаяСсылка(), Справочники.ДоговорыКонтрагентов.ПустаяСсылка(), Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ТекСтрокаСписокПенсионеров.НДФЛ);
						КонецЕсли;
					КонецЕсли;
					//еще РКО
					Если РКОВСумме Тогда
						ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.РКО, Получ, ДоговорКонтрагента, 
						Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получ, ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ТекСтрокаСписокПенсионеров.РКО);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если ПоИсполнительномуЛисту Тогда
				Для Каждого стр из СписокПенсионеров Цикл
					Движение = Движения.уп_ВыплатыПоИсполнительнымЛистам.Добавить();
					Движение.Период = Дата;
					Движение.ИсполнительныйЛист = ИсполнительныйЛист;
					Движение.Организация = Организация;
					Движение.Участник = стр.Участник;
					Движение.Сумма = стр.Выплата;
				КонецЦикла;	
			КонецЕсли;	
			
			Если НЕ Отказ Тогда
				Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий Тогда
					Движения.уп_НачисленияПенсий.Загрузить(ТабНачислений);
					Движения.уп_Резервы.Загрузить(ТабРезервовНПО);
					Движения.уп_ОтвергнутыеПлатежиПенсийНПО.Загрузить(ТабОтвергнутых);
				ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияНПО Тогда
					Движения.уп_ОтвергнутыеПлатежиПенсийНПО.Загрузить(ТабНачислений);
					Движения.уп_Резервы.Загрузить(ТабРезервовНПО);  //возможно, это надо будет убрать
				Иначе
					Движения.уп_ВозвратыПенсийНПО.Загрузить(ТабНачислений);
					Движения.уп_ОтвергнутыеПлатежиПенсийНПО.Загрузить(ТабОтвергнутых);
				КонецЕсли;
				Движения.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Загрузить(ТабНДФЛ_НА);
				Движения.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Загрузить(ТабНДФЛ);
				Движения.уп_НДФЛУчастниковРасчетыСБюджетом.Загрузить(ТабНДФЛУчастников);
				Движения.уп_Выплаты.Загрузить(ТабВыплат);
				//Движения.уп_Резервы.Загрузить(ТабРезервовНПО);
			КонецЕсли;
			
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВзносов Тогда
			//запрос по остаткам
			
			ТабНачислений        = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ПрочиеНачисления");
			ТабВыплат         = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_Выплаты");
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчета КАК НомерСчета,
			               |	уп_ВыплатныеРеестрыСписокПенсионеров.Схема КАК Схема,
			               |	уп_ВыплатныеРеестрыСписокПенсионеров.Участник КАК Участник,
			               |	СУММА(уп_ВыплатныеРеестрыСписокПенсионеров.Сумма) КАК Сумма,
			               |	уп_ВыплатныеРеестрыСписокПенсионеров.ДокументРегистрации КАК ДокументРегистрации,
			               |	СУММА(уп_ВыплатныеРеестрыСписокПенсионеров.РКО) КАК РКО
			               |ПОМЕСТИТЬ СписокСчетовСуммы
			               |ИЗ
			               |	Документ.уп_ВыплатныеРеестры.СписокПенсионеров КАК уп_ВыплатныеРеестрыСписокПенсионеров
			               |ГДЕ
			               |	уп_ВыплатныеРеестрыСписокПенсионеров.Ссылка = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчета,
			               |	уп_ВыплатныеРеестрыСписокПенсионеров.Схема,
			               |	уп_ВыплатныеРеестрыСписокПенсионеров.Участник,
			               |	уп_ВыплатныеРеестрыСписокПенсионеров.ДокументРегистрации
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	СписокСчетовСуммы.Участник КАК Участник,
			               |	ЕСТЬNULL(ПрочиеНачисленияОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
			               |	СписокСчетовСуммы.ДокументРегистрации КАК ДокументРегистрации,
			               |	СписокСчетовСуммы.НомерСчета КАК НомерСчета,
			               |	СписокСчетовСуммы.Сумма КАК Сумма,
			               |	СписокСчетовСуммы.Схема КАК Схема,
			               |	СписокСчетовСуммы.РКО КАК РКО,
			               |	ПрочиеНачисленияОстатки.ТипРезерва КАК ТипРезерва,
			               |	ПрочиеНачисленияОстатки.ТипСуммы КАК ТипСуммы
			               |ИЗ
			               |	СписокСчетовСуммы КАК СписокСчетовСуммы
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_ПрочиеНачисления.Остатки(
			               |				&ДатаДок,
			               |				Организация = &Организация
			               |					И ТипВыплаты = &ТипВыплаты
			               |					И Участник В (&СписокПолучателей)
			               |					И НомерСчета В (&СписокСчетов)) КАК ПрочиеНачисленияОстатки
			               |		ПО СписокСчетовСуммы.НомерСчета = ПрочиеНачисленияОстатки.НомерСчета
			               |			И СписокСчетовСуммы.Участник = ПрочиеНачисленияОстатки.Участник
			               |			И СписокСчетовСуммы.ДокументРегистрации = ПрочиеНачисленияОстатки.ДокументРегистрации
			               |ИТОГИ
			               |	СУММА(СуммаОстаток),
			               |	МАКСИМУМ(Сумма),
			               |	МАКСИМУМ(РКО)
			               |ПО
			               |	НомерСчета";
			
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("ДатаДок", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
			Запрос.УстановитьПараметр("ТипВыплаты", ТипВыплаты);
			Запрос.УстановитьПараметр("СписокПолучателей", СписокПенсионеров.ВыгрузитьКолонку("Участник"));
			Запрос.УстановитьПараметр("СписокСчетов", СписокПенсионеров.ВыгрузитьКолонку("НомерСчета"));
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			
			//ТЗОстатков = Запрос.Выполнить().Выгрузить();
			Результат = Запрос.Выполнить();
			ВыборкаПС = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			//Для каждого стр из СписокПенсионеров Цикл
			Пока ВыборкаПС.Следующий() Цикл
				//НаборСтрок = ТЗОстатков.НайтиСтроки(Новый Структура("НомерСчета,Участник,ДокументРегистрации",стр.НомерСчета,стр.Участник,стр.ДокументРегистрации));
				//Если НаборСтрок.Количество()>0 Тогда
				//СтрокаНабора = НаборСтрок[0];
				Если ВыборкаПС.СуммаОстаток>=ВыборкаПС.Сумма Тогда 
					СуммаКСписанию = ВыборкаПС.Сумма;
					Выборка = ВыборкаПС.Выбрать();
					Пока Выборка.Следующий() Цикл
						ТекУчастник = Выборка.Участник;
						ТекСхема = Выборка.Схема;
						//списываем из начисленного 
						СуммаСписываем = Мин(Выборка.СуммаОстаток, СуммаКСписанию);
						Движение = ТабНачислений.Добавить();
						Движение.Активность = Истина;
						Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
						//Движение = Движения.уп_ПрочиеНачисления.ДобавитьРасход();
						Движение.Период = Дата;
						Движение.Организация = Организация;
						Движение.Участник = Выборка.Участник;
						Движение.НомерСчета = Выборка.НомерСчета;
						Движение.ТипВыплаты = ТипВыплаты; 
						Движение.ТипРезерва = Выборка.ТипРезерва;
						Движение.ТипСуммы = Выборка.ТипСуммы;
						Движение.ДокументРегистрации = Выборка.ДокументРегистрации;
						Движение.Сумма = СуммаСписываем;
						Движение.Схема = Выборка.Схема;
						
						СуммаКСписанию = СуммаКСписанию-СуммаСписываем;
						Если СуммаКСписанию = 0 Тогда  
							Прервать;
						КонецЕсли;	
					КонецЦикла;
					
					//записываем в выплаченное
					Движение = ТабВыплат.Добавить();
					Движение.Активность = Истина;
					//Движение = Движения.уп_Выплаты.Добавить();
					Движение.Период = Дата;
					Движение.Организация = Организация;
					Движение.Участник = ТекУчастник;
					Движение.НомерСчета = ВыборкаПС.НомерСчета;
					Движение.ТипВыплаты = ТипВыплаты;
					Движение.Схема      = ТекСхема;
					Движение.Сумма = ВыборкаПС.Сумма;
					Если РКОВСумме Тогда
						Движение.РКО = ВыборкаПС.РКО;
						Движение.Выплата = ВыборкаПС.Сумма - ВыборкаПС.РКО;
					Иначе
						Движение.Выплата = ВыборкаПС.Сумма;
					КонецЕсли;
					
					ПризнакДт = Ложь;
					Если НЕ ПроводкиПоНачислению Тогда
						ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.ВозвратВзносовНПО, Выборка.НомерСчета.Владелец.Вкладчик, Выборка.НомерСчета.Владелец.ДоговорКонтрагента, 
						ТекСхема, ПризнакДт, Получатель, Выборка.НомерСчета.Владелец.ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Выборка.Сумма);
					КонецЕсли;
					//еще РКО
					Если РКОВСумме Тогда
						ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.РКО, Выборка.НомерСчета.Владелец.Вкладчик, Выборка.НомерСчета.Владелец.ДоговорКонтрагента, 
						Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получатель, Получатель.ОсновнойДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Выборка.РКО);
					КонецЕсли;	
					
				Иначе
					Отказ = Истина;
					//уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По документу регистрации "+Выборка.ДокументРегистрации+" по ПС "+ВыборкаПС.НомерСчета+" на счете "+ВыборкаПС.СуммаОстаток,,Заголовок);
					уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("По ПС "+ВыборкаПС.НомерСчета+" на счете "+ВыборкаПС.СуммаОстаток,,Заголовок);
				КонецЕсли;	
				//Иначе
				//	Отказ = истина;
				//	//ТекстСообщения = ТекстСообщения+
				//	//"|У Вкладчика "+стр.Участник+" отсутствуют деньги по документу регистрации "+стр.ДокументРегистрации;
				//	уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У Вкладчика "+стр.Участник+" отсутствуют деньги по документу регистрации "+стр.ДокументРегистрации,,Заголовок);
				//КонецЕсли;
			КонецЦикла;
			Если НЕ Отказ Тогда
				Движения.уп_ПрочиеНачисления.Загрузить(ТабНачислений);
				Движения.уп_Выплаты.Загрузить(ТабВыплат);
			КонецЕсли;
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам
			или ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_НПО
			или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатРасторженцамНПО
			или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатНаследникамНПО
			ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиНПО
			ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежРасторжениеНПО			
			или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам Тогда //(расторженцы и наследники)
			
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам 
				или ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_НПО
				ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежРасторжениеНПО
				или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатРасторженцамНПО Тогда
				ВидДвиженияНачисления = Перечисления.уп_ВидыДвижений.ЗакрытиеСчетаНПОРасторжение;
				ВидДвижения = Перечисления.уп_ВидыДвижений.НДФЛРасторженцев;
			Иначе
				ВидДвиженияНачисления = Перечисления.уп_ВидыДвижений.ЗакрытиеСчетаНПОСмерть;
				ВидДвижения = Перечисления.уп_ВидыДвижений.НДФЛНаследников;
			КонецЕсли;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам 
				или ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_НПО
				или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам  Тогда
				ТабНачислений    = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ПрочиеНачисления");
				ТабОтвергнутых    = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ОтвергнутыеПлатежиПрочиеНачисленияНПО");
				ТабТрансляции     = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ПрочиеНачисления");
			ИначеЕсли	ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиНПО
				ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежРасторжениеНПО	Тогда
				ТабНачислений    = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ОтвергнутыеПлатежиПрочиеНачисленияНПО");
				ТабТрансляции     = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ОтвергнутыеПлатежиПрочиеНачисленияНПО");
			Иначе
				ТабНачислений     = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ВозвратыПрочихНачисленийНПО");
				ТабОтвергнутых    = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_ОтвергнутыеПлатежиПрочиеНачисленияНПО");
			КонецЕсли;
			
			ТабНДФЛУчастников = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_НДФЛУчастниковРасчетыСБюджетом");
			ТабНДФЛ           = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("РасчетыНалогоплательщиковСБюджетомПоНДФЛ");
			ТабНДФЛ_НА        = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("РасчетыНалоговыхАгентовСБюджетомПоНДФЛ");
			ТабВыплат         = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_Выплаты");
			ТабПоступлений    = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_Поступления");
			ТабРезервы        = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_Резервы");
			ТабСостоянийПС    = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструСведений("уп_СостоянияПС");
			ТабСостоянийДоговоров = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструСведений("уп_СостоянияДоговора");
			
			СписокСчетовПенсионеров = СписокПенсионеров.ВыгрузитьКолонку("НомерСчета");
			СписокУчастников = СписокПенсионеров.ВыгрузитьКолонку("Участник");
			
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам 
				или ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_НПО
				или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам  Тогда
				
				//запрос по остаткам
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчета КАК НомерСчета,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.ПенсионныйДоговор КАК ПенсионныйДоговор,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.Схема КАК Схема,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.Участник КАК Участник,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.Сумма КАК Сумма,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.НДФЛ КАК НДФЛ,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчетаПриемника КАК НомерСчетаПриемника,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.РКО КАК РКО,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.ПенсионныйДоговор.ДоговорКонтрагента КАК ДоговорВкладчика,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.ПенсионныйДоговор.Вкладчик КАК Вкладчик,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета, 0) = 0
				|			ТОГДА 0
				|		ИНАЧЕ 1
				|	КОНЕЦ КАК Невыплата
				|ПОМЕСТИТЬ СписокПС
				|ИЗ
				|	Документ.уп_ВыплатныеРеестры.СписокПенсионеров КАК уп_ВыплатныеРеестрыСписокПенсионеров
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ВыплатныеРеестры.НеисполненныеВыплаты КАК уп_ВыплатныеРеестрыНеисполненныеВыплаты
				|		ПО уп_ВыплатныеРеестрыСписокПенсионеров.Ссылка = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Ссылка
				|			И уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчета = уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета
				|			И уп_ВыплатныеРеестрыСписокПенсионеров.Участник = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Участник
				|ГДЕ
				|	уп_ВыплатныеРеестрыСписокПенсионеров.Ссылка = &Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	уп_СхемаСчетаСрезПоследних.НомерСчета КАК НомерСчета,
				|	уп_СхемаСчетаСрезПоследних.Схема КАК Схема
				|ПОМЕСТИТЬ СхемыПравопреемников
				|ИЗ
				|	РегистрСведений.уп_СхемаСчета.СрезПоследних(
				|			&ДатаДок1,
				|			НомерСчета В
				|				(ВЫБРАТЬ
				|					СписокПС.НомерСчетаПриемника
				|				ИЗ
				|					СписокПС)) КАК уп_СхемаСчетаСрезПоследних
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	уп_СостоянияПССрезПоследних.НомерСчета КАК НомерСчета,
				|	уп_СостоянияПССрезПоследних.Состояние КАК Состояние
				|ПОМЕСТИТЬ СостоянияПСПравопреемников
				|ИЗ
				|	РегистрСведений.уп_СостоянияПС.СрезПоследних(
				|			&ДатаДок1,
				|			НомерСчета В
				|				(ВЫБРАТЬ
				|					СписокПС.НомерСчетаПриемника
				|				ИЗ
				|					СписокПС)) КАК уп_СостоянияПССрезПоследних
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	уп_СостоянияДоговораСрезПоследних.ПенсионныйДоговор КАК ПенсионныйДоговор,
				|	уп_СостоянияДоговораСрезПоследних.Состояние КАК Состояние
				|ПОМЕСТИТЬ СостоянияДоговоровПравопреемников
				|ИЗ
				|	РегистрСведений.уп_СостоянияДоговора.СрезПоследних(
				|			&ДатаДок1,
				|			ПенсионныйДоговор В
				|				(ВЫБРАТЬ
				|					СписокПС.НомерСчетаПриемника.Владелец
				|				ИЗ
				|					СписокПС)) КАК уп_СостоянияДоговораСрезПоследних
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СостоянияПСПравопреемников.НомерСчета КАК НомерСчетаПП,
				|	СостоянияПСПравопреемников.Состояние КАК СостояниеПС,
				|	СхемыПравопреемников.Схема КАК СхемаПП,
				|	СостоянияДоговоровПравопреемников.Состояние КАК СостояниеДоговора
				|ПОМЕСТИТЬ СводнаяПравопреемники
				|ИЗ
				|	СостоянияПСПравопреемников КАК СостоянияПСПравопреемников
				|		ЛЕВОЕ СОЕДИНЕНИЕ СхемыПравопреемников КАК СхемыПравопреемников
				|		ПО СостоянияПСПравопреемников.НомерСчета = СхемыПравопреемников.НомерСчета
				|		ЛЕВОЕ СОЕДИНЕНИЕ СостоянияДоговоровПравопреемников КАК СостоянияДоговоровПравопреемников
				|		ПО СостоянияПСПравопреемников.НомерСчета.Владелец = СостоянияДоговоровПравопреемников.ПенсионныйДоговор
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СписокПС.Участник КАК Участник,
				|	ПрочиеНачисленияОстатки.ДокументРегистрации КАК ДокументРегистрации,
				|	ЕСТЬNULL(ПрочиеНачисленияОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
				|	ЕСТЬNULL(ПрочиеНачисленияОстатки.НалоговаяБазаПоНДФЛОстаток, 0) КАК НалоговаяБазаПоНДФЛОстаток,
				|	ПрочиеНачисленияОстатки.ТипРезерва КАК ТипРезерва,
				|	ПрочиеНачисленияОстатки.ТипСуммы КАК ТипСуммы,
				|	СписокПС.НомерСчета КАК НомерСчета,
				|	СписокПС.ПенсионныйДоговор КАК ПенсионныйДоговор,
				|	СписокПС.ДоговорВкладчика КАК ДоговорВкладчика,
				|	СписокПС.Вкладчик КАК Вкладчик,
				|	СписокПС.Схема КАК Схема,
				|	СписокПС.Сумма КАК Сумма,
				|	СписокПС.НДФЛ КАК НДФЛ,
				|	СписокПС.НомерСчетаПриемника КАК НомерСчетаПриемника,
				|	СписокПС.РКО КАК РКО,
				|	СводнаяПравопреемники.СостояниеПС КАК СостояниеПС,
				|	СводнаяПравопреемники.СхемаПП КАК СхемаПП,
				|	СводнаяПравопреемники.СостояниеДоговора КАК СостояниеДоговора,
				|	СписокПС.Невыплата КАК Невыплата
				|ИЗ
				|	СписокПС КАК СписокПС
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_ПрочиеНачисления.Остатки(
				|				&ДатаДок,
				|				Организация = &Организация
				|					И ТипВыплаты = &ТипВыплаты
				|					И Участник В (&СписокУчастников)
				|					И НомерСчета В (&СписокСчетов)) КАК ПрочиеНачисленияОстатки
				|		ПО СписокПС.НомерСчета = ПрочиеНачисленияОстатки.НомерСчета
				|			И СписокПС.Участник = ПрочиеНачисленияОстатки.Участник
				|		ЛЕВОЕ СОЕДИНЕНИЕ СводнаяПравопреемники КАК СводнаяПравопреемники
				|		ПО СписокПС.НомерСчетаПриемника = СводнаяПравопреемники.НомерСчетаПП
				|ИТОГИ
				|	СУММА(СуммаОстаток),
				|	СУММА(НалоговаяБазаПоНДФЛОстаток),
				|	МАКСИМУМ(Сумма),
				|	МАКСИМУМ(НДФЛ),
				|	МАКСИМУМ(РКО),
				|	СУММА(Невыплата)
				|ПО
				|	Участник,
				|	НомерСчета";
				
				Запрос.УстановитьПараметр("Организация", Организация);
				Запрос.УстановитьПараметр("ДатаДок1", КонецДня(Дата));
				Запрос.УстановитьПараметр("ДатаДок", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
				Запрос.УстановитьПараметр("ТипВыплаты", ТипВыплаты);
				Запрос.УстановитьПараметр("СписокУчастников", СписокУчастников);
				Запрос.УстановитьПараметр("СписокСчетов", СписокСчетовПенсионеров);
				Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
				
				Результат = Запрос.Выполнить();
				ВыборкаУч = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаУч.Следующий() Цикл
					Если ВыборкаУч.Невыплата = 0 или ФормироватьОтвергнутыеПлатежи  Тогда
						ВыборкаСчетов = ВыборкаУч.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаСчетов.Следующий() Цикл
							Если НЕ ЗначениеЗаполнено(Получатель) Тогда //через кассу
								Получ = ВыборкаСчетов.НомерСчета.Участник;
								ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
							Иначе
								Если Реестр Тогда 
									Получ = ВыборкаСчетов.НомерСчета.Участник;
									ДоговорКонтрагента = ВыборкаСчетов.НомерСчета.Владелец.ДоговорКонтрагента;
								Иначе
									Получ = Получатель;
									ДоговорКонтрагента = Получатель.ОсновнойДоговорКонтрагента;
								КонецЕсли;
							Конецесли;
							Если ВыборкаСчетов.Сумма<=ВыборкаСчетов.СуммаОстаток Тогда
								Выборка = ВыборкаСчетов.Выбрать();
								//Если НаборСтрок.Количество()>0 Тогда
								НадоСписать = ВыборкаСчетов.Сумма;
								НадоСписатьНДФЛ = ВыборкаСчетов.НДФЛ;
								НадоСписатьНБ = ВыборкаСчетов.НалоговаяБазаПоНДФЛОстаток;
								
								//Для каждого строкаНабора из НаборСтрок Цикл
								Пока Выборка.Следующий() Цикл	
									СуммаКСписанию = Мин(НадоСписать,Выборка.СуммаОстаток);
									
									Движение = ТабНачислений.Добавить();
									Движение.Активность = Истина;
									Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
									//Движение = Движения.уп_ПрочиеНачисления.ДобавитьРасход();
									Движение.Период = Дата;
									Движение.Организация = Организация;
									Движение.НомерСчета = Выборка.НомерСчета;
									Движение.Участник = Выборка.Участник;
									Движение.ТипВыплаты = ТипВыплаты;
									Движение.ДокументРегистрации = Выборка.ДокументРегистрации;
									Движение.Схема  = Выборка.Схема;
									Движение.Сумма = СуммаКСписанию;
									Движение.НалоговаяБазаПоНДФЛ = Выборка.НалоговаяБазаПоНДФЛОстаток;
									Движение.ТипРезерва = Выборка.ТипРезерва;
									Движение.ТипСуммы = Выборка.ТипСуммы;
									
									Если ВыборкаСчетов.Невыплата = 0 Тогда
										СтрокаТабТрансляции = ТабТрансляции.Добавить();
										ЗаполнитьЗначенияСвойств(СтрокаТабТрансляции,Движение);
									КонецЕсли;	
									
									Если ВыборкаСчетов.Невыплата > 0 и ФормироватьОтвергнутыеПлатежи Тогда
										Если Выборка.НалоговаяБазаПоНДФЛОстаток>0 Тогда
											Если Выборка.НалоговаяБазаПоНДФЛОстаток>0 И Выборка.НалоговаяБазаПоНДФЛОстаток = НадоСписатьНБ Тогда
												СписываемНДФЛ = НадоСписатьНДФЛ;
											ИначеЕсли Выборка.НалоговаяБазаПоНДФЛОстаток>0 Тогда
												СписываемНДФЛ = Окр(Выборка.НалоговаяБазаПоНДФЛОстаток*НадоСписатьНДФЛ/НадоСписатьНБ,2);
											ИначеЕсли НадосписатьНБ = 0 Тогда
												СписываемНДФЛ = НадоСписатьНДФЛ;
											КонецЕсли;	
										Иначе
											СписываемНДФЛ = НадоСписатьНДФЛ;
										КонецЕсли;	
										//формируем регистр отвергнутых платежей
										//то же, что и в начислениях, но еще НДФЛ
										Движение = ТабОтвергнутых.Добавить();
										Движение.Активность = Истина;
										Движение.Период = Дата;
										Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
										Движение.Организация = Организация;
										Движение.НомерСчета = Выборка.НомерСчета;
										Движение.Участник = Выборка.Участник;
										Движение.ТипВыплаты = ТипВыплаты;
										Движение.Регистратор = Ссылка;
										
										Движение.ТипРезерва = Выборка.ТипРезерва;
										Движение.ТипСуммы = Выборка.ТипСуммы;
										
										Движение.Сумма = СуммаКСписанию-СписываемНДФЛ;  
										Движение.НалоговаяБазаПоНДФЛ = Выборка.НалоговаяБазаПоНДФЛОстаток;
										Если НДФЛУдержанВБюджет Тогда
											Движение.НДФЛ = 0;
										Иначе
											Движение.НДФЛ = СписываемНДФЛ; //это, если НДФЛ не перечисляем
										КонецЕсли;
										Движение.Схема        = Выборка.Схема;
										Движение.ДокументВыплаты = Ссылка;
										Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.Возврат;
										
										НадоСписатьНДФЛ = НадоСписатьНДФЛ-СписываемНДФЛ;
										НадоСписатьНБ = НадоСписатьНБ-Выборка.НалоговаяБазаПоНДФЛОстаток;
									КонецЕсли;
									
									НадоСписать = НадоСписать-СуммаКСписанию;
									Если НадоСписать = 0  и ВыборкаУч.Невыплата = 0 Тогда
										Движение = ТабВыплат.Добавить();
										Движение.Активность = Истина;
										//Движение = Движения.уп_Выплаты.Добавить();
										Движение.Период = Дата;
										Движение.Организация = Организация;
										Движение.Участник = Выборка.Участник;
										Движение.НомерСчета = Выборка.НомерСчета;
										Движение.ТипВыплаты = ТипВыплаты;
										Движение.Схема = Выборка.Схема;
										Движение.Сумма = ВыборкаСчетов.Сумма;
										Движение.НДФЛ = ВыборкаСчетов.НДФЛ;
										Если РКОВСумме Тогда
											ТекСуммаВыплаты = ВыборкаСчетов.Сумма-ВыборкаСчетов.НДФЛ-ВыборкаСчетов.РКО;
											Движение.РКО = ВыборкаСчетов.РКО;
										Иначе
											ТекСуммаВыплаты = ВыборкаСчетов.Сумма-ВыборкаСчетов.НДФЛ;
										КонецЕсли;	
										Движение.Выплата = ТекСуммаВыплаты;
										
										//Если ТекСхема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
										//	ПризнакДт = Истина;
										//Иначе
										ПризнакДт = Ложь;
										//КонецЕсли;
										Если НЕ ПроводкиПоНачислению Тогда
											ДвиженияПоБухУчету(Дата, ВидДвиженияНачисления, Выборка.Вкладчик, Выборка.ДоговорВкладчика, 
											Выборка.Схема, ПризнакДт, Получ, ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ВыборкаСчетов.Сумма);
										КонецЕсли;
										//еще РКО
										Если РКОВСумме Тогда
											ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.РКО, Получ, ДоговорКонтрагента, 
											Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получ, ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ВыборкаСчетов.РКО);
										КонецЕсли;
										
										//перевод средств на ИПС
										Если  ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам и ПереводСредств Тогда
											
											ТекСхемаПриемник = Выборка.СхемаПП;
											//регистр поступлений
											Движение = ТабПоступлений.Добавить();
											Движение.Активность = Истина;
											//Движение = Движения.уп_Поступления.Добавить();
											Движение.Период = Дата;
											Движение.Организация = Организация;
											Движение.НомерСчета = Выборка.НомерСчетаПриемника;
											Движение.ТипРезерва = Перечисления.уп_ТипыРезерва.ИПС;
											Движение.ТипСуммы = Справочники.уп_ТипыСумм.ВзносыФиз;
											Движение.Плательщик = Выборка.Участник;
											Движение.ГодПоступления = НачалоГода(Дата);
											Движение.Сумма = ВыборкаСчетов.Сумма-ВыборкаСчетов.НДФЛ;
											Движение.Схема = ТекСхемаПриемник;
											Движение.ПенсионнаяСхема = ТекСхемаПриемник;
											
											ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.ВзносПравопреемника, Получ, ДоговорКонтрагента, 
											Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Выборка.НомерСчетаПриемника.Владелец.Вкладчик, Выборка.НомерСчетаПриемника.Владелец.ДоговорКонтрагента, ТекСхемаПриемник, Ложь, ВыборкаСчетов.Сумма-ВыборкаСчетов.НДФЛ);
											
											//регистр резервов
											Движение = ТабРезервы.Добавить();
											Движение.Активность = Истина;
											Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
											//Движение = Движения.уп_Резервы.ДобавитьПриход();
											Движение.Период = Дата;
											Движение.Организация = Организация;
											Движение.НомерСчета = Выборка.НомерСчетаПриемника;
											Движение.ТипРезерва = Перечисления.уп_ТипыРезерва.ИПС;
											Движение.ТипСуммы = Справочники.уп_ТипыСумм.ВзносыФиз;
											Движение.Сумма = ВыборкаСчетов.Сумма-ВыборкаСчетов.НДФЛ;
											Движение.Движение = Перечисления.уп_ВидыДвижений.ВзносНПО;
											Движение.Схема  = ТекСхемаПриемник;
											
											ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.ВзносНПО, Выборка.НомерСчетаПриемника.Владелец.Вкладчик, Выборка.НомерСчетаПриемника.Владелец.ДоговорКонтрагента, 
											ТекСхемаПриемник, Ложь, Выборка.НомерСчетаПриемника.Владелец.Вкладчик, Выборка.НомерСчетаПриемника.Владелец.ДоговорКонтрагента, ТекСхемаПриемник, Ложь, ВыборкаСчетов.Сумма-ВыборкаСчетов.НДФЛ);
											
											//состояние счета
											//ТекСостояние = РегистрыСведений.уп_СостоянияПС.ПолучитьПоследнее(Дата, Новый Структура("НомерСчета", стр.НомерСчетаПриемника)).Состояние;
											ТекСостояние = Выборка.СостояниеПС;
											Если ТекСостояние = Перечисления.уп_СостоянияПС.ОжиданиеВзносов Тогда
												Движение = ТабСостоянийПС.Добавить();
												Движение.Активность = Истина;
												//Движение = Движения.уп_СостоянияПС.Добавить();
												Движение.Период = Дата;
												Движение.НомерСчета = Выборка.НомерСчетаПриемника;
												Движение.Состояние = Перечисления.уп_СостоянияПС.НакопительныйПериод;
											КонецЕсли;
											//состояние договора
											//ТекСостояниеД = РегистрыСведений.уп_СостоянияДоговора.ПолучитьПоследнее(Дата, Новый Структура("ПенсионныйДоговор", стр.НомерСчетаПриемника.Владелец)).Состояние;
											ТекСостояниеД = Выборка.СостояниеДоговора;
											Если ТекСостояниеД = Перечисления.уп_СостоянияДоговора.Открыт Тогда
												Движение = ТабСостоянийДоговоров.Добавить();
												Движение.Активность = Истина;
												//Движение = Движения.уп_СостоянияДоговора.Добавить();
												Движение.Период = Дата;
												Движение.ПенсионныйДоговор = Выборка.НомерСчетаПриемника.Владелец;
												Движение.Состояние = Перечисления.уп_СостоянияДоговора.Действует;
											КонецЕсли;
										КонецЕсли;
										
										Прервать;
									КонецЕсли;	
								КонецЦикла;
								Если НадоСписать>0 Тогда
									Отказ = Истина;
									//ТекстСообщения = ТекстСообщения+
									//"|У Участника "+стр.Участник+" начисленная сумма составляет "+(стр.Сумма-НадоСписать);
									уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У Участника "+Выборка.Участник+" начисленная сумма составляет "+(ВыборкаСчетов.Сумма-НадоСписать),,Заголовок);
								КонецЕсли;
							Иначе
								Отказ = истина;
								//ТекстСообщения = ТекстСообщения+
								//"|У Участника "+стр.Участник+" нет начисленных средств.";
								уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У Участника "+ВыборкаСчетов.Участник+" не хватает начисленных средств.",,Заголовок);
							КонецЕсли;
							
							//еще бух. проводка по НДФЛ
							Если НЕ ЗначениеЗаполнено(Получатель) Тогда //через кассу
								Получ = ВыборкаСчетов.НомерСчета.Участник;
								ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
							Иначе
								Если Реестр Тогда 
									Получ = ВыборкаСчетов.НомерСчета.Участник;
									ДоговорКонтрагента = ВыборкаСчетов.НомерСчета.Владелец.ДоговорКонтрагента;
								Иначе
									Получ = Получатель;
									ДоговорКонтрагента = Получатель.ОсновнойДоговорКонтрагента;
								КонецЕсли; 
							КонецЕсли;
							Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам
								или ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_НПО
								или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам Тогда
								Если НЕ ПроводкиПоНачислению Тогда
									ДвиженияПоБухУчету(Дата, ВидДВижения, Получ, ДоговорКонтрагента, 
									Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Справочники.Контрагенты.ПустаяСсылка(), Справочники.ДоговорыКонтрагентов.ПустаяСсылка(), Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ВыборкаСчетов.НДФЛ);
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиНПО
				ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежРасторжениеНПО	Тогда
				//запрос по остаткам
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчета КАК НомерСчета,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.ПенсионныйДоговор КАК ПенсионныйДоговор,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.Схема КАК Схема,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.Участник КАК Участник,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.Сумма - уп_ВыплатныеРеестрыСписокПенсионеров.НДФЛ КАК Сумма,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.НДФЛ КАК НДФЛ,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.РКО КАК РКО,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.ПенсионныйДоговор.ДоговорКонтрагента КАК ДоговорВкладчика,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.ПенсионныйДоговор.Вкладчик КАК Вкладчик,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета, 0) = 0
				|			ТОГДА 0
				|		ИНАЧЕ 1
				|	КОНЕЦ КАК Невыплата,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.Выплата КАК Выплата
				|ПОМЕСТИТЬ СписокПС
				|ИЗ
				|	Документ.уп_ВыплатныеРеестры.СписокПенсионеров КАК уп_ВыплатныеРеестрыСписокПенсионеров
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ВыплатныеРеестры.НеисполненныеВыплаты КАК уп_ВыплатныеРеестрыНеисполненныеВыплаты
				|		ПО уп_ВыплатныеРеестрыСписокПенсионеров.Ссылка = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Ссылка
				|			И уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчета = уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета
				|			И уп_ВыплатныеРеестрыСписокПенсионеров.Участник = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Участник
				|ГДЕ
				|	уп_ВыплатныеРеестрыСписокПенсионеров.Ссылка = &Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СписокПС.Участник КАК Участник,
				|	ЕСТЬNULL(уп_ОтвергнутыеПлатежиПрочиеНачисленияНПООстатки.СуммаОстаток, 0) КАК СуммаОстаток,
				|	ЕСТЬNULL(уп_ОтвергнутыеПлатежиПрочиеНачисленияНПООстатки.НалоговаяБазаПоНДФЛОстаток, 0) КАК НалоговаяБазаПоНДФЛОстаток,
				|	уп_ОтвергнутыеПлатежиПрочиеНачисленияНПООстатки.ТипРезерва КАК ТипРезерва,
				|	уп_ОтвергнутыеПлатежиПрочиеНачисленияНПООстатки.ТипСуммы КАК ТипСуммы,
				|	СписокПС.НомерСчета КАК НомерСчета,
				|	СписокПС.ПенсионныйДоговор КАК ПенсионныйДоговор,
				|	СписокПС.ДоговорВкладчика КАК ДоговорВкладчика,
				|	СписокПС.Вкладчик КАК Вкладчик,
				|	СписокПС.Схема КАК Схема,
				|	СписокПС.Сумма КАК Сумма,
				|	СписокПС.НДФЛ КАК НДФЛ,
				|	СписокПС.РКО КАК РКО,
				|	СписокПС.Невыплата КАК Невыплата,
				|	ЕСТЬNULL(уп_ОтвергнутыеПлатежиПрочиеНачисленияНПООстатки.НДФЛОстаток, 0) КАК НДФЛОстаток,
				|	СписокПС.Выплата КАК Выплата
				|ИЗ
				|	СписокПС КАК СписокПС
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_ОтвергнутыеПлатежиПрочиеНачисленияНПО.Остатки(
				|				&ДатаДок,
				|				Организация = &Организация
				|					И ТипВыплаты = &ТипВыплаты
				|					И Участник В (&СписокУчастников)
				|					И НомерСчета В (&СписокСчетов)) КАК уп_ОтвергнутыеПлатежиПрочиеНачисленияНПООстатки
				|		ПО СписокПС.НомерСчета = уп_ОтвергнутыеПлатежиПрочиеНачисленияНПООстатки.НомерСчета
				|			И СписокПС.Участник = уп_ОтвергнутыеПлатежиПрочиеНачисленияНПООстатки.Участник
				|ИТОГИ
				|	СУММА(СуммаОстаток),
				|	СУММА(НалоговаяБазаПоНДФЛОстаток),
				|	МАКСИМУМ(Сумма),
				|	МАКСИМУМ(НДФЛ),
				|	МАКСИМУМ(РКО),
				|	СУММА(Невыплата),
				|	СУММА(НДФЛОстаток),
				|	МАКСИМУМ(Выплата)
				|ПО
				|	Участник,
				|	НомерСчета";
				
				Запрос.УстановитьПараметр("Организация", Организация);
				Запрос.УстановитьПараметр("ДатаДок", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
				Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежРасторжениеНПО Тогда
					Запрос.УстановитьПараметр("ТипВыплаты", Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам);
				Иначе
					Запрос.УстановитьПараметр("ТипВыплаты", Перечисления.уп_ТипыВыплат.ВыплатыНаследникам);
				КонецЕсли;	
				Запрос.УстановитьПараметр("СписокУчастников", СписокУчастников);
				Запрос.УстановитьПараметр("СписокСчетов", СписокСчетовПенсионеров);
				Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);				
				
				Результат = Запрос.Выполнить();
				ВыборкаУч = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаУч.Следующий() Цикл
					Если ВыборкаУч.Невыплата = 0 или ФормироватьОтвергнутыеПлатежи  Тогда
						ВыборкаСчетов = ВыборкаУч.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаСчетов.Следующий() Цикл
							Если НЕ ЗначениеЗаполнено(Получатель) Тогда //через кассу
								Получ = ВыборкаСчетов.НомерСчета.Участник;
								ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
							Иначе
								Если Реестр Тогда 
									Получ = ВыборкаСчетов.НомерСчета.Участник;
									ДоговорКонтрагента = ВыборкаСчетов.НомерСчета.Владелец.ДоговорКонтрагента;
								Иначе
									Получ = Получатель;
									ДоговорКонтрагента = Получатель.ОсновнойДоговорКонтрагента;
								КонецЕсли;
							КонецЕсли;
							Если ВыборкаСчетов.Сумма<=ВыборкаСчетов.СуммаОстаток Тогда
								Выборка = ВыборкаСчетов.Выбрать();
								//Если НаборСтрок.Количество()>0 Тогда
								НадоСписать = ВыборкаСчетов.Выплата;
								//Для каждого строкаНабора из НаборСтрок Цикл
								Пока Выборка.Следующий() Цикл	
									СуммаКСписанию = Мин(НадоСписать,Выборка.СуммаОстаток);
									
									Движение = ТабНачислений.Добавить();
									Движение.Активность = Истина;
									Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
									//Движение = Движения.уп_ПрочиеНачисления.ДобавитьРасход();
									Движение.Период = Дата;
									Движение.Организация = Организация;
									Движение.НомерСчета = Выборка.НомерСчета;
									Движение.Участник = Выборка.Участник;
									Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиНПО Тогда
										Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам;
									ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежРасторжениеНПО Тогда
										Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам;
									КонецЕсли;
									Движение.Схема  = Выборка.Схема;
									Движение.Сумма = СуммаКСписанию;
									Движение.НалоговаяБазаПоНДФЛ = Выборка.НалоговаяБазаПоНДФЛОстаток;
									Движение.НДФЛ = Выборка.НДФЛОстаток;
									Движение.ТипРезерва = Выборка.ТипРезерва;
									Движение.ТипСуммы = Выборка.ТипСуммы;
									Движение.ДокументВыплаты = Ссылка;
									Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.Выплата;
									
									Если Выборка.Невыплата = 0 Тогда
										СтрокаТабТрансляции = ТабТрансляции.Добавить();
										ЗаполнитьЗначенияСвойств(СтрокаТабТрансляции,Движение);
										СтрокаТабТрансляции.Сумма = СуммаКСписанию+Выборка.НДФЛОстаток;
									КонецЕсли;	
									
									Если Выборка.Невыплата > 0 и ФормироватьОтвергнутыеПлатежи Тогда
										//Если Выборка.НалоговаяБазаПоНДФЛОстаток>0 Тогда
										//	Если ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток>0 И ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток = НадоСписатьНБ Тогда
										//		СписываемНДФЛ = НадоСписатьНДФЛ;
										//	ИначеЕсли Выборка.НалоговаяБазаПоНДФЛОстаток>0 Тогда
										//		СписываемНДФЛ = Окр(ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток*НадоСписатьНДФЛ/Выборка.НалоговаяБазаПоНДФЛОстаток,2);
										//	ИначеЕсли НадосписатьНБ = 0 Тогда
										//		СписываемНДФЛ = НадоСписатьНДФЛ;
										//	КонецЕсли;	
										//Иначе
										//	СписываемНДФЛ = НадоСписатьНДФЛ;
										//КонецЕсли;	
										//формируем регистр отвергнутых платежей
										//то же, что и в начислениях, но еще НДФЛ
										Движение = ТабНачислений.Добавить();
										Движение.Активность = Истина;
										Движение.Период = Дата;
										Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
										Движение.Организация = Организация;
										Движение.НомерСчета = Выборка.НомерСчета;
										Движение.Участник = Выборка.Участник;
										Движение.ТипВыплаты = ТипВыплаты;
										Движение.Регистратор = Ссылка;
										
										Движение.ТипРезерва = Выборка.ТипРезерва;
										Движение.ТипСуммы = Выборка.ТипСуммы;
										
										Движение.Сумма = СуммаКСписанию;  
										Движение.НалоговаяБазаПоНДФЛ = Выборка.НалоговаяБазаПоНДФЛОстаток;
										Если НДФЛУдержанВБюджет Тогда
											Движение.НДФЛ = 0;
										Иначе
											Движение.НДФЛ = Выборка.НДФЛОстаток;
										КонецЕсли;
										Движение.Схема        = Выборка.Схема;
										Движение.ДокументВыплаты = Ссылка;
										Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.Возврат;
										
										//НадоСписатьНДФЛ = НадоСписатьНДФЛ-СписываемНДФЛ;
										//НадоСписатьНБ = НадоСписатьНБ-ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток;
									КонецЕсли;									
									
									НадоСписать = НадоСписать-СуммаКСписанию;
									Если НадоСписать = 0  и ВыборкаУч.Невыплата = 0 Тогда
										Движение = ТабВыплат.Добавить();
										Движение.Активность = Истина;
										//Движение = Движения.уп_Выплаты.Добавить();
										Движение.Период = Дата;
										Движение.Организация = Организация;
										Движение.Участник = Выборка.Участник;
										Движение.НомерСчета = Выборка.НомерСчета;
										Движение.ТипВыплаты = ТипВыплаты;
										Движение.Схема = Выборка.Схема;
										Движение.Сумма = ВыборкаСчетов.Сумма+ВыборкаСчетов.НДФЛ;
										Движение.НДФЛ = ВыборкаСчетов.НДФЛ;
										Если РКОВСумме Тогда
											ТекСуммаВыплаты = ВыборкаСчетов.Сумма-ВыборкаСчетов.РКО;
											Движение.РКО = ВыборкаСчетов.РКО;
										Иначе
											ТекСуммаВыплаты = ВыборкаСчетов.Сумма;
										КонецЕсли;	
										Движение.Выплата = ТекСуммаВыплаты;
										
										//Если ТекСхема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
										//	ПризнакДт = Истина;
										//Иначе
										ПризнакДт = Ложь;
										//КонецЕсли;
										Если НЕ ПроводкиПоНачислению Тогда
											ДвиженияПоБухУчету(Дата, ВидДвиженияНачисления, Выборка.Вкладчик, Выборка.ДоговорВкладчика, 
											Выборка.Схема, ПризнакДт, Получ, ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ВыборкаСчетов.Сумма);
										КонецЕсли;
										//еще РКО
										Если РКОВСумме Тогда
											ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.РКО, Получ, ДоговорКонтрагента, 
											Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получ, ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ВыборкаСчетов.РКО);
										КонецЕсли;
										
										Прервать;
									КонецЕсли;	
								КонецЦикла;
								Если НадоСписать>0 Тогда
									Отказ = Истина;
									//ТекстСообщения = ТекстСообщения+
									//"|У Участника "+стр.Участник+" начисленная сумма составляет "+(стр.Сумма-НадоСписать);
									уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У Участника "+Выборка.Участник+" начисленная сумма составляет "+(ВыборкаСчетов.Сумма-НадоСписать),,Заголовок);
								КонецЕсли;
							Иначе
								Отказ = истина;
								//ТекстСообщения = ТекстСообщения+
								//"|У Участника "+стр.Участник+" нет начисленных средств.";
								уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У Участника "+ВыборкаСчетов.Участник+" не хватает начисленных средств.",,Заголовок);
							КонецЕсли;
							
							//еще бух. проводка по НДФЛ
							Если НЕ ЗначениеЗаполнено(Получатель) Тогда //через кассу
								Получ = ВыборкаСчетов.НомерСчета.Участник;
								ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
							Иначе
								Получ = Получатель;
								ДоговорКонтрагента = Получатель.ОсновнойДоговорКонтрагента;
							КонецЕсли;
							Если НЕ ПроводкиПоНачислению Тогда
								ДвиженияПоБухУчету(Дата, ВидДВижения, Получ, ДоговорКонтрагента, 
								Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Справочники.Контрагенты.ПустаяСсылка(), Справочники.ДоговорыКонтрагентов.ПустаяСсылка(), Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ВыборкаСчетов.НДФЛ);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				
			ИначеЕсли  ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатНаследникамНПО
				или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатРасторженцамНПО Тогда
				//запрос по остаткам
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчета КАК НомерСчета,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.ПенсионныйДоговор КАК ПенсионныйДоговор,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.Схема КАК Схема,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.Участник КАК Участник,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.Сумма КАК Сумма,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.НДФЛ КАК НДФЛ,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчетаПриемника КАК НомерСчетаПриемника,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.РКО КАК РКО,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.ПенсионныйДоговор.ДоговорКонтрагента КАК ДоговорВкладчика,
				|	уп_ВыплатныеРеестрыСписокПенсионеров.ПенсионныйДоговор.Вкладчик КАК Вкладчик,
				|	ВЫБОР
				|		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета, 0) = 0
				|			ТОГДА 0
				|		ИНАЧЕ 1
				|	КОНЕЦ КАК Невыплата
				|ПОМЕСТИТЬ СписокПС
				|ИЗ
				|	Документ.уп_ВыплатныеРеестры.СписокПенсионеров КАК уп_ВыплатныеРеестрыСписокПенсионеров
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ВыплатныеРеестры.НеисполненныеВыплаты КАК уп_ВыплатныеРеестрыНеисполненныеВыплаты
				|		ПО уп_ВыплатныеРеестрыСписокПенсионеров.Ссылка = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Ссылка
				|			И уп_ВыплатныеРеестрыСписокПенсионеров.НомерСчета = уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСтроки
				|			И уп_ВыплатныеРеестрыСписокПенсионеров.Участник = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Участник
				|ГДЕ
				|	уп_ВыплатныеРеестрыСписокПенсионеров.Ссылка = &Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СписокПС.Участник КАК Участник,
				|	ЕСТЬNULL(уп_ВозвратыПрочихНачисленийНПООстатки.СуммаОстаток, 0) КАК СуммаОстаток,
				|	ЕСТЬNULL(уп_ВозвратыПрочихНачисленийНПООстатки.НалоговаяБазаПоНДФЛОстаток, 0) КАК НалоговаяБазаПоНДФЛОстаток,
				|	уп_ВозвратыПрочихНачисленийНПООстатки.ТипРезерва КАК ТипРезерва,
				|	уп_ВозвратыПрочихНачисленийНПООстатки.ТипСуммы КАК ТипСуммы,
				|	СписокПС.НомерСчета КАК НомерСчета,
				|	СписокПС.ПенсионныйДоговор КАК ПенсионныйДоговор,
				|	СписокПС.ДоговорВкладчика КАК ДоговорВкладчика,
				|	СписокПС.Вкладчик КАК Вкладчик,
				|	СписокПС.Схема КАК Схема,
				|	СписокПС.Сумма КАК Сумма,
				|	СписокПС.НДФЛ КАК НДФЛ,
				|	СписокПС.НомерСчетаПриемника КАК НомерСчетаПриемника,
				|	СписокПС.РКО КАК РКО,
				|	СписокПС.Невыплата КАК Невыплата
				|ИЗ
				|	СписокПС КАК СписокПС
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_ВозвратыПрочихНачисленийНПО.Остатки(
				|				&ДатаДок,
				|				Организация = &Организация
				|					И ТипВыплаты = &ТипВыплаты
				|					И Участник В (&СписокУчастников)
				|					И НомерСчета В (&СписокСчетов)) КАК уп_ВозвратыПрочихНачисленийНПООстатки
				|		ПО СписокПС.НомерСчета = уп_ВозвратыПрочихНачисленийНПООстатки.НомерСчета
				|			И СписокПС.Участник = уп_ВозвратыПрочихНачисленийНПООстатки.Участник
				|ИТОГИ
				|	СУММА(СуммаОстаток),
				|	МАКСИМУМ(Сумма),
				|	МАКСИМУМ(НДФЛ),
				|	МАКСИМУМ(РКО),
				|	СУММА(Невыплата)
				|ПО
				|	Участник,
				|	НомерСчета";
				
				Запрос.УстановитьПараметр("Организация", Организация);
				Запрос.УстановитьПараметр("ДатаДок", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
				Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатРасторженцамНПО Тогда 
					Запрос.УстановитьПараметр("ТипВыплаты", Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам);
				Иначе
					Запрос.УстановитьПараметр("ТипВыплаты", Перечисления.уп_ТипыВыплат.ВыплатыНаследникам);
				КонецЕсли;	
				Запрос.УстановитьПараметр("СписокУчастников", СписокУчастников);
				Запрос.УстановитьПараметр("СписокСчетов", СписокСчетовПенсионеров);
				Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);				
				
				Результат = Запрос.Выполнить();
				ВыборкаУч = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаУч.Следующий() Цикл
					Если ВыборкаУч.Невыплата = 0 или ФормироватьОтвергнутыеПлатежи Тогда
						ВыборкаСчетов = ВыборкаУч.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаСчетов.Следующий() Цикл
							Если НЕ ЗначениеЗаполнено(Получатель) Тогда //через кассу
								Получ = ВыборкаСчетов.НомерСчета.Участник;
								ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
							Иначе
								Получ = Получатель;
								ДоговорКонтрагента = Получатель.ОсновнойДоговорКонтрагента;
							КонецЕсли;
							Если ВыборкаСчетов.Сумма<=ВыборкаСчетов.СуммаОстаток Тогда
								Выборка = ВыборкаСчетов.Выбрать();
								//Если НаборСтрок.Количество()>0 Тогда
								НадоСписать = ВыборкаСчетов.Сумма;
								//Для каждого строкаНабора из НаборСтрок Цикл
								Пока Выборка.Следующий() Цикл	
									СуммаКСписанию = Мин(НадоСписать,Выборка.СуммаОстаток);
									
									Движение = ТабНачислений.Добавить();
									Движение.Активность = Истина;
									Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
									//Движение = Движения.уп_ПрочиеНачисления.ДобавитьРасход();
									Движение.Период = Дата;
									Движение.Организация = Организация;
									Движение.НомерСчета = Выборка.НомерСчета;
									Движение.Участник = Выборка.Участник;
									Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатРасторженцамНПО Тогда 
										Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам;
									Иначе
										Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам;
									КонецЕсли;
									Движение.ТипРезерва = Выборка.ТипРезерва;
									Движение.ТипСуммы = Выборка.ТипСуммы;
									Движение.Схема  = Выборка.Схема;
									Движение.Сумма = СуммаКСписанию;
									Движение.НалоговаяБазаПоНДФЛ = Выборка.НалоговаяБазаПоНДФЛОстаток;
									Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.Выплата;
									Движение.ДокументВыплаты = Ссылка;
									
									Если Выборка.Невыплата > 0 и ФормироватьОтвергнутыеПлатежи Тогда
										//Если Выборка.НалоговаяБазаПоНДФЛОстаток>0 Тогда
										//	Если ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток>0 И ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток = НадоСписатьНБ Тогда
										//		СписываемНДФЛ = НадоСписатьНДФЛ;
										//	ИначеЕсли Выборка.НалоговаяБазаПоНДФЛОстаток>0 Тогда
										//		СписываемНДФЛ = Окр(ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток*НадоСписатьНДФЛ/Выборка.НалоговаяБазаПоНДФЛОстаток,2);
										//	ИначеЕсли НадосписатьНБ = 0 Тогда
										//		СписываемНДФЛ = НадоСписатьНДФЛ;
										//	КонецЕсли;	
										//Иначе
										//	СписываемНДФЛ = НадоСписатьНДФЛ;
										//КонецЕсли;	
										//формируем регистр отвергнутых платежей
										//то же, что и в начислениях, но еще НДФЛ
										Движение = ТабОтвергнутых.Добавить();
										Движение.Активность = Истина;
										Движение.Период = Дата;
										Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
										Движение.Организация = Организация;
										Движение.НомерСчета = Выборка.НомерСчета;
										Движение.Участник = Выборка.Участник;
										Движение.ТипВыплаты = ТипВыплаты;
										Движение.Регистратор = Ссылка;
										
										Движение.ТипРезерва = Выборка.ТипРезерва;
										Движение.ТипСуммы = Выборка.ТипСуммы;
										
										Движение.Сумма = СуммаКСписанию;  
										Движение.НалоговаяБазаПоНДФЛ = Выборка.НалоговаяБазаПоНДФЛОстаток;
										//Если НДФЛУдержанВБюджет Тогда
										//	Движение.НДФЛ = 0;	
										//Иначе
										//	Движение.НДФЛ = СписываемНДФЛ; //это, если НДФЛ не перечисляем
										//КонецЕсли;
										Движение.Схема        = ВыборкаНачислений.Схема;
										Движение.ДокументВыплаты = Ссылка;
										Движение.ВидДвиженияРегистра = Перечисления.уп_ВидыДвиженияВозвратов.Возврат;
										
										//НадоСписатьНДФЛ = НадоСписатьНДФЛ-СписываемНДФЛ;
										//НадоСписатьНБ = НадоСписатьНБ-ВыборкаНачислений.НалоговаяБазаПоНДФЛОстаток;
									КонецЕсли;
									
									НадоСписать = НадоСписать-СуммаКСписанию;
									Если НадоСписать = 0  и ВыборкаУч.Невыплата = 0  Тогда
										Движение = ТабВыплат.Добавить();
										Движение.Активность = Истина;
										//Движение = Движения.уп_Выплаты.Добавить();
										Движение.Период = Дата;
										Движение.Организация = Организация;
										Движение.Участник = Выборка.Участник;
										Движение.НомерСчета = Выборка.НомерСчета;
										Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатНаследникамНПО Тогда
											Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам;
										ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатРасторженцамНПО Тогда
											Движение.ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам;
										КонецЕсли;
										Движение.Схема = Выборка.Схема;
										Движение.Сумма = ВыборкаСчетов.Сумма;
										Движение.НДФЛ = ВыборкаСчетов.НДФЛ;
										Если РКОВСумме Тогда
											ТекСуммаВыплаты = ВыборкаСчетов.Сумма-ВыборкаСчетов.НДФЛ-ВыборкаСчетов.РКО;
											Движение.РКО = ВыборкаСчетов.РКО;
										Иначе
											ТекСуммаВыплаты = ВыборкаСчетов.Сумма-ВыборкаСчетов.НДФЛ;
										КонецЕсли;	
										Движение.Выплата = ТекСуммаВыплаты;
										
										//Если ТекСхема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
										//	ПризнакДт = Истина;
										//Иначе
										ПризнакДт = Ложь;
										//КонецЕсли;
										Если НЕ ПроводкиПоНачислению Тогда
											ДвиженияПоБухУчету(Дата, ВидДвиженияНачисления, Выборка.Вкладчик, Выборка.ДоговорВкладчика, 
											Выборка.Схема, ПризнакДт, Получ, ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ВыборкаСчетов.Сумма);
										КонецЕсли;
										//еще РКО
										Если РКОВСумме Тогда
											ДвиженияПоБухУчету(Дата, Перечисления.уп_ВидыДвижений.РКО, Получ, ДоговорКонтрагента, 
											Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, Получ, ДоговорКонтрагента, Справочники.уп_ПенсионныеСхемы.ПустаяСсылка(), Ложь, ВыборкаСчетов.РКО);
										КонецЕсли;
										
										Прервать;
									КонецЕсли;	
								КонецЦикла;
								Если НадоСписать>0 Тогда
									Отказ = Истина;
									//ТекстСообщения = ТекстСообщения+
									//"|У Участника "+стр.Участник+" начисленная сумма составляет "+(стр.Сумма-НадоСписать);
									уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У Участника "+Выборка.Участник+" начисленная сумма составляет "+(ВыборкаСчетов.Сумма-НадоСписать),,Заголовок);
								КонецЕсли;
							Иначе
								Отказ = истина;
								//ТекстСообщения = ТекстСообщения+
								//"|У Участника "+стр.Участник+" нет начисленных средств.";
								уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У Участника "+ВыборкаСчетов.Участник+" не хватает начисленных средств.",,Заголовок);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам
				или ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_НПО
				или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам 
				или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиНПО
				или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежРасторжениеНПО Тогда
				ТабРезервы = ДвиженияПоРезервамНПО(ТабТрансляции,ТабРезервы,2);
			КонецЕсли;
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ВыплатныеРеестрыСписокПенсионеров.Участник КАК Участник,
			               |	СУММА(ВыплатныеРеестрыСписокПенсионеров.НДФЛ) КАК НДФЛ,
			               |	ВыплатныеРеестрыСписокПенсионеров.НомерСчета КАК НомерСчета,
			               |	ВыплатныеРеестрыСписокПенсионеров.Участник.уп_ФизЛицо КАК уп_ФизЛицо,
			               |	ВЫБОР
			               |		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета, 0) = 0
			               |			ТОГДА 0
			               |		ИНАЧЕ 1
			               |	КОНЕЦ КАК Невыплата
			               |ПОМЕСТИТЬ СписокУчастниковНДФЛ
			               |ИЗ
			               |	Документ.уп_ВыплатныеРеестры.СписокПенсионеров КАК ВыплатныеРеестрыСписокПенсионеров
			               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ВыплатныеРеестры.НеисполненныеВыплаты КАК уп_ВыплатныеРеестрыНеисполненныеВыплаты
			               |		ПО ВыплатныеРеестрыСписокПенсионеров.Ссылка = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Ссылка
			               |			И ВыплатныеРеестрыСписокПенсионеров.НомерСчета = уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета
			               |			И ВыплатныеРеестрыСписокПенсионеров.Участник = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Участник
			               |ГДЕ
			               |	ВыплатныеРеестрыСписокПенсионеров.Ссылка = &Ссылка
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ВыплатныеРеестрыСписокПенсионеров.Участник,
			               |	ВыплатныеРеестрыСписокПенсионеров.НомерСчета,
			               |	ВыплатныеРеестрыСписокПенсионеров.Участник.уп_ФизЛицо,
			               |	ВЫБОР
			               |		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.НомерСчета, 0) = 0
			               |			ТОГДА 0
			               |		ИНАЧЕ 1
			               |	КОНЕЦ
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	СписокУчастниковНДФЛ.Участник КАК Участник,
			               |	СписокУчастниковНДФЛ.НДФЛ КАК НДФЛ,
			               |	НДФЛУчастниковРасчетыСБюджетомОстатки.СтавкаНалогообложенияРезидента КАК СтавкаНалогообложенияРезидента,
			               |	НДФЛУчастниковРасчетыСБюджетомОстатки.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
			               |	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.НалогОстаток, 0) КАК НДФЛОстаток, 
						   |	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияОстаток, 0) КАК СуммаСПревышенияОстаток,
						   |	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке18Остаток, 0) КАК СуммаСПревышенияПоСтавке18Остаток,
						   |	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке20Остаток, 0) КАК СуммаСПревышенияПоСтавке20Остаток,
						   |	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке22Остаток, 0) КАК СуммаСПревышенияПоСтавке22Остаток,
						   |	ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.НалогОстаток, 0) + ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияОстаток, 0) + ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке18Остаток, 0) + ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке20Остаток, 0) + ЕСТЬNULL(НДФЛУчастниковРасчетыСБюджетомОстатки.СуммаСПревышенияПоСтавке22Остаток, 0) КАК НалогОстаток,
			               |	СтатусФизЛицКакНалогоплательщиковНДФЛСрезПоследних.Статус КАК Статус,
			               |	СписокУчастниковНДФЛ.НомерСчета КАК НомерСчета,
			               |	СписокУчастниковНДФЛ.Невыплата КАК Невыплата, 
			               |	НДФЛУчастниковРасчетыСБюджетомОстатки.ВидРасчета КАК ВидРасчета
			               |ИЗ
			               |	СписокУчастниковНДФЛ КАК СписокУчастниковНДФЛ
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ.СрезПоследних(
			               |				&ДатаДок,
			               |				ФизическоеЛицо В
			               |					(ВЫБРАТЬ
			               |						СписокУчастниковНДФЛ.уп_ФизЛицо
			               |					ИЗ
			               |						СписокУчастниковНДФЛ)) КАК СтатусФизЛицКакНалогоплательщиковНДФЛСрезПоследних
			               |		ПО СписокУчастниковНДФЛ.уп_ФизЛицо = СтатусФизЛицКакНалогоплательщиковНДФЛСрезПоследних.ФизическоеЛицо
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_НДФЛУчастниковРасчетыСБюджетом.Остатки(
			               |				&ДатаДок,
			               |				Организация = &Организация
			               |					И НомерСчета В (&СписокСчетов)
			               |					И Участник В (&СписокУчастников)
			               |					И ВидРасчета В (&ВидРасчета)) КАК НДФЛУчастниковРасчетыСБюджетомОстатки
			               |		ПО СписокУчастниковНДФЛ.НомерСчета = НДФЛУчастниковРасчетыСБюджетомОстатки.НомерСчета
			               |			И СписокУчастниковНДФЛ.Участник = НДФЛУчастниковРасчетыСБюджетомОстатки.Участник
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Участник,
			               |	НомерСчета,
			               |	МесяцНалоговогоПериода
			               |ИТОГИ
			               |	МАКСИМУМ(НДФЛ),
			               |	СУММА(НалогОстаток),
			               |	СУММА(Невыплата)
			               |ПО
			               |	Участник,
			               |	НомерСчета";
			
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("ДатаДок", КонецДня(Дата));
			Запрос.УстановитьПараметр("НомерСчета", Справочники.уп_ПенсионныеСчета.ПустаяСсылка());
			Запрос.УстановитьПараметр("СписокУчастников", СписокУчастников);
			Запрос.УстановитьПараметр("СписокСчетов", СписокСчетовПенсионеров);
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам 
				или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежРасторжениеНПО
				или ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_НПО Тогда  
				ВидРасчета = Новый СписокЗначений;
				ВидРасчета.Добавить(ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцам);
				ВидРасчета.Добавить(ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцамВзносыФЛ);
				Запрос.УстановитьПараметр("ВидРасчета", ВидРасчета);
			Иначе
				ВидРасчета = Новый СписокЗначений;
				ВидРасчета.Добавить(ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаНаследникам);
				Запрос.УстановитьПараметр("ВидРасчета", ВидРасчета);
			КонецЕсли;	
			
			//ТЗНДФЛ = Запрос.Выполнить().Выгрузить();
			
			//Для каждого стр из СписокПенсионеров Цикл
			Результат = Запрос.Выполнить();
			ВыборкаУч = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаУч.Следующий() Цикл
				Если ВыборкаУч.Невыплата = 0 или НДФЛУдержанВБюджет Тогда
					ВыборкаСчетов = ВыборкаУч.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаСчетов.Следующий() Цикл
						Если ВыборкаСчетов.НДФЛ<>0 Тогда
							//НаборСтрок = ТЗНДФЛ.НайтиСтроки(Новый Структура("Участник,НомерСчета",стр.Участник,стр.НомерСчета));
							Выборка = ВыборкаСчетов.Выбрать();
							Если Выборка.Количество()>0 Тогда
								НадоСписать = ВыборкаСчетов.НДФЛ;
								Пока Выборка.Следующий() Цикл
									СуммаКСписанию = Мин(НадоСписать,Выборка.НалогОстаток); 
									Если СуммаКСписанию<0 Тогда
										СуммаКСписанию = 0;
									КонецЕсли;	
									
									СписатьПоСтроке = СуммаКСписанию;
									Если Выборка.СуммаСПревышенияПоСтавке22Остаток>0 Тогда
										Налог22 = Мин(СписатьПоСтроке, Выборка.СуммаСПревышенияПоСтавке22Остаток);
									Иначе
										Налог22 = 0;
									КонецЕсли;
									СписатьПоСтроке = СписатьПоСтроке-Налог22;
									
									Если Выборка.СуммаСПревышенияПоСтавке20Остаток>0 И СписатьПоСтроке>0 Тогда
										Налог20 = Мин(СписатьПоСтроке, Выборка.СуммаСПревышенияПоСтавке20Остаток);
									Иначе
										Налог20 = 0;
									КонецЕсли;
									СписатьПоСтроке = СписатьПоСтроке-Налог20; 
									
									Если Выборка.СуммаСПревышенияПоСтавке18Остаток>0 И СписатьПоСтроке>0 Тогда
										Налог18 = Мин(СписатьПоСтроке, Выборка.СуммаСПревышенияПоСтавке18Остаток);
									Иначе
										Налог18 = 0;
									КонецЕсли;
									СписатьПоСтроке = СписатьПоСтроке-Налог18;
									
									Если Выборка.СуммаСПревышенияОстаток>0 И СписатьПоСтроке>0 Тогда
										Налог15 = Мин(СписатьПоСтроке, Выборка.СуммаСПревышенияОстаток);
									Иначе
										Налог15 = 0;
									КонецЕсли;
									СписатьПоСтроке = СписатьПоСтроке-Налог15; 
									
									Если Выборка.НДФЛОстаток>0 И СписатьПоСтроке>0 Тогда
										Налог13 = Мин(СписатьПоСтроке, Выборка.НДФЛОстаток);
									Иначе
										Налог13 = 0;
									КонецЕсли;
								
									
									Движение = ТабНДФЛУчастников.Добавить();
									Движение.Активность = Истина;
									Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
									//Движение = Движения.уп_НДФЛУчастниковРасчетыСБюджетом.ДобавитьРасход();
									Движение.Организация = Организация;
									Движение.Участник = Выборка.Участник;
									Движение.НомерСчета = Выборка.НомерСчета;
									Движение.МесяцНалоговогоПериода = Выборка.МесяцНалоговогоПериода;
									Движение.Период = Дата;
									Движение.СтавкаНалогообложенияРезидента = Выборка.СтавкаНалогообложенияРезидента;
									Движение.ВидСтроки = Перечисления.УдалитьНДФЛРасчетыСБюджетомВидСтроки.Удержание;
									Движение.Налог = Налог13;   
									Движение.СуммаСПревышения = Налог15;
									Движение.СуммаСПревышенияПоСтавке18 = Налог18;
									Движение.СуммаСПревышенияПоСтавке20 = Налог20;
									Движение.СуммаСПревышенияПоСтавке22 = Налог22;
									//Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам
									//	Или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиНПО Тогда
									//	Движение.ВидРасчета = ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаНаследникам;
									//Иначе
									//	Движение.ВидРасчета = ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцам;
									//КонецЕсли;	
									Движение.ВидРасчета = Выборка.ВидРасчета;
									
									Движение = ТабНДФЛ.Добавить();
									Движение.Активность = Истина;
									Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
									//Движение = Движения.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.ДобавитьРасход();
									Движение.ФизическоеЛицо = Выборка.Участник.уп_ФизЛицо;
									Движение.Период = Дата;
									Движение.Регистратор = Ссылка;
									Движение.МесяцНалоговогоПериода = Выборка.МесяцНалоговогоПериода;
									Если НЕ ЗначениеЗаполнено(Организация.ГоловнаяОрганизация) Тогда
										Движение.ГоловнаяОрганизация = Организация;
									Иначе
										Движение.ГоловнаяОрганизация = Организация.ГоловнаяОрганизация;
									КонецЕсли; 
									//Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам Тогда
									//	Движение.КатегорияДохода = ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаНаследникам.КатегорияДохода;
									//Иначе
									//	Движение.КатегорияДохода = ПланыВидовРасчета.Начисления.уп_ВыкупнаяСуммаРасторженцам.КатегорияДохода;
									//КонецЕсли;	
									Движение.КатегорияДохода = Выборка.ВидРасчета.КатегорияДохода;
									Движение.СтавкаНалогообложенияРезидента = Выборка.СтавкаНалогообложенияРезидента;
									Движение.РегистрацияВНалоговомОргане = РегистрацияВНалоговомОргане;
									Движение.Подразделение = ПодразделениеОрганизации;
									Движение.Сумма = Налог13; 
									Движение.СуммаСПревышения = Налог15;
									Движение.СуммаСПревышенияПоСтавке18 = Налог18;
									Движение.СуммаСПревышенияПоСтавке20 = Налог20;
									Движение.СуммаСПревышенияПоСтавке22 = Налог22;
									//Магера Д.В. 
									Движение.ВариантУдержания = Перечисления.ВариантыУдержанияНДФЛ.Удержано; 
									Движение.Организация = Организация;
									
									
									//регистр РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
									СтруктураСуммНДФЛ = Новый Структура("Сумма13, Сумма15, Сумма18, Сумма20, Сумма22, Сумма30", ?(Выборка.Статус = Справочники.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент,0,Налог13), Налог15, Налог18, Налог20, Налог22, ?(Выборка.Статус = Справочники.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент,Налог13,0));
									ТаблицаРаспределения = уп_ОбщегоНазначенияСервер.СформироватьТаблицуНДФЛПоСтавкам(СтруктураСуммНДФЛ);
									Для Каждого стрСтавка из ТаблицаРаспределения Цикл
										Движение = ТабНДФЛ_НА.Добавить();
										Движение.Активность = Истина;
										Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
										//Движение = Движения.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ДобавитьПриход();
										Движение.ФизическоеЛицо = Выборка.Участник.уп_ФизЛицо;
										Движение.Период = Дата;
										Движение.МесяцНалоговогоПериода = Выборка.МесяцНалоговогоПериода;
										Движение.Регистратор = Ссылка;
										Если НЕ ЗначениеЗаполнено(Организация.ГоловнаяОрганизация) Тогда
											Движение.Организация = Организация;
										Иначе
											Движение.Организация = Организация.ГоловнаяОрганизация;
										КонецЕсли;
										Движение.Ставка = стрСтавка.Ставка;
										Движение.Сумма = стрСтавка.Сумма;
										//Если Выборка.Статус = Справочники.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент Тогда
										//	Движение.Ставка = Перечисления.НДФЛСтавки.Ставка30;
										//Иначе
										//	Движение.Ставка = Перечисления.НДФЛСтавки.Ставка13;
										//КонецЕсли;
										////Движение.ОКАТО_КПП = СтрОКАТОКПП;
										////Движение.ОКТМО_КПП = СтрОКТМОКПП;
										//Движение.Сумма = СуммаКСписанию;
										Движение.РегистрацияВНалоговомОргане = РегистрацияВНалоговомОргане;
									КонецЦикла;	
									НадоСписать = НадоСписать-СуммаКСписанию;
									Если НадоСписать = 0 Тогда
										Прервать;
									КонецЕсли;	
								КонецЦикла;
								Если НадоСписать>0 Тогда
									Отказ = Истина;
									//ТекстСообщения = ТекстСообщения+
									//"|У Участника "+стр.Участник+" начисленная сумма НДФЛ "+(стр.НДФЛ-НадоСписать);
									уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У Участника "+ВыборкаСчетов.Участник+" начисленная сумма НДФЛ "+(ВыборкаСчетов.НДФЛ-НадоСписать),,Заголовок);
								КонецЕсли;	
							Иначе
								Отказ = истина;
								//ТекстСообщения = ТекстСообщения+
								//"|У Участника "+стр.Участник+" нет начисленного НДФЛ."
								уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("У Участника "+ВыборкаУч.Участник+" нет начисленного НДФЛ.",,Заголовок);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;	
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ Отказ Тогда
				Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам
					или ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_НПО
					или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам Тогда
					Движения.уп_ПрочиеНачисления.Загрузить(ТабНачислений);
					Движения.уп_ОтвергнутыеПлатежиПрочиеНачисленияНПО.Загрузить(ТабОтвергнутых);
				ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиНПО
					или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежРасторжениеНПО Тогда 
					Движения.уп_ОтвергнутыеПлатежиПрочиеНачисленияНПО.Загрузить(ТабНачислений);
				Иначе
					Движения.уп_ВозвратыПрочихНачисленийНПО.Загрузить(ТабНачислений);
					Движения.уп_ОтвергнутыеПлатежиПрочиеНачисленияНПО.Загрузить(ТабОтвергнутых);
				КонецЕсли;
				Движения.уп_НДФЛУчастниковРасчетыСБюджетом.Загрузить(ТабНДФЛУчастников);
				Движения.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Загрузить(ТабНДФЛ);
				Движения.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Загрузить(ТабНДФЛ_НА);
				Движения.уп_Выплаты.Загрузить(ТабВыплат);
				Движения.уп_Поступления.Загрузить(ТабПоступлений);
				Движения.уп_Резервы.Загрузить(ТабРезервы);
			КонецЕсли;
			//надо еще проверить можно ли закрыть счета (если не осталось в резерве и нет начисленного, то можно закрывать концом дня выплаты)
			Движения.уп_Резервы.Записать();
			ЗакрытьПенсионныеСчета(ТабСостоянийПС, ТабСостоянийДоговоров);
			Движения.уп_СостоянияПС.Загрузить(ТабСостоянийПС);
			Движения.уп_СостоянияДоговора.Загрузить(ТабСостоянийДоговоров);
			
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойПФ Тогда
			ДвиженияПоРасторжениюОПС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникамОПС Тогда
			ДвиженияПоНаследованиюОПС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатПравопреемникамОПС Тогда
			ДвиженияПоВозвратамППОПС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиОПС Тогда
			ДвиженияПоОтвергнутымПлатежамППОПС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаОПС Тогда
			ДвиженияПоЕдиновременнойВыплатеОПС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратЕдиновременнойВыплатыОПС Тогда
			ДвиженияПоВозвратамЕВОПС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежЕВОПС Тогда
			ДвиженияПоОтвергнутымПлатежамЕВОПС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС Тогда
			ДвиженияПоВыплатеПенсийОПС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратНакопительнойПенсииОПС Тогда
			ДвиженияПоВыплатеВозвратовПенсийОПС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежНПОПС Тогда
			ДвиженияПоОтвергнутымПлатежамПенсииОПС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.СрочнаяПенсияОПС Тогда
			ДвиженияПоВыплатеПенсийОПС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратСрочнойПенсииОПС Тогда
			ДвиженияПоВыплатеВозвратовПенсийОПС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежСВОПС Тогда
			ДвиженияПоОтвергнутымПлатежамПенсииОПС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапитала
			ИЛИ ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратМатеринскогоКапиталаПДС Тогда
			ДвиженияПоВыплатеМатеринскогоКапиталаОПС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.РазделениеСНИЛС Тогда
			ДвиженияПоРазделениюСНИЛС(Отказ, Заголовок); 		
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийПДС Тогда
			ДвиженияПоВыплатеПенсийПДС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратПенсииПДС Тогда
			ДвиженияПоВыплатеВозвратовПенсийПДС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияПДС Тогда
			ДвиженияПоОтвергнутыеПлатёжиПоВыплатеПенсийПДС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ЕдиновременнаяВыплатаПДС Тогда
			ДвиженияПоЕдиновременнойВыплатеПДС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратЕдиновременнаяВыплатаПДС Тогда
			ДвиженияПоВыплатеВозвратовПоЕдиновременнойВыплатеПДС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежЕВПДС Тогда
			ДвиженияПоОтвергнутыеПлатёжиПоЕдиновременнойВыплатеПДС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыкупнаяСуммаПДС Тогда
			ДвиженияПоРасторжениюПДС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыкупнаяСуммаПДС Тогда
			ДвиженияПоВыплатеВозвратовПоРасторжениюПДС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежВыкупнаяСуммаПДС Тогда
			ДвиженияПоОтвергнутыеПлатёжиПоРасторжениюПДС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПоОсобымОбстоятельствамПДС Тогда
			ДвиженияПоОсобымОбстоятельствамПДС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатыПоОсобымОбстоятельствамПДС Тогда
			ДвиженияПоВыплатеВозвратовПоОсобымОбстоятельствамПДС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежВыплатыПоОсобымОбстоятельствамПДС Тогда
			ДвиженияПоОтвергнутыеПлатёжиПоОсобымОбстоятельствамПДС(Отказ, Заголовок);

		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПравопреемникамПДС Тогда
			ДвиженияПоПравопреемникамПДС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВыплатыПравопреемникамПДС Тогда
			ДвиженияПоВыплатеВозвратовПоПравопреемникамПДС(Отказ, Заголовок);
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиПДС Тогда
			ДвиженияПоОтвергнутыеПлатёжиПоПравопреемникамПДС(Отказ, Заголовок); 
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратВзносовПДС Тогда
			ДвиженияПоВозвратуВзносовПДС(Отказ, Заголовок); 
//ЮП
		ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_ПДС Тогда
			ДвиженияПоПереводуВДругойНПФ_ПДС(Отказ, Заголовок);			
			
		КонецЕсли;
		
		//Добавим движения по бухгалтерии
		//Если ОтражатьВБухгалтерскомУчете и НЕ ПроводкиПоНачислению Тогда
		Если ОтражатьВБухгалтерскомУчете Тогда
			уп_ОбщегоНазначенияУчетРезервов.ДополнитьТаблицуБухУчета(Дата, ТабБухУчет, Ссылка, Отказ);
			уп_ОбщегоНазначенияУчетРезервов.СделатьДвиженияПоБухУчету(ЭтотОбъект, ТабБухУчет);
		КонецЕсли;	
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;

		#Вставка
		// +ХМНПФ 18.03.2016 ШадринАВ // ОбработкаПроведения() // №281
		Если ХМ_ВыплатаПоВозвратам Тогда
			Для Каждого Движение Из Движения.уп_НачисленияПенсийОПС Цикл
				Если Движение.ВидДвижения = ВидДвиженияНакопления.Расход Тогда Движение.ХМ_Возврат = Истина; КонецЕсли;
			КонецЦикла;
			Для Каждого Движение Из Движения.уп_ПрочиеНачисленияОПС Цикл
				Если Движение.ВидДвижения = ВидДвиженияНакопления.Расход Тогда Движение.ХМ_Возврат = Истина; КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// -ХМНПФ 18.03.2016 ШадринАВ // ОбработкаПроведения() // №281
		#КонецВставки
		//// записываем движения регистров
		//Движения.уп_НачисленияПенсий.Записать();
		//Движения.уп_НДФЛУчастниковРасчетыСБюджетом.Записать();
		//Движения.УдалитьНДФЛРасчетыСБюджетом.Записать();
		//Движения.уп_ПрочиеНачисления.Записать();
		//Движения.уп_Выплаты.Записать();
		//Движения.уп_ПрочиеНачисленияОПС.Записать();
		//Движения.уп_ВыплатыОПС.Записать();
		//Движения.Хозрасчетный.Записать();
	КонецЕсли;
	Если ТекстСообщения<>"" Тогда
		уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(ТекстСообщения,,Заголовок);
	КонецЕсли;	
КонецПроцедуры

&ИзменениеИКонтроль("ДвиженияПоРезервамНПО")
Функция ХМДвиженияПоРезервамНПО(ТабНачислений, ТабРезервов, пТипВыплаты)
	
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	
	Если ТабРезервов = Неопределено Тогда
		ТабРезервов        = уп_ОсновнаяПоставкаСервер.СформироватьСтуктуруТаблицыПоРегиструНакопления("уп_Резервы");
	КонецЕсли;
	
	//списываем резерв начислений
	Если пТипВыплаты = 1 Тогда 
		ТабНачислений.Свернуть("НомерСчета,Схема,ТипРезерва,ТипСуммы, ТипПенсии", "Сумма");
	Иначе
		ТабНачислений.Свернуть("НомерСчета,Схема,ТипРезерва,ТипСуммы", "Сумма");
	КонецЕсли;
	ТабНачислений.Колонки.Добавить("ИПС", Новый ОписаниеТипов("Булево")); 
	ТабНачислений.Колонки.Добавить("СПС", Новый ОписаниеТипов("Булево")); 
	
	
	ТЗСол = ТабНачислений.Скопировать();
	ТЗСол.Очистить();
	
	Если пТипВыплаты = 1 Тогда
		Запрос = Новый Запрос; 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТабНачислений.НомерСчета КАК Справочник.уп_ПенсионныеСчета) КАК НомерСчета,
		|	ВЫРАЗИТЬ(ТабНачислений.Схема КАК Справочник.уп_ПенсионныеСхемы) КАК Схема,
		|	ТабНачислений.ТипРезерва КАК ТипРезерва,
		|	ТабНачислений.ТипСуммы КАК ТипСуммы,
		|	ТабНачислений.ТипПенсии КАК ТипПенсии,
		|	ТабНачислений.ИПС КАК ИПС,
		|	ТабНачислений.СПС КАК СПС,
		|	ТабНачислений.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВТ_ТабНачислений
		|ИЗ
		|	&ТабНачислений КАК ТабНачислений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ПенсионныеСхемыИсточникиВыплат_ИПС.Ссылка КАК Схема,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уп_ПенсионныеСхемыИсточникиВыплат_ИПС.НомерСтроки) КАК КолИсточниковИПС
		|ПОМЕСТИТЬ ВТ_СхемыИсточникиИПС
		|ИЗ
		|	Справочник.уп_ПенсионныеСхемы.ИсточникиВыплат_ИПС КАК уп_ПенсионныеСхемыИсточникиВыплат_ИПС
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_ПенсионныеСхемыИсточникиВыплат_ИПС.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ПенсионныеСхемыИсточникиВыплат_СПС.Ссылка КАК Схема,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ уп_ПенсионныеСхемыИсточникиВыплат_СПС.НомерСтроки) КАК КолИсточниковСПС
		|ПОМЕСТИТЬ ВТ_СхемыИсточникиСПС
		|ИЗ
		|	Справочник.уп_ПенсионныеСхемы.ИсточникиВыплат_СПС КАК уп_ПенсионныеСхемыИсточникиВыплат_СПС
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_ПенсионныеСхемыИсточникиВыплат_СПС.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_ПенсионныеСхемы.Ссылка КАК Схема,
		|	ЕСТЬNULL(ВТ_СхемыИсточникиИПС.КолИсточниковИПС, 0) КАК КолИсточниковИПС,
		|	ЕСТЬNULL(ВТ_СхемыИсточникиСПС.КолИсточниковСПС, 0) КАК КолИсточниковСПС,
		|	уп_ПравилаВеденияРезерваПожизненныхВыплатСрезПоследних.Правило КАК Правило
		|ПОМЕСТИТЬ ВТ_ПравилаСхем
		|ИЗ
		|	Справочник.уп_ПенсионныеСхемы КАК уп_ПенсионныеСхемы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СхемыИсточникиИПС КАК ВТ_СхемыИсточникиИПС
		|		ПО уп_ПенсионныеСхемы.Ссылка = ВТ_СхемыИсточникиИПС.Схема
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СхемыИсточникиСПС КАК ВТ_СхемыИсточникиСПС
		|		ПО уп_ПенсионныеСхемы.Ссылка = ВТ_СхемыИсточникиСПС.Схема
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_ПравилаВеденияРезерваПожизненныхВыплат.СрезПоследних(&ДатаДок, ) КАК уп_ПравилаВеденияРезерваПожизненныхВыплатСрезПоследних
		|		ПО уп_ПенсионныеСхемы.Ссылка = уп_ПравилаВеденияРезерваПожизненныхВыплатСрезПоследних.Схема
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ТабНачислений.ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.ПожизненныхВыплат)
		|				И ВТ_ПравилаСхем.Правило = ЗНАЧЕНИЕ(Перечисление.уп_РезервПожизненныхВыплат.БезАналитики)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.уп_ПенсионныеСчета.ПустаяСсылка)
		|		ИНАЧЕ ВТ_ТабНачислений.НомерСчета
		|	КОНЕЦ КАК НомерСчета,
		|	ВТ_ТабНачислений.Схема КАК Схема,
		|	ВТ_ТабНачислений.ТипРезерва КАК ТипРезерва,
		|	ВТ_ТабНачислений.ТипСуммы КАК ТипСуммы,
		|	ВЫБОР
		|		КОГДА ВТ_ТабНачислений.ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.ПожизненныхВыплат)
		|				И ВТ_ПравилаСхем.Правило = ЗНАЧЕНИЕ(Перечисление.уп_РезервПожизненныхВыплат.БезАналитики)
		|			ТОГДА ИСТИНА
		|		КОГДА ВТ_ПравилаСхем.КолИсточниковИПС > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ИПС,
		|	ВЫБОР
		|		КОГДА ВТ_ТабНачислений.ТипПенсии = ЗНАЧЕНИЕ(Перечисление.уп_ТипыПенсионныхСхем.ПожизненныхВыплат)
		|				И ВТ_ПравилаСхем.Правило = ЗНАЧЕНИЕ(Перечисление.уп_РезервПожизненныхВыплат.БезАналитики)
		|			ТОГДА ЛОЖЬ
		|		КОГДА ВТ_ПравилаСхем.КолИсточниковСПС > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СПС,
		|	ВТ_ТабНачислений.Сумма КАК Сумма
		|ИЗ
		|	ВТ_ТабНачислений КАК ВТ_ТабНачислений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПравилаСхем КАК ВТ_ПравилаСхем
		|		ПО ВТ_ТабНачислений.Схема = ВТ_ПравилаСхем.Схема
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ТабНачислений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_СхемыИсточникиИПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_СхемыИсточникиСПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ПравилаСхем"; 
		
		Запрос.УстановитьПараметр("ДатаДок", Дата); 
		Запрос.УстановитьПараметр("ТабНачислений", ТабНачислений);
		
		Результат = Запрос.Выполнить();
		
		ТабНачислений = Результат.Выгрузить();
		ТабНачислений.Свернуть("НомерСчета,Схема,ТипРезерва,ТипСуммы,ИПС,СПС", "Сумма");
		
		//Для Каждого стр из ТабНачислений Цикл
		//	ТекСхема = стр.Схема;
		//	Порядок_ИПС = ТекСхема.ИсточникиВыплат_ИПС.Выгрузить();
		//	Порядок_СПС = ТекСхема.ИсточникиВыплат_СПС.Выгрузить();
		//	Если (Порядок_ИПС.Количество() = 0) и (Порядок_СПС.Количество() = 0) Тогда
		//		Если ТекСхема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
		//			//посмотрим порядок ведения резерва ПВ
		//			ПорядокВеденияРПВ = уп_НПФ.ОпределитьПорядокВеденияПожизненногоРезерва(ТекСхема, Дата);
		//			Если ПорядокВеденияРПВ = Перечисления.уп_РезервПожизненныхВыплат.БезАналитики Тогда
		//				//стр.РПВ = Истина;
		//				Стр.НомерСчета = Справочники.уп_ПенсионныеСчета.ПустаяСсылка();
		//			КонецЕсли;	
		//		КонецЕсли;
		//	Иначе
		//		Если ТекСхема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.ПожизненныхВыплат Тогда
		//			//посмотрим порядок ведения резерва ПВ
		//			ПорядокВеденияРПВ = уп_НПФ.ОпределитьПорядокВеденияПожизненногоРезерва(ТекСхема, Дата);
		//			Если ПорядокВеденияРПВ = Перечисления.уп_РезервПожизненныхВыплат.БезАналитики Тогда
		//				Стр.НомерСчета = Справочники.уп_ПенсионныеСчета.ПустаяСсылка();
		//			Иначе
		//				Если (Порядок_СПС.Количество() > 0) Тогда
		//					//Стр.НомерСчета = стр.НомерСчета.Владелец.ПенсионныйСчет;
		//					Стр.СПС = Истина;
		//				КонецЕсли;
		//			КонецЕсли;
		//		Иначе
		//			Если (Порядок_СПС.Количество() > 0) Тогда
		//				//Стр.НомерСчета = стр.НомерСчета.Владелец.ПенсионныйСчет;
		//				Стр.СПС = Истина;
		//			КонецЕсли;
		//		КонецЕсли;	
		//	КонецЕсли;
		//КонецЦикла; 
	Иначе
		ТабНачислений.ЗаполнитьЗначения(ИСТИНА, "ИПС");
	КонецЕсли;
	Запрос = Новый Запрос;
	Если ВестиУчетПоСхемам 
		И (ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий
		или ТипВыплаты = Перечисления.уп_ТипыВыплат.ВозвратПенсииНПО
		или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПенсияНПО) Тогда
		УсловиеСхемы = " И ТабСписания.Схема = Остатки.ПенсионнаяСхема";
	Иначе
		УсловиеСхемы = "";
	КонецЕсли;	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТабСписания.НомерСчета КАК НомерСчета,
	|	ТабСписания.Схема КАК Схема,
	|	ТабСписания.ТипРезерва КАК ТипРезерва,
	|	ТабСписания.ТипСуммы КАК ТипСуммы,
	|	ТабСписания.Сумма КАК Сумма,
	|	ТабСписания.СПС КАК СПС,
	|	ВЫБОР
	|		КОГДА ТабСписания.ТипРезерва = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.УП_ТИПЫРЕЗЕРВА.ИПС)
	|			ТОГДА &РезервНачисленийИПС
	|		КОГДА ТабСписания.ТипРезерва = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.УП_ТИПЫРЕЗЕРВА.СПС)
	|			ТОГДА &РезервНачисленийСПС
	|		КОГДА ТабСписания.ТипРезерва = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.УП_ТИПЫРЕЗЕРВА.ПожизненныхВыплат)
	|			ТОГДА &РезервНачисленийПожизненныхВыплат
	|		КОГДА ТабСписания.ТипРезерва = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.УП_ТИПЫРЕЗЕРВА.РезервНаследниковИПС)
	|			ТОГДА &РезервНачисленийНаследниковИПС
	|		КОГДА ТабСписания.ТипРезерва = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.УП_ТИПЫРЕЗЕРВА.РезервНаследниковСПС)
	|			ТОГДА &РезервНачисленийНаследниковСПС
	|		ИНАЧЕ ТабСписания.ТипРезерва
	|	КОНЕЦ КАК ТипРезерваНачислений
	|ПОМЕСТИТЬ ТабСписания
	|ИЗ
	|	&ТабСписания КАК ТабСписания
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСчета,
	|	Схема
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_РезервыОстатки.ТипСуммы КАК ТипСуммы,
	|	уп_РезервыОстатки.ТипРезерва КАК ТипРезерва,
	|	уп_РезервыОстатки.НомерСчета КАК НомерСчета,
	|	уп_РезервыОстатки.СуммаОстаток КАК СуммаОстаток,
	|	уп_РезервыОстатки.ПенсионнаяСхема КАК ПенсионнаяСхема
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.уп_Резервы.Остатки(
	|			&ДатаДок,
	|			НомерСчета В
	|					(ВЫБРАТЬ
	|						ТабСписания.НомерСчета КАК НомерСчета
	|					ИЗ
	|						ТабСписания КАК ТабСписания)
	|				И ТипРезерва В (&ТипыРезервовНачислений)) КАК уп_РезервыОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	#Вставка 
	//ЛыткинАМ //Ускорение формирования реестра
	|	ТабСписания.Номерсчета.Владелец.ПенсионныйСчет  КАК ПенсионныйСчетИсточник,
	#КонецВставки
	|	ТабСписания.НомерСчета КАК НомерСчета,
	|	ТабСписания.Схема КАК Схема,
	|	Остатки.ТипРезерва КАК ТипРезерва,
	|	Остатки.ТипСуммы КАК ТипСуммы,
	|	ТабСписания.Сумма КАК Сумма,
	|	ТабСписания.СПС КАК СПС,
	|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	Остатки.ПенсионнаяСхема КАК ПенсионнаяСхема,
	|	ТабСписания.ТипРезерваНачислений КАК ТипРезерваНачислений,
	|	ТабСписания.ТипРезерва КАК ТипРезерваИсх,
	|	ТабСписания.ТипСуммы КАК ТипСуммыИсх
	|ИЗ
	|	ТабСписания КАК ТабСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ТабСписания.НомерСчета = Остатки.НомерСчета
	|			И ТабСписания.ТипРезерваНачислений = Остатки.ТипРезерва "+УсловиеСхемы+"
	|			И ТабСписания.ТипСуммы = Остатки.ТипСуммы";
	
	Запрос.УстановитьПараметр("ТабСписания", ТабНачислений);
	Запрос.УстановитьПараметр("ДатаДок", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", Организация);
	ТипыРезервовНачислений = Новый СписокЗначений;
	Если пТипВыплаты = 1 Тогда
		ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийИПС);
		ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийСПС);
		ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийПожизненныхВыплат);
		Запрос.УстановитьПараметр("РезервНачисленийИПС", Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийИПС);
		Запрос.УстановитьПараметр("РезервНачисленийСПС", Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийСПС);
		Запрос.УстановитьПараметр("РезервНачисленийПожизненныхВыплат", Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийПожизненныхВыплат);
		Запрос.УстановитьПараметр("РезервНачисленийНаследниковИПС", Перечисления.уп_ТипыРезерва.РезервНаследниковИПС);
		Запрос.УстановитьПараметр("РезервНачисленийНаследниковСПС", Перечисления.уп_ТипыРезерва.РезервНаследниковСПС);
	Иначе
		ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммИПС);
		ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммСПС);
		ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммПожизненныхВыплат);
		Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам 
			или ТипВыплаты = Перечисления.уп_ТипыВыплат.ОтвергнутыйПлатежПравопреемникиНПО Тогда
			ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийНаследниковИПС);
			ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийНаследниковСПС);
		КонецЕсли;
		Запрос.УстановитьПараметр("РезервНачисленийИПС", Перечисления.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммИПС);
		Запрос.УстановитьПараметр("РезервНачисленийСПС", Перечисления.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммСПС);
		Запрос.УстановитьПараметр("РезервНачисленийПожизненныхВыплат", Перечисления.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммПожизненныхВыплат);
		Запрос.УстановитьПараметр("РезервНачисленийНаследниковИПС", Перечисления.уп_ТипыРезерва.РезервНачисленийНаследниковИПС);
		Запрос.УстановитьПараметр("РезервНачисленийНаследниковСПС", Перечисления.уп_ТипыРезерва.РезервНачисленийНаследниковСПС);
	КонецЕсли;
	Запрос.УстановитьПараметр("ТипыРезервовНачислений", ТипыРезервовНачислений);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	#Вставка 
	//ЛыткинАМ //Учет по счетам источникам
	ТЗСол.Колонки.Добавить("ПенсионныйСчетИсточник", Новый ОписаниеТипов("СправочникСсылка.уп_ПенсионныеСчета"));
	#КонецВставки
	Пока Выборка.Следующий() Цикл
		#Вставка 
		//ЛыткинАМ //Возможность списать минусовые начисления
		Если Выборка.СуммаОстаток>0 ИЛИ Выборка.СуммаОстаток <= Выборка.Сумма И Выборка.Сумма < 0 Тогда
		#КонецВставки
		#Удаление
		Если Выборка.СуммаОстаток>0 Тогда
			#КонецУдаления
			Движение = ТабРезервов.Добавить();
			Движение.Активность = Истина;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Регистратор = Ссылка;
			Движение.НомерСчета = Выборка.НомерСчета;
			Движение.Организация = Организация;
			Движение.Период = Дата;
			Движение.ТипРезерва = Выборка.ТипРезерва;
			Движение.ТипСуммы = Выборка.ТипСуммы;
			Движение.ПенсионнаяСхема = Выборка.ПенсионнаяСхема;
			Движение.Схема = Выборка.Схема;
			Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий Тогда
				Движение.Движение = Перечисления.уп_ВидыДвижений.Начисление;
			ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам Тогда
				Движение.Движение = Перечисления.уп_ВидыДвижений.ЗакрытиеСчетаНПОРасторжение;
			ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам Тогда
				Движение.Движение = Перечисления.уп_ВидыДвижений.ЗакрытиеСчетаНПОСмерть;
			ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_НПО Тогда
				Движение.Движение = Перечисления.уп_ВидыДвижений.ЗакрытиеСчетаНПОРасторжение;
			КонецЕсли;
			Движение.Сумма = Мин(Выборка.СуммаОстаток,Выборка.Сумма);  
			
			Если Движение.Сумма<Выборка.Сумма И Выборка.СПС И пТипВыплаты = 1 И ЗначениеЗаполнено(Выборка.НомерСчета) Тогда  //возможно списание с СПС если не хватает на ИПС
				СтрТЗСол = ТЗСол.Добавить();
				#Удаление
				СтрТЗСол.НомерСчета = Выборка.Номерсчета.Владелец.ПенсионныйСчет;
				#КонецУдаления
				#Вставка 
				//ЛыткинАМ //Учет по счетам источникам
				СтрТЗСол.НомерСчета = Выборка.ПенсионныйСчетИсточник;
				СтрТЗСол.ПенсионныйСчетИсточник = Выборка.Номерсчета;
				#КонецВставки
				СтрТЗСол.ТипРезерва = Выборка.ТипРезерваИсх; 
				СтрТЗСол.ТипСуммы = Выборка.ТипСуммыИсх; 
				СтрТЗСол.Схема = Выборка.Схема;
				СтрТЗСол.Сумма = Движение.Сумма - Выборка.Сумма;
				#Вставка 
				//ЛыткинАМ //Учет по счетам источникам
			ИначеЕсли Движение.Сумма<Выборка.Сумма Тогда
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("На счете "+Выборка.НомерСчета+" по резерву "+Выборка.ТипРезерваНачислений+" по типу суммы "+Выборка.ТипСуммы+" недостаточно средств для выплаты. На счете "+Выборка.СуммаОстаток+", необходимо "+Выборка.Сумма,,Заголовок);
				//https://redmine.npf.com/issues/4245
				Отказ = Истина;
				#КонецВставки
			КонецЕсли;	
		Иначе
			Если Выборка.СПС Тогда
				//кандидат на списание с СПС
				СтрТЗСол = ТЗСол.Добавить();
				#Удаление
				СтрТЗСол.НомерСчета = Выборка.Номерсчета.Владелец.ПенсионныйСчет;
				#КонецУдаления
				#Вставка 
				//ЛыткинАМ //Учет по счетам источникам
				СтрТЗСол.НомерСчета = Выборка.ПенсионныйСчетИсточник;
				СтрТЗСол.ПенсионныйСчетИсточник = Выборка.Номерсчета;
				#КонецВставки
				СтрТЗСол.ТипРезерва = Выборка.ТипРезерваИсх; 
				СтрТЗСол.ТипСуммы = Выборка.ТипСуммыИсх; 
				СтрТЗСол.Схема = Выборка.Схема;
				СтрТЗСол.Сумма = Выборка.Сумма;
				//Иначе
				//	уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("На счете "+Выборка.НомерСчета+" по резерву "+Выборка.ТипРезерваНачислений+" по типу суммы "+Выборка.ТипСуммы+" недостаточно средств для выплаты. На счете "+Выборка.СуммаОстаток+", необходимо "+Выборка.Сумма,,Заголовок);
				#Вставка 
				//ЛыткинАМ //Учет по счетам источникам
			Иначе
				уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("На счете "+Выборка.НомерСчета+" по резерву "+Выборка.ТипРезерваНачислений+" по типу суммы "+Выборка.ТипСуммы+" недостаточно средств для выплаты. На счете "+Выборка.СуммаОстаток+", необходимо "+Выборка.Сумма,,Заголовок);
				#КонецВставки
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	Если ТЗСол.Количество() > 0 Тогда
		#Удаление
		ТЗСол.Свернуть("НомерСчета,Схема,ТипРезерва,ТипСуммы", "Сумма");
		#КонецУдаления
		#Вставка 
		//ЛыткинАМ //Учет по счетам источникам
		ТЗСол.Свернуть("ПенсионныйСчетИсточник,НомерСчета,Схема,ТипРезерва,ТипСуммы", "Сумма");
		#КонецВставки
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТабСписания.НомерСчета КАК НомерСчета,
		|	ТабСписания.Схема КАК Схема,
		|	ТабСписания.ТипРезерва КАК ТипРезерва,
		|	ТабСписания.ТипСуммы КАК ТипСуммы,
		|	ТабСписания.Сумма КАК Сумма,
		#Вставка 
		//ЛыткинАМ //Учет по счетам источникам
		|	ТабСписания.ПенсионныйСчетИсточник КАК ПенсионныйСчетИсточник,
		#КонецВставки
		|	ВЫБОР
		|		КОГДА ТабСписания.ТипРезерва = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.УП_ТИПЫРЕЗЕРВА.ИПС)
		|			ТОГДА &РезервНачисленийИПС
		|		КОГДА ТабСписания.ТипРезерва = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.УП_ТИПЫРЕЗЕРВА.СПС)
		|			ТОГДА &РезервНачисленийСПС
		|		КОГДА ТабСписания.ТипРезерва = ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.УП_ТИПЫРЕЗЕРВА.ПожизненныхВыплат)
		|			ТОГДА &РезервНачисленийПожизненныхВыплат
		|		ИНАЧЕ ТабСписания.ТипРезерва
		|	КОНЕЦ КАК ТипРезерваНачислений
		|ПОМЕСТИТЬ ТабСписания
		|ИЗ
		|	&ТабСписания КАК ТабСписания
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерСчета,
		|	Схема
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	уп_РезервыОстатки.ТипСуммы КАК ТипСуммы,
		|	уп_РезервыОстатки.ТипРезерва КАК ТипРезерва,
		|	уп_РезервыОстатки.НомерСчета КАК НомерСчета,
		|	уп_РезервыОстатки.СуммаОстаток КАК СуммаОстаток,
		|	уп_РезервыОстатки.ПенсионнаяСхема КАК ПенсионнаяСхема
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.уп_Резервы.Остатки(
		|			&ДатаДок,
		|			НомерСчета В
		|					(ВЫБРАТЬ
		|						ТабСписания.НомерСчета КАК НомерСчета
		|					ИЗ
		|						ТабСписания КАК ТабСписания)
		|				И ТипРезерва В (&ТипыРезервовНачислений)) КАК уп_РезервыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		#Вставка 
		//ЛыткинАМ //Учет по счетам источникам
		|	ТабСписания.ПенсионныйСчетИсточник КАК ПенсионныйСчетИсточник,
		#КонецВставки
		|	ТабСписания.НомерСчета КАК НомерСчета,
		|	ТабСписания.Схема КАК Схема,
		|	Остатки.ТипРезерва КАК ТипРезерва,
		|	Остатки.ТипСуммы КАК ТипСуммы,
		|	ТабСписания.Сумма КАК Сумма,
		|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	Остатки.ПенсионнаяСхема КАК ПенсионнаяСхема,
		|	ТабСписания.ТипРезерва КАК ТипРезерваИсх,
		|	ТабСписания.ТипСуммы КАК ТипСуммыИсх,
		|	ТабСписания.ТипРезерваНачислений КАК ТипРезерваНачислений
		|ИЗ
		|	ТабСписания КАК ТабСписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
		|		ПО ТабСписания.НомерСчета = Остатки.НомерСчета
		|			И ТабСписания.ТипРезерваНачислений = Остатки.ТипРезерва "+УсловиеСхемы+"
		|			И ТабСписания.ТипСуммы = Остатки.ТипСуммы";
		#Вставка 
		Запрос.Текст = Запрос.Текст + "
		|ИТОГИ
		|   Максимум(СуммаОстаток),
		|   СУММА(Сумма)
		|ПО
		|   ТипСуммы,
		|   ТипРезерва,
		|   НомерСчета,
		|   ПенсионнаяСхема";
		#КонецВставки
		
		Запрос.УстановитьПараметр("ТабСписания", ТЗСол);
		Запрос.УстановитьПараметр("ДатаДок", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("Организация", Организация);
		ТипыРезервовНачислений = Новый СписокЗначений;
		Если пТипВыплаты = 1 Тогда
			ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийИПС);
			ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийСПС);
			ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийПожизненныхВыплат);
			Запрос.УстановитьПараметр("РезервНачисленийИПС", Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийИПС);
			Запрос.УстановитьПараметр("РезервНачисленийСПС", Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийСПС);
			Запрос.УстановитьПараметр("РезервНачисленийПожизненныхВыплат", Перечисления.уп_ТипыРезерва.РезервНачисленийПенсийПожизненныхВыплат);
		Иначе
			ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммИПС);
			ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммСПС);
			ТипыРезервовНачислений.Добавить(Перечисления.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммПожизненныхВыплат);
			Запрос.УстановитьПараметр("РезервНачисленийИПС", Перечисления.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммИПС);
			Запрос.УстановитьПараметр("РезервНачисленийСПС", Перечисления.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммСПС);
			Запрос.УстановитьПараметр("РезервНачисленийПожизненныхВыплат", Перечисления.уп_ТипыРезерва.РезервНачисленийВыкупныхСуммПожизненныхВыплат);
		КонецЕсли;
		Запрос.УстановитьПараметр("ТипыРезервовНачислений", ТипыРезервовНачислений);
		
		Результат = Запрос.Выполнить();
		#Вставка 
		РезультатТипСуммы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока РезультатТипСуммы.Следующий() Цикл
			РезультатТипРезерва = РезультатТипСуммы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока РезультатТипРезерва.Следующий() Цикл
				РезультатНомерСчета = РезультатТипРезерва.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока РезультатНомерСчета.Следующий() Цикл
					РезультатПенсионнаяСхема = РезультатНомерСчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока РезультатПенсионнаяСхема.Следующий() Цикл
						Если РезультатПенсионнаяСхема.СуммаОстаток < РезультатПенсионнаяСхема.Сумма Тогда
							уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("На солидарном счете "+Выборка.НомерСчета+" по резерву "+Выборка.ТипРезерваНачислений+" по типу суммы "+Выборка.ТипСуммы+" недостаточно средств для выплаты. На счете "+Выборка.СуммаОстаток+", необходимо "+Выборка.Сумма,,Заголовок);
						КонецЕсли;
						Результат = РезультатПенсионнаяСхема;	
						#КонецВставки
						Выборка = Результат.Выбрать();
						Пока Выборка.Следующий() Цикл
							Если Выборка.СуммаОстаток>0 Тогда
								Движение = ТабРезервов.Добавить();
								Движение.Активность = Истина;
								Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
								Движение.Регистратор = Ссылка;
								Движение.НомерСчета = Выборка.НомерСчета;
								#Вставка 
								//ЛыткинАМ //Учет по счетам источникам
								Движение.ПенсионныйСчетИсточник = Выборка.ПенсионныйСчетИсточник;
								#КонецВставки
								Движение.Организация = Организация;
								Движение.Период = Дата;
								Движение.ТипРезерва = Выборка.ТипРезерва;
								Движение.ТипСуммы = Выборка.ТипСуммы;
								Движение.ПенсионнаяСхема = Выборка.ПенсионнаяСхема;
								Движение.Схема = Выборка.Схема;
								Если ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсий Тогда
									Движение.Движение = Перечисления.уп_ВидыДвижений.Начисление;
								ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыРасторженцам Тогда
									Движение.Движение = Перечисления.уп_ВидыДвижений.ЗакрытиеСчетаНПОРасторжение;
								ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыНаследникам Тогда
									Движение.Движение = Перечисления.уп_ВидыДвижений.ЗакрытиеСчетаНПОСмерть;
								ИначеЕсли ТипВыплаты = Перечисления.уп_ТипыВыплат.ПереводВДругойНПФ_НПО Тогда
									Движение.Движение = Перечисления.уп_ВидыДвижений.ЗакрытиеСчетаНПОРасторжение;
								КонецЕсли;
								Движение.Сумма = Мин(Выборка.СуммаОстаток,Выборка.Сумма);
								//Иначе
								//	уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("На солидарном счете "+Выборка.НомерСчета+" по резерву "+Выборка.ТипРезерваНачислений+" по типу суммы "+Выборка.ТипСуммы+" недостаточно средств для выплаты. На счете "+Выборка.СуммаОстаток+", необходимо "+Выборка.Сумма,,Заголовок);
							КонецЕсли;	
						КонецЦикла;
						#Вставка 
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		#КонецВставки
	КонецЕсли;
		
	Возврат ТабРезервов;
КонецФункции

&После("ПередЗаписью")
Процедура ХМПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Дата = НачалоДня(Дата)+60*60*12;
КонецПроцедуры

&ИзменениеИКонтроль("ПроверитьОстаткиПоНачислениюПенсийОПС")
Функция ХМПроверитьОстаткиПоНачислениюПенсийОПС()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уп_ВыплатныеРеестрыДоговорыОПС.ДоговорОПС,
	|	СУММА(уп_ВыплатныеРеестрыДоговорыОПС.Сумма) КАК Сумма,
	|	СУММА(уп_ВыплатныеРеестрыДоговорыОПС.РКО) КАК РКО,
	|	уп_ВыплатныеРеестрыДоговорыОПС.ТипПенсииОПС,
	|	уп_ВыплатныеРеестрыДоговорыОПС.НачалоПериодаНачисления,
	|	уп_ВыплатныеРеестрыДоговорыОПС.Участник,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.ДоговорОПС, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Невыплата
	|ПОМЕСТИТЬ СписокДоговоровОПС
	|ИЗ
	|	Документ.уп_ВыплатныеРеестры.ДоговорыОПС КАК уп_ВыплатныеРеестрыДоговорыОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уп_ВыплатныеРеестры.НеисполненныеВыплаты КАК уп_ВыплатныеРеестрыНеисполненныеВыплаты
	|		ПО уп_ВыплатныеРеестрыДоговорыОПС.Ссылка = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Ссылка
	|			И уп_ВыплатныеРеестрыДоговорыОПС.ДоговорОПС = уп_ВыплатныеРеестрыНеисполненныеВыплаты.ДоговорОПС
	|			И уп_ВыплатныеРеестрыДоговорыОПС.Участник = уп_ВыплатныеРеестрыНеисполненныеВыплаты.Участник
	|ГДЕ
	|	уп_ВыплатныеРеестрыДоговорыОПС.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	уп_ВыплатныеРеестрыДоговорыОПС.ДоговорОПС,
	|	уп_ВыплатныеРеестрыДоговорыОПС.ТипПенсииОПС,
	|	уп_ВыплатныеРеестрыДоговорыОПС.НачалоПериодаНачисления,
	|	уп_ВыплатныеРеестрыДоговорыОПС.Участник,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(уп_ВыплатныеРеестрыНеисполненныеВыплаты.ДоговорОПС, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уп_НачисленияПенсийОПСОстатки.ТипСуммы,
	|	ЕСТЬNULL(уп_НачисленияПенсийОПСОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	СписокДоговоровОПС.ДоговорОПС КАК ДоговорОПС,
	|	уп_НачисленияПенсийОПСОстатки.НачПериода КАК НачалоПериодаНачисления,
	|	уп_НачисленияПенсийОПСОстатки.ПериодичностьВыплат,
	|	СписокДоговоровОПС.ТипПенсииОПС КАК ТипПенсии,
	|	ЕСТЬNULL(уп_НачисленияПенсийОПСОстатки.СуммаКомпенсацииОстаток, 0) КАК СуммаКомпенсацииОстаток,
	|	ЕСТЬNULL(уп_НачисленияПенсийОПСОстатки.СуммаВосполненияОстаток, 0) КАК СуммаВосполненияОстаток,
	|	ЕСТЬNULL(уп_НачисленияПенсийОПСОстатки.СуммаВозмещенияОстаток, 0) КАК СуммаВозмещенияОстаток,
	|	СписокДоговоровОПС.Сумма КАК Сумма,
	|	СписокДоговоровОПС.РКО КАК РКО,
	|	СписокДоговоровОПС.Участник,
	|	СписокДоговоровОПС.Невыплата КАК Невыплата
	|ИЗ
	|	СписокДоговоровОПС КАК СписокДоговоровОПС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_НачисленияПенсийОПС.Остатки(&ДатаДок, ДоговорОПС В (&СписокДоговоровОПС)) КАК уп_НачисленияПенсийОПСОстатки
	|		ПО СписокДоговоровОПС.ДоговорОПС = уп_НачисленияПенсийОПСОстатки.ДоговорОПС
	|			И СписокДоговоровОПС.ТипПенсииОПС = уп_НачисленияПенсийОПСОстатки.ТипПенсии
	|			И СписокДоговоровОПС.НачалоПериодаНачисления = уп_НачисленияПенсийОПСОстатки.НачПериода
	#Вставка 
	//ЛыткинАМ //Возможность списать минусовые начисления
	|УПОРЯДОЧИТЬ ПО
	|	СуммаОстаток
	#КонецВставки
	|ИТОГИ
	|	СУММА(СуммаОстаток),
	|	СУММА(СуммаКомпенсацииОстаток),
	|	СУММА(СуммаВосполненияОстаток),
	|	СУММА(СуммаВозмещенияОстаток),
	|	МАКСИМУМ(Сумма),
	|	МАКСИМУМ(РКО),
	|	СУММА(Невыплата)
	|ПО
	|	ДоговорОПС,
	|	ТипПенсии,
	|	НачалоПериодаНачисления";
	
	Запрос.УстановитьПараметр("ДатаДок", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("СписокДоговоровОПС", ДоговорыОПС.ВыгрузитьКолонку("ДоговорОПС"));
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	//Результат = Запрос.Выполнить().Выгрузить();
	Результат = Запрос.Выполнить();
	Возврат Результат;
КонецФункции
// ХМНПФ 12.03.2024 ПлыгунЮВ // -

// +ХМНПФ 02.07.2025 КопыткоАА // №4381
Функция ХМПроверкаПослеПроведенияНеПройдена()
	Если не ХМ_ВыплатаПоВозвратам  И ТипВыплаты = Перечисления.уп_ТипыВыплат.ВыплатыПенсийОПС Тогда
		ТаблицаНачисленияПенсийОПС = Движения.уп_НачисленияПенсийОПС.Выгрузить();
		ТаблицаПрочиеНачисленияОПС = Движения.уп_ПрочиеНачисленияОПС.Выгрузить();
		ТаблицаРезервыОПС = Движения.уп_РезервыОПС.Выгрузить();
		
		СуммаНачисленияПенсийОПС = ТаблицаНачисленияПенсийОПС.Итог("Сумма") + ТаблицаПрочиеНачисленияОПС.Итог("Сумма");
		СуммаРезервыОПС = ТаблицаРезервыОПС.Итог("Сумма");
		Если НЕ(СуммаНачисленияПенсийОПС = СуммаРезервыОПС) Тогда
			Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
			уп_ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Общая сумма по резерву не соответствует общей сумме выплат. Сумма выплат " + СуммаНачисленияПенсийОПС +", а сумма резерва " + СуммаРезервыОПС,,Заголовок);
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
КонецФункции   

&После("ПриУстановкеНовогоНомера")
Процедура ХМ_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	ХМ_ПодпискиНаСобытия.ХМ_НомераРешенийПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);		
КонецПроцедуры
