
&После("ПередЗаписью")
Процедура ХМПередЗаписью(Отказ, Замещение)
//https://app.holst.so/board/4d594186-254c-434b-ab28-a978a9373f13
//ЛыткинАМ //https://redmine.npf.com/issues/4288
	Если ЭтотОбъект.Количество() > 0 Тогда
		ДатаРегистратора = ЭтотОбъект.Отбор.Регистратор.Значение.Дата;
		Для каждого Движение Из ЭтотОбъект Цикл
			Движение.Период = НачалоДня(Движение.Период) 
				+ 60*60*(12 + Год(ДатаРегистратора) - Год(Движение.Период))
				+ 60* (Месяц(ДатаРегистратора) - Месяц(Движение.Период))
				+ (День(ДатаРегистратора) - День(Движение.Период));
		КонецЦикла;
	КОнецЕсли;
КонецПроцедуры
