// +ХМНПФ 01.09.2025 КопыткоАА // http://redmine.npf.com/issues/4564

&НаКлиенте
Процедура ПередатьНаСверку(Команда)
	
	хм_МеханизмыСверкиКлиент.ОбработатьВыделенное("ОповеститьОВыборе", Новый Структура("ИмяСобытия,ИмяПоля","ПередатьНаСверку","НомерСчета"), ЭтаФорма, Неопределено, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ХМОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	хм_МеханизмыСверкиКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтаФорма, Список);	

КонецПроцедуры 

// -ХМНПФ 01.09.2025 КопыткоАА // http://redmine.npf.com/issues/4564