&НаКлиенте
Процедура УточнитьВыделенные(Команда)
	хм_МеханизмыСверкиКлиент.ОбработатьВыделенное("УточнитьНастройкиМСФО", 
		Новый Структура("ПоляДляУточнения, УточнятьПустойТипРезерва, ВозвращатьСтроками",
		Новый Структура("ТипДокумента,Документ,ТипВыплаты,ВидРучнойОперации,ТипРезерва,ВидДеятельности")), 
		ЭтаФорма, Неопределено, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура УточнитьИсточникПотока(Команда)
	хм_МеханизмыСверкиКлиент.ОбработатьВыделенное("УточнитьНастройкиМСФО", 
		Новый Структура("ПоляУточнения, ПоляДляУточнения, УточнятьПустойТипРезерва, ВозвращатьСтроками", 
		Новый Структура("ИсточникПотока,Статус, Комментарий"),
		Новый Структура("ТипДокумента,Документ,ТипВыплаты,ВидРучнойОперации,ТипРезерва,ВидДеятельности"),""), 
		ЭтаФорма, Неопределено, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура УточнитьСтатус(Команда)
	хм_МеханизмыСверкиКлиент.ОбработатьВыделенное("УточнитьНастройкиМСФО", 
		Новый Структура("ПоляУточнения, ПоляДляУточнения, УточнятьПустойТипРезерва, ВозвращатьСтроками", 
		Новый Структура("Статус, Комментарий"),
		Новый Структура("ТипДокумента,Документ,ТипВыплаты,ВидРучнойОперации,ТипРезерва,ВидДеятельности"),""), 
		ЭтаФорма, Неопределено, Элементы.Список);	
КонецПроцедуры

&НаКлиенте
Процедура УточнитьЗнакСуммы(Команда)
	хм_МеханизмыСверкиКлиент.ОбработатьВыделенное("УточнитьНастройкиМСФО", 
		Новый Структура("ПоляУточнения, ПоляДляУточнения, УточнятьПустойТипРезерва, ВозвращатьСтроками", 
		Новый Структура("ЗнакСуммы"), 
		Новый Структура("ТипДокумента,Документ,ТипВыплаты,ВидРучнойОперации,ТипРезерва,ВидДеятельности"),""), 
		ЭтаФорма, Неопределено, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура УточнитьИсточникПриемникПлатежа(Команда)
	хм_МеханизмыСверкиКлиент.ОбработатьВыделенное("УточнитьНастройкиМСФО", 
		Новый Структура("ПоляУточнения, ПоляДляУточнения, УточнятьПустойТипРезерва, ВозвращатьСтроками", 
		Новый Структура("ИсточникПлатежа, ПриемникПлатежа"),
		Новый Структура("ТипДокумента,Документ,ТипВыплаты,ВидРучнойОперации,ТипРезерва,ВидДеятельности"),""), 
		ЭтаФорма, Неопределено, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	Структура = Новый Структура("Ключ",ВыбраннаяСтрока);                
	ОткрытьФорму("РегистрСведений.хм_МСФО_ОПС_МаппингДП.Форма.ХМ_ФормаЗаписи",Структура,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПустыеВидыДеятельности(Команда)
	СписокВидовДеятельности = Новый СписокЗначений;
	СписокВидовДеятельности.Добавить(ПредопределенноеЗначение("Перечисление.уп_ВидыДеятельности.ОПС"),"ОПС");
	СписокВидовДеятельности.Добавить(ПредопределенноеЗначение("Перечисление.уп_ВидыДеятельности.ПДС"),"ПДС");
	СписокВидовДеятельности.Добавить(ПредопределенноеЗначение("Перечисление.уп_ВидыДеятельности.ПР"),"ПР");
	СписокВидовДеятельности.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ЗаполнитьПустыеВидыДеятельности_Завершение", ЭтаФорма), "Выберите вид деятельности для заполнения");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПустыеВидыДеятельности_Завершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;	
	КонецЕсли;  
	
	ЗаполнитьПустыеВидыДеятельностиНаСервере(ВыбранныйЭлемент.Значение);
КонецПроцедуры
 
&НаСервере
Процедура ЗаполнитьПустыеВидыДеятельностиНаСервере(ВыбранныйЭлемент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	хм_МСФО_ОПС_МаппингДП.ТипДокумента КАК ТипДокумента,
	               |	хм_МСФО_ОПС_МаппингДП.ТипВыплаты КАК ТипВыплаты,
	               |	хм_МСФО_ОПС_МаппингДП.ТипРезерва КАК ТипРезерва,
	               |	хм_МСФО_ОПС_МаппингДП.ВидРучнойОперации КАК ВидРучнойОперации,
	               |	хм_МСФО_ОПС_МаппингДП.ВидДеятельности КАК ВидДеятельности,
	               |	хм_МСФО_ОПС_МаппингДП.flow_type_cd КАК flow_type_cd,
	               |	хм_МСФО_ОПС_МаппингДП.payment_type_cd КАК payment_type_cd,
	               |	хм_МСФО_ОПС_МаппингДП.ТипПлатежа КАК ТипПлатежа,
	               |	хм_МСФО_ОПС_МаппингДП.ИсточникПотока КАК ИсточникПотока,
	               |	хм_МСФО_ОПС_МаппингДП.Статус КАК Статус,
	               |	хм_МСФО_ОПС_МаппингДП.Комментарий КАК Комментарий,
	               |	хм_МСФО_ОПС_МаппингДП.КоэффициентРезервыПриход КАК КоэффициентРезервыПриход,
	               |	хм_МСФО_ОПС_МаппингДП.КоэффициентРезервыРасход КАК КоэффициентРезервыРасход,
	               |	хм_МСФО_ОПС_МаппингДП.КоэффициентНачисленияРасход КАК КоэффициентНачисленияРасход,
	               |	хм_МСФО_ОПС_МаппингДП.КоэффициентНачисленияПриход КАК КоэффициентНачисленияПриход,
	               |	хм_МСФО_ОПС_МаппингДП.КоэффициентВыплаты КАК КоэффициентВыплаты,
	               |	хм_МСФО_ОПС_МаппингДП.ЗнакСуммы КАК ЗнакСуммы
	               |ИЗ
	               |	РегистрСведений.хм_МСФО_ОПС_МаппингДП КАК хм_МСФО_ОПС_МаппингДП
	               |ГДЕ
	               |	хм_МСФО_ОПС_МаппингДП.ВидДеятельности = &ВидДеятельности";
	Запрос.УстановитьПараметр("ВидДеятельности",Перечисления.уп_ВидыДеятельности.ПустаяСсылка());
	Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
	Пока Выборка.Следующий() Цикл  
		МенеджерЗаписи = РегистрыСведений.хм_МСФО_ОПС_МаппингДП.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Выборка);
		МенеджерЗаписи.Прочитать();
        Если МенеджерЗаписи.Выбран() Тогда
            МенеджерЗаписи.ВидДеятельности = ВыбранныйЭлемент;
            МенеджерЗаписи.Записать();
        Иначе
            Сообщить("Менеджер записи не выбран: " + МенеджерЗаписи.ТипДокумента + ", " + МенеджерЗаписи.ТипВыплаты + ", " + МенеджерЗаписи.ВидРучнойОперации);
        КонецЕсли;
    КонецЦикла; 	
КонецПроцедуры



