// ХМНПФ 23.01.2018 КлименкоМИ // уп_ВозвратПенсийОПС() // №1296
Процедура уп_ВозвратПенсийОПС(Источник, Отказ, РежимПроведения) Экспорт
	Если ЗначениеЗаполнено(Источник.ХМ_ВозвратСПлатежногоПоручения.ДокументОснование) Тогда		
		Если  Источник.Дата <= Источник.ХМ_ВозвратСПлатежногоПоручения.ДокументОснование.Дата Тогда
			Сообщить("Дата документа возврата меньше даты документа выплаты. Неправильная последовательность документов!"  + Символы.ПС
			+ "Документ возврата: " + Источник.Ссылка + Символы.ПС
			+ "Документ выплаты: " + Источник.ХМ_ВозвратСПлатежногоПоручения.ДокументОснование.Ссылка + Символы.ПС
			+ "Проведение невозможно!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // уп_ВозвратПрочихНачисленийОПС(Источник, Отказ, РежимПроведения)
